enum _ALTERNATIVE_ARCHITECTURE_TYPE;
enum BINDING_ENABLED_OR_DISABLED;
union _WHEA_PERSISTENCE_INFO;
enum SE_WS_APPX_SIGNATURE_ORIGIN;
enum PAUSE_OR_RESTART;
enum JOB_OBJECT_NET_RATE_CONTROL_FLAGS;
enum JOB_OBJECT_IO_RATE_CONTROL_FLAGS;
enum _PS_MITIGATION_OPTION;
struct _LIST_ENTRY;
struct _NDIS_OPEN_BLOCK;
enum _RTL_FEATURE_CONFIGURATION_OPERATION;
enum _RTL_FEATURE_ENABLED_STATE_OPTIONS;
struct _NDIS_OBJECT_HEADER;
struct _NDIS_OFFLOAD_CLIENT_HANDLERS;
enum _NT_PRODUCT_TYPE;
enum _TP_CALLBACK_PRIORITY;
struct _GUID;
class wistd::__compressed_pair<Rtl::KString *,wistd::default_delete<Rtl::KString> >;
class wistd::unique_ptr<Rtl::KString,wistd::default_delete<Rtl::KString> >;
struct NDIS_BIND_FILTER_DRIVER;
class KRef<NDIS_BIND_FILTER_DRIVER>::KRefHolder;
enum _RTL_RESOURCE_POLICY_FLAGS;
enum _POOL_TYPE;
enum _EX_POOL_PRIORITY;
struct _NDIS_FRAME_TYPE_AND_OPEN;
struct _NDIS_FRAME_TYPE_RECORD;
enum _EVENT_TYPE;
enum _IO_PRIORITY_HINT;
struct _RTL_ACTIVATION_CONTEXT_STACK_FRAME;
enum _DEVICE_POWER_STATE;
enum _DEVICE_WAKE_DEPTH;
enum _NDIS_GFT_COUNTER_UPDATE_FREQUENCY;
enum _NDIS_GFT_COUNTER_TYPE;
enum _NDIS_GFT_WILDCARD_ACTION;
enum _NDIS_GFT_FLOW_ENTRY_CACHE_HINT;
enum _NDIS_GFT_FLOW_ENTRY_STATE;
struct _NDIS_GFT_WILDCARD_MATCH_FLOW_ENTRY;
enum _DEVPROPSTORE;
enum _MEMORY_CACHING_TYPE;
struct _ECP_LIST;
struct _ACTIVATION_CONTEXT_STACK;
struct _NDIS_GFP_HEADER_GROUP_EXACT_MATCH_PROFILE;
enum _WHEA_EVENT_LOG_ENTRY_TYPE;
enum _WHEA_EVENT_LOG_ENTRY_ID;

struct _NDIS_TCP_OFFLOAD_EVENT_HANDLERS;
struct _tlgTypeMapBase<char>;
struct _PATH_OFFLOAD_STATE_CONST;
struct _NDIS_NSI_INTERFACE_ENUM_ROS;
struct _NDIS_GFT_TABLE_PARAMETERS;
struct _NDIS_802_11_BSSID_LIST_EX;
struct _NDIS_RECEIVE_FILTER_BLOCK;
struct _WWAN_SET_REGISTER_STATE;
struct _NDIS_WWAN_SET_REGISTER_STATE;
struct DOT11_CIPHER_DEFAULT_KEY_VALUE;
struct _NDIS_IPSEC_OFFLOAD_V2_TUNNEL_NET_BUFFER_LIST_INFO;
struct _NDIS_REFCOUNT_BLOCK;
struct _NDIS_WAN_GET_STATS;
struct _tlgTypeMapBase<bool>;
struct _NEIGHBOR_OFFLOAD_STATE_CONST;
struct _NDIS_WAN_LINE_UP;
struct DOT11_BSSID_LIST;
struct _NDIS_CLIENT_CHIMNEY_OFFLOAD_GENERIC_CHARACTERISTICS;
struct _tlgTypeMapBase<char *>;
struct _NDIS_GFT_CUSTOM_ACTION_PROFILE;
struct _NDIS_NBL_MEDIA_MEDIA_SPECIFIC_INFORMATION;
struct _NDIS_MINIPORT_CO_CHARACTERISTICS;
struct _tlgTypeMapBase<void *>;
struct _NDIS_NET_BUFFER_POOL;
struct _NDIS_MINIPORT_INTERRUPT_CHARACTERISTICS;
struct _tlgTypeMapBase<_FILETIME>;
struct _NDIS_CONFIGURATION_OBJECT;
struct _IO_INTERRUPT_MESSAGE_INFO;
struct _NDIS_TCP_IP_CHECKSUM_NET_BUFFER_LIST_INFO;
struct _NDIS_GFT_FLOW_ENTRY_INFO_ARRAY;
struct _NDIS_TIMER_CHARACTERISTICS;
struct _tlgTypeMapBase<wchar_t *>;
struct _NDIS_REFCOUNT_TAGGED_ENTRY;
struct _DOT11_INCOMING_ASSOC_DECISION;
struct _TRANSPORT_HEADER_OFFSET;
struct _NDIS_PROTOCOL_PAUSE_PARAMETERS;
struct _GEN_GET_NETCARD_TIME;
struct _NDIS_WWAN_DEVICE_CAPS;
struct _NDIS_802_11_TEST;
struct _NDIS_GLOBAL_TRIAGE_BLOCK;
struct _NDIS_GFT_COUNTER_PARAMETERS;
struct _NDIS_RECEIVE_FILTER_GLOBAL_PARAMETERS;
struct _NDIS_IPSEC_OFFLOAD_V2_NET_BUFFER_LIST_INFO;
struct _MEDIA_SPECIFIC_INFORMATION;
struct _WWAN_DRIVER_CAPS;
struct _NDIS_WWAN_DRIVER_CAPS;
struct NDIS_PD_FILTER_HANDLE__;
struct _NDIS_NET_BUFFER_LIST_FILTERING_INFO;
struct _NDIS_STACK_TRACE_TABLE;
struct DOT11_PORT_STATE_NOTIFICATION;
struct _NDIS_NET_BUFFER_LIST_8021Q_INFO;
class Rtl::KArray<void *,1>::iterator;
struct __vc_attributes::moduleAttribute;
struct _NDIS_802_11_NETWORK_TYPE_LIST;
struct _NDIS_GFT_EXACT_MATCH_FLOW_ENTRY;
struct _NDIS_802_11_ASSOCIATION_INFORMATION;
struct _NDIS_802_11_REMOVE_KEY;
struct DOT11_AUTH_CIPHER_PAIR_LIST;
struct _PMKID_CANDIDATE;
struct _NDIS_802_11_PMKID_CANDIDATE_LIST;
struct _DOT11_AVAILABLE_CHANNEL_LIST;
struct _NDIS_PROTOCOL_CO_CHARACTERISTICS;
union _NDIS_RECEIVE_FILTER_FIELD_PARAMETERS::_HEADER_FIELD;
union _NDIS_RECEIVE_FILTER_FIELD_PARAMETERS::_FIELD_VALUE;
union _NDIS_RECEIVE_FILTER_FIELD_PARAMETERS::_RESULT_VALUE;
struct _NDIS_RECEIVE_FILTER_FIELD_PARAMETERS;
struct _NDIS_WAN_CO_GET_STATS_INFO;
struct _NDIS_PKT_POOL_HDR;
struct DOT11_CIPHER_ALGORITHM_LIST;
struct _NDIS_WAN_CO_INFO;
struct _NDIS_WAN_CO_SET_COMP_INFO;
struct _NDIS_MSIX_CONFIG_PARAMETERS;
struct _NDIS_GFT_COUNTER_VALUE_ARRAY;

typedef enum _ALTERNATIVE_ARCHITECTURE_TYPE
{
  StandardDesign = 0,
  NEC98x86 = 1,
  EndAlternatives = 2,
} ALTERNATIVE_ARCHITECTURE_TYPE, *PALTERNATIVE_ARCHITECTURE_TYPE;

enum BINDING_ENABLED_OR_DISABLED
{
  BindingEnabled = 0,
  BindingDisabled = 1,
};

typedef union _WHEA_PERSISTENCE_INFO
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned __int64 Signature : 16; /* bit position: 0 */
      /* 0x0000 */ unsigned __int64 Length : 24; /* bit position: 16 */
      /* 0x0000 */ unsigned __int64 Identifier : 16; /* bit position: 40 */
      /* 0x0000 */ unsigned __int64 Attributes : 2; /* bit position: 56 */
      /* 0x0000 */ unsigned __int64 DoNotLog : 1; /* bit position: 58 */
      /* 0x0000 */ unsigned __int64 Reserved : 5; /* bit position: 59 */
    }; /* bitfield */
    /* 0x0000 */ unsigned __int64 AsULONGLONG;
  }; /* size: 0x0008 */
} WHEA_PERSISTENCE_INFO, *PWHEA_PERSISTENCE_INFO; /* size: 0x0008 */

enum SE_WS_APPX_SIGNATURE_ORIGIN
{
  SE_WS_APPX_SIGNATURE_ORIGIN_NOT_VALIDATED = 0,
  SE_WS_APPX_SIGNATURE_ORIGIN_UNKNOWN = 1,
  SE_WS_APPX_SIGNATURE_ORIGIN_APPSTORE = 2,
  SE_WS_APPX_SIGNATURE_ORIGIN_WINDOWS = 3,
  SE_WS_APPX_SIGNATURE_ORIGIN_ENTERPRISE = 4,
};

enum PAUSE_OR_RESTART
{
  DatapathPaused = 0,
  DatapathRunning = 1,
};

enum JOB_OBJECT_NET_RATE_CONTROL_FLAGS
{
  JOB_OBJECT_NET_RATE_CONTROL_ENABLE = 1,
  JOB_OBJECT_NET_RATE_CONTROL_MAX_BANDWIDTH = 2,
  JOB_OBJECT_NET_RATE_CONTROL_DSCP_TAG = 4,
  JOB_OBJECT_NET_RATE_CONTROL_VALID_FLAGS = 7,
};

enum JOB_OBJECT_IO_RATE_CONTROL_FLAGS
{
  JOB_OBJECT_IO_RATE_CONTROL_ENABLE = 1,
  JOB_OBJECT_IO_RATE_CONTROL_STANDALONE_VOLUME = 2,
  JOB_OBJECT_IO_RATE_CONTROL_FORCE_UNIT_ACCESS_ALL = 4,
  JOB_OBJECT_IO_RATE_CONTROL_FORCE_UNIT_ACCESS_ON_SOFT_CAP = 8,
  JOB_OBJECT_IO_RATE_CONTROL_VALID_FLAGS = 15,
};

typedef enum _PS_MITIGATION_OPTION
{
  PS_MITIGATION_OPTION_NX = 0,
  PS_MITIGATION_OPTION_SEHOP = 1,
  PS_MITIGATION_OPTION_FORCE_RELOCATE_IMAGES = 2,
  PS_MITIGATION_OPTION_HEAP_TERMINATE = 3,
  PS_MITIGATION_OPTION_BOTTOM_UP_ASLR = 4,
  PS_MITIGATION_OPTION_HIGH_ENTROPY_ASLR = 5,
  PS_MITIGATION_OPTION_STRICT_HANDLE_CHECKS = 6,
  PS_MITIGATION_OPTION_WIN32K_SYSTEM_CALL_DISABLE = 7,
  PS_MITIGATION_OPTION_EXTENSION_POINT_DISABLE = 8,
  PS_MITIGATION_OPTION_PROHIBIT_DYNAMIC_CODE = 9,
  PS_MITIGATION_OPTION_CONTROL_FLOW_GUARD = 10,
  PS_MITIGATION_OPTION_BLOCK_NON_MICROSOFT_BINARIES = 11,
  PS_MITIGATION_OPTION_FONT_DISABLE = 12,
  PS_MITIGATION_OPTION_IMAGE_LOAD_NO_REMOTE = 13,
  PS_MITIGATION_OPTION_IMAGE_LOAD_NO_LOW_LABEL = 14,
  PS_MITIGATION_OPTION_IMAGE_LOAD_PREFER_SYSTEM32 = 15,
  PS_MITIGATION_OPTION_RETURN_FLOW_GUARD = 16,
  PS_MITIGATION_OPTION_LOADER_INTEGRITY_CONTINUITY = 17,
  PS_MITIGATION_OPTION_STRICT_CONTROL_FLOW_GUARD = 18,
  PS_MITIGATION_OPTION_RESTRICT_SET_THREAD_CONTEXT = 19,
  PS_MITIGATION_OPTION_ROP_STACKPIVOT = 20,
  PS_MITIGATION_OPTION_ROP_CALLER_CHECK = 21,
  PS_MITIGATION_OPTION_ROP_SIMEXEC = 22,
  PS_MITIGATION_OPTION_EXPORT_ADDRESS_FILTER = 23,
  PS_MITIGATION_OPTION_EXPORT_ADDRESS_FILTER_PLUS = 24,
  PS_MITIGATION_OPTION_RESTRICT_CHILD_PROCESS_CREATION = 25,
  PS_MITIGATION_OPTION_IMPORT_ADDRESS_FILTER = 26,
  PS_MITIGATION_OPTION_MODULE_TAMPERING_PROTECTION = 27,
  PS_MITIGATION_OPTION_RESTRICT_INDIRECT_BRANCH_PREDICTION = 28,
  PS_MITIGATION_OPTION_SPECULATIVE_STORE_BYPASS_DISABLE = 29,
  PS_MITIGATION_OPTION_ALLOW_DOWNGRADE_DYNAMIC_CODE_POLICY = 30,
  PS_MITIGATION_OPTION_CET_USER_SHADOW_STACKS = 31,
} PS_MITIGATION_OPTION, *PPS_MITIGATION_OPTION;

typedef struct _LIST_ENTRY
{
  /* 0x0000 */ struct _LIST_ENTRY* Flink;
  /* 0x0004 */ struct _LIST_ENTRY* Blink;
} LIST_ENTRY, *PLIST_ENTRY; /* size: 0x0008 */

typedef struct _NDIS_OPEN_BLOCK
{
  /* 0x0000 */ long Padding_0[132];
  /* 0x0210 */ struct _NDIS_CO_AF_BLOCK* NextAf;
  /* 0x0214 */ void* MiniportCoCreateVcHandler /* function */;
  /* 0x0218 */ void* MiniportCoRequestHandler /* function */;
  /* 0x021c */ void* CoCreateVcHandler /* function */;
  /* 0x0220 */ void* CoDeleteVcHandler /* function */;
  /* 0x0224 */ void* CmActivateVcCompleteHandler /* function */;
  /* 0x0228 */ void* CmDeactivateVcCompleteHandler /* function */;
  /* 0x022c */ void* CoRequestCompleteHandler /* function */;
  /* 0x0230 */ void* CoRequestHandler /* function */;
  /* 0x0234 */ struct _LIST_ENTRY ActiveVcHead;
  /* 0x023c */ struct _LIST_ENTRY InactiveVcHead;
  /* 0x0244 */ long PendingAfNotifications;
  /* 0x0248 */ struct _KEVENT* AfNotifyCompleteEvent;
  /* 0x024c */ void* MiniportCoOidRequestHandler /* function */;
  /* 0x0250 */ void* CoOidRequestCompleteHandler /* function */;
  /* 0x0254 */ void* CoOidRequestHandler /* function */;
} NDIS_OPEN_BLOCK, *PNDIS_OPEN_BLOCK; /* size: 0x0258 */

typedef enum _RTL_FEATURE_CONFIGURATION_OPERATION
{
  FeatureConfigurationOperationNone = 0,
  FeatureConfigurationOperationFeatureState = 1,
  FeatureConfigurationOperationVariantState = 2,
  FeatureConfigurationOperationResetState = 4,
} RTL_FEATURE_CONFIGURATION_OPERATION, *PRTL_FEATURE_CONFIGURATION_OPERATION;

typedef enum _RTL_FEATURE_ENABLED_STATE_OPTIONS
{
  FeatureEnabledStateOptionsNone = 0,
  FeatureEnabledStateOptionsWexpConfig = 1,
} RTL_FEATURE_ENABLED_STATE_OPTIONS, *PRTL_FEATURE_ENABLED_STATE_OPTIONS;

typedef struct _NDIS_OBJECT_HEADER
{
  /* 0x0000 */ unsigned char Type;
  /* 0x0001 */ unsigned char Revision;
  /* 0x0002 */ unsigned short Size;
} NDIS_OBJECT_HEADER, *PNDIS_OBJECT_HEADER; /* size: 0x0004 */

typedef struct _NDIS_OFFLOAD_CLIENT_HANDLERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
} NDIS_OFFLOAD_CLIENT_HANDLERS, *PNDIS_OFFLOAD_CLIENT_HANDLERS; /* size: 0x0004 */

typedef enum _NT_PRODUCT_TYPE
{
  NtProductWinNt = 1,
  NtProductLanManNt = 2,
  NtProductServer = 3,
} NT_PRODUCT_TYPE, *PNT_PRODUCT_TYPE;

typedef enum _TP_CALLBACK_PRIORITY
{
  TP_CALLBACK_PRIORITY_HIGH = 0,
  TP_CALLBACK_PRIORITY_NORMAL = 1,
  TP_CALLBACK_PRIORITY_LOW = 2,
  TP_CALLBACK_PRIORITY_INVALID = 3,
  TP_CALLBACK_PRIORITY_COUNT = 3,
} TP_CALLBACK_PRIORITY, *PTP_CALLBACK_PRIORITY;

typedef struct _GUID
{
  /* 0x0000 */ unsigned long Data1;
  /* 0x0004 */ unsigned short Data2;
  /* 0x0006 */ unsigned short Data3;
  /* 0x0008 */ unsigned char Data4[8];
} GUID, *PGUID; /* size: 0x0010 */

class wistd::__compressed_pair<Rtl::KString *,wistd::default_delete<Rtl::KString> >
{
}; /* size: 0x0004 */

class wistd::unique_ptr<Rtl::KString,wistd::default_delete<Rtl::KString> >
{
  /* 0x0000 */ class wistd::__compressed_pair<Rtl::KString *,wistd::default_delete<Rtl::KString> > __ptr_;
}; /* size: 0x0004 */

struct NDIS_BIND_FILTER_DRIVER
{
  /* 0x0000 */ long Padding_1[3];
  /* 0x000c */ struct _GUID Guid;
  /* 0x001c */ unsigned long FilterBindFlags;
  /* 0x0020 */ class wistd::unique_ptr<Rtl::KString,wistd::default_delete<Rtl::KString> > FilterClass;
  /* 0x0024 */ struct _NDIS_FILTER_DRIVER_BLOCK* RunningDriver;
}; /* size: 0x0028 */

class KRef<NDIS_BIND_FILTER_DRIVER>::KRefHolder
{
  /* 0x0000 */ struct NDIS_BIND_FILTER_DRIVER _t;
  /* 0x0028 */ unsigned long RefCount;
}; /* size: 0x002c */

typedef enum _RTL_RESOURCE_POLICY_FLAGS
{
  RTL_RESOURCE_POLICY_FLAGS_NONE = 0,
} RTL_RESOURCE_POLICY_FLAGS, *PRTL_RESOURCE_POLICY_FLAGS;

typedef enum _POOL_TYPE
{
  NonPagedPool = 0,
  NonPagedPoolExecute = 0,
  PagedPool = 1,
  NonPagedPoolMustSucceed = 2,
  DontUseThisType = 3,
  NonPagedPoolCacheAligned = 4,
  PagedPoolCacheAligned = 5,
  NonPagedPoolCacheAlignedMustS = 6,
  MaxPoolType = 7,
  NonPagedPoolBase = 0,
  NonPagedPoolBaseMustSucceed = 2,
  NonPagedPoolBaseCacheAligned = 4,
  NonPagedPoolBaseCacheAlignedMustS = 6,
  NonPagedPoolSession = 32,
  PagedPoolSession = 33,
  NonPagedPoolMustSucceedSession = 34,
  DontUseThisTypeSession = 35,
  NonPagedPoolCacheAlignedSession = 36,
  PagedPoolCacheAlignedSession = 37,
  NonPagedPoolCacheAlignedMustSSession = 38,
  NonPagedPoolNx = 512,
  NonPagedPoolNxCacheAligned = 516,
  NonPagedPoolSessionNx = 544,
} POOL_TYPE, *PPOOL_TYPE;

typedef enum _EX_POOL_PRIORITY
{
  LowPoolPriority = 0,
  LowPoolPrioritySpecialPoolOverrun = 8,
  LowPoolPrioritySpecialPoolUnderrun = 9,
  NormalPoolPriority = 16,
  NormalPoolPrioritySpecialPoolOverrun = 24,
  NormalPoolPrioritySpecialPoolUnderrun = 25,
  HighPoolPriority = 32,
  HighPoolPrioritySpecialPoolOverrun = 40,
  HighPoolPrioritySpecialPoolUnderrun = 41,
} EX_POOL_PRIORITY, *PEX_POOL_PRIORITY;

typedef struct _NDIS_FRAME_TYPE_AND_OPEN
{
  /* 0x0000 */ unsigned short Type;
  /* 0x0002 */ char Padding_2[2];
  /* 0x0004 */ struct _NDIS_OPEN_BLOCK* Open;
} NDIS_FRAME_TYPE_AND_OPEN, *PNDIS_FRAME_TYPE_AND_OPEN; /* size: 0x0008 */

typedef struct _NDIS_FRAME_TYPE_RECORD
{
  /* 0x0000 */ unsigned int NumEntries;
  /* 0x0004 */ struct _NDIS_FRAME_TYPE_AND_OPEN Entry[16];
} NDIS_FRAME_TYPE_RECORD, *PNDIS_FRAME_TYPE_RECORD; /* size: 0x0084 */

typedef enum _EVENT_TYPE
{
  NotificationEvent = 0,
  SynchronizationEvent = 1,
} EVENT_TYPE, *PEVENT_TYPE;

typedef enum _IO_PRIORITY_HINT
{
  IoPriorityVeryLow = 0,
  IoPriorityLow = 1,
  IoPriorityNormal = 2,
  IoPriorityHigh = 3,
  IoPriorityCritical = 4,
  MaxIoPriorityTypes = 5,
} IO_PRIORITY_HINT, *PIO_PRIORITY_HINT;

struct _RTL_ACTIVATION_CONTEXT_STACK_FRAME;

typedef enum _DEVICE_POWER_STATE
{
  PowerDeviceUnspecified = 0,
  PowerDeviceD0 = 1,
  PowerDeviceD1 = 2,
  PowerDeviceD2 = 3,
  PowerDeviceD3 = 4,
  PowerDeviceMaximum = 5,
} DEVICE_POWER_STATE, *PDEVICE_POWER_STATE;

typedef enum _DEVICE_WAKE_DEPTH
{
  DeviceWakeDepthNotWakeable = 0,
  DeviceWakeDepthD0 = 1,
  DeviceWakeDepthD1 = 2,
  DeviceWakeDepthD2 = 3,
  DeviceWakeDepthD3hot = 4,
  DeviceWakeDepthD3cold = 5,
  DeviceWakeDepthMaximum = 6,
} DEVICE_WAKE_DEPTH, *PDEVICE_WAKE_DEPTH;

typedef enum _NDIS_GFT_COUNTER_UPDATE_FREQUENCY
{
  NdisGftCounterUpdateFrequencyUndefined = 0,
  NdisGftCounterUpdateFrequencyOnQuery = 1,
  NdisGftCounterUpdateFrequencyPerUpdatePeriod = 2,
  NdisGftCounterUpdateFrequencyPerPacket = 3,
  NdisGftCounterUpdateFrequencyMax = 4,
} NDIS_GFT_COUNTER_UPDATE_FREQUENCY, *PNDIS_GFT_COUNTER_UPDATE_FREQUENCY;

typedef enum _NDIS_GFT_COUNTER_TYPE
{
  NdisGftCounterTypeUndefined = 0,
  NdisGftCounterTypePacket = 1,
  NdisGftCounterTypeByte = 2,
  NdisGftCounterTypePacketByte = 3,
  NdisGftCounterTypePacketByteAndState = 4,
  NdisGftCounterTypeMax = 5,
} NDIS_GFT_COUNTER_TYPE, *PNDIS_GFT_COUNTER_TYPE;

typedef enum _NDIS_GFT_WILDCARD_ACTION
{
  NdisGftWildcardActionUndefined = 0,
  NdisGftWildcardActionAllow = 1,
  NdisGftWildcardActionDrop = 2,
  NdisGftWildcardActionMax = 3,
} NDIS_GFT_WILDCARD_ACTION, *PNDIS_GFT_WILDCARD_ACTION;

typedef enum _NDIS_GFT_FLOW_ENTRY_CACHE_HINT
{
  NdisGftFlowEntryCacheHintUndefined = 0,
  NdisGftFlowEntryCacheHintLowFrequency = 100,
  NdisGftFlowEntryCacheHintMediumFrequency = 200,
  NdisGftFlowEntryCacheHintHighFrequency = 300,
  NdisGftFlowEntryCacheHintMax = 1000,
} NDIS_GFT_FLOW_ENTRY_CACHE_HINT, *PNDIS_GFT_FLOW_ENTRY_CACHE_HINT;

typedef enum _NDIS_GFT_FLOW_ENTRY_STATE
{
  NdisGftFlowEntryStateUndefined = 0,
  NdisGftFlowEntryStateDeactivated = 1,
  NdisGftFlowEntryStateActivated = 2,
  NdisGftFlowEntryStateMax = 3,
} NDIS_GFT_FLOW_ENTRY_STATE, *PNDIS_GFT_FLOW_ENTRY_STATE;

typedef struct _NDIS_GFT_WILDCARD_MATCH_FLOW_ENTRY
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ unsigned long TableId;
  /* 0x000c */ unsigned long VPortId;
  /* 0x0010 */ unsigned long MatchProfileId;
  /* 0x0014 */ int MatchRequestStatus;
  /* 0x0018 */ int ActionRequestStatus;
  /* 0x001c */ unsigned long CounterFlags;
  /* 0x0020 */ enum _NDIS_GFT_COUNTER_UPDATE_FREQUENCY CounterUpdateFrequency;
  /* 0x0024 */ enum _NDIS_GFT_COUNTER_TYPE CounterType;
  /* 0x0028 */ unsigned long UpdatePeriod;
  union
  {
    union
    {
      /* 0x002c */ volatile struct _NDIS_GFT_PACKET_COUNTER_VALUE* PacketCounterAddress;
      /* 0x002c */ volatile struct _NDIS_GFT_BYTE_COUNTER_VALUE* ByteCounterAddress;
      /* 0x002c */ volatile struct _NDIS_GFT_PACKET_BYTE_COUNTER_VALUE* PacketByteCounterAddress;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ CounterValueBuffer;
  /* 0x0030 */ unsigned long Priority;
  /* 0x0034 */ enum _NDIS_GFT_WILDCARD_ACTION Action;
  /* 0x0038 */ unsigned long RedirectionVPortId;
  /* 0x003c */ unsigned long TtlIsOneRedirectionVPortId;
  /* 0x0040 */ unsigned long NumCounterObjects;
  /* 0x0044 */ unsigned long CounterIdArray[8];
  /* 0x0064 */ enum _NDIS_GFT_FLOW_ENTRY_CACHE_HINT CacheHint;
  /* 0x0068 */ unsigned long ClientFlowEntryId;
  /* 0x006c */ unsigned long ProviderFlowEntryId;
  /* 0x0070 */ enum _NDIS_GFT_FLOW_ENTRY_STATE FlowEntryState;
  /* 0x0074 */ unsigned long HeaderGroupWildcardMatchArrayOffset;
  /* 0x0078 */ unsigned long HeaderGroupWildcardMatchArrayNumElements;
  /* 0x007c */ unsigned long HeaderGroupWildcardMatchArrayElementSize;
  /* 0x0080 */ unsigned long CustomActionOffset;
} NDIS_GFT_WILDCARD_MATCH_FLOW_ENTRY, *PNDIS_GFT_WILDCARD_MATCH_FLOW_ENTRY; /* size: 0x0084 */

typedef enum _DEVPROPSTORE
{
  DEVPROP_STORE_SYSTEM = 0,
  DEVPROP_STORE_USER = 1,
} DEVPROPSTORE, *PDEVPROPSTORE;

typedef enum _MEMORY_CACHING_TYPE
{
  MmNonCached = 0,
  MmCached = 1,
  MmWriteCombined = 2,
  MmHardwareCoherentCached = 3,
  MmNonCachedUnordered = 4,
  MmUSWCCached = 5,
  MmMaximumCacheType = 6,
  MmNotMapped = -1,
} MEMORY_CACHING_TYPE, *PMEMORY_CACHING_TYPE;

struct _ECP_LIST;

typedef struct _ACTIVATION_CONTEXT_STACK
{
  /* 0x0000 */ struct _RTL_ACTIVATION_CONTEXT_STACK_FRAME* ActiveFrame;
  /* 0x0004 */ struct _LIST_ENTRY FrameListCache;
  /* 0x000c */ unsigned long Flags;
  /* 0x0010 */ unsigned long NextCookieSequenceNumber;
  /* 0x0014 */ unsigned long StackId;
} ACTIVATION_CONTEXT_STACK, *PACTIVATION_CONTEXT_STACK; /* size: 0x0018 */

typedef struct _NDIS_GFP_HEADER_GROUP_EXACT_MATCH_PROFILE
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ unsigned long HeadersPresent;
  /* 0x000c */ long Padding_3;
  /* 0x0010 */ unsigned __int64 MatchFields;
} NDIS_GFP_HEADER_GROUP_EXACT_MATCH_PROFILE, *PNDIS_GFP_HEADER_GROUP_EXACT_MATCH_PROFILE; /* size: 0x0018 */

typedef enum _WHEA_EVENT_LOG_ENTRY_TYPE
{
  WheaEventLogEntryTypeInformational = 0,
  WheaEventLogEntryTypeWarning = 1,
  WheaEventLogEntryTypeError = 2,
} WHEA_EVENT_LOG_ENTRY_TYPE, *PWHEA_EVENT_LOG_ENTRY_TYPE;

typedef enum _WHEA_EVENT_LOG_ENTRY_ID
{
  WheaEventLogEntryIdCmcPollingTimeout = -2147483647,
  WheaEventLogEntryIdWheaInit = -2147483646,
  WheaEventLogEntryIdCmcSwitchToPolling = -2147483645,
  WheaEventLogEntryIdDroppedCorrectedError = -2147483644,
  WheaEventLogEntryIdStartedReportHwError = -2147483643,
  WheaEventLogEntryIdPFAMemoryOfflined = -2147483642,
  WheaEventLogEntryIdPFAMemoryRemoveMonitor = -2147483641,
  WheaEventLogEntryIdPFAMemoryPolicy = -2147483640,
  WheaEventLogEntryIdPshedInjectError = -2147483639,
  WheaEventLogEntryIdOscCapabilities = -2147483638,
  WheaEventLogEntryIdPshedPluginRegister = -2147483637,
  WheaEventLogEntryIdAddRemoveErrorSource = -2147483636,
  WheaEventLogEntryIdWorkQueueItem = -2147483635,
  WheaEventLogEntryIdAttemptErrorRecovery = -2147483634,
  WheaEventLogEntryIdMcaFoundErrorInBank = -2147483633,
  WheaEventLogEntryIdMcaStuckErrorCheck = -2147483632,
  WheaEventLogEntryIdMcaErrorCleared = -2147483631,
  WheaEventLogEntryIdClearedPoison = -2147483630,
  WheaEventLogEntryIdProcessEINJ = -2147483629,
  WheaEventLogEntryIdProcessHEST = -2147483628,
  WheaEventLogEntryIdCreateGenericRecord = -2147483627,
  WheaEventLogEntryIdErrorRecord = -2147483626,
  WheaEventLogEntryIdErrorRecordLimit = -2147483625,
  WheaEventLogEntryIdErrSrcArrayInvalid = -2147483623,
  WheaEventLogEntryIdAcpiTimeOut = -2147483622,
  WheaEventLogCmciRestart = -2147483621,
  WheaEventLogCmciFinalRestart = -2147483620,
  WheaEventLogEntryEtwOverFlow = -2147483619,
  WheaEventLogAzccRootBusSearchErr = -2147483618,
  WheaEventLogAzccRootBusList = -2147483617,
  WheaEventLogEntryIdErrSrcInvalid = -2147483616,
  WheaEventLogEntryIdGenericErrMemMap = -2147483615,
  WheaEventLogEntryIdPshedCallbackCollision = -2147483614,
  WheaEventLogEntryIdSELBugCheckProgress = -2147483613,
  WheaEventLogEntryIdPshedPluginLoad = -2147483612,
  WheaEventLogEntryIdPshedPluginUnload = -2147483611,
  WheaEventLogEntryIdPshedPluginSupported = -2147483610,
  WheaEventLogEntryIdDeviceDriver = -2147483609,
  WheaEventLogEntryIdCmciImplPresent = -2147483608,
  WheaEventLogEntryIdCmciInitError = -2147483607,
  WheaEventLogEntryIdSELBugCheckRecovery = -2147483606,
  WheaEventLogEntryIdDrvErrSrcInvalid = -2147483605,
  WheaEventLogEntryIdDrvHandleBusy = -2147483604,
  WheaEventLogEntryIdWheaHeartbeat = -2147483603,
  WheaEventLogAzccRootBusPoisonSet = -2147483602,
  WheaEventLogEntryIdSELBugCheckInfo = -2147483601,
  WheaEventLogEntryIdErrDimmInfoMismatch = -2147483600,
} WHEA_EVENT_LOG_ENTRY_ID, *PWHEA_EVENT_LOG_ENTRY_ID;

typedef struct _SINGLE_LIST_ENTRY
{
  /* 0x0000 */ struct _SINGLE_LIST_ENTRY* Next;
} SINGLE_LIST_ENTRY, *PSINGLE_LIST_ENTRY; /* size: 0x0004 */

typedef union _SLIST_HEADER
{
  union
  {
    /* 0x0000 */ unsigned __int64 Alignment;
    struct
    {
      /* 0x0000 */ struct _SINGLE_LIST_ENTRY Next;
      /* 0x0004 */ unsigned short Depth;
      /* 0x0006 */ unsigned short CpuId;
    }; /* size: 0x0008 */
  }; /* size: 0x0008 */
} SLIST_HEADER, *PSLIST_HEADER; /* size: 0x0008 */

typedef struct _GENERAL_LOOKASIDE_POOL
{
  union
  {
    /* 0x0000 */ union _SLIST_HEADER ListHead;
    /* 0x0000 */ struct _SINGLE_LIST_ENTRY SingleListHead;
  }; /* size: 0x0008 */
  /* 0x0008 */ unsigned short Depth;
  /* 0x000a */ unsigned short MaximumDepth;
  /* 0x000c */ unsigned long TotalAllocates;
  union
  {
    /* 0x0010 */ unsigned long AllocateMisses;
    /* 0x0010 */ unsigned long AllocateHits;
  }; /* size: 0x0004 */
  /* 0x0014 */ unsigned long TotalFrees;
  union
  {
    /* 0x0018 */ unsigned long FreeMisses;
    /* 0x0018 */ unsigned long FreeHits;
  }; /* size: 0x0004 */
  /* 0x001c */ enum _POOL_TYPE Type;
  /* 0x0020 */ unsigned long Tag;
  /* 0x0024 */ unsigned long Size;
  union
  {
    /* 0x0028 */ void* AllocateEx /* function */;
    /* 0x0028 */ void* Allocate /* function */;
  }; /* size: 0x0004 */
  union
  {
    /* 0x002c */ void* FreeEx /* function */;
    /* 0x002c */ void* Free /* function */;
  }; /* size: 0x0004 */
  /* 0x0030 */ struct _LIST_ENTRY ListEntry;
  /* 0x0038 */ unsigned long LastTotalAllocates;
  union
  {
    /* 0x003c */ unsigned long LastAllocateMisses;
    /* 0x003c */ unsigned long LastAllocateHits;
  }; /* size: 0x0004 */
  /* 0x0040 */ unsigned long Future[2];
} GENERAL_LOOKASIDE_POOL, *PGENERAL_LOOKASIDE_POOL; /* size: 0x0048 */

typedef struct _LOOKASIDE_LIST_EX
{
  /* 0x0000 */ struct _GENERAL_LOOKASIDE_POOL L;
} LOOKASIDE_LIST_EX, *PLOOKASIDE_LIST_EX; /* size: 0x0048 */

typedef enum _WHEA_ERROR_TYPE
{
  WheaErrTypeProcessor = 0,
  WheaErrTypeMemory = 1,
  WheaErrTypePCIExpress = 2,
  WheaErrTypeNMI = 3,
  WheaErrTypePCIXBus = 4,
  WheaErrTypePCIXDevice = 5,
  WheaErrTypeGeneric = 6,
  WheaErrTypePmem = 7,
} WHEA_ERROR_TYPE, *PWHEA_ERROR_TYPE;

typedef enum _WHEA_ERROR_SEVERITY
{
  WheaErrSevRecoverable = 0,
  WheaErrSevFatal = 1,
  WheaErrSevCorrected = 2,
  WheaErrSevInformational = 3,
} WHEA_ERROR_SEVERITY, *PWHEA_ERROR_SEVERITY;

typedef struct _EVENT_DESCRIPTOR
{
  /* 0x0000 */ unsigned short Id;
  /* 0x0002 */ unsigned char Version;
  /* 0x0003 */ unsigned char Channel;
  /* 0x0004 */ unsigned char Level;
  /* 0x0005 */ unsigned char Opcode;
  /* 0x0006 */ unsigned short Task;
  /* 0x0008 */ unsigned __int64 Keyword;
} EVENT_DESCRIPTOR, *PEVENT_DESCRIPTOR; /* size: 0x0010 */

typedef enum _WHEA_ERROR_SOURCE_TYPE
{
  WheaErrSrcTypeMCE = 0,
  WheaErrSrcTypeCMC = 1,
  WheaErrSrcTypeCPE = 2,
  WheaErrSrcTypeNMI = 3,
  WheaErrSrcTypePCIe = 4,
  WheaErrSrcTypeGeneric = 5,
  WheaErrSrcTypeINIT = 6,
  WheaErrSrcTypeBOOT = 7,
  WheaErrSrcTypeSCIGeneric = 8,
  WheaErrSrcTypeIPFMCA = 9,
  WheaErrSrcTypeIPFCMC = 10,
  WheaErrSrcTypeIPFCPE = 11,
  WheaErrSrcTypeGenericV2 = 12,
  WheaErrSrcTypeSCIGenericV2 = 13,
  WheaErrSrcTypeBMC = 14,
  WheaErrSrcTypePMEM = 15,
  WheaErrSrcTypeDeviceDriver = 16,
  WheaErrSrcTypeMax = 17,
} WHEA_ERROR_SOURCE_TYPE, *PWHEA_ERROR_SOURCE_TYPE;

typedef enum _WHEA_ERROR_PACKET_DATA_FORMAT
{
  WheaDataFormatIPFSalRecord = 0,
  WheaDataFormatXPFMCA = 1,
  WheaDataFormatMemory = 2,
  WheaDataFormatPCIExpress = 3,
  WheaDataFormatNMIPort = 4,
  WheaDataFormatPCIXBus = 5,
  WheaDataFormatPCIXDevice = 6,
  WheaDataFormatGeneric = 7,
  WheaDataFormatMax = 8,
} WHEA_ERROR_PACKET_DATA_FORMAT, *PWHEA_ERROR_PACKET_DATA_FORMAT;

typedef struct _NDIS_SPIN_LOCK
{
  /* 0x0000 */ unsigned long SpinLock;
  /* 0x0004 */ unsigned char OldIrql;
  /* 0x0005 */ char __PADDING__[3];
} NDIS_SPIN_LOCK, *PNDIS_SPIN_LOCK; /* size: 0x0008 */

typedef enum _WWAN_SMS_FORMAT
{
  WwanSmsFormatPdu = 0,
  WwanSmsFormatReserved0 = 1,
  WwanSmsFormatReserved1 = 2,
  WwanSmsFormatReserved2 = 3,
  WwanSmsFormatCdma = 4,
  WwanSmsFormatMax = 5,
} WWAN_SMS_FORMAT, *PWWAN_SMS_FORMAT;

typedef enum _WWAN_SMS_FLAG
{
  WwanSmsFlagAll = 0,
  WwanSmsFlagIndex = 1,
  WwanSmsFlagNew = 2,
  WwanSmsFlagOld = 3,
  WwanSmsFlagSent = 4,
  WwanSmsFlagDraft = 5,
  WwanSmsFlagMax = 6,
} WWAN_SMS_FLAG, *PWWAN_SMS_FLAG;

typedef struct _WWAN_SMS_FILTER
{
  /* 0x0000 */ enum _WWAN_SMS_FLAG Flag;
  /* 0x0004 */ unsigned long MessageIndex;
} WWAN_SMS_FILTER, *PWWAN_SMS_FILTER; /* size: 0x0008 */

typedef struct _WWAN_SMS_READ
{
  /* 0x0000 */ enum _WWAN_SMS_FORMAT SmsFormat;
  /* 0x0004 */ struct _WWAN_SMS_FILTER ReadFilter;
} WWAN_SMS_READ, *PWWAN_SMS_READ; /* size: 0x000c */

enum SCOPE_LEVEL
{
  ScopeLevelInterface = 1,
  ScopeLevelLink = 2,
  ScopeLevelSubnet = 3,
  ScopeLevelAdmin = 4,
  ScopeLevelSite = 5,
  ScopeLevelOrganization = 8,
  ScopeLevelGlobal = 14,
  ScopeLevelCount = 16,
};

enum NL_ADDRESS_TYPE
{
  NlatUnspecified = 0,
  NlatUnicast = 1,
  NlatAnycast = 2,
  NlatMulticast = 3,
  NlatBroadcast = 4,
  NlatInvalid = 5,
};

typedef struct _DEVPROPKEY
{
  /* 0x0000 */ struct _GUID fmtid;
  /* 0x0010 */ unsigned long pid;
} DEVPROPKEY, *PDEVPROPKEY; /* size: 0x0014 */

typedef struct _NDIS_PACKET_PRIVATE
{
  /* 0x0000 */ unsigned int PhysicalCount;
  /* 0x0004 */ unsigned int TotalLength;
  /* 0x0008 */ struct _MDL* Head;
  /* 0x000c */ struct _MDL* Tail;
  /* 0x0010 */ void* Pool;
  /* 0x0014 */ unsigned int Count;
  /* 0x0018 */ unsigned long Flags;
  /* 0x001c */ unsigned char ValidCounts;
  /* 0x001d */ unsigned char NdisPacketFlags;
  /* 0x001e */ unsigned short NdisPacketOobOffset;
} NDIS_PACKET_PRIVATE, *PNDIS_PACKET_PRIVATE; /* size: 0x0020 */

typedef struct _DISPATCHER_HEADER
{
  union
  {
    /* 0x0000 */ volatile long Lock;
    /* 0x0000 */ long LockNV;
    struct
    {
      /* 0x0000 */ unsigned char Type;
      /* 0x0001 */ unsigned char Signalling;
      /* 0x0002 */ unsigned char Size;
      /* 0x0003 */ unsigned char Reserved1;
    }; /* size: 0x0004 */
    struct
    {
      /* 0x0000 */ unsigned char TimerType;
      union
      {
        /* 0x0001 */ unsigned char TimerControlFlags;
        struct
        {
          struct /* bitfield */
          {
            /* 0x0001 */ unsigned char Absolute : 1; /* bit position: 0 */
            /* 0x0001 */ unsigned char Wake : 1; /* bit position: 1 */
            /* 0x0001 */ unsigned char EncodedTolerableDelay : 6; /* bit position: 2 */
          }; /* bitfield */
          /* 0x0002 */ unsigned char Hand;
          union
          {
            /* 0x0003 */ unsigned char TimerMiscFlags;
            struct /* bitfield */
            {
              /* 0x0003 */ unsigned char Index : 1; /* bit position: 0 */
              /* 0x0003 */ unsigned char Processor : 5; /* bit position: 1 */
              /* 0x0003 */ unsigned char Inserted : 1; /* bit position: 6 */
              /* 0x0003 */ volatile unsigned char Expired : 1; /* bit position: 7 */
            }; /* bitfield */
          }; /* size: 0x0001 */
        }; /* size: 0x0003 */
      }; /* size: 0x0003 */
    }; /* size: 0x0004 */
    struct
    {
      /* 0x0000 */ unsigned char Timer2Type;
      union
      {
        /* 0x0001 */ unsigned char Timer2Flags;
        struct
        {
          struct /* bitfield */
          {
            /* 0x0001 */ unsigned char Timer2Inserted : 1; /* bit position: 0 */
            /* 0x0001 */ unsigned char Timer2Expiring : 1; /* bit position: 1 */
            /* 0x0001 */ unsigned char Timer2CancelPending : 1; /* bit position: 2 */
            /* 0x0001 */ unsigned char Timer2SetPending : 1; /* bit position: 3 */
            /* 0x0001 */ unsigned char Timer2Running : 1; /* bit position: 4 */
            /* 0x0001 */ unsigned char Timer2Disabled : 1; /* bit position: 5 */
            /* 0x0001 */ unsigned char Timer2ReservedFlags : 2; /* bit position: 6 */
          }; /* bitfield */
          /* 0x0002 */ unsigned char Timer2ComponentId;
          /* 0x0003 */ unsigned char Timer2RelativeId;
        }; /* size: 0x0003 */
      }; /* size: 0x0003 */
    }; /* size: 0x0004 */
    struct
    {
      /* 0x0000 */ unsigned char QueueType;
      union
      {
        /* 0x0001 */ unsigned char QueueControlFlags;
        struct
        {
          struct /* bitfield */
          {
            /* 0x0001 */ unsigned char Abandoned : 1; /* bit position: 0 */
            /* 0x0001 */ unsigned char DisableIncrement : 1; /* bit position: 1 */
            /* 0x0001 */ unsigned char QueueReservedControlFlags : 6; /* bit position: 2 */
          }; /* bitfield */
          /* 0x0002 */ unsigned char QueueSize;
          /* 0x0003 */ unsigned char QueueReserved;
        }; /* size: 0x0003 */
      }; /* size: 0x0003 */
    }; /* size: 0x0004 */
    struct
    {
      /* 0x0000 */ unsigned char ThreadType;
      /* 0x0001 */ unsigned char ThreadReserved;
      union
      {
        /* 0x0002 */ unsigned char ThreadControlFlags;
        struct
        {
          struct /* bitfield */
          {
            /* 0x0002 */ unsigned char CycleProfiling : 1; /* bit position: 0 */
            /* 0x0002 */ unsigned char CounterProfiling : 1; /* bit position: 1 */
            /* 0x0002 */ unsigned char GroupScheduling : 1; /* bit position: 2 */
            /* 0x0002 */ unsigned char AffinitySet : 1; /* bit position: 3 */
            /* 0x0002 */ unsigned char Tagged : 1; /* bit position: 4 */
            /* 0x0002 */ unsigned char EnergyProfiling : 1; /* bit position: 5 */
            /* 0x0002 */ unsigned char SchedulerAssist : 1; /* bit position: 6 */
            /* 0x0002 */ unsigned char Instrumented : 1; /* bit position: 7 */
          }; /* bitfield */
          /* 0x0003 */ unsigned char DebugActive;
        }; /* size: 0x0002 */
      }; /* size: 0x0002 */
    }; /* size: 0x0004 */
    struct
    {
      /* 0x0000 */ unsigned char MutantType;
      /* 0x0001 */ unsigned char MutantSize;
      /* 0x0002 */ unsigned char DpcActive;
      /* 0x0003 */ unsigned char MutantReserved;
    }; /* size: 0x0004 */
  }; /* size: 0x0004 */
  /* 0x0004 */ long SignalState;
  /* 0x0008 */ struct _LIST_ENTRY WaitListHead;
} DISPATCHER_HEADER, *PDISPATCHER_HEADER; /* size: 0x0010 */

typedef struct _KEVENT
{
  /* 0x0000 */ struct _DISPATCHER_HEADER Header;
} KEVENT, *PKEVENT; /* size: 0x0010 */

typedef struct _FAST_MUTEX
{
  /* 0x0000 */ long Count;
  /* 0x0004 */ void* Owner;
  /* 0x0008 */ unsigned long Contention;
  /* 0x000c */ struct _KEVENT Event;
  /* 0x001c */ unsigned long OldIrql;
} FAST_MUTEX, *PFAST_MUTEX; /* size: 0x0020 */

enum DL_ADDRESS_TYPE
{
  DlUnicast = 0,
  DlMulticast = 1,
  DlBroadcast = 2,
};

typedef enum _NPI_MODULEID_TYPE
{
  MIT_GUID = 1,
  MIT_IF_LUID = 2,
} NPI_MODULEID_TYPE, *PNPI_MODULEID_TYPE;

typedef struct _NETIO_NET_BUFFER_CONTEXT
{
  /* 0x0000 */ unsigned long OriginalDataOffset;
  /* 0x0004 */ unsigned long OriginalDataLength;
  /* 0x0008 */ unsigned long TruncatedLength;
  union
  {
    /* 0x000c */ unsigned long Flags;
    struct /* bitfield */
    {
      /* 0x000c */ unsigned long EcnField : 2; /* bit position: 0 */
      /* 0x000c */ unsigned long EspTrailerSpaceAllocated : 1; /* bit position: 2 */
      /* 0x000c */ unsigned long Converted : 1; /* bit position: 3 */
      /* 0x000c */ unsigned long Restored : 1; /* bit position: 4 */
      /* 0x000c */ unsigned long EcnForceNotEct : 1; /* bit position: 5 */
      /* 0x000c */ unsigned long NdPriority : 1; /* bit position: 6 */
      /* 0x000c */ unsigned long IpsnpiForwardInjection : 1; /* bit position: 7 */
      /* 0x000c */ unsigned long IpsnpiForwardInjectionCopy : 1; /* bit position: 8 */
    }; /* bitfield */
  }; /* size: 0x0004 */
  /* 0x0010 */ void* Scratch[2];
} NETIO_NET_BUFFER_CONTEXT, *PNETIO_NET_BUFFER_CONTEXT; /* size: 0x0018 */

typedef struct _TEB_ACTIVE_FRAME_CONTEXT
{
  /* 0x0000 */ unsigned long Flags;
  /* 0x0004 */ const char* FrameName;
} TEB_ACTIVE_FRAME_CONTEXT, *PTEB_ACTIVE_FRAME_CONTEXT; /* size: 0x0008 */

enum COMPARTMENT_ID
{
  UNSPECIFIED_COMPARTMENT_ID = 0,
  DEFAULT_COMPARTMENT_ID = 1,
};

typedef union _LARGE_INTEGER
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned long LowPart;
      /* 0x0004 */ long HighPart;
    }; /* size: 0x0008 */
    struct
    {
      /* 0x0000 */ unsigned long LowPart;
      /* 0x0004 */ long HighPart;
    } /* size: 0x0008 */ u;
    /* 0x0000 */ __int64 QuadPart;
  }; /* size: 0x0008 */
} LARGE_INTEGER, *PLARGE_INTEGER; /* size: 0x0008 */

typedef struct _EVENT_HEADER
{
  /* 0x0000 */ unsigned short Size;
  /* 0x0002 */ unsigned short HeaderType;
  /* 0x0004 */ unsigned short Flags;
  /* 0x0006 */ unsigned short EventProperty;
  /* 0x0008 */ unsigned long ThreadId;
  /* 0x000c */ unsigned long ProcessId;
  /* 0x0010 */ union _LARGE_INTEGER TimeStamp;
  /* 0x0018 */ struct _GUID ProviderId;
  /* 0x0028 */ struct _EVENT_DESCRIPTOR EventDescriptor;
  union
  {
    struct
    {
      /* 0x0038 */ unsigned long KernelTime;
      /* 0x003c */ unsigned long UserTime;
    }; /* size: 0x0008 */
    /* 0x0038 */ unsigned __int64 ProcessorTime;
  }; /* size: 0x0008 */
  /* 0x0040 */ struct _GUID ActivityId;
} EVENT_HEADER, *PEVENT_HEADER; /* size: 0x0050 */

typedef enum _NET_DEVICE_RESET_TYPE
{
  FunctionLevelReset = 0,
  PlatformLevelReset = 1,
} NET_DEVICE_RESET_TYPE, *PNET_DEVICE_RESET_TYPE;

typedef struct _NDIS_TCP_IP_CHECKSUM_OFFLOAD
{
  struct
  {
    /* 0x0000 */ unsigned long Encapsulation;
    struct /* bitfield */
    {
      /* 0x0004 */ unsigned long IpOptionsSupported : 2; /* bit position: 0 */
      /* 0x0004 */ unsigned long TcpOptionsSupported : 2; /* bit position: 2 */
      /* 0x0004 */ unsigned long TcpChecksum : 2; /* bit position: 4 */
      /* 0x0004 */ unsigned long UdpChecksum : 2; /* bit position: 6 */
      /* 0x0004 */ unsigned long IpChecksum : 2; /* bit position: 8 */
    }; /* bitfield */
  } /* size: 0x0008 */ IPv4Transmit;
  struct
  {
    /* 0x0008 */ unsigned long Encapsulation;
    struct /* bitfield */
    {
      /* 0x000c */ unsigned long IpOptionsSupported : 2; /* bit position: 0 */
      /* 0x000c */ unsigned long TcpOptionsSupported : 2; /* bit position: 2 */
      /* 0x000c */ unsigned long TcpChecksum : 2; /* bit position: 4 */
      /* 0x000c */ unsigned long UdpChecksum : 2; /* bit position: 6 */
      /* 0x000c */ unsigned long IpChecksum : 2; /* bit position: 8 */
    }; /* bitfield */
  } /* size: 0x0008 */ IPv4Receive;
  struct
  {
    /* 0x0010 */ unsigned long Encapsulation;
    struct /* bitfield */
    {
      /* 0x0014 */ unsigned long IpExtensionHeadersSupported : 2; /* bit position: 0 */
      /* 0x0014 */ unsigned long TcpOptionsSupported : 2; /* bit position: 2 */
      /* 0x0014 */ unsigned long TcpChecksum : 2; /* bit position: 4 */
      /* 0x0014 */ unsigned long UdpChecksum : 2; /* bit position: 6 */
    }; /* bitfield */
  } /* size: 0x0008 */ IPv6Transmit;
  struct
  {
    /* 0x0018 */ unsigned long Encapsulation;
    struct /* bitfield */
    {
      /* 0x001c */ unsigned long IpExtensionHeadersSupported : 2; /* bit position: 0 */
      /* 0x001c */ unsigned long TcpOptionsSupported : 2; /* bit position: 2 */
      /* 0x001c */ unsigned long TcpChecksum : 2; /* bit position: 4 */
      /* 0x001c */ unsigned long UdpChecksum : 2; /* bit position: 6 */
    }; /* bitfield */
  } /* size: 0x0008 */ IPv6Receive;
} NDIS_TCP_IP_CHECKSUM_OFFLOAD, *PNDIS_TCP_IP_CHECKSUM_OFFLOAD; /* size: 0x0020 */

typedef struct _NDIS_TCP_LARGE_SEND_OFFLOAD_V1
{
  struct
  {
    /* 0x0000 */ unsigned long Encapsulation;
    /* 0x0004 */ unsigned long MaxOffLoadSize;
    /* 0x0008 */ unsigned long MinSegmentCount;
    struct /* bitfield */
    {
      /* 0x000c */ unsigned long TcpOptions : 2; /* bit position: 0 */
      /* 0x000c */ unsigned long IpOptions : 2; /* bit position: 2 */
    }; /* bitfield */
  } /* size: 0x0010 */ IPv4;
} NDIS_TCP_LARGE_SEND_OFFLOAD_V1, *PNDIS_TCP_LARGE_SEND_OFFLOAD_V1; /* size: 0x0010 */

typedef struct _NDIS_IPSEC_OFFLOAD_V1
{
  struct
  {
    /* 0x0000 */ unsigned long Encapsulation;
    /* 0x0004 */ unsigned long AhEspCombined;
    /* 0x0008 */ unsigned long TransportTunnelCombined;
    /* 0x000c */ unsigned long IPv4Options;
    /* 0x0010 */ unsigned long Flags;
  } /* size: 0x0014 */ Supported;
  struct
  {
    struct /* bitfield */
    {
      /* 0x0014 */ unsigned long Md5 : 2; /* bit position: 0 */
      /* 0x0014 */ unsigned long Sha_1 : 2; /* bit position: 2 */
      /* 0x0014 */ unsigned long Transport : 2; /* bit position: 4 */
      /* 0x0014 */ unsigned long Tunnel : 2; /* bit position: 6 */
      /* 0x0014 */ unsigned long Send : 2; /* bit position: 8 */
      /* 0x0014 */ unsigned long Receive : 2; /* bit position: 10 */
    }; /* bitfield */
  } /* size: 0x0004 */ IPv4AH;
  struct
  {
    struct /* bitfield */
    {
      /* 0x0018 */ unsigned long Des : 2; /* bit position: 0 */
      /* 0x0018 */ unsigned long Reserved : 2; /* bit position: 2 */
      /* 0x0018 */ unsigned long TripleDes : 2; /* bit position: 4 */
      /* 0x0018 */ unsigned long NullEsp : 2; /* bit position: 6 */
      /* 0x0018 */ unsigned long Transport : 2; /* bit position: 8 */
      /* 0x0018 */ unsigned long Tunnel : 2; /* bit position: 10 */
      /* 0x0018 */ unsigned long Send : 2; /* bit position: 12 */
      /* 0x0018 */ unsigned long Receive : 2; /* bit position: 14 */
    }; /* bitfield */
  } /* size: 0x0004 */ IPv4ESP;
} NDIS_IPSEC_OFFLOAD_V1, *PNDIS_IPSEC_OFFLOAD_V1; /* size: 0x001c */

typedef struct _NDIS_TCP_LARGE_SEND_OFFLOAD_V2
{
  struct
  {
    /* 0x0000 */ unsigned long Encapsulation;
    /* 0x0004 */ unsigned long MaxOffLoadSize;
    /* 0x0008 */ unsigned long MinSegmentCount;
  } /* size: 0x000c */ IPv4;
  struct
  {
    /* 0x000c */ unsigned long Encapsulation;
    /* 0x0010 */ unsigned long MaxOffLoadSize;
    /* 0x0014 */ unsigned long MinSegmentCount;
    struct /* bitfield */
    {
      /* 0x0018 */ unsigned long IpExtensionHeadersSupported : 2; /* bit position: 0 */
      /* 0x0018 */ unsigned long TcpOptionsSupported : 2; /* bit position: 2 */
    }; /* bitfield */
  } /* size: 0x0010 */ IPv6;
} NDIS_TCP_LARGE_SEND_OFFLOAD_V2, *PNDIS_TCP_LARGE_SEND_OFFLOAD_V2; /* size: 0x001c */

typedef struct _NDIS_IPSEC_OFFLOAD_V2
{
  /* 0x0000 */ unsigned long Encapsulation;
  /* 0x0004 */ unsigned char IPv6Supported;
  /* 0x0005 */ unsigned char IPv4Options;
  /* 0x0006 */ unsigned char IPv6NonIPsecExtensionHeaders;
  /* 0x0007 */ unsigned char Ah;
  /* 0x0008 */ unsigned char Esp;
  /* 0x0009 */ unsigned char AhEspCombined;
  /* 0x000a */ unsigned char Transport;
  /* 0x000b */ unsigned char Tunnel;
  /* 0x000c */ unsigned char TransportTunnelCombined;
  /* 0x000d */ unsigned char LsoSupported;
  /* 0x000e */ unsigned char ExtendedSequenceNumbers;
  /* 0x000f */ char Padding_4;
  /* 0x0010 */ unsigned long UdpEsp;
  /* 0x0014 */ unsigned long AuthenticationAlgorithms;
  /* 0x0018 */ unsigned long EncryptionAlgorithms;
  /* 0x001c */ unsigned long SaOffloadCapacity;
} NDIS_IPSEC_OFFLOAD_V2, *PNDIS_IPSEC_OFFLOAD_V2; /* size: 0x0020 */

typedef struct _NDIS_TCP_RECV_SEG_COALESCE_OFFLOAD
{
  struct
  {
    /* 0x0000 */ unsigned char Enabled;
  } /* size: 0x0001 */ IPv4;
  struct
  {
    /* 0x0001 */ unsigned char Enabled;
  } /* size: 0x0001 */ IPv6;
} NDIS_TCP_RECV_SEG_COALESCE_OFFLOAD, *PNDIS_TCP_RECV_SEG_COALESCE_OFFLOAD; /* size: 0x0002 */

typedef struct _NDIS_ENCAPSULATED_PACKET_TASK_OFFLOAD
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned long TransmitChecksumOffloadSupported : 4; /* bit position: 0 */
    /* 0x0000 */ unsigned long ReceiveChecksumOffloadSupported : 4; /* bit position: 4 */
    /* 0x0000 */ unsigned long LsoV2Supported : 4; /* bit position: 8 */
    /* 0x0000 */ unsigned long RssSupported : 4; /* bit position: 12 */
    /* 0x0000 */ unsigned long VmqSupported : 4; /* bit position: 16 */
  }; /* bitfield */
  /* 0x0004 */ unsigned long MaxHeaderSizeSupported;
} NDIS_ENCAPSULATED_PACKET_TASK_OFFLOAD, *PNDIS_ENCAPSULATED_PACKET_TASK_OFFLOAD; /* size: 0x0008 */

typedef struct _NDIS_ENCAPSULATED_PACKET_TASK_OFFLOAD_V2::_ENCAPSULATION_PROTOCOL_INFO::_VXLAN_INFO
{
  /* 0x0000 */ unsigned short VxlanUDPPortNumber;
  /* 0x0002 */ unsigned short VxlanUDPPortNumberConfigurable : 1; /* bit position: 0 */
} NDIS_ENCAPSULATED_PACKET_TASK_OFFLOAD_V2::_ENCAPSULATION_PROTOCOL_INFO::_VXLAN_INFO, *PNDIS_ENCAPSULATED_PACKET_TASK_OFFLOAD_V2::_ENCAPSULATION_PROTOCOL_INFO::_VXLAN_INFO; /* size: 0x0004 */

typedef union _NDIS_ENCAPSULATED_PACKET_TASK_OFFLOAD_V2::_ENCAPSULATION_PROTOCOL_INFO
{
  union
  {
    /* 0x0000 */ struct _NDIS_ENCAPSULATED_PACKET_TASK_OFFLOAD_V2::_ENCAPSULATION_PROTOCOL_INFO::_VXLAN_INFO VxlanInfo;
    /* 0x0000 */ unsigned long Value;
  }; /* size: 0x0004 */
} NDIS_ENCAPSULATED_PACKET_TASK_OFFLOAD_V2::_ENCAPSULATION_PROTOCOL_INFO, *PNDIS_ENCAPSULATED_PACKET_TASK_OFFLOAD_V2::_ENCAPSULATION_PROTOCOL_INFO; /* size: 0x0004 */

typedef struct _NDIS_ENCAPSULATED_PACKET_TASK_OFFLOAD_V2
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned long TransmitChecksumOffloadSupported : 4; /* bit position: 0 */
    /* 0x0000 */ unsigned long ReceiveChecksumOffloadSupported : 4; /* bit position: 4 */
    /* 0x0000 */ unsigned long LsoV2Supported : 4; /* bit position: 8 */
    /* 0x0000 */ unsigned long RssSupported : 4; /* bit position: 12 */
    /* 0x0000 */ unsigned long VmqSupported : 4; /* bit position: 16 */
    /* 0x0000 */ unsigned long Reserved : 12; /* bit position: 20 */
  }; /* bitfield */
  /* 0x0004 */ unsigned long MaxHeaderSizeSupported;
  /* 0x0008 */ union _NDIS_ENCAPSULATED_PACKET_TASK_OFFLOAD_V2::_ENCAPSULATION_PROTOCOL_INFO EncapsulationProtocolInfo;
  /* 0x000c */ unsigned long Reserved1;
  /* 0x0010 */ unsigned long Reserved2;
} NDIS_ENCAPSULATED_PACKET_TASK_OFFLOAD_V2, *PNDIS_ENCAPSULATED_PACKET_TASK_OFFLOAD_V2; /* size: 0x0014 */

typedef enum _NDIS_RFC6877_464XLAT_OFFLOAD_OPTIONS
{
  NDIS_RFC6877_464XLAT_OFFLOAD_NOT_SUPPORTED = 0,
  NDIS_RFC6877_464XLAT_OFFLOAD_DISABLED = 1,
  NDIS_RFC6877_464XLAT_OFFLOAD_ENABLED = 2,
  NDIS_RFC6877_464XLAT_OFFLOAD_ON_DEMAND = 3,
} NDIS_RFC6877_464XLAT_OFFLOAD_OPTIONS, *PNDIS_RFC6877_464XLAT_OFFLOAD_OPTIONS;

typedef struct _NDIS_RFC6877_464XLAT_OFFLOAD
{
  /* 0x0000 */ enum _NDIS_RFC6877_464XLAT_OFFLOAD_OPTIONS XlatOffload;
  /* 0x0004 */ unsigned long Flags;
} NDIS_RFC6877_464XLAT_OFFLOAD, *PNDIS_RFC6877_464XLAT_OFFLOAD; /* size: 0x0008 */

typedef struct _NDIS_UDP_SEGMENTATION_OFFLOAD
{
  struct
  {
    /* 0x0000 */ unsigned long Encapsulation;
    /* 0x0004 */ unsigned long MaxOffLoadSize;
    struct /* bitfield */
    {
      /* 0x0008 */ unsigned long MinSegmentCount : 6; /* bit position: 0 */
      /* 0x0008 */ unsigned long SubMssFinalSegmentSupported : 1; /* bit position: 6 */
      /* 0x0008 */ unsigned long Reserved : 25; /* bit position: 7 */
    }; /* bitfield */
  } /* size: 0x000c */ IPv4;
  struct
  {
    /* 0x000c */ unsigned long Encapsulation;
    /* 0x0010 */ unsigned long MaxOffLoadSize;
    struct /* bitfield */
    {
      /* 0x0014 */ unsigned long MinSegmentCount : 6; /* bit position: 0 */
      /* 0x0014 */ unsigned long SubMssFinalSegmentSupported : 1; /* bit position: 6 */
      /* 0x0014 */ unsigned long Reserved1 : 25; /* bit position: 7 */
    }; /* bitfield */
    struct /* bitfield */
    {
      /* 0x0018 */ unsigned long IpExtensionHeadersSupported : 2; /* bit position: 0 */
      /* 0x0018 */ unsigned long Reserved2 : 30; /* bit position: 2 */
    }; /* bitfield */
  } /* size: 0x0010 */ IPv6;
} NDIS_UDP_SEGMENTATION_OFFLOAD, *PNDIS_UDP_SEGMENTATION_OFFLOAD; /* size: 0x001c */

typedef struct _NDIS_OFFLOAD
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ struct _NDIS_TCP_IP_CHECKSUM_OFFLOAD Checksum;
  /* 0x0024 */ struct _NDIS_TCP_LARGE_SEND_OFFLOAD_V1 LsoV1;
  /* 0x0034 */ struct _NDIS_IPSEC_OFFLOAD_V1 IPsecV1;
  /* 0x0050 */ struct _NDIS_TCP_LARGE_SEND_OFFLOAD_V2 LsoV2;
  /* 0x006c */ unsigned long Flags;
  /* 0x0070 */ struct _NDIS_IPSEC_OFFLOAD_V2 IPsecV2;
  /* 0x0090 */ struct _NDIS_TCP_RECV_SEG_COALESCE_OFFLOAD Rsc;
  /* 0x0092 */ char Padding_5[2];
  /* 0x0094 */ struct _NDIS_ENCAPSULATED_PACKET_TASK_OFFLOAD EncapsulatedPacketTaskOffloadGre;
  /* 0x009c */ struct _NDIS_ENCAPSULATED_PACKET_TASK_OFFLOAD_V2 EncapsulatedPacketTaskOffloadVxlan;
  /* 0x00b0 */ unsigned char EncapsulationTypes;
  /* 0x00b1 */ char Padding_6[3];
  /* 0x00b4 */ struct _NDIS_RFC6877_464XLAT_OFFLOAD Rfc6877Xlat;
  /* 0x00bc */ struct _NDIS_UDP_SEGMENTATION_OFFLOAD UdpSegmentation;
} NDIS_OFFLOAD, *PNDIS_OFFLOAD; /* size: 0x00d8 */

enum FEATURE_CHANGE_TIME
{
  FEATURE_CHANGE_TIME_READ = 0,
  FEATURE_CHANGE_TIME_MODULE_RELOAD = 1,
  FEATURE_CHANGE_TIME_SESSION = 2,
  FEATURE_CHANGE_TIME_REBOOT = 3,
  FEATURE_CHANGE_TIME_USER_FLAG = 128,
};

enum FEATURE_ENABLED_STATE
{
  FEATURE_ENABLED_STATE_DEFAULT = 0,
  FEATURE_ENABLED_STATE_DISABLED = 1,
  FEATURE_ENABLED_STATE_ENABLED = 2,
  FEATURE_ENABLED_STATE_HAS_NOTIFICATION = 128,
  FEATURE_ENABLED_STATE_HAS_VARIANT_CONFIGURATION = 64,
};

enum wil_FeatureEnabledStateOptions
{
  wil_FeatureEnabledStateOptions_None = 0,
  wil_FeatureEnabledStateOptions_VariantConfig = 1,
};

typedef struct _CM_PARTIAL_RESOURCE_DESCRIPTOR
{
  /* 0x0000 */ unsigned char Type;
  /* 0x0001 */ unsigned char ShareDisposition;
  /* 0x0002 */ unsigned short Flags;
  union
  {
    union
    {
      struct
      {
        /* 0x0004 */ union _LARGE_INTEGER Start;
        /* 0x000c */ unsigned long Length;
      } /* size: 0x000c */ Generic;
      struct
      {
        /* 0x0004 */ union _LARGE_INTEGER Start;
        /* 0x000c */ unsigned long Length;
      } /* size: 0x000c */ Port;
      struct
      {
        /* 0x0004 */ unsigned short Level;
        /* 0x0006 */ unsigned short Group;
        /* 0x0008 */ unsigned long Vector;
        /* 0x000c */ unsigned long Affinity;
      } /* size: 0x000c */ Interrupt;
      struct
      {
        union
        {
          struct
          {
            /* 0x0004 */ unsigned short Group;
            /* 0x0006 */ unsigned short MessageCount;
            /* 0x0008 */ unsigned long Vector;
            /* 0x000c */ unsigned long Affinity;
          } /* size: 0x000c */ Raw;
          struct
          {
            /* 0x0004 */ unsigned short Level;
            /* 0x0006 */ unsigned short Group;
            /* 0x0008 */ unsigned long Vector;
            /* 0x000c */ unsigned long Affinity;
          } /* size: 0x000c */ Translated;
        }; /* size: 0x000c */
      } /* size: 0x000c */ MessageInterrupt;
      struct
      {
        /* 0x0004 */ union _LARGE_INTEGER Start;
        /* 0x000c */ unsigned long Length;
      } /* size: 0x000c */ Memory;
      struct
      {
        /* 0x0004 */ unsigned long Channel;
        /* 0x0008 */ unsigned long Port;
        /* 0x000c */ unsigned long Reserved1;
      } /* size: 0x000c */ Dma;
      struct
      {
        /* 0x0004 */ unsigned long Channel;
        /* 0x0008 */ unsigned long RequestLine;
        /* 0x000c */ unsigned char TransferWidth;
        /* 0x000d */ unsigned char Reserved1;
        /* 0x000e */ unsigned char Reserved2;
        /* 0x000f */ unsigned char Reserved3;
      } /* size: 0x000c */ DmaV3;
      struct
      {
        /* 0x0004 */ unsigned long Data[3];
      } /* size: 0x000c */ DevicePrivate;
      struct
      {
        /* 0x0004 */ unsigned long Start;
        /* 0x0008 */ unsigned long Length;
        /* 0x000c */ unsigned long Reserved;
      } /* size: 0x000c */ BusNumber;
      struct
      {
        /* 0x0004 */ unsigned long DataSize;
        /* 0x0008 */ unsigned long Reserved1;
        /* 0x000c */ unsigned long Reserved2;
      } /* size: 0x000c */ DeviceSpecificData;
      struct
      {
        /* 0x0004 */ union _LARGE_INTEGER Start;
        /* 0x000c */ unsigned long Length40;
      } /* size: 0x000c */ Memory40;
      struct
      {
        /* 0x0004 */ union _LARGE_INTEGER Start;
        /* 0x000c */ unsigned long Length48;
      } /* size: 0x000c */ Memory48;
      struct
      {
        /* 0x0004 */ union _LARGE_INTEGER Start;
        /* 0x000c */ unsigned long Length64;
      } /* size: 0x000c */ Memory64;
      struct
      {
        /* 0x0004 */ unsigned char Class;
        /* 0x0005 */ unsigned char Type;
        /* 0x0006 */ unsigned char Reserved1;
        /* 0x0007 */ unsigned char Reserved2;
        /* 0x0008 */ unsigned long IdLowPart;
        /* 0x000c */ unsigned long IdHighPart;
      } /* size: 0x000c */ Connection;
    }; /* size: 0x000c */
  } /* size: 0x000c */ u;
} CM_PARTIAL_RESOURCE_DESCRIPTOR, *PCM_PARTIAL_RESOURCE_DESCRIPTOR; /* size: 0x0010 */

typedef struct _CM_PARTIAL_RESOURCE_LIST
{
  /* 0x0000 */ unsigned short Version;
  /* 0x0002 */ unsigned short Revision;
  /* 0x0004 */ unsigned long Count;
  /* 0x0008 */ struct _CM_PARTIAL_RESOURCE_DESCRIPTOR PartialDescriptors[1];
} CM_PARTIAL_RESOURCE_LIST, *PCM_PARTIAL_RESOURCE_LIST; /* size: 0x0018 */

typedef struct _TEB_ACTIVE_FRAME
{
  /* 0x0000 */ unsigned long Flags;
  /* 0x0004 */ struct _TEB_ACTIVE_FRAME* Previous;
  /* 0x0008 */ const struct _TEB_ACTIVE_FRAME_CONTEXT* Context;
} TEB_ACTIVE_FRAME, *PTEB_ACTIVE_FRAME; /* size: 0x000c */

struct wistd::default_delete<NDIS_BIND_PROTOCOL_LINK>
{
}; /* size: 0x0001 */

enum wil_details_StagingConfigFeatureFields
{
  wil_details_StagingConfigFeatureFields_None = 0,
  wil_details_StagingConfigFeatureFields_ServiceState = 1,
  wil_details_StagingConfigFeatureFields_UserState = 2,
  wil_details_StagingConfigFeatureFields_TestState = 4,
  wil_details_StagingConfigFeatureFields_Variant = 8,
};

enum wil_details_ServiceReportingOptions
{
  wil_details_ServiceReportingOptions_None = 0,
  wil_details_ServiceReportingOptions_VariantConfig = 1,
};

struct NDIS_MEMORYDUMP_HANDLE__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

typedef struct _RTL_DYNAMIC_HASH_TABLE_CONTEXT
{
  /* 0x0000 */ struct _LIST_ENTRY* ChainHead;
  /* 0x0004 */ struct _LIST_ENTRY* PrevLinkage;
  /* 0x0008 */ unsigned long Signature;
} RTL_DYNAMIC_HASH_TABLE_CONTEXT, *PRTL_DYNAMIC_HASH_TABLE_CONTEXT; /* size: 0x000c */

enum wil_ReportingKind
{
  wil_ReportingKind_None = 0,
  wil_ReportingKind_UniqueUsage = 1,
  wil_ReportingKind_UniqueOpportunity = 2,
  wil_ReportingKind_DeviceUsage = 3,
  wil_ReportingKind_DeviceOpportunity = 4,
  wil_ReportingKind_TotalDuration = 5,
  wil_ReportingKind_PausedDuration = 6,
};

enum wil_details_ServiceReportingKind
{
  wil_details_ServiceReportingKind_UniqueUsage = 0,
  wil_details_ServiceReportingKind_UniqueOpportunity = 1,
  wil_details_ServiceReportingKind_DeviceUsage = 2,
  wil_details_ServiceReportingKind_DeviceOpportunity = 3,
  wil_details_ServiceReportingKind_PotentialUniqueUsage = 4,
  wil_details_ServiceReportingKind_PotentialUniqueOpportunity = 5,
  wil_details_ServiceReportingKind_PotentialDeviceUsage = 6,
  wil_details_ServiceReportingKind_PotentialDeviceOpportunity = 7,
  wil_details_ServiceReportingKind_EnabledTotalDuration = 8,
  wil_details_ServiceReportingKind_EnabledPausedDuration = 9,
  wil_details_ServiceReportingKind_DisabledTotalDuration = 10,
  wil_details_ServiceReportingKind_DisabledPausedDuration = 11,
  wil_details_ServiceReportingKind_CustomEnabledBase = 100,
  wil_details_ServiceReportingKind_CustomDisabledBase = 150,
  wil_details_ServiceReportingKind_Store = 254,
  wil_details_ServiceReportingKind_None = 255,
  wil_details_ServiceReportingKind_VariantDevicePotentialBase = 256,
  wil_details_ServiceReportingKind_VariantDeviceUsageBase = 320,
  wil_details_ServiceReportingKind_VariantUniquePotentialBase = 384,
  wil_details_ServiceReportingKind_VariantUniqueUsageBase = 448,
};

typedef struct _NDIS_DEVICE_OBJECT_ATTRIBUTES
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ struct _UNICODE_STRING* DeviceName;
  /* 0x0008 */ struct _UNICODE_STRING* SymbolicName;
  /* 0x000c */ void** MajorFunctions /* function */;
  /* 0x0010 */ unsigned long ExtensionSize;
  /* 0x0014 */ const struct _UNICODE_STRING* DefaultSDDLString;
  /* 0x0018 */ const struct _GUID* DeviceClassGuid;
} NDIS_DEVICE_OBJECT_ATTRIBUTES, *PNDIS_DEVICE_OBJECT_ATTRIBUTES; /* size: 0x001c */

enum wil_VariantReportingKind
{
  wil_VariantReportingKind_None = 0,
  wil_VariantReportingKind_UniqueUsage = 1,
  wil_VariantReportingKind_DeviceUsage = 2,
};

typedef struct _PROCESSOR_NUMBER
{
  /* 0x0000 */ unsigned short Group;
  /* 0x0002 */ unsigned char Number;
  /* 0x0003 */ unsigned char Reserved;
} PROCESSOR_NUMBER, *PPROCESSOR_NUMBER; /* size: 0x0004 */

struct Rtl::KString
{
}; /* size: 0x0008 */

typedef struct _RTL_SPLAY_LINKS
{
  /* 0x0000 */ struct _RTL_SPLAY_LINKS* Parent;
  /* 0x0004 */ struct _RTL_SPLAY_LINKS* LeftChild;
  /* 0x0008 */ struct _RTL_SPLAY_LINKS* RightChild;
} RTL_SPLAY_LINKS, *PRTL_SPLAY_LINKS; /* size: 0x000c */

enum wil_FeatureEnabledStateKind
{
  wil_FeatureEnabledStateKind_All = 0,
  wil_FeatureEnabledStateKind_Service = 1,
  wil_FeatureEnabledStateKind_User = 2,
  wil_FeatureEnabledStateKind_Test = 3,
};

enum wil_FeatureEnabledState
{
  wil_FeatureEnabledState_Default = 0,
  wil_FeatureEnabledState_Disabled = 1,
  wil_FeatureEnabledState_Enabled = 2,
};

typedef struct _IMAGE_FILE_HEADER
{
  /* 0x0000 */ unsigned short Machine;
  /* 0x0002 */ unsigned short NumberOfSections;
  /* 0x0004 */ unsigned long TimeDateStamp;
  /* 0x0008 */ unsigned long PointerToSymbolTable;
  /* 0x000c */ unsigned long NumberOfSymbols;
  /* 0x0010 */ unsigned short SizeOfOptionalHeader;
  /* 0x0012 */ unsigned short Characteristics;
} IMAGE_FILE_HEADER, *PIMAGE_FILE_HEADER; /* size: 0x0014 */

typedef struct _IMAGE_DATA_DIRECTORY
{
  /* 0x0000 */ unsigned long VirtualAddress;
  /* 0x0004 */ unsigned long Size;
} IMAGE_DATA_DIRECTORY, *PIMAGE_DATA_DIRECTORY; /* size: 0x0008 */

typedef struct _IMAGE_OPTIONAL_HEADER
{
  /* 0x0000 */ unsigned short Magic;
  /* 0x0002 */ unsigned char MajorLinkerVersion;
  /* 0x0003 */ unsigned char MinorLinkerVersion;
  /* 0x0004 */ unsigned long SizeOfCode;
  /* 0x0008 */ unsigned long SizeOfInitializedData;
  /* 0x000c */ unsigned long SizeOfUninitializedData;
  /* 0x0010 */ unsigned long AddressOfEntryPoint;
  /* 0x0014 */ unsigned long BaseOfCode;
  /* 0x0018 */ unsigned long BaseOfData;
  /* 0x001c */ unsigned long ImageBase;
  /* 0x0020 */ unsigned long SectionAlignment;
  /* 0x0024 */ unsigned long FileAlignment;
  /* 0x0028 */ unsigned short MajorOperatingSystemVersion;
  /* 0x002a */ unsigned short MinorOperatingSystemVersion;
  /* 0x002c */ unsigned short MajorImageVersion;
  /* 0x002e */ unsigned short MinorImageVersion;
  /* 0x0030 */ unsigned short MajorSubsystemVersion;
  /* 0x0032 */ unsigned short MinorSubsystemVersion;
  /* 0x0034 */ unsigned long Win32VersionValue;
  /* 0x0038 */ unsigned long SizeOfImage;
  /* 0x003c */ unsigned long SizeOfHeaders;
  /* 0x0040 */ unsigned long CheckSum;
  /* 0x0044 */ unsigned short Subsystem;
  /* 0x0046 */ unsigned short DllCharacteristics;
  /* 0x0048 */ unsigned long SizeOfStackReserve;
  /* 0x004c */ unsigned long SizeOfStackCommit;
  /* 0x0050 */ unsigned long SizeOfHeapReserve;
  /* 0x0054 */ unsigned long SizeOfHeapCommit;
  /* 0x0058 */ unsigned long LoaderFlags;
  /* 0x005c */ unsigned long NumberOfRvaAndSizes;
  /* 0x0060 */ struct _IMAGE_DATA_DIRECTORY DataDirectory[16];
} IMAGE_OPTIONAL_HEADER, *PIMAGE_OPTIONAL_HEADER; /* size: 0x00e0 */

typedef struct _IMAGE_NT_HEADERS
{
  /* 0x0000 */ unsigned long Signature;
  /* 0x0004 */ struct _IMAGE_FILE_HEADER FileHeader;
  /* 0x0018 */ struct _IMAGE_OPTIONAL_HEADER OptionalHeader;
} IMAGE_NT_HEADERS, *PIMAGE_NT_HEADERS; /* size: 0x00f8 */

enum wil_FeatureStore
{
  wil_FeatureStore_Machine = 0,
  wil_FeatureStore_User = 1,
  wil_FeatureStore_All = 2,
};

enum wil_FeatureChangeTime
{
  wil_FeatureChangeTime_OnRead = 0,
  wil_FeatureChangeTime_OnReload = 1,
  wil_FeatureChangeTime_OnSession = 2,
  wil_FeatureChangeTime_OnReboot = 3,
};

typedef enum _OB_OPEN_REASON
{
  ObCreateHandle = 0,
  ObOpenHandle = 1,
  ObDuplicateHandle = 2,
  ObInheritHandle = 3,
  ObMaxOpenReason = 4,
} OB_OPEN_REASON, *POB_OPEN_REASON;

typedef struct _NET_BUFFER_SHARED_MEMORY
{
  /* 0x0000 */ struct _NET_BUFFER_SHARED_MEMORY* NextSharedMemorySegment;
  /* 0x0004 */ unsigned long SharedMemoryFlags;
  /* 0x0008 */ void* SharedMemoryHandle;
  /* 0x000c */ unsigned long SharedMemoryOffset;
  /* 0x0010 */ unsigned long SharedMemoryLength;
} NET_BUFFER_SHARED_MEMORY, *PNET_BUFFER_SHARED_MEMORY; /* size: 0x0014 */

typedef struct _RTL_DYNAMIC_HASH_TABLE_ENTRY
{
  /* 0x0000 */ struct _LIST_ENTRY Linkage;
  /* 0x0008 */ unsigned long Signature;
} RTL_DYNAMIC_HASH_TABLE_ENTRY, *PRTL_DYNAMIC_HASH_TABLE_ENTRY; /* size: 0x000c */

enum wil_FeatureVariantPayloadKind
{
  wil_FeatureVariantPayloadKind_None = 0,
  wil_FeatureVariantPayloadKind_Resident = 1,
  wil_FeatureVariantPayloadKind_External = 2,
};

typedef struct _DOT11_SSID
{
  /* 0x0000 */ unsigned long uSSIDLength;
  /* 0x0004 */ unsigned char ucSSID[32];
} DOT11_SSID, *PDOT11_SSID; /* size: 0x0024 */

struct DOT11_SSID_LIST
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long uNumOfEntries;
  /* 0x0008 */ unsigned long uTotalNumOfEntries;
  /* 0x000c */ struct _DOT11_SSID SSIDs[1];
}; /* size: 0x0030 */

typedef enum _NET_PNP_EVENT_CODE
{
  NetEventSetPower = 0,
  NetEventQueryPower = 1,
  NetEventQueryRemoveDevice = 2,
  NetEventCancelRemoveDevice = 3,
  NetEventReconfigure = 4,
  NetEventBindList = 5,
  NetEventBindsComplete = 6,
  NetEventPnPCapabilities = 7,
  NetEventPause = 8,
  NetEventRestart = 9,
  NetEventPortActivation = 10,
  NetEventPortDeactivation = 11,
  NetEventIMReEnableDevice = 12,
  NetEventNDKEnable = 13,
  NetEventNDKDisable = 14,
  NetEventFilterPreDetach = 15,
  NetEventBindFailed = 16,
  NetEventSwitchActivate = 17,
  NetEventAllowBindsAbove = 18,
  NetEventInhibitBindsAbove = 19,
  NetEventAllowStart = 20,
  NetEventRequirePause = 21,
  NetEventUploadGftFlowEntries = 22,
  NetEventMaximum = 23,
} NET_PNP_EVENT_CODE, *PNET_PNP_EVENT_CODE;

typedef struct _NET_PNP_EVENT
{
  /* 0x0000 */ enum _NET_PNP_EVENT_CODE NetEvent;
  /* 0x0004 */ void* Buffer;
  /* 0x0008 */ unsigned long BufferLength;
  /* 0x000c */ unsigned long NdisReserved[4];
  /* 0x001c */ unsigned long TransportReserved[4];
  /* 0x002c */ unsigned long TdiReserved[4];
  /* 0x003c */ unsigned long TdiClientReserved[4];
} NET_PNP_EVENT, *PNET_PNP_EVENT; /* size: 0x004c */

typedef enum _RTL_FEATURE_CONFIGURATION_TYPE
{
  RtlFeatureConfigurationBoot = 0,
  RtlFeatureConfigurationRuntime = 1,
  RtlFeatureConfigurationCount = 2,
} RTL_FEATURE_CONFIGURATION_TYPE, *PRTL_FEATURE_CONFIGURATION_TYPE;

typedef struct _NT_TIB
{
  /* 0x0000 */ struct _EXCEPTION_REGISTRATION_RECORD* ExceptionList;
  /* 0x0004 */ void* StackBase;
  /* 0x0008 */ void* StackLimit;
  /* 0x000c */ void* SubSystemTib;
  union
  {
    /* 0x0010 */ void* FiberData;
    /* 0x0010 */ unsigned long Version;
  }; /* size: 0x0004 */
  /* 0x0014 */ void* ArbitraryUserPointer;
  /* 0x0018 */ struct _NT_TIB* Self;
} NT_TIB, *PNT_TIB; /* size: 0x001c */

typedef struct _CLIENT_ID
{
  /* 0x0000 */ void* UniqueProcess;
  /* 0x0004 */ void* UniqueThread;
} CLIENT_ID, *PCLIENT_ID; /* size: 0x0008 */

typedef struct _GDI_TEB_BATCH
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned long Offset : 31; /* bit position: 0 */
    /* 0x0000 */ unsigned long HasRenderingCommand : 1; /* bit position: 31 */
  }; /* bitfield */
  /* 0x0004 */ unsigned long HDC;
  /* 0x0008 */ unsigned long Buffer[310];
} GDI_TEB_BATCH, *PGDI_TEB_BATCH; /* size: 0x04e0 */

typedef struct _UNICODE_STRING
{
  /* 0x0000 */ unsigned short Length;
  /* 0x0002 */ unsigned short MaximumLength;
  /* 0x0004 */ wchar_t* Buffer;
} UNICODE_STRING, *PUNICODE_STRING; /* size: 0x0008 */

typedef struct _TEB
{
  /* 0x0000 */ struct _NT_TIB NtTib;
  /* 0x001c */ void* EnvironmentPointer;
  /* 0x0020 */ struct _CLIENT_ID ClientId;
  /* 0x0028 */ void* ActiveRpcHandle;
  /* 0x002c */ void* ThreadLocalStoragePointer;
  /* 0x0030 */ struct _PEB* ProcessEnvironmentBlock;
  /* 0x0034 */ unsigned long LastErrorValue;
  /* 0x0038 */ unsigned long CountOfOwnedCriticalSections;
  /* 0x003c */ void* CsrClientThread;
  /* 0x0040 */ void* Win32ThreadInfo;
  /* 0x0044 */ unsigned long User32Reserved[26];
  /* 0x00ac */ unsigned long UserReserved[5];
  /* 0x00c0 */ void* WOW32Reserved;
  /* 0x00c4 */ unsigned long CurrentLocale;
  /* 0x00c8 */ unsigned long FpSoftwareStatusRegister;
  /* 0x00cc */ void* ReservedForDebuggerInstrumentation[16];
  /* 0x010c */ void* SystemReserved1[26];
  /* 0x0174 */ char PlaceholderCompatibilityMode;
  /* 0x0175 */ unsigned char PlaceholderHydrationAlwaysExplicit;
  /* 0x0176 */ char PlaceholderReserved[10];
  /* 0x0180 */ unsigned long ProxiedProcessId;
  /* 0x0184 */ struct _ACTIVATION_CONTEXT_STACK _ActivationStack;
  /* 0x019c */ unsigned char WorkingOnBehalfTicket[8];
  /* 0x01a4 */ long ExceptionCode;
  /* 0x01a8 */ struct _ACTIVATION_CONTEXT_STACK* ActivationContextStackPointer;
  /* 0x01ac */ unsigned long InstrumentationCallbackSp;
  /* 0x01b0 */ unsigned long InstrumentationCallbackPreviousPc;
  /* 0x01b4 */ unsigned long InstrumentationCallbackPreviousSp;
  /* 0x01b8 */ unsigned char InstrumentationCallbackDisabled;
  /* 0x01b9 */ unsigned char SpareBytes[23];
  /* 0x01d0 */ unsigned long TxFsContext;
  /* 0x01d4 */ struct _GDI_TEB_BATCH GdiTebBatch;
  /* 0x06b4 */ struct _CLIENT_ID RealClientId;
  /* 0x06bc */ void* GdiCachedProcessHandle;
  /* 0x06c0 */ unsigned long GdiClientPID;
  /* 0x06c4 */ unsigned long GdiClientTID;
  /* 0x06c8 */ void* GdiThreadLocalInfo;
  /* 0x06cc */ unsigned long Win32ClientInfo[62];
  /* 0x07c4 */ void* glDispatchTable[233];
  /* 0x0b68 */ unsigned long glReserved1[29];
  /* 0x0bdc */ void* glReserved2;
  /* 0x0be0 */ void* glSectionInfo;
  /* 0x0be4 */ void* glSection;
  /* 0x0be8 */ void* glTable;
  /* 0x0bec */ void* glCurrentRC;
  /* 0x0bf0 */ void* glContext;
  /* 0x0bf4 */ unsigned long LastStatusValue;
  /* 0x0bf8 */ struct _UNICODE_STRING StaticUnicodeString;
  /* 0x0c00 */ wchar_t StaticUnicodeBuffer[261];
  /* 0x0e0a */ char Padding_7[2];
  /* 0x0e0c */ void* DeallocationStack;
  /* 0x0e10 */ void* TlsSlots[64];
  /* 0x0f10 */ struct _LIST_ENTRY TlsLinks;
  /* 0x0f18 */ void* Vdm;
  /* 0x0f1c */ void* ReservedForNtRpc;
  /* 0x0f20 */ void* DbgSsReserved[2];
  /* 0x0f28 */ unsigned long HardErrorMode;
  /* 0x0f2c */ void* Instrumentation[9];
  /* 0x0f50 */ struct _GUID ActivityId;
  /* 0x0f60 */ void* SubProcessTag;
  /* 0x0f64 */ void* PerflibData;
  /* 0x0f68 */ void* EtwTraceData;
  /* 0x0f6c */ void* WinSockData;
  /* 0x0f70 */ unsigned long GdiBatchCount;
  union
  {
    /* 0x0f74 */ struct _PROCESSOR_NUMBER CurrentIdealProcessor;
    /* 0x0f74 */ unsigned long IdealProcessorValue;
    struct
    {
      /* 0x0f74 */ unsigned char ReservedPad0;
      /* 0x0f75 */ unsigned char ReservedPad1;
      /* 0x0f76 */ unsigned char ReservedPad2;
      /* 0x0f77 */ unsigned char IdealProcessor;
    }; /* size: 0x0004 */
  }; /* size: 0x0004 */
  /* 0x0f78 */ unsigned long GuaranteedStackBytes;
  /* 0x0f7c */ void* ReservedForPerf;
  /* 0x0f80 */ void* ReservedForOle;
  /* 0x0f84 */ unsigned long WaitingOnLoaderLock;
  /* 0x0f88 */ void* SavedPriorityState;
  /* 0x0f8c */ unsigned long ReservedForCodeCoverage;
  /* 0x0f90 */ void* ThreadPoolData;
  /* 0x0f94 */ void** TlsExpansionSlots;
  /* 0x0f98 */ unsigned long MuiGeneration;
  /* 0x0f9c */ unsigned long IsImpersonating;
  /* 0x0fa0 */ void* NlsCache;
  /* 0x0fa4 */ void* pShimData;
  /* 0x0fa8 */ unsigned long HeapData;
  /* 0x0fac */ void* CurrentTransactionHandle;
  /* 0x0fb0 */ struct _TEB_ACTIVE_FRAME* ActiveFrame;
  /* 0x0fb4 */ void* FlsData;
  /* 0x0fb8 */ void* PreferredLanguages;
  /* 0x0fbc */ void* UserPrefLanguages;
  /* 0x0fc0 */ void* MergedPrefLanguages;
  /* 0x0fc4 */ unsigned long MuiImpersonation;
  union
  {
    /* 0x0fc8 */ volatile unsigned short CrossTebFlags;
    /* 0x0fc8 */ unsigned short SpareCrossTebBits : 16; /* bit position: 0 */
  }; /* size: 0x0002 */
  union
  {
    /* 0x0fca */ unsigned short SameTebFlags;
    struct /* bitfield */
    {
      /* 0x0fca */ unsigned short SafeThunkCall : 1; /* bit position: 0 */
      /* 0x0fca */ unsigned short InDebugPrint : 1; /* bit position: 1 */
      /* 0x0fca */ unsigned short HasFiberData : 1; /* bit position: 2 */
      /* 0x0fca */ unsigned short SkipThreadAttach : 1; /* bit position: 3 */
      /* 0x0fca */ unsigned short WerInShipAssertCode : 1; /* bit position: 4 */
      /* 0x0fca */ unsigned short RanProcessInit : 1; /* bit position: 5 */
      /* 0x0fca */ unsigned short ClonedThread : 1; /* bit position: 6 */
      /* 0x0fca */ unsigned short SuppressDebugMsg : 1; /* bit position: 7 */
      /* 0x0fca */ unsigned short DisableUserStackWalk : 1; /* bit position: 8 */
      /* 0x0fca */ unsigned short RtlExceptionAttached : 1; /* bit position: 9 */
      /* 0x0fca */ unsigned short InitialThread : 1; /* bit position: 10 */
      /* 0x0fca */ unsigned short SessionAware : 1; /* bit position: 11 */
      /* 0x0fca */ unsigned short LoadOwner : 1; /* bit position: 12 */
      /* 0x0fca */ unsigned short LoaderWorker : 1; /* bit position: 13 */
      /* 0x0fca */ unsigned short SkipLoaderInit : 1; /* bit position: 14 */
      /* 0x0fca */ unsigned short SpareSameTebBits : 1; /* bit position: 15 */
    }; /* bitfield */
  }; /* size: 0x0002 */
  /* 0x0fcc */ void* TxnScopeEnterCallback;
  /* 0x0fd0 */ void* TxnScopeExitCallback;
  /* 0x0fd4 */ void* TxnScopeContext;
  /* 0x0fd8 */ unsigned long LockCount;
  /* 0x0fdc */ long WowTebOffset;
  /* 0x0fe0 */ void* ResourceRetValue;
  /* 0x0fe4 */ void* ReservedForWdf;
  /* 0x0fe8 */ unsigned __int64 ReservedForCrt;
  /* 0x0ff0 */ struct _GUID EffectiveContainerId;
} TEB, *PTEB; /* size: 0x1000 */

typedef enum _RTL_FEATURE_CONFIGURATION_PRIORITY
{
  FeatureConfigurationPriorityAll = 0,
  FeatureConfigurationPriorityService = 4,
  FeatureConfigurationPriorityUser = 8,
  FeatureConfigurationPriorityTest = 12,
  FeatureConfigurationPriorityMax = 15,
} RTL_FEATURE_CONFIGURATION_PRIORITY, *PRTL_FEATURE_CONFIGURATION_PRIORITY;

enum wil_details_FeatureTestStateKind
{
  wil_details_FeatureTestStateKind_EnabledState = 0,
  wil_details_FeatureTestStateKind_Variant = 1,
};

typedef enum _DOT11_AUTH_ALGORITHM
{
  DOT11_AUTH_ALGO_80211_OPEN = 1,
  DOT11_AUTH_ALGO_80211_SHARED_KEY = 2,
  DOT11_AUTH_ALGO_WPA = 3,
  DOT11_AUTH_ALGO_WPA_PSK = 4,
  DOT11_AUTH_ALGO_WPA_NONE = 5,
  DOT11_AUTH_ALGO_RSNA = 6,
  DOT11_AUTH_ALGO_RSNA_PSK = 7,
  DOT11_AUTH_ALGO_WPA3 = 8,
  DOT11_AUTH_ALGO_WPA3_SAE = 9,
  DOT11_AUTH_ALGO_OWE = 10,
  DOT11_AUTH_ALGO_IHV_START = -2147483648,
  DOT11_AUTH_ALGO_IHV_END = -1,
} DOT11_AUTH_ALGORITHM, *PDOT11_AUTH_ALGORITHM;

typedef enum _DOT11_CIPHER_ALGORITHM
{
  DOT11_CIPHER_ALGO_NONE = 0,
  DOT11_CIPHER_ALGO_WEP40 = 1,
  DOT11_CIPHER_ALGO_TKIP = 2,
  DOT11_CIPHER_ALGO_CCMP = 4,
  DOT11_CIPHER_ALGO_WEP104 = 5,
  DOT11_CIPHER_ALGO_BIP = 6,
  DOT11_CIPHER_ALGO_GCMP = 8,
  DOT11_CIPHER_ALGO_GCMP_256 = 9,
  DOT11_CIPHER_ALGO_CCMP_256 = 10,
  DOT11_CIPHER_ALGO_BIP_GMAC_128 = 11,
  DOT11_CIPHER_ALGO_BIP_GMAC_256 = 12,
  DOT11_CIPHER_ALGO_BIP_CMAC_256 = 13,
  DOT11_CIPHER_ALGO_WPA_USE_GROUP = 256,
  DOT11_CIPHER_ALGO_RSN_USE_GROUP = 256,
  DOT11_CIPHER_ALGO_WEP = 257,
  DOT11_CIPHER_ALGO_IHV_START = -2147483648,
  DOT11_CIPHER_ALGO_IHV_END = -1,
} DOT11_CIPHER_ALGORITHM, *PDOT11_CIPHER_ALGORITHM;

typedef enum _DOT11_ASSOCIATION_STATE
{
  dot11_assoc_state_zero = 0,
  dot11_assoc_state_unauth_unassoc = 1,
  dot11_assoc_state_auth_unassoc = 2,
  dot11_assoc_state_auth_assoc = 3,
} DOT11_ASSOCIATION_STATE, *PDOT11_ASSOCIATION_STATE;

typedef enum _DOT11_POWER_MODE
{
  dot11_power_mode_unknown = 0,
  dot11_power_mode_active = 1,
  dot11_power_mode_powersave = 2,
} DOT11_POWER_MODE, *PDOT11_POWER_MODE;

typedef struct _DOT11_PEER_STATISTICS
{
  /* 0x0000 */ unsigned __int64 ullDecryptSuccessCount;
  /* 0x0008 */ unsigned __int64 ullDecryptFailureCount;
  /* 0x0010 */ unsigned __int64 ullTxPacketSuccessCount;
  /* 0x0018 */ unsigned __int64 ullTxPacketFailureCount;
  /* 0x0020 */ unsigned __int64 ullRxPacketSuccessCount;
  /* 0x0028 */ unsigned __int64 ullRxPacketFailureCount;
} DOT11_PEER_STATISTICS, *PDOT11_PEER_STATISTICS; /* size: 0x0030 */

typedef struct _DOT11_PEER_INFO
{
  /* 0x0000 */ unsigned char MacAddress[6];
  /* 0x0006 */ unsigned short usCapabilityInformation;
  /* 0x0008 */ enum _DOT11_AUTH_ALGORITHM AuthAlgo;
  /* 0x000c */ enum _DOT11_CIPHER_ALGORITHM UnicastCipherAlgo;
  /* 0x0010 */ enum _DOT11_CIPHER_ALGORITHM MulticastCipherAlgo;
  /* 0x0014 */ unsigned char bWpsEnabled;
  /* 0x0015 */ char Padding_8;
  /* 0x0016 */ unsigned short usListenInterval;
  /* 0x0018 */ unsigned char ucSupportedRates[255];
  /* 0x0117 */ char Padding_9;
  /* 0x0118 */ unsigned short usAssociationID;
  /* 0x011a */ char Padding_10[2];
  /* 0x011c */ enum _DOT11_ASSOCIATION_STATE AssociationState;
  /* 0x0120 */ enum _DOT11_POWER_MODE PowerMode;
  /* 0x0124 */ long Padding_11;
  /* 0x0128 */ union _LARGE_INTEGER liAssociationUpTime;
  /* 0x0130 */ struct _DOT11_PEER_STATISTICS Statistics;
} DOT11_PEER_INFO, *PDOT11_PEER_INFO; /* size: 0x0160 */

typedef struct _NET_BUFFER_LIST_DATA
{
  /* 0x0000 */ struct _NET_BUFFER_LIST* Next;
  /* 0x0004 */ struct _NET_BUFFER* FirstNetBuffer;
} NET_BUFFER_LIST_DATA, *PNET_BUFFER_LIST_DATA; /* size: 0x0008 */

typedef enum _EVENT_INFO_CLASS
{
  EventProviderBinaryTrackInfo = 0,
  EventProviderSetReserved1 = 1,
  EventProviderSetTraits = 2,
  EventProviderUseDescriptorType = 3,
  MaxEventInfo = 4,
} EVENT_INFO_CLASS, *PEVENT_INFO_CLASS;

typedef struct _TraceLoggingMetadata_t
{
  /* 0x0000 */ unsigned int Signature;
  /* 0x0004 */ unsigned short Size;
  /* 0x0006 */ unsigned char Version;
  /* 0x0007 */ unsigned char Flags;
  /* 0x0008 */ unsigned __int64 Magic;
} TraceLoggingMetadata_t, *PTraceLoggingMetadata_t; /* size: 0x0010 */

typedef enum
{
  Unlocked = 0,
  Shared = 1,
  Exclusive = 2,
} TAG_UNNAMED_1, *PTAG_UNNAMED_1;

typedef struct _NDIS_WAN_LINE_DOWN
{
  /* 0x0000 */ unsigned char RemoteAddress[6];
  /* 0x0006 */ unsigned char LocalAddress[6];
} NDIS_WAN_LINE_DOWN, *PNDIS_WAN_LINE_DOWN; /* size: 0x000c */

typedef struct _NET_BUFFER_LIST_CONTEXT
{
  /* 0x0000 */ struct _NET_BUFFER_LIST_CONTEXT* Next;
  /* 0x0004 */ unsigned short Size;
  /* 0x0006 */ unsigned short Offset;
  /* 0x0008 */ unsigned char* ContextData /* zero-length array */;
} NET_BUFFER_LIST_CONTEXT, *PNET_BUFFER_LIST_CONTEXT; /* size: 0x0008 */

typedef enum _NDIS_REQUEST_TYPE
{
  NdisRequestQueryInformation = 0,
  NdisRequestSetInformation = 1,
  NdisRequestQueryStatistics = 2,
  NdisRequestOpen = 3,
  NdisRequestClose = 4,
  NdisRequestSend = 5,
  NdisRequestTransferData = 6,
  NdisRequestReset = 7,
  NdisRequestGeneric1 = 8,
  NdisRequestGeneric2 = 9,
  NdisRequestGeneric3 = 10,
  NdisRequestGeneric4 = 11,
  NdisRequestMethod = 12,
} NDIS_REQUEST_TYPE, *PNDIS_REQUEST_TYPE;

enum CallRunMode
{
  RunSynchronous = 0,
  RunAsynchronous = 1,
  RunAsynchronousButOkayToBlock = 2,
};

typedef struct _LUID
{
  /* 0x0000 */ unsigned long LowPart;
  /* 0x0004 */ long HighPart;
} LUID, *PLUID; /* size: 0x0008 */

enum KRegKey::BooleanDisposition
{
  FailIfNotFound = 0,
  DefaultToFalse = 1,
  DefaultToTrue = 2,
};

enum Ndis::BindSource::Flags
{
  Registry = 1,
  UserRequested = 2,
  UnsolicitedOpen = 4,
  TapiProxy = 8,
};

enum NetSetupSubkeyType
{
  Root = 0,
  PropertyBag = 1,
  KernelSummary = 2,
  Writeback = 3,
  Keywords = 4,
};

enum BIND_SOURCE_STATE
{
  AddBindSource = 0,
  RemoveBindSource = 1,
};

typedef struct _EVENT_FILTER_DESCRIPTOR
{
  /* 0x0000 */ unsigned __int64 Ptr;
  /* 0x0008 */ unsigned long Size;
  /* 0x000c */ unsigned long Type;
} EVENT_FILTER_DESCRIPTOR, *PEVENT_FILTER_DESCRIPTOR; /* size: 0x0010 */

typedef struct _RTL_BALANCED_NODE
{
  union
  {
    /* 0x0000 */ struct _RTL_BALANCED_NODE* Children[2];
    struct
    {
      /* 0x0000 */ struct _RTL_BALANCED_NODE* Left;
      /* 0x0004 */ struct _RTL_BALANCED_NODE* Right;
    }; /* size: 0x0008 */
  }; /* size: 0x0008 */
  union
  {
    /* 0x0008 */ unsigned char Red : 1; /* bit position: 0 */
    /* 0x0008 */ unsigned char Balance : 2; /* bit position: 0 */
    /* 0x0008 */ unsigned long ParentValue;
  }; /* size: 0x0004 */
} RTL_BALANCED_NODE, *PRTL_BALANCED_NODE; /* size: 0x000c */

enum NDIS_DO_NOT_BIND_REASON
{
  Reason_NoBindSourceWantsThisBinding = 1,
  Reason_DriverNotReady = 2,
  Reason_LastBindAttemptFailed = 4,
  Reason_LastRestartAttemptFailed = 8,
  Reason_DriverRejectedBinding = 16,
  Reason_MissingMandatoryFilter = 32,
  Reason_MissingOptionalFilter = 64,
  Reason_MissingModifyingFilter = 128,
  Reason_MandatoryMissingDuringBoot = 256,
  Reason_UnbindOnAttach = 512,
  Reason_UnbindOnDetach = 1024,
  Reason_MiniportLowPower = 2048,
  Reason_RemovingMiniport = 4096,
  Reason_RebindNeeded = 8192,
  Reason_DefaultPortNotActive = 0xffff8000,
  Reason_SecondaryMiniport = 0x10000,
  Reason_MiniportNotReady = 0x20000,
  Reason_DisabledByLegacyIoctl = 0x40000,
  Reason_MiniportDeviceNotStarted = 0x80000,
  Reason_NetEventInhibitBindsAbove = 0x100000,
  Reason_ProtocolDependsOnVBus = 0x200000,
  Reason_IncompatibleWithNotification = 0x400000,
  Reason_MiniportInterfaceDeregister = 0x800000,
};

enum NDIS_PAUSE_REASON
{
  PauseReason_InitialPause = 1,
  PauseReason_LowPower = 2,
  PauseReason_Pnp = 4,
  PauseReason_RemovingMiniport = 8,
  PauseReason_LowerDriverPaused = 16,
  PauseReason_RestartNeeded = 32,
  PauseReason_MandatoryMissingDuringBoot = 64,
  PauseReason_Wdf = 128,
  PauseReason_NetEventRequirePause = 256,
  PauseReason_InterfaceChangeInProgress = 512,
};

typedef enum _NET_IF_MEDIA_CONNECT_STATE
{
  MediaConnectStateUnknown = 0,
  MediaConnectStateConnected = 1,
  MediaConnectStateDisconnected = 2,
} NET_IF_MEDIA_CONNECT_STATE, *PNET_IF_MEDIA_CONNECT_STATE;

typedef union _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_VALIDBITS
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned char FRUId : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned char FRUText : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned char Reserved : 6; /* bit position: 2 */
    }; /* bitfield */
    /* 0x0000 */ unsigned char AsUCHAR;
  }; /* size: 0x0001 */
} WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_VALIDBITS, *PWHEA_ERROR_RECORD_SECTION_DESCRIPTOR_VALIDBITS; /* size: 0x0001 */

struct _KNODE;

class wistd::__compressed_pair<NDIS_BIND_FILTER_LINK *,wistd::default_delete<NDIS_BIND_FILTER_LINK> >
{
}; /* size: 0x0004 */

typedef enum _NET_IF_MEDIA_DUPLEX_STATE
{
  MediaDuplexStateUnknown = 0,
  MediaDuplexStateHalf = 1,
  MediaDuplexStateFull = 2,
} NET_IF_MEDIA_DUPLEX_STATE, *PNET_IF_MEDIA_DUPLEX_STATE;

typedef enum _NDIS_MEDIUM
{
  NdisMedium802_3 = 0,
  NdisMedium802_5 = 1,
  NdisMediumFddi = 2,
  NdisMediumWan = 3,
  NdisMediumLocalTalk = 4,
  NdisMediumDix = 5,
  NdisMediumArcnetRaw = 6,
  NdisMediumArcnet878_2 = 7,
  NdisMediumAtm = 8,
  NdisMediumWirelessWan = 9,
  NdisMediumIrda = 10,
  NdisMediumBpc = 11,
  NdisMediumCoWan = 12,
  NdisMedium1394 = 13,
  NdisMediumInfiniBand = 14,
  NdisMediumTunnel = 15,
  NdisMediumNative802_11 = 16,
  NdisMediumLoopback = 17,
  NdisMediumWiMAX = 18,
  NdisMediumIP = 19,
  NdisMediumMax = 20,
} NDIS_MEDIUM, *PNDIS_MEDIUM;

typedef enum __vc_attributes::event_receiverAttribute::type_e
{
  native = 0,
  com = 1,
  managed = 2,
} _vc_attributes::event_receiverAttribute::type_e, *P_vc_attributes::event_receiverAttribute::type_e;

typedef struct __vc_attributes::event_receiverAttribute
{
  /* 0x0000 */ enum __vc_attributes::event_receiverAttribute::type_e type;
  /* 0x0004 */ BOOL layout_dependent;
  /* 0x0005 */ char __PADDING__[3];
} _vc_attributes::event_receiverAttribute, *P_vc_attributes::event_receiverAttribute; /* size: 0x0008 */

struct _NDIS_LOG;

struct wil_details_StagingConfigHeaderProperties
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned int ignoreServiceState : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned int ignoreUserState : 1; /* bit position: 1 */
    /* 0x0000 */ unsigned int ignoreTestState : 1; /* bit position: 2 */
    /* 0x0000 */ unsigned int ignoreVariants : 1; /* bit position: 3 */
    /* 0x0000 */ unsigned int unused : 28; /* bit position: 4 */
  }; /* bitfield */
}; /* size: 0x0004 */

typedef enum _NDIS_INTERFACE_TYPE
{
  NdisInterfaceInternal = 0,
  NdisInterfaceIsa = 1,
  NdisInterfaceEisa = 2,
  NdisInterfaceMca = 3,
  NdisInterfaceTurboChannel = 4,
  NdisInterfacePci = 5,
  NdisInterfacePcMcia = 8,
  NdisInterfaceCBus = 9,
  NdisInterfaceMPIBus = 10,
  NdisInterfaceMPSABus = 11,
  NdisInterfaceProcessorInternal = 12,
  NdisInterfaceInternalPowerBus = 13,
  NdisInterfacePNPISABus = 14,
  NdisInterfacePNPBus = 15,
  NdisInterfaceUSB = 16,
  NdisInterfaceIrda = 17,
  NdisInterface1394 = 18,
  NdisMaximumInterfaceType = 19,
} NDIS_INTERFACE_TYPE, *PNDIS_INTERFACE_TYPE;

typedef enum _NDIS_SUPPORTED_PAUSE_FUNCTIONS
{
  NdisPauseFunctionsUnsupported = 0,
  NdisPauseFunctionsSendOnly = 1,
  NdisPauseFunctionsReceiveOnly = 2,
  NdisPauseFunctionsSendAndReceive = 3,
  NdisPauseFunctionsUnknown = 4,
} NDIS_SUPPORTED_PAUSE_FUNCTIONS, *PNDIS_SUPPORTED_PAUSE_FUNCTIONS;

typedef struct _DESCRIPTOR
{
  /* 0x0000 */ unsigned short Pad;
  /* 0x0002 */ unsigned short Limit;
  /* 0x0004 */ unsigned long Base;
} DESCRIPTOR, *PDESCRIPTOR; /* size: 0x0008 */

typedef struct _KSPECIAL_REGISTERS
{
  /* 0x0000 */ unsigned long Cr0;
  /* 0x0004 */ unsigned long Cr2;
  /* 0x0008 */ unsigned long Cr3;
  /* 0x000c */ unsigned long Cr4;
  /* 0x0010 */ unsigned long KernelDr0;
  /* 0x0014 */ unsigned long KernelDr1;
  /* 0x0018 */ unsigned long KernelDr2;
  /* 0x001c */ unsigned long KernelDr3;
  /* 0x0020 */ unsigned long KernelDr6;
  /* 0x0024 */ unsigned long KernelDr7;
  /* 0x0028 */ struct _DESCRIPTOR Gdtr;
  /* 0x0030 */ struct _DESCRIPTOR Idtr;
  /* 0x0038 */ unsigned short Tr;
  /* 0x003a */ unsigned short Ldtr;
  /* 0x003c */ unsigned __int64 Xcr0;
  /* 0x0044 */ unsigned long ExceptionList;
  /* 0x0048 */ unsigned long Reserved[3];
} KSPECIAL_REGISTERS, *PKSPECIAL_REGISTERS; /* size: 0x0054 */

typedef enum _SYSTEM_POWER_STATE
{
  PowerSystemUnspecified = 0,
  PowerSystemWorking = 1,
  PowerSystemSleeping1 = 2,
  PowerSystemSleeping2 = 3,
  PowerSystemSleeping3 = 4,
  PowerSystemHibernate = 5,
  PowerSystemShutdown = 6,
  PowerSystemMaximum = 7,
} SYSTEM_POWER_STATE, *PSYSTEM_POWER_STATE;

typedef enum _NDIS_M_PERIODIC_RECEIVE_STATE
{
  PeriodicReceivesOff = 0,
  PeriodicReceivesOn = 1,
  PeriodicReceivesBlocked = 2,
} NDIS_M_PERIODIC_RECEIVE_STATE, *PNDIS_M_PERIODIC_RECEIVE_STATE;

typedef struct _WORK_QUEUE_ITEM
{
  /* 0x0000 */ struct _LIST_ENTRY List;
  /* 0x0008 */ void* WorkerRoutine /* function */;
  /* 0x000c */ void* Parameter;
} WORK_QUEUE_ITEM, *PWORK_QUEUE_ITEM; /* size: 0x0010 */

typedef struct _NDIS_M_PERIODIC_RECEIVES
{
  /* 0x0000 */ struct _NDIS_MINIPORT_BLOCK* NextMiniportBlock;
  /* 0x0004 */ enum _NDIS_M_PERIODIC_RECEIVE_STATE State;
  /* 0x0008 */ unsigned long SpinLock;
  /* 0x000c */ void* LockThread;
  /* 0x0010 */ long NumMQueuedNbls;
  /* 0x0014 */ long NumNblsDequeued;
  /* 0x0018 */ struct _NET_BUFFER_LIST* QueuedHead;
  /* 0x001c */ struct _NET_BUFFER_LIST* QueuedTail;
  /* 0x0020 */ unsigned long BoundToIP;
  /* 0x0024 */ unsigned char Paused;
  /* 0x0025 */ char Padding_12[3];
  /* 0x0028 */ long NblsAllocated;
  /* 0x002c */ unsigned long TrackingQueued;
  /* 0x0030 */ unsigned long TrackingDequeued;
  /* 0x0034 */ unsigned long TrackingResources;
  /* 0x0038 */ unsigned long TrackingPending;
  /* 0x003c */ unsigned long TrackingIndicated;
  /* 0x0040 */ unsigned long TrackingEmptied;
  /* 0x0044 */ struct _WORK_QUEUE_ITEM WorkItem;
  /* 0x0054 */ long WorkItemQueued;
} NDIS_M_PERIODIC_RECEIVES, *PNDIS_M_PERIODIC_RECEIVES; /* size: 0x0058 */

typedef enum _NDIS_PNP_DEVICE_STATE
{
  NdisPnPDeviceAdded = 0,
  NdisPnPDeviceStarted = 1,
  NdisPnPDeviceQueryStopped = 2,
  NdisPnPDeviceStopped = 3,
  NdisPnPDeviceQueryRemoved = 4,
  NdisPnPDeviceRemoved = 5,
  NdisPnPDeviceSurpriseRemoved = 6,
} NDIS_PNP_DEVICE_STATE, *PNDIS_PNP_DEVICE_STATE;

typedef struct _RTL_AVL_TREE
{
  /* 0x0000 */ struct _RTL_BALANCED_NODE* Root;
} RTL_AVL_TREE, *PRTL_AVL_TREE; /* size: 0x0004 */

class wistd::__compressed_pair<NDIS_BIND_PROTOCOL_LINK *,wistd::default_delete<NDIS_BIND_PROTOCOL_LINK> >
{
}; /* size: 0x0004 */

typedef enum _NDIS_PHYSICAL_MEDIUM
{
  NdisPhysicalMediumUnspecified = 0,
  NdisPhysicalMediumWirelessLan = 1,
  NdisPhysicalMediumCableModem = 2,
  NdisPhysicalMediumPhoneLine = 3,
  NdisPhysicalMediumPowerLine = 4,
  NdisPhysicalMediumDSL = 5,
  NdisPhysicalMediumFibreChannel = 6,
  NdisPhysicalMedium1394 = 7,
  NdisPhysicalMediumWirelessWan = 8,
  NdisPhysicalMediumNative802_11 = 9,
  NdisPhysicalMediumBluetooth = 10,
  NdisPhysicalMediumInfiniband = 11,
  NdisPhysicalMediumWiMax = 12,
  NdisPhysicalMediumUWB = 13,
  NdisPhysicalMedium802_3 = 14,
  NdisPhysicalMedium802_5 = 15,
  NdisPhysicalMediumIrda = 16,
  NdisPhysicalMediumWiredWAN = 17,
  NdisPhysicalMediumWiredCoWan = 18,
  NdisPhysicalMediumOther = 19,
  NdisPhysicalMediumNative802_15_4 = 20,
  NdisPhysicalMediumMax = 21,
} NDIS_PHYSICAL_MEDIUM, *PNDIS_PHYSICAL_MEDIUM;

typedef enum _NDIS_MINIPORT_STATE
{
  NdisMiniportUndefinedState = 0,
  NdisMiniportHalted = 1,
  NdisMiniportInitializing = 2,
  NdisMiniportRestarting = 3,
  NdisMiniportRunning = 4,
  NdisMiniportPausing = 5,
  NdisMiniportPaused = 6,
} NDIS_MINIPORT_STATE, *PNDIS_MINIPORT_STATE;

typedef enum _NDIS_SEND_PATH_TYPE
{
  NdisFilterSendPath = 0,
  NdisNoFilterSendPath = 1,
  Ndis5NoFilterSendPath = 2,
  NdisFakeSendPath = 3,
} NDIS_SEND_PATH_TYPE, *PNDIS_SEND_PATH_TYPE;

typedef enum _NDIS_PORT_CONTROL_STATE
{
  NdisPortControlStateUnknown = 0,
  NdisPortControlStateControlled = 1,
  NdisPortControlStateUncontrolled = 2,
} NDIS_PORT_CONTROL_STATE, *PNDIS_PORT_CONTROL_STATE;

typedef struct __WIL__WNF_STATE_NAME
{
  /* 0x0000 */ unsigned long Data[2];
} _WIL__WNF_STATE_NAME, *P_WIL__WNF_STATE_NAME; /* size: 0x0008 */

typedef struct _EVENT_DATA_DESCRIPTOR
{
  /* 0x0000 */ unsigned __int64 Ptr;
  /* 0x0008 */ unsigned long Size;
  union
  {
    /* 0x000c */ unsigned long Reserved;
    struct
    {
      /* 0x000c */ unsigned char Type;
      /* 0x000d */ unsigned char Reserved1;
      /* 0x000e */ unsigned short Reserved2;
    }; /* size: 0x0004 */
  }; /* size: 0x0004 */
} EVENT_DATA_DESCRIPTOR, *PEVENT_DATA_DESCRIPTOR; /* size: 0x0010 */

typedef enum _NDIS_PORT_AUTHORIZATION_STATE
{
  NdisPortAuthorizationUnknown = 0,
  NdisPortAuthorized = 1,
  NdisPortUnauthorized = 2,
  NdisPortReauthorizing = 3,
} NDIS_PORT_AUTHORIZATION_STATE, *PNDIS_PORT_AUTHORIZATION_STATE;

typedef enum _INTERFACE_TYPE
{
  InterfaceTypeUndefined = -1,
  Internal = 0,
  Isa = 1,
  Eisa = 2,
  MicroChannel = 3,
  TurboChannel = 4,
  PCIBus = 5,
  VMEBus = 6,
  NuBus = 7,
  PCMCIABus = 8,
  CBus = 9,
  MPIBus = 10,
  MPSABus = 11,
  ProcessorInternal = 12,
  InternalPowerBus = 13,
  PNPISABus = 14,
  PNPBus = 15,
  Vmcs = 16,
  ACPIBus = 17,
  MaximumInterfaceType = 18,
} INTERFACE_TYPE, *PINTERFACE_TYPE;

typedef struct _WNF_TYPE_ID
{
  /* 0x0000 */ struct _GUID TypeId;
} WNF_TYPE_ID, *PWNF_TYPE_ID; /* size: 0x0010 */

typedef struct _KSPIN_LOCK_QUEUE
{
  /* 0x0000 */ struct _KSPIN_LOCK_QUEUE* volatile Next;
  /* 0x0004 */ unsigned long* volatile Lock;
} KSPIN_LOCK_QUEUE, *PKSPIN_LOCK_QUEUE; /* size: 0x0008 */

typedef enum _NET_IF_ADMIN_STATUS
{
  NET_IF_ADMIN_STATUS_UP = 1,
  NET_IF_ADMIN_STATUS_DOWN = 2,
  NET_IF_ADMIN_STATUS_TESTING = 3,
} NET_IF_ADMIN_STATUS, *PNET_IF_ADMIN_STATUS;

typedef struct _NDIS_WAN_CO_GET_LINK_INFO
{
  /* 0x0000 */ unsigned long MaxSendFrameSize;
  /* 0x0004 */ unsigned long MaxRecvFrameSize;
  /* 0x0008 */ unsigned long SendFramingBits;
  /* 0x000c */ unsigned long RecvFramingBits;
  /* 0x0010 */ unsigned long SendCompressionBits;
  /* 0x0014 */ unsigned long RecvCompressionBits;
  /* 0x0018 */ unsigned long SendACCM;
  /* 0x001c */ unsigned long RecvACCM;
} NDIS_WAN_CO_GET_LINK_INFO, *PNDIS_WAN_CO_GET_LINK_INFO; /* size: 0x0020 */

typedef struct _PENDING_STACK_EXPANSION_FALLBACK_WORK
{
  /* 0x0000 */ unsigned char IssueOidRequest;
  /* 0x0001 */ unsigned char CompleteOidRequest;
  /* 0x0002 */ char Padding_13[2];
  /* 0x0004 */ struct _NDIS_OID_REQUEST* DirectOidRequestsToComplete;
  /* 0x0008 */ struct _NDIS_STATUS_INDICATION* StatusIndications;
  /* 0x000c */ struct _NET_PNP_EVENT_NOTIFICATION* NetPnPEvents;
  /* 0x0010 */ struct _NET_DEVICE_PNP_EVENT* DevicePnPEvents;
  /* 0x0014 */ struct _NET_BUFFER_LIST* SentNblsToComplete;
  /* 0x0018 */ struct _NET_BUFFER_LIST* ReceivedNblsToComplete;
} PENDING_STACK_EXPANSION_FALLBACK_WORK, *PPENDING_STACK_EXPANSION_FALLBACK_WORK; /* size: 0x001c */

typedef enum _NET_IF_OPER_STATUS
{
  NET_IF_OPER_STATUS_UP = 1,
  NET_IF_OPER_STATUS_DOWN = 2,
  NET_IF_OPER_STATUS_TESTING = 3,
  NET_IF_OPER_STATUS_UNKNOWN = 4,
  NET_IF_OPER_STATUS_DORMANT = 5,
  NET_IF_OPER_STATUS_NOT_PRESENT = 6,
  NET_IF_OPER_STATUS_LOWER_LAYER_DOWN = 7,
} NET_IF_OPER_STATUS, *PNET_IF_OPER_STATUS;

typedef enum _NDIS_MINIPORT_EVENT
{
  NdisMEvent_Unknown = 0,
  NdisMEventDx_SystemSleep = 1,
  NdisMEventDx_NicQuiet = 2,
  NdisMEventDx_SSIdle = 3,
  NdisMEventDx_D3DTimeout = 4,
  NdisMEventD0_SystemResume = 5,
  NdisMEventD0_NicActive = 6,
  NdisMEventD0_AoAcWake = 7,
  NdisMEventD0_SSResume = 8,
  NdisMEventD0_D3DCancel = 9,
  NdisMEventD0_D3DWake = 10,
  NdisMEventD0_D3DResume = 11,
  NdisMEventD0_Complete = 12,
  NdisMEventD0_SSComplete = 13,
  NdisMEventDx_Complete = 14,
  NdisMEventDx_SSComplete = 15,
  NdisMEvent_SSCancelIdle = 16,
  NdisMEvent_SSIdleComplete = 17,
  NdisMEvent_SSIdleReq = 18,
  NdisMEvent_SSIdleConfirm = 19,
  NdisMEventD0_AoAcSurpriseWake = 20,
  NdisMEvent_DeviceAdded = 31,
  NdisMEvent_DeviceStart = 32,
  NdisMEvent_DeviceQueryRemove = 33,
  NdisMEvent_DeviceCancelRemove = 34,
  NdisMEvent_DeviceRemove = 35,
  NdisMEvent_DeviceSurpriseRemoval = 36,
  NdisMEvent_DeviceQueryStop = 37,
  NdisMEvent_DeviceCancelStop = 38,
  NdisMEvent_DeviceStop = 39,
  NdisMEvent_MiniportInitialized = 51,
  NdisMEvent_MiniportHalted = 52,
  NdisMEvent_MiniportPaused = 53,
  NdisMEvent_MiniportRestarted = 54,
  NdisMEvent_MiniportPmInitialized = 55,
  NdisMEventErr_Min = 70,
  NdisMEventErr_UserRequested = 70,
  NdisMEventErr_MiniportRequested = 71,
  NdisMEventErr_FailedIMInitDevice = 72,
  NdisMEventErr_FailedRestart = 73,
  NdisMEventErr_FailedPowerD0 = 74,
  NdisMEventErr_FailedPowerDx = 75,
  NdisMEventErr_UninstalledByUsermode = 76,
  NdisMEventErr_Max = 76,
} NDIS_MINIPORT_EVENT, *PNDIS_MINIPORT_EVENT;

typedef struct _FLOATING_SAVE_AREA
{
  /* 0x0000 */ unsigned long ControlWord;
  /* 0x0004 */ unsigned long StatusWord;
  /* 0x0008 */ unsigned long TagWord;
  /* 0x000c */ unsigned long ErrorOffset;
  /* 0x0010 */ unsigned long ErrorSelector;
  /* 0x0014 */ unsigned long DataOffset;
  /* 0x0018 */ unsigned long DataSelector;
  /* 0x001c */ unsigned char RegisterArea[80];
  /* 0x006c */ unsigned long Spare0;
} FLOATING_SAVE_AREA, *PFLOATING_SAVE_AREA; /* size: 0x0070 */

typedef struct _CONTEXT
{
  /* 0x0000 */ unsigned long ContextFlags;
  /* 0x0004 */ unsigned long Dr0;
  /* 0x0008 */ unsigned long Dr1;
  /* 0x000c */ unsigned long Dr2;
  /* 0x0010 */ unsigned long Dr3;
  /* 0x0014 */ unsigned long Dr6;
  /* 0x0018 */ unsigned long Dr7;
  /* 0x001c */ struct _FLOATING_SAVE_AREA FloatSave;
  /* 0x008c */ unsigned long SegGs;
  /* 0x0090 */ unsigned long SegFs;
  /* 0x0094 */ unsigned long SegEs;
  /* 0x0098 */ unsigned long SegDs;
  /* 0x009c */ unsigned long Edi;
  /* 0x00a0 */ unsigned long Esi;
  /* 0x00a4 */ unsigned long Ebx;
  /* 0x00a8 */ unsigned long Edx;
  /* 0x00ac */ unsigned long Ecx;
  /* 0x00b0 */ unsigned long Eax;
  /* 0x00b4 */ unsigned long Ebp;
  /* 0x00b8 */ unsigned long Eip;
  /* 0x00bc */ unsigned long SegCs;
  /* 0x00c0 */ unsigned long EFlags;
  /* 0x00c4 */ unsigned long Esp;
  /* 0x00c8 */ unsigned long SegSs;
  /* 0x00cc */ unsigned char ExtendedRegisters[512];
} CONTEXT, *PCONTEXT; /* size: 0x02cc */

typedef struct _KPROCESSOR_STATE
{
  /* 0x0000 */ struct _CONTEXT ContextFrame;
  /* 0x02cc */ struct _KSPECIAL_REGISTERS SpecialRegisters;
} KPROCESSOR_STATE, *PKPROCESSOR_STATE; /* size: 0x0320 */

typedef struct _KPRCB
{
  /* 0x0000 */ unsigned short MinorVersion;
  /* 0x0002 */ unsigned short MajorVersion;
  /* 0x0004 */ struct _KTHREAD* CurrentThread;
  /* 0x0008 */ struct _KTHREAD* NextThread;
  /* 0x000c */ struct _KTHREAD* IdleThread;
  /* 0x0010 */ unsigned char LegacyNumber;
  /* 0x0011 */ unsigned char NestingLevel;
  /* 0x0012 */ unsigned short BuildType;
  /* 0x0014 */ char CpuType;
  /* 0x0015 */ char CpuID;
  union
  {
    /* 0x0016 */ unsigned short CpuStep;
    struct
    {
      /* 0x0016 */ unsigned char CpuStepping;
      /* 0x0017 */ unsigned char CpuModel;
    }; /* size: 0x0002 */
  }; /* size: 0x0002 */
  /* 0x0018 */ struct _KPROCESSOR_STATE ProcessorState;
  /* 0x0338 */ struct _KNODE* ParentNode;
  /* 0x033c */ char* PriorityState;
  /* 0x0340 */ unsigned long KernelReserved[14];
  /* 0x0378 */ unsigned long HalReserved[16];
  /* 0x03b8 */ unsigned long CFlushSize;
  /* 0x03bc */ unsigned char CoresPerPhysicalProcessor;
  /* 0x03bd */ unsigned char LogicalProcessorsPerCore;
  /* 0x03be */ unsigned char CpuVendor;
  /* 0x03bf */ unsigned char PrcbPad0[1];
  /* 0x03c0 */ unsigned long MHz;
  /* 0x03c4 */ unsigned char GroupIndex;
  /* 0x03c5 */ unsigned char Group;
  /* 0x03c6 */ unsigned char PrcbPad05[2];
  /* 0x03c8 */ unsigned long GroupSetMember;
  /* 0x03cc */ unsigned long Number;
  /* 0x03d0 */ unsigned char ClockOwner;
  union
  {
    /* 0x03d1 */ unsigned char PendingTickFlags;
    struct /* bitfield */
    {
      /* 0x03d1 */ unsigned char PendingTick : 1; /* bit position: 0 */
      /* 0x03d1 */ unsigned char PendingBackupTick : 1; /* bit position: 1 */
    }; /* bitfield */
  }; /* size: 0x0001 */
  /* 0x03d2 */ unsigned char PrcbPad10[70];
  /* 0x0418 */ struct _KSPIN_LOCK_QUEUE LockQueue[17];
} KPRCB, *PKPRCB; /* size: 0x04a0 */

typedef union _NET_LUID_LH
{
  union
  {
    /* 0x0000 */ unsigned __int64 Value;
    struct
    {
      struct /* bitfield */
      {
        /* 0x0000 */ unsigned __int64 Reserved : 24; /* bit position: 0 */
        /* 0x0000 */ unsigned __int64 NetLuidIndex : 24; /* bit position: 24 */
        /* 0x0000 */ unsigned __int64 IfType : 16; /* bit position: 48 */
      }; /* bitfield */
    } /* size: 0x0008 */ Info;
  }; /* size: 0x0008 */
} NET_LUID_LH, *PNET_LUID_LH; /* size: 0x0008 */

typedef struct _NDIS_FILTER_INTERFACE
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ unsigned long FilterType;
  /* 0x000c */ unsigned long FilterRunType;
  /* 0x0010 */ unsigned long IfIndex;
  /* 0x0014 */ long Padding_14;
  /* 0x0018 */ union _NET_LUID_LH NetLuid;
  /* 0x0020 */ struct _UNICODE_STRING FilterClass;
  /* 0x0028 */ struct _UNICODE_STRING FilterInstanceName;
} NDIS_FILTER_INTERFACE, *PNDIS_FILTER_INTERFACE; /* size: 0x0030 */

typedef enum _NDIS_RSS_PROFILE
{
  NdisRssProfileClosest = 1,
  NdisRssProfileClosestStatic = 2,
  NdisRssProfileNuma = 3,
  NdisRssProfileNumaStatic = 4,
  NdisRssProfileConservative = 5,
  NdisRssProfileMaximum = 6,
} NDIS_RSS_PROFILE, *PNDIS_RSS_PROFILE;

typedef enum _NDIS_ENCAPSULATION
{
  UNSPECIFIED_Encapsulation = 0,
  NULL_Encapsulation = 1,
  IEEE_802_3_Encapsulation = 2,
  IEEE_802_5_Encapsulation = 3,
  LLC_SNAP_ROUTED_Encapsulation = 4,
  LLC_SNAP_BRIDGED_Encapsulation = 5,
} NDIS_ENCAPSULATION, *PNDIS_ENCAPSULATION;

typedef struct _NDIS_ENCAPSULATION_FORMAT
{
  /* 0x0000 */ enum _NDIS_ENCAPSULATION Encapsulation;
  struct
  {
    struct /* bitfield */
    {
      /* 0x0004 */ unsigned long FixedHeaderSize : 1; /* bit position: 0 */
      /* 0x0004 */ unsigned long Reserved : 31; /* bit position: 1 */
    }; /* bitfield */
  } /* size: 0x0004 */ Flags;
  /* 0x0008 */ unsigned long EncapsulationHeaderSize;
} NDIS_ENCAPSULATION_FORMAT, *PNDIS_ENCAPSULATION_FORMAT; /* size: 0x000c */

typedef struct _NDIS_TASK_OFFLOAD_HEADER
{
  /* 0x0000 */ unsigned long Version;
  /* 0x0004 */ unsigned long Size;
  /* 0x0008 */ unsigned long Reserved;
  /* 0x000c */ unsigned long OffsetFirstTask;
  /* 0x0010 */ struct _NDIS_ENCAPSULATION_FORMAT EncapsulationFormat;
} NDIS_TASK_OFFLOAD_HEADER, *PNDIS_TASK_OFFLOAD_HEADER; /* size: 0x001c */

typedef enum _NDIS_PM_WAKE_REASON_TYPE
{
  NdisWakeReasonUnspecified = 0,
  NdisWakeReasonPacket = 1,
  NdisWakeReasonMediaDisconnect = 2,
  NdisWakeReasonMediaConnect = 3,
  NdisWakeReasonWlanNLODiscovery = 4096,
  NdisWakeReasonWlanAPAssociationLost = 4097,
  NdisWakeReasonWlanGTKHandshakeError = 4098,
  NdisWakeReasonWlan4WayHandshakeRequest = 4099,
  NdisWakeReasonWwanRegisterState = 8192,
  NdisWakeReasonWwanSMSReceive = 8193,
  NdisWakeReasonWwanUSSDReceive = 8194,
  NdisWakeReasonWwanPacketState = 8196,
  NdisWakeReasonWwanUiccChange = 8197,
} NDIS_PM_WAKE_REASON_TYPE, *PNDIS_PM_WAKE_REASON_TYPE;

enum NetSetupStoreType
{
  System = 0,
  Mutable = 1,
};

typedef enum _NDIS_FILTER_STATE
{
  NdisFilterDetached = 0,
  NdisFilterAttaching = 1,
  NdisFilterPaused = 2,
  NdisFilterRestarting = 3,
  NdisFilterRunning = 4,
  NdisFilterPausing = 5,
  NdisFilterDetaching = 6,
} NDIS_FILTER_STATE, *PNDIS_FILTER_STATE;

typedef struct _NDIS_FILTER_TASK_OFFLOAD
{
  /* 0x0000 */ struct _NDIS_OFFLOAD OffloadCaps;
} NDIS_FILTER_TASK_OFFLOAD, *PNDIS_FILTER_TASK_OFFLOAD; /* size: 0x00d8 */

typedef enum _NET_IF_ACCESS_TYPE
{
  NET_IF_ACCESS_LOOPBACK = 1,
  NET_IF_ACCESS_BROADCAST = 2,
  NET_IF_ACCESS_POINT_TO_POINT = 3,
  NET_IF_ACCESS_POINT_TO_MULTI_POINT = 4,
  NET_IF_ACCESS_MAXIMUM = 5,
} NET_IF_ACCESS_TYPE, *PNET_IF_ACCESS_TYPE;

typedef enum _IPSEC_OFFLOAD_V2_OPERATION
{
  IPsecOffloadV2Ah = 1,
  IPsecOffloadV2Esp = 2,
  IPsecOffloadV2Max = 3,
} IPSEC_OFFLOAD_V2_OPERATION, *PIPSEC_OFFLOAD_V2_OPERATION;

typedef struct _IPSEC_OFFLOAD_V2_UPDATE_SA
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ void* OffloadHandle;
  /* 0x0008 */ enum _IPSEC_OFFLOAD_V2_OPERATION Operation;
  /* 0x000c */ unsigned long Spi;
  /* 0x0010 */ unsigned long SequenceNumberHighOrder;
} IPSEC_OFFLOAD_V2_UPDATE_SA, *PIPSEC_OFFLOAD_V2_UPDATE_SA; /* size: 0x0014 */

typedef struct _NDIS_PHYSICAL_ADDRESS_UNIT
{
  /* 0x0000 */ union _LARGE_INTEGER PhysicalAddress;
  /* 0x0008 */ unsigned int Length;
  /* 0x000c */ long __PADDING__[1];
} NDIS_PHYSICAL_ADDRESS_UNIT, *PNDIS_PHYSICAL_ADDRESS_UNIT; /* size: 0x0010 */

struct wistd::__invokable_r<void,void (__stdcall*)(NDISWATCHDOG__ *),NDISWATCHDOG__ * &>
{
  /* 0x0000 */ const BOOL value;
}; /* size: 0x0001 */

typedef enum _NET_IF_CONNECTION_TYPE
{
  NET_IF_CONNECTION_DEDICATED = 1,
  NET_IF_CONNECTION_PASSIVE = 2,
  NET_IF_CONNECTION_DEMAND = 3,
  NET_IF_CONNECTION_MAXIMUM = 4,
} NET_IF_CONNECTION_TYPE, *PNET_IF_CONNECTION_TYPE;

typedef enum _NDIS_MINIPORT_HOOK_DRIVER_TYPE
{
  NdisMiniportHookDriverTypeNone = 0,
  NdisMiniportHookDriverTypeWdi = 1,
  NdisMiniportHookDriverType_Maximum = 2,
} NDIS_MINIPORT_HOOK_DRIVER_TYPE, *PNDIS_MINIPORT_HOOK_DRIVER_TYPE;

enum NDIS_NDIS5_DRIVER_STATE
{
  Ndis5StateUnused = 0,
  Ndis5StatePaused = 1,
  Ndis5StateRunning = 2,
};

typedef enum _NDIS_DEVICE_POWER_STATE
{
  NdisDeviceStateUnspecified = 0,
  NdisDeviceStateD0 = 1,
  NdisDeviceStateD1 = 2,
  NdisDeviceStateD2 = 3,
  NdisDeviceStateD3 = 4,
  NdisDeviceStateMaximum = 5,
} NDIS_DEVICE_POWER_STATE, *PNDIS_DEVICE_POWER_STATE;

enum NDIS_MINIPORT_POLICY_OWNER
{
  MiniportNotOwned = 0,
  MiniportOwnedByPowerManagement = 1,
  MiniportOwnedByBindEngine = 2,
};

typedef struct _GENERIC_MAPPING
{
  /* 0x0000 */ unsigned long GenericRead;
  /* 0x0004 */ unsigned long GenericWrite;
  /* 0x0008 */ unsigned long GenericExecute;
  /* 0x000c */ unsigned long GenericAll;
} GENERIC_MAPPING, *PGENERIC_MAPPING; /* size: 0x0010 */

typedef struct _ACCESS_REASONS
{
  /* 0x0000 */ unsigned long Data[32];
} ACCESS_REASONS, *PACCESS_REASONS; /* size: 0x0080 */

typedef struct _AUX_ACCESS_DATA
{
  /* 0x0000 */ struct _PRIVILEGE_SET* PrivilegesUsed;
  /* 0x0004 */ struct _GENERIC_MAPPING GenericMapping;
  /* 0x0014 */ unsigned long AccessesToAudit;
  /* 0x0018 */ unsigned long MaximumAuditMask;
  /* 0x001c */ struct _GUID TransactionId;
  /* 0x002c */ void* NewSecurityDescriptor;
  /* 0x0030 */ void* ExistingSecurityDescriptor;
  /* 0x0034 */ void* ParentSecurityDescriptor;
  /* 0x0038 */ void* DeRefSecurityDescriptor /* function */;
  /* 0x003c */ void* SDLock;
  /* 0x0040 */ struct _ACCESS_REASONS AccessReasons;
  /* 0x00c0 */ unsigned char GenerateStagingEvents;
  /* 0x00c1 */ char __PADDING__[3];
} AUX_ACCESS_DATA, *PAUX_ACCESS_DATA; /* size: 0x00c4 */

typedef struct _WWAN_SET_SIGNAL_INDICATION
{
  /* 0x0000 */ unsigned long RssiInterval;
  /* 0x0004 */ unsigned long RssiThreshold;
} WWAN_SET_SIGNAL_INDICATION, *PWWAN_SET_SIGNAL_INDICATION; /* size: 0x0008 */

typedef struct _NDIS_WWAN_SET_SIGNAL_INDICATION
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ struct _WWAN_SET_SIGNAL_INDICATION SignalIndication;
} NDIS_WWAN_SET_SIGNAL_INDICATION, *PNDIS_WWAN_SET_SIGNAL_INDICATION; /* size: 0x000c */

typedef enum _PKTMON_PACKET_TYPE
{
  PktMonPayload_Unknown = 0,
  PktMonPayload_Ethernet = 1,
  PktMonPayload_WiFi = 2,
  PktMonPayload_MBB = 3,
  PktMonPayload_HTTP = 4,
} PKTMON_PACKET_TYPE, *PPKTMON_PACKET_TYPE;

typedef enum _NDIS_HALT_ACTION
{
  NdisHaltDeviceDisabled = 0,
  NdisHaltDeviceInstanceDeInitialized = 1,
  NdisHaltDevicePoweredDown = 2,
  NdisHaltDeviceSurpriseRemoved = 3,
  NdisHaltDeviceFailed = 4,
  NdisHaltDeviceInitializationFailed = 5,
  NdisHaltDeviceStopped = 6,
} NDIS_HALT_ACTION, *PNDIS_HALT_ACTION;

typedef enum _NDIS_SHUTDOWN_ACTION
{
  NdisShutdownPowerOff = 0,
  NdisShutdownBugCheck = 1,
} NDIS_SHUTDOWN_ACTION, *PNDIS_SHUTDOWN_ACTION;

struct _KPROCESS;

struct DOT11_PRIVACY_EXEMPTION
{
  /* 0x0000 */ unsigned short usEtherType;
  /* 0x0002 */ unsigned short usExemptionActionType;
  /* 0x0004 */ unsigned short usExemptionPacketType;
}; /* size: 0x0006 */

typedef enum _IO_RATE_CONTROL_TYPE
{
  IoRateControlTypeCapMin = 0,
  IoRateControlTypeIopsCap = 0,
  IoRateControlTypeBandwidthCap = 1,
  IoRateControlTypeTimePercentCap = 2,
  IoRateControlTypeCapMax = 2,
  IoRateControlTypeReservationMin = 3,
  IoRateControlTypeIopsReservation = 3,
  IoRateControlTypeBandwidthReservation = 4,
  IoRateControlTypeTimePercentReservation = 5,
  IoRateControlTypeReservationMax = 5,
  IoRateControlTypeCriticalReservationMin = 6,
  IoRateControlTypeIopsCriticalReservation = 6,
  IoRateControlTypeBandwidthCriticalReservation = 7,
  IoRateControlTypeTimePercentCriticalReservation = 8,
  IoRateControlTypeCriticalReservationMax = 8,
  IoRateControlTypeSoftCapMin = 9,
  IoRateControlTypeIopsSoftCap = 9,
  IoRateControlTypeBandwidthSoftCap = 10,
  IoRateControlTypeTimePercentSoftCap = 11,
  IoRateControlTypeSoftCapMax = 11,
  IoRateControlTypeLimitExcessNotifyMin = 12,
  IoRateControlTypeIopsLimitExcessNotify = 12,
  IoRateControlTypeBandwidthLimitExcessNotify = 13,
  IoRateControlTypeTimePercentLimitExcessNotify = 14,
  IoRateControlTypeLimitExcessNotifyMax = 14,
  IoRateControlTypeMax = 15,
} IO_RATE_CONTROL_TYPE, *PIO_RATE_CONTROL_TYPE;

typedef struct _OFFLOAD_STATE_HEADER
{
  /* 0x0000 */ unsigned long Length;
  /* 0x0004 */ unsigned long RecognizedOptions;
} OFFLOAD_STATE_HEADER, *POFFLOAD_STATE_HEADER; /* size: 0x0008 */

typedef struct _PATH_OFFLOAD_STATE_DELEGATED
{
  /* 0x0000 */ struct _OFFLOAD_STATE_HEADER Header;
} PATH_OFFLOAD_STATE_DELEGATED, *PPATH_OFFLOAD_STATE_DELEGATED; /* size: 0x0008 */

typedef struct _ETW_BUFFER_CONTEXT
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned char ProcessorNumber;
      /* 0x0001 */ unsigned char Alignment;
    }; /* size: 0x0002 */
    /* 0x0000 */ unsigned short ProcessorIndex;
  }; /* size: 0x0002 */
  /* 0x0002 */ unsigned short LoggerId;
} ETW_BUFFER_CONTEXT, *PETW_BUFFER_CONTEXT; /* size: 0x0004 */

typedef enum _KINTERRUPT_POLARITY
{
  InterruptPolarityUnknown = 0,
  InterruptActiveHigh = 1,
  InterruptRisingEdge = 1,
  InterruptActiveLow = 2,
  InterruptFallingEdge = 2,
  InterruptActiveBoth = 3,
  InterruptActiveBothTriggerLow = 3,
  InterruptActiveBothTriggerHigh = 4,
} KINTERRUPT_POLARITY, *PKINTERRUPT_POLARITY;

typedef struct _NDIS_POOL_HEADER
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long ListLock;
  /* 0x0008 */ struct _LIST_ENTRY AllocatedList;
} NDIS_POOL_HEADER, *PNDIS_POOL_HEADER; /* size: 0x0010 */

typedef enum _NDIS_RECEIVE_QUEUE_PNP_STATE
{
  NdisReceiveQueuePnPStateUndefined = 0,
  NdisReceiveQueuePnPStateAddedToList = 1,
  NdisReceiveQueuePnPStateAllocated = 2,
  NdisReceiveQueuePnPStateEnabled = 3,
  NdisReceiveQueuePnPStateMaximum = 4,
} NDIS_RECEIVE_QUEUE_PNP_STATE, *PNDIS_RECEIVE_QUEUE_PNP_STATE;

typedef enum _NDIS_RECEIVE_QUEUE_OPERATIONAL_STATE
{
  NdisReceiveQueueOperationalStateUndefined = 0,
  NdisReceiveQueueOperationalStateRunning = 1,
  NdisReceiveQueueOperationalStatePaused = 2,
  NdisReceiveQueueOperationalStateDmaStopped = 3,
  NdisReceiveQueueOperationalStateMaximum = 4,
} NDIS_RECEIVE_QUEUE_OPERATIONAL_STATE, *PNDIS_RECEIVE_QUEUE_OPERATIONAL_STATE;

typedef enum _JOBOBJECTINFOCLASS
{
  JobObjectBasicAccountingInformation = 1,
  JobObjectBasicLimitInformation = 2,
  JobObjectBasicProcessIdList = 3,
  JobObjectBasicUIRestrictions = 4,
  JobObjectSecurityLimitInformation = 5,
  JobObjectEndOfJobTimeInformation = 6,
  JobObjectAssociateCompletionPortInformation = 7,
  JobObjectBasicAndIoAccountingInformation = 8,
  JobObjectExtendedLimitInformation = 9,
  JobObjectJobSetInformation = 10,
  JobObjectGroupInformation = 11,
  JobObjectNotificationLimitInformation = 12,
  JobObjectLimitViolationInformation = 13,
  JobObjectGroupInformationEx = 14,
  JobObjectCpuRateControlInformation = 15,
  JobObjectCompletionFilter = 16,
  JobObjectCompletionCounter = 17,
  JobObjectFreezeInformation = 18,
  JobObjectExtendedAccountingInformation = 19,
  JobObjectWakeInformation = 20,
  JobObjectBackgroundInformation = 21,
  JobObjectSchedulingRankBiasInformation = 22,
  JobObjectTimerVirtualizationInformation = 23,
  JobObjectCycleTimeNotification = 24,
  JobObjectClearEvent = 25,
  JobObjectInterferenceInformation = 26,
  JobObjectClearPeakJobMemoryUsed = 27,
  JobObjectMemoryUsageInformation = 28,
  JobObjectSharedCommit = 29,
  JobObjectContainerId = 30,
  JobObjectIoRateControlInformation = 31,
  JobObjectSiloRootDirectory = 37,
  JobObjectServerSiloBasicInformation = 38,
  JobObjectServerSiloUserSharedData = 39,
  JobObjectServerSiloInitialize = 40,
  JobObjectServerSiloRunningState = 41,
  JobObjectIoAttribution = 42,
  JobObjectMemoryPartitionInformation = 43,
  JobObjectContainerTelemetryId = 44,
  JobObjectSiloSystemRoot = 45,
  JobObjectEnergyTrackingState = 46,
  JobObjectThreadImpersonationInformation = 47,
  JobObjectReserved1Information = 18,
  JobObjectReserved2Information = 19,
  JobObjectReserved3Information = 20,
  JobObjectReserved4Information = 21,
  JobObjectReserved5Information = 22,
  JobObjectReserved6Information = 23,
  JobObjectReserved7Information = 24,
  JobObjectReserved8Information = 25,
  JobObjectReserved9Information = 26,
  JobObjectReserved10Information = 27,
  JobObjectReserved11Information = 28,
  JobObjectReserved12Information = 29,
  JobObjectReserved13Information = 30,
  JobObjectReserved14Information = 31,
  JobObjectNetRateControlInformation = 32,
  JobObjectNotificationLimitInformation2 = 33,
  JobObjectLimitViolationInformation2 = 34,
  JobObjectCreateSilo = 35,
  JobObjectSiloBasicInformation = 36,
  JobObjectReserved15Information = 37,
  JobObjectReserved16Information = 38,
  JobObjectReserved17Information = 39,
  JobObjectReserved18Information = 40,
  JobObjectReserved19Information = 41,
  JobObjectReserved20Information = 42,
  JobObjectReserved21Information = 43,
  JobObjectReserved22Information = 44,
  JobObjectReserved23Information = 45,
  JobObjectReserved24Information = 46,
  JobObjectReserved25Information = 47,
  MaxJobObjectInfoClass = 48,
} JOBOBJECTINFOCLASS, *PJOBOBJECTINFOCLASS;

typedef struct _NDIS_WAN_COMPRESS_INFO
{
  /* 0x0000 */ unsigned char SessionKey[8];
  /* 0x0008 */ unsigned long MSCompType;
  /* 0x000c */ unsigned char CompType;
  /* 0x000d */ char Padding_15;
  /* 0x000e */ unsigned short CompLength;
  union
  {
    struct
    {
      /* 0x0010 */ unsigned char CompOUI[3];
      /* 0x0013 */ unsigned char CompSubType;
      /* 0x0014 */ unsigned char CompValues[32];
    } /* size: 0x0024 */ Proprietary;
    struct
    {
      struct
      {
        /* 0x0010 */ unsigned char CompValues[32];
      } /* size: 0x0020 */ Public;
      /* 0x0030 */ long __PADDING__[1];
    }; /* size: 0x0024 */
  }; /* size: 0x0024 */
} NDIS_WAN_COMPRESS_INFO, *PNDIS_WAN_COMPRESS_INFO; /* size: 0x0034 */

typedef struct _NDIS_WAN_CO_GET_COMP_INFO
{
  /* 0x0000 */ struct _NDIS_WAN_COMPRESS_INFO SendCapabilities;
  /* 0x0034 */ struct _NDIS_WAN_COMPRESS_INFO RecvCapabilities;
} NDIS_WAN_CO_GET_COMP_INFO, *PNDIS_WAN_CO_GET_COMP_INFO; /* size: 0x0068 */

typedef enum _NDIS_INTERRUPT_TYPE
{
  NDIS_CONNECT_LINE_BASED = 1,
  NDIS_CONNECT_MESSAGE_BASED = 2,
} NDIS_INTERRUPT_TYPE, *PNDIS_INTERRUPT_TYPE;

typedef enum _NETSETUPPROP_OPERATOR
{
  NETSETUPPROP_OPERATOR_MODIFIER_NOT = 0x10000,
  NETSETUPPROP_OPERATOR_MODIFIER_IGNORE_CASE = 0x20000,
  NETSETUPPROP_OPERATOR_NONE = 0,
  NETSETUPPROP_OPERATOR_EXISTS = 1,
  NETSETUPPROP_OPERATOR_NOT_EXISTS = 0x10001,
  NETSETUPPROP_OPERATOR_EQUALS = 2,
  NETSETUPPROP_OPERATOR_NOT_EQUALS = 0x10002,
  NETSETUPPROP_OPERATOR_GREATER_THAN = 3,
  NETSETUPPROP_OPERATOR_LESS_THAN = 4,
  NETSETUPPROP_OPERATOR_GREATER_THAN_EQUALS = 5,
  NETSETUPPROP_OPERATOR_LESS_THAN_EQUALS = 6,
  NETSETUPPROP_OPERATOR_EQUALS_IGNORE_CASE = 0x20002,
  NETSETUPPROP_OPERATOR_NOT_EQUALS_IGNORE_CASE = 0x30002,
  NETSETUPPROP_OPERATOR_BITMASK_ALL = 7,
  NETSETUPPROP_OPERATOR_BITMASK_ANY = 8,
  NETSETUPPROP_OPERATOR_CHANGED = 256,
  NETSETUPPROP_OPERATOR_CHANGED_ANY_IN_NAMESPACE = 257,
  NETSETUPPROP_OPERATOR_LIST_CONTAINS = 4096,
  NETSETUPPROP_OPERATOR_LIST_CONTAINS_IGNORE_CASE = 0x21000,
  NETSETUPPROP_OPERATOR_LIST_COUNT = 8192,
  NETSETUPPROP_OPERATOR_AND_OPEN = 0x100000,
  NETSETUPPROP_OPERATOR_AND_CLOSE = 0x200000,
  NETSETUPPROP_OPERATOR_OR_OPEN = 0x300000,
  NETSETUPPROP_OPERATOR_OR_CLOSE = 0x400000,
  NETSETUPPROP_OPERATOR_NOT_OPEN = 0x500000,
  NETSETUPPROP_OPERATOR_NOT_CLOSE = 0x600000,
  NETSETUPPROP_OPERATOR_XOR_OPEN = 0x700000,
  NETSETUPPROP_OPERATOR_XOR_CLOSE = 0x800000,
  NETSETUPPROP_TARGET_MODIFIER_PRINCIPAL_OBJECT = 0,
  NETSETUPPROP_TARGET_MODIFIER_TRANSACTION = 0x10000000,
  NETSETUPPROP_TARGET_MODIFIER_ANY_ON_PATH = 0x20000000,
  NETSETUPPROP_TARGET_MODIFIER_ALL_ON_PATH = 0x20010000,
  NETSETUPPROP_TARGET_MODIFIER_TOP_OF_PATH = 0x30000000,
  NETSETUPPROP_TARGET_MODIFIER_BOTTOM_OF_PATH = 0x40000000,
  NETSETUPPROP_TARGET_MODIFIER_GLOBAL = 0x50000000,
  NETSETUPPROP_TARGET_MODIFIER_ANY_PROPERTY = 0x60000000,
  NETSETUPPROP_OPERATOR_MASK_EVAL = 4095,
  NETSETUPPROP_OPERATOR_MASK_LIST = 0xfffff000,
  NETSETUPPROP_OPERATOR_MASK_MODIFIER = 0xf0000,
  NETSETUPPROP_OPERATOR_MASK_NOT_LOGICAL = 0xfffff,
  NETSETUPPROP_OPERATOR_MASK_LOGICAL = 0xff00000,
  NETSETUPPROP_OPERATOR_MASK_TARGET = -268435456,
} NETSETUPPROP_OPERATOR, *PNETSETUPPROP_OPERATOR;

typedef struct _NDIS_CO_CLIENT_OPTIONAL_HANDLERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Reserved;
  /* 0x0008 */ void* ClCreateVcHandler /* function */;
  /* 0x000c */ void* ClDeleteVcHandler /* function */;
  /* 0x0010 */ void* ClOidRequestHandler /* function */;
  /* 0x0014 */ void* ClOidRequestCompleteHandler /* function */;
  /* 0x0018 */ void* ClOpenAfCompleteHandlerEx /* function */;
  /* 0x001c */ void* ClCloseAfCompleteHandler /* function */;
  /* 0x0020 */ void* ClRegisterSapCompleteHandler /* function */;
  /* 0x0024 */ void* ClDeregisterSapCompleteHandler /* function */;
  /* 0x0028 */ void* ClMakeCallCompleteHandler /* function */;
  /* 0x002c */ void* ClModifyCallQoSCompleteHandler /* function */;
  /* 0x0030 */ void* ClCloseCallCompleteHandler /* function */;
  /* 0x0034 */ void* ClAddPartyCompleteHandler /* function */;
  /* 0x0038 */ void* ClDropPartyCompleteHandler /* function */;
  /* 0x003c */ void* ClIncomingCallHandler /* function */;
  /* 0x0040 */ void* ClIncomingCallQoSChangeHandler /* function */;
  /* 0x0044 */ void* ClIncomingCloseCallHandler /* function */;
  /* 0x0048 */ void* ClIncomingDropPartyHandler /* function */;
  /* 0x004c */ void* ClCallConnectedHandler /* function */;
  /* 0x0050 */ void* ClNotifyCloseAfHandler /* function */;
} NDIS_CO_CLIENT_OPTIONAL_HANDLERS, *PNDIS_CO_CLIENT_OPTIONAL_HANDLERS; /* size: 0x0054 */

typedef enum _SECURITY_OPERATION_CODE
{
  SetSecurityDescriptor = 0,
  QuerySecurityDescriptor = 1,
  DeleteSecurityDescriptor = 2,
  AssignSecurityDescriptor = 3,
} SECURITY_OPERATION_CODE, *PSECURITY_OPERATION_CODE;

typedef union __m64
{
  union
  {
    /* 0x0000 */ unsigned __int64 m64_u64;
    /* 0x0000 */ float m64_f32[2];
    /* 0x0000 */ char m64_i8[8];
    /* 0x0000 */ short m64_i16[4];
    /* 0x0000 */ int m64_i32[2];
    /* 0x0000 */ __int64 m64_i64;
    /* 0x0000 */ unsigned char m64_u8[8];
    /* 0x0000 */ unsigned short m64_u16[4];
    /* 0x0000 */ unsigned int m64_u32[2];
  }; /* size: 0x0008 */
} _m64, *P_m64; /* size: 0x0008 */

typedef struct _GENERAL_LOOKASIDE
{
  union
  {
    /* 0x0000 */ union _SLIST_HEADER ListHead;
    /* 0x0000 */ struct _SINGLE_LIST_ENTRY SingleListHead;
  }; /* size: 0x0008 */
  /* 0x0008 */ unsigned short Depth;
  /* 0x000a */ unsigned short MaximumDepth;
  /* 0x000c */ unsigned long TotalAllocates;
  union
  {
    /* 0x0010 */ unsigned long AllocateMisses;
    /* 0x0010 */ unsigned long AllocateHits;
  }; /* size: 0x0004 */
  /* 0x0014 */ unsigned long TotalFrees;
  union
  {
    /* 0x0018 */ unsigned long FreeMisses;
    /* 0x0018 */ unsigned long FreeHits;
  }; /* size: 0x0004 */
  /* 0x001c */ enum _POOL_TYPE Type;
  /* 0x0020 */ unsigned long Tag;
  /* 0x0024 */ unsigned long Size;
  union
  {
    /* 0x0028 */ void* AllocateEx /* function */;
    /* 0x0028 */ void* Allocate /* function */;
  }; /* size: 0x0004 */
  union
  {
    /* 0x002c */ void* FreeEx /* function */;
    /* 0x002c */ void* Free /* function */;
  }; /* size: 0x0004 */
  /* 0x0030 */ struct _LIST_ENTRY ListEntry;
  /* 0x0038 */ unsigned long LastTotalAllocates;
  union
  {
    /* 0x003c */ unsigned long LastAllocateMisses;
    /* 0x003c */ unsigned long LastAllocateHits;
  }; /* size: 0x0004 */
  /* 0x0040 */ unsigned long Future[2];
} GENERAL_LOOKASIDE, *PGENERAL_LOOKASIDE; /* size: 0x0048 */

typedef struct _PAGED_LOOKASIDE_LIST
{
  /* 0x0000 */ struct _GENERAL_LOOKASIDE L;
  /* 0x0048 */ struct _FAST_MUTEX Lock__ObsoleteButDoNotDelete;
} PAGED_LOOKASIDE_LIST, *PPAGED_LOOKASIDE_LIST; /* size: 0x0068 */

typedef enum _NETSETUP_OBJECT_SOURCE
{
  NetSetupObjectSourceUnknown = 0,
  NetSetupObjectSourcePartOfOS = 1,
  NetSetupObjectCreatedByOtherOSComponent = 2,
  NetSetupObjectCreatedByNetSetupInternal = 3,
  NetSetupObjectCreatedByOSMigration = 4,
  NetSetupObjectCreatedByNicInstallation = 5,
  NetSetupObjectCreatedByINetCfg = 6,
  NetSetupObjectSourceHardcoded = 7,
  NetSetupObjectSourceOfflineDism = 8,
  NetSetupObjectSourceUniversalInfRegistration = 9,
} NETSETUP_OBJECT_SOURCE, *PNETSETUP_OBJECT_SOURCE;

typedef enum _NL_ECN_CODEPOINT
{
  NlEcnCodepointNotEct = 0,
  NlEcnCodepointEct1 = 1,
  NlEcnCodepointEct0 = 2,
  NlEcnCodepointCe = 3,
} NL_ECN_CODEPOINT, *PNL_ECN_CODEPOINT;

typedef enum _NETSETUP_OBJECT_TYPE
{
  NetSetupObjectTypeUnknown = 0,
  NetSetupObjectTypeGlobal = 1,
  NetSetupObjectTypeInterface = 2,
  NetSetupObjectTypeFilterDriver = 3,
  NetSetupObjectTypeProtocolDriver = 4,
  NetSetupObjectTypeServiceDriver = 5,
  NetSetupObjectTypeClientDriver = 6,
  NetSetupObjectTypeBindingPath = 7,
  NetSetupObjectTypeMux = 8,
  NetSetupObjectTypeTransaction = 9,
  NetSetupObjectTypeReflectedProperty = 10,
  NetSetupObjectTypeBindRule = 11,
  NetSetupObjectTypeInterfaceDriver = 12,
  NetSetupObjectTypeMaximum = 13,
} NETSETUP_OBJECT_TYPE, *PNETSETUP_OBJECT_TYPE;

enum TlgIn_t
{
  TlgInNULL = 0,
  TlgInUNICODESTRING = 1,
  TlgInANSISTRING = 2,
  TlgInINT8 = 3,
  TlgInUINT8 = 4,
  TlgInINT16 = 5,
  TlgInUINT16 = 6,
  TlgInINT32 = 7,
  TlgInUINT32 = 8,
  TlgInINT64 = 9,
  TlgInUINT64 = 10,
  TlgInFLOAT = 11,
  TlgInDOUBLE = 12,
  TlgInBOOL32 = 13,
  TlgInBINARY = 14,
  TlgInGUID = 15,
  _TlgInPOINTER_unsupported = 16,
  TlgInFILETIME = 17,
  TlgInSYSTEMTIME = 18,
  TlgInSID = 19,
  TlgInHEXINT32 = 20,
  TlgInHEXINT64 = 21,
  TlgInCOUNTEDSTRING = 22,
  TlgInCOUNTEDANSISTRING = 23,
  _TlgInSTRUCT = 24,
  TlgInCOUNTEDBINARY = 25,
  _TlgInMax = 26,
  TlgInINTPTR = 7,
  TlgInUINTPTR = 8,
  TlgInPOINTER = 20,
  TlgInLONG = 7,
  TlgInULONG = 8,
  TlgInHEXLONG = 20,
  _TlgInCcount = 32,
  TlgInVcount = 64,
  _TlgInChain = 128,
  _TlgInCustom = 96,
  _TlgInTypeMask = 31,
  _TlgInCountMask = 96,
  _TlgInFlagMask = 224,
};

enum NetDmaEventTypes
{
  NdisMIndicateRecvEvent = 0,
  NdisPIndicateRecvEvent = 1,
  NdisPIndicateRecvCompleteEvent = 2,
  NdisPReturnPacketsExEvent = 3,
  NdisMReturnPacketsExEvent = 4,
  NdisPReturnPacketEvent = 5,
  NdisMReturnPacketEvent = 6,
  NdisMReturnPacketInRecvEvent = 7,
  DmaCopyV2VEvent = 8,
  DmaChainV2VNoCopyEvent = 9,
  DmaChainV2VCopyEvent = 10,
  DmaCopyP2VEvent = 11,
  DmaChainP2VNoCopyEvent = 12,
  DmaChainP2VCopyEvent = 13,
  DmaCopyFlushEvent = 14,
  DmaCopyAppendEvent = 15,
  DmaChainCopyAppendEvent = 16,
  DmaCopyFlushAppendEvent = 17,
  DmaCopyCheckForCompletionEvent = 18,
  DmaCopyGetPhysicalAddressEvent = 19,
  DmaCopyNullXferEvent = 20,
  DmaCopyDummyEvent = 21,
  TotalEventTypes = 22,
};

typedef enum _NDIS_LWFDRV_REFTAG
{
  LWFDRV_ATTACHING = 0,
  LWFDRV_IOWORKITEM = 1,
  LWFDRV_IOWORKITEMC = 2,
  LWFDRV_FILTERMODULE = 3,
  LWFDRV_PD_CLIENT = 4,
  LWFDRV_NUMBER_OF_TAGS = 5,
} NDIS_LWFDRV_REFTAG, *PNDIS_LWFDRV_REFTAG;

typedef union _WHEA_EVENT_LOG_ENTRY_FLAGS
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long Reserved1 : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned long LogInternalEtw : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned long LogBlackbox : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned long LogSel : 1; /* bit position: 3 */
      /* 0x0000 */ unsigned long RawSel : 1; /* bit position: 4 */
      /* 0x0000 */ unsigned long NoFormat : 1; /* bit position: 5 */
      /* 0x0000 */ unsigned long Driver : 1; /* bit position: 6 */
      /* 0x0000 */ unsigned long Reserved2 : 25; /* bit position: 7 */
    }; /* bitfield */
    /* 0x0000 */ unsigned long AsULONG;
  }; /* size: 0x0004 */
} WHEA_EVENT_LOG_ENTRY_FLAGS, *PWHEA_EVENT_LOG_ENTRY_FLAGS; /* size: 0x0004 */

typedef struct _WHEA_EVENT_LOG_ENTRY_HEADER
{
  /* 0x0000 */ unsigned long Signature;
  /* 0x0004 */ unsigned long Version;
  /* 0x0008 */ unsigned long Length;
  /* 0x000c */ enum _WHEA_EVENT_LOG_ENTRY_TYPE Type;
  /* 0x0010 */ unsigned long OwnerTag;
  /* 0x0014 */ enum _WHEA_EVENT_LOG_ENTRY_ID Id;
  /* 0x0018 */ union _WHEA_EVENT_LOG_ENTRY_FLAGS Flags;
  /* 0x001c */ unsigned long PayloadLength;
} WHEA_EVENT_LOG_ENTRY_HEADER, *PWHEA_EVENT_LOG_ENTRY_HEADER; /* size: 0x0020 */

typedef struct _WHEA_EVENT_LOG_ENTRY
{
  /* 0x0000 */ struct _WHEA_EVENT_LOG_ENTRY_HEADER Header;
} WHEA_EVENT_LOG_ENTRY, *PWHEA_EVENT_LOG_ENTRY; /* size: 0x0020 */

struct wistd::__compressed_pair_elem<wistd::default_delete<_NDIS_MINIPORT_DRIVER_CHARACTERISTICS>,1,1>
{
}; /* size: 0x0001 */

typedef enum _NDIS_NBL_TRACKER_SOURCE
{
  NdisNblTrackerMiniport = 0,
  NdisNblTrackerFilter = 1,
  NdisNblTrackerProtocol = 2,
  NdisNblTrackerNdisNPOSRReturn = 3,
  NdisNblTrackerNdisSSSend = 4,
  NdisNblTrackerNdisSSRReturn = 5,
  NdisNblTrackerFirstCustomContext = 256,
} NDIS_NBL_TRACKER_SOURCE, *PNDIS_NBL_TRACKER_SOURCE;

typedef enum _NDIS_PROCESSOR_VENDOR
{
  NdisProcessorVendorUnknown = 0,
  NdisProcessorVendorGenuinIntel = 1,
  NdisProcessorVendorGenuineIntel = 1,
  NdisProcessorVendorAuthenticAMD = 2,
} NDIS_PROCESSOR_VENDOR, *PNDIS_PROCESSOR_VENDOR;

typedef struct _RTL_RB_TREE
{
  /* 0x0000 */ struct _RTL_BALANCED_NODE* Root;
  union
  {
    /* 0x0004 */ unsigned char Encoded : 1; /* bit position: 0 */
    /* 0x0004 */ struct _RTL_BALANCED_NODE* Min;
  }; /* size: 0x0004 */
} RTL_RB_TREE, *PRTL_RB_TREE; /* size: 0x0008 */

typedef enum _NDIS_DATA_PATH_TYPE
{
  NdisSendPath = 0,
  NdisSendCompletePath = 1,
  NdisReceivePath = 2,
  NdisReceiveCompletePath = 3,
  NdisDataPathCount = 4,
} NDIS_DATA_PATH_TYPE, *PNDIS_DATA_PATH_TYPE;

typedef enum _NETSETUP_ENVIRONMENT_TYPE
{
  NetSetupEnvironmentApplicationOnline = 0,
  NetSetupEnvironmentCbsOnline = 1,
  NetSetupEnvironmentCbsOffline = 2,
  NetSetupEnvironmentRpcServer = 3,
  NetSetupEnvironmentMiniportPnp = 4,
  NetSetupEnvironmentTest = 5,
  NetSetupEnvironmentApplicationOffline = 6,
  NetSetupEnvironmentNetCfgShim = 7,
  NetSetupEnvironmentOSMigrationOffline = 8,
  NetSetupEnvironmentOSMigrationOnline = 9,
  NetSetupEnvironmentNotifyObjectHost = 10,
  NetSetupEnvironmentTransactionMonitor = 11,
  NetSetupEnvironmentTypeNotifyObjectReplay = 12,
} NETSETUP_ENVIRONMENT_TYPE, *PNETSETUP_ENVIRONMENT_TYPE;

typedef union _WHEA_ERROR_PACKET_FLAGS
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long PreviousError : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned long CriticalEvent : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned long HypervisorError : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned long Simulated : 1; /* bit position: 3 */
      /* 0x0000 */ unsigned long PlatformPfaControl : 1; /* bit position: 4 */
      /* 0x0000 */ unsigned long PlatformDirectedOffline : 1; /* bit position: 5 */
      /* 0x0000 */ unsigned long AddressTranslationRequired : 1; /* bit position: 6 */
      /* 0x0000 */ unsigned long AddressTranslationCompleted : 1; /* bit position: 7 */
      /* 0x0000 */ unsigned long Reserved2 : 24; /* bit position: 8 */
    }; /* bitfield */
    /* 0x0000 */ unsigned long AsULONG;
  }; /* size: 0x0004 */
} WHEA_ERROR_PACKET_FLAGS, *PWHEA_ERROR_PACKET_FLAGS; /* size: 0x0004 */

typedef struct _WHEA_ERROR_PACKET_V2
{
  /* 0x0000 */ unsigned long Signature;
  /* 0x0004 */ unsigned long Version;
  /* 0x0008 */ unsigned long Length;
  /* 0x000c */ union _WHEA_ERROR_PACKET_FLAGS Flags;
  /* 0x0010 */ enum _WHEA_ERROR_TYPE ErrorType;
  /* 0x0014 */ enum _WHEA_ERROR_SEVERITY ErrorSeverity;
  /* 0x0018 */ unsigned long ErrorSourceId;
  /* 0x001c */ enum _WHEA_ERROR_SOURCE_TYPE ErrorSourceType;
  /* 0x0020 */ struct _GUID NotifyType;
  /* 0x0030 */ unsigned __int64 Context;
  /* 0x0038 */ enum _WHEA_ERROR_PACKET_DATA_FORMAT DataFormat;
  /* 0x003c */ unsigned long Reserved1;
  /* 0x0040 */ unsigned long DataOffset;
  /* 0x0044 */ unsigned long DataLength;
  /* 0x0048 */ unsigned long PshedDataOffset;
  /* 0x004c */ unsigned long PshedDataLength;
} WHEA_ERROR_PACKET_V2, *PWHEA_ERROR_PACKET_V2; /* size: 0x0050 */

typedef enum _NDIS_GFP_TABLE_TYPE
{
  NdisGfpTableTypeUndefined = 0,
  NdisGfpTableTypeWildcardIngress = 1,
  NdisGfpTableTypeWildcardEgress = 2,
  NdisGfpTableTypeExactMatchIngress = 3,
  NdisGfpTableTypeExactMatchEgress = 4,
  NdisGfpTableTypePacketDirect = 5,
  NdisGfpTableTypeMax = 6,
} NDIS_GFP_TABLE_TYPE, *PNDIS_GFP_TABLE_TYPE;

typedef struct _NDIS_MINIPORT_HANDLERS
{
  /* 0x0000 */ void* RequestContext;
  /* 0x0004 */ void* CancelSendContext;
  /* 0x0008 */ void* IndicateNetBufferListsContext;
  /* 0x000c */ struct NDIS_NBL_TRACKER_HANDLE__* IndicateNetBufferListsTracker;
  /* 0x0010 */ struct _NDIS_OBJECT_HEADER* IndicateNetBufferListsObject;
  /* 0x0014 */ void* SaveIndicateNetBufferListsContext;
  /* 0x0018 */ void* ReturnNetBufferListsContext;
  /* 0x001c */ struct NDIS_NBL_TRACKER_HANDLE__* ReturnNetBufferListsTracker;
  /* 0x0020 */ struct _NDIS_OBJECT_HEADER* ReturnNetBufferListsObject;
  /* 0x0024 */ void* SendNetBufferListsContext;
  /* 0x0028 */ struct NDIS_NBL_TRACKER_HANDLE__* SendNetBufferListsTracker;
  /* 0x002c */ struct _NDIS_OBJECT_HEADER* SendNetBufferListsObject;
  /* 0x0030 */ void* SendNetBufferListsCompleteContext;
  /* 0x0034 */ struct NDIS_NBL_TRACKER_HANDLE__* SendNetBufferListsCompleteTracker;
  /* 0x0038 */ struct _NDIS_OBJECT_HEADER* SendNetBufferListsCompleteObject;
  /* 0x003c */ void* RequestHandle;
  union
  {
    /* 0x0040 */ void* CancelSendHandler /* function */;
    /* 0x0040 */ void* CancelSendPacketsHandler /* function */;
  }; /* size: 0x0004 */
  /* 0x0044 */ void* SendNetBufferListsCompleteHandler /* function */;
  /* 0x0048 */ void* IndicateNetBufferListsHandler /* function */;
  /* 0x004c */ void* SaveIndicateNetBufferListsHandler /* function */;
  /* 0x0050 */ void* ReturnNetBufferListsHandler /* function */;
  /* 0x0054 */ void* SendNetBufferListsHandler /* function */;
  /* 0x0058 */ void* DirectRequestHandle;
} NDIS_MINIPORT_HANDLERS, *PNDIS_MINIPORT_HANDLERS; /* size: 0x005c */

struct wistd::__compressed_pair_elem<Rtl::KString *,0,0>
{
  /* 0x0000 */ struct Rtl::KString* __value_;
}; /* size: 0x0004 */

typedef enum _NDIS_GFP_WILDCARD_MATCH_TYPE
{
  NdisGfpWildcardMatchTypeUndefined = 0,
  NdisGfpWildcardMatchTypeEqual = 1,
  NdisGfpWildcardMatchTypeMaskEqual = 2,
  NdisGfpWildcardMatchTypeInRange = 3,
  NdisGfpWildcardMatchTypeMax = 4,
} NDIS_GFP_WILDCARD_MATCH_TYPE, *PNDIS_GFP_WILDCARD_MATCH_TYPE;

typedef enum _NDIS_NET_BUFFER_LIST_INFO
{
  TcpIpChecksumNetBufferListInfo = 0,
  TcpOffloadBytesTransferred = 0,
  IPsecOffloadV1NetBufferListInfo = 1,
  IPsecOffloadV2NetBufferListInfo = 1,
  TcpLargeSendNetBufferListInfo = 2,
  TcpReceiveNoPush = 2,
  ClassificationHandleNetBufferListInfo = 3,
  Ieee8021QNetBufferListInfo = 4,
  NetBufferListCancelId = 5,
  MediaSpecificInformation = 6,
  NetBufferListFrameType = 7,
  NetBufferListProtocolId = 7,
  NetBufferListHashValue = 8,
  NetBufferListHashInfo = 9,
  WfpNetBufferListInfo = 10,
  IPsecOffloadV2TunnelNetBufferListInfo = 11,
  IPsecOffloadV2HeaderNetBufferListInfo = 12,
  NetBufferListCorrelationId = 13,
  NetBufferListFilteringInfo = 14,
  MediaSpecificInformationEx = 15,
  NblOriginalInterfaceIfIndex = 16,
  NblReAuthWfpFlowContext = 16,
  TcpReceiveBytesTransferred = 17,
  NrtNameResolutionId = 17,
  UdpRecvSegCoalesceOffloadInfo = 17,
  IMReserved = 18,
  TcpRecvSegCoalesceInfo = 19,
  UdpSegmentationOffloadInfo = 19,
  RscTcpTimestampDelta = 20,
  TcpSendOffloadsSupplementalNetBufferListInfo = 20,
  NetBufferListInfoReserved3 = 21,
  NetBufferListInfoReserved4 = 22,
  SwitchForwardingReserved = 23,
  SwitchForwardingDetail_b0_to_b31 = 24,
  SwitchForwardingDetail_b32_to_b63 = 25,
  VirtualSubnetInfo = 26,
  NetBufferListInfoReserved1 = 27,
  NetBufferListInfoReserved2 = 28,
  MaxNetBufferListInfo = 29,
} NDIS_NET_BUFFER_LIST_INFO, *PNDIS_NET_BUFFER_LIST_INFO;

typedef union _WHEA_REVISION
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned char MinorRevision;
      /* 0x0001 */ unsigned char MajorRevision;
    }; /* size: 0x0002 */
    /* 0x0000 */ unsigned short AsUSHORT;
  }; /* size: 0x0002 */
} WHEA_REVISION, *PWHEA_REVISION; /* size: 0x0002 */

typedef enum _NETSETUP_QUERY_RESULT_ACTION
{
  NetSetupQueryResultStateChange = 0,
  NetSetupQueryResultAdd = 1,
  NetSetupQueryResultUpdate = 2,
  NetSetupQueryResultRemove = 3,
} NETSETUP_QUERY_RESULT_ACTION, *PNETSETUP_QUERY_RESULT_ACTION;

typedef enum _MEMORY_PHYSICAL_CONTIGUITY_UNIT_STATE
{
  MemoryNotContiguous = 0,
  MemoryAlignedAndContiguous = 1,
  MemoryNotResident = 2,
  MemoryNotEligibleToMakeContiguous = 3,
  MemoryContiguityStateMax = 4,
} MEMORY_PHYSICAL_CONTIGUITY_UNIT_STATE, *PMEMORY_PHYSICAL_CONTIGUITY_UNIT_STATE;

typedef struct _MAILSLOT_CREATE_PARAMETERS
{
  /* 0x0000 */ unsigned long MailslotQuota;
  /* 0x0004 */ unsigned long MaximumMessageSize;
  /* 0x0008 */ union _LARGE_INTEGER ReadTimeout;
  /* 0x0010 */ unsigned char TimeoutSpecified;
  /* 0x0011 */ char __PADDING__[7];
} MAILSLOT_CREATE_PARAMETERS, *PMAILSLOT_CREATE_PARAMETERS; /* size: 0x0018 */

struct _NDIS_PCW_DATA_BLOCK;

typedef enum _WWAN_PACKET_SERVICE_ACTION
{
  WwanPacketServiceActionAttach = 0,
  WwanPacketServiceActionDetach = 1,
} WWAN_PACKET_SERVICE_ACTION, *PWWAN_PACKET_SERVICE_ACTION;

typedef enum _NETSETUP_REASON_BINDING_IS_CRITICAL
{
  NetSetupBindingIsSecurityCritical = 1,
  NetSetupBindingIsMediaConverter = 2,
  NetSetupBindingProvidesBootDevice = 3,
} NETSETUP_REASON_BINDING_IS_CRITICAL, *PNETSETUP_REASON_BINDING_IS_CRITICAL;

typedef struct _tlgProvider_t
{
  /* 0x0000 */ unsigned int LevelPlus1;
  /* 0x0004 */ const unsigned short* ProviderMetadataPtr;
  /* 0x0008 */ unsigned __int64 KeywordAny;
  /* 0x0010 */ unsigned __int64 KeywordAll;
  /* 0x0018 */ unsigned __int64 RegHandle;
  /* 0x0020 */ void* EnableCallback /* function */;
  /* 0x0024 */ void* CallbackContext;
} tlgProvider_t, *PtlgProvider_t; /* size: 0x0028 */

typedef enum _NDIS_FRAME_HEADER
{
  NdisFrameHeaderUndefined = 0,
  NdisFrameHeaderMac = 1,
  NdisFrameHeaderArp = 2,
  NdisFrameHeaderIPv4 = 3,
  NdisFrameHeaderIPv6 = 4,
  NdisFrameHeaderUdp = 5,
  NdisFrameHeaderMaximum = 6,
} NDIS_FRAME_HEADER, *PNDIS_FRAME_HEADER;

typedef enum _PS_WAKE_REASON
{
  PsWakeReasonUser = 0,
  PsWakeReasonExecutionRequired = 1,
  PsWakeReasonKernel = 2,
  PsWakeReasonInstrumentation = 3,
  PsWakeReasonPreserveProcess = 4,
  PsWakeReasonActivityReference = 5,
  PsWakeReasonWorkOnBehalf = 6,
  PsMaxWakeReasons = 7,
} PS_WAKE_REASON, *PPS_WAKE_REASON;

enum wil_FeatureStage
{
  wil_FeatureStage_AlwaysDisabled = 0,
  wil_FeatureStage_DisabledByDefault = 1,
  wil_FeatureStage_EnabledByDefault = 2,
  wil_FeatureStage_AlwaysEnabled = 3,
};

enum wil_UsageReportingMode
{
  wil_UsageReportingMode_Default = 0,
  wil_UsageReportingMode_SuppressPotential = 1,
  wil_UsageReportingMode_SuppressImplicit = 2,
};

struct PAGED_OBJECT<1920090443>
{
}; /* size: 0x0001 */

typedef struct _tlgTypeMapBase<unsigned int>
{
  union
  {
    /* 0x0000 */ const BOOL _tlgIsSimple;
    /* 0x0000 */ const unsigned char _tlgType0;
    /* 0x0000 */ const unsigned short _tlgType1;
  }; /* size: 0x0002 */
  /* 0x0002 */ char __PADDING__[4294967295];
} tlgTypeMapBase<unsigned int>, *PtlgTypeMapBase<unsigned int>; /* size: 0x0001 */

typedef struct _REFERENCE
{
  /* 0x0000 */ unsigned long SpinLock;
  /* 0x0004 */ unsigned short ReferenceCount;
  /* 0x0006 */ unsigned char Closing;
  /* 0x0007 */ char __PADDING__[1];
} REFERENCE, *PREFERENCE; /* size: 0x0008 */

typedef union _ULARGE_INTEGER
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned long LowPart;
      /* 0x0004 */ unsigned long HighPart;
    }; /* size: 0x0008 */
    struct
    {
      /* 0x0000 */ unsigned long LowPart;
      /* 0x0004 */ unsigned long HighPart;
    } /* size: 0x0008 */ u;
    /* 0x0000 */ unsigned __int64 QuadPart;
  }; /* size: 0x0008 */
} ULARGE_INTEGER, *PULARGE_INTEGER; /* size: 0x0008 */

typedef struct _KTIMER
{
  /* 0x0000 */ struct _DISPATCHER_HEADER Header;
  /* 0x0010 */ union _ULARGE_INTEGER DueTime;
  /* 0x0018 */ struct _LIST_ENTRY TimerListEntry;
  /* 0x0020 */ struct _KDPC* Dpc;
  /* 0x0024 */ unsigned long Period;
} KTIMER, *PKTIMER; /* size: 0x0028 */

typedef struct _KDPC
{
  union
  {
    /* 0x0000 */ unsigned long TargetInfoAsUlong;
    struct
    {
      /* 0x0000 */ unsigned char Type;
      /* 0x0001 */ unsigned char Importance;
      /* 0x0002 */ volatile unsigned short Number;
    }; /* size: 0x0004 */
  }; /* size: 0x0004 */
  /* 0x0004 */ struct _SINGLE_LIST_ENTRY DpcListEntry;
  /* 0x0008 */ unsigned long ProcessorHistory;
  /* 0x000c */ void* DeferredRoutine /* function */;
  /* 0x0010 */ void* DeferredContext;
  /* 0x0014 */ void* SystemArgument1;
  /* 0x0018 */ void* SystemArgument2;
  /* 0x001c */ void* DpcData;
} KDPC, *PKDPC; /* size: 0x0020 */

typedef struct _NDIS_TIMER
{
  /* 0x0000 */ struct _KTIMER Timer;
  /* 0x0028 */ struct _KDPC Dpc;
} NDIS_TIMER, *PNDIS_TIMER; /* size: 0x0048 */

typedef struct _NDIS_PM_WAKE_UP_CAPABILITIES
{
  /* 0x0000 */ enum _NDIS_DEVICE_POWER_STATE MinMagicPacketWakeUp;
  /* 0x0004 */ enum _NDIS_DEVICE_POWER_STATE MinPatternWakeUp;
  /* 0x0008 */ enum _NDIS_DEVICE_POWER_STATE MinLinkChangeWakeUp;
} NDIS_PM_WAKE_UP_CAPABILITIES, *PNDIS_PM_WAKE_UP_CAPABILITIES; /* size: 0x000c */

typedef struct _NDIS_PNP_CAPABILITIES
{
  /* 0x0000 */ unsigned long Flags;
  /* 0x0004 */ struct _NDIS_PM_WAKE_UP_CAPABILITIES WakeUpCapabilities;
} NDIS_PNP_CAPABILITIES, *PNDIS_PNP_CAPABILITIES; /* size: 0x0010 */

typedef struct _NDIS_PM_CAPABILITIES
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ unsigned long SupportedWoLPacketPatterns;
  /* 0x000c */ unsigned long NumTotalWoLPatterns;
  /* 0x0010 */ unsigned long MaxWoLPatternSize;
  /* 0x0014 */ unsigned long MaxWoLPatternOffset;
  /* 0x0018 */ unsigned long MaxWoLPacketSaveBuffer;
  /* 0x001c */ unsigned long SupportedProtocolOffloads;
  /* 0x0020 */ unsigned long NumArpOffloadIPv4Addresses;
  /* 0x0024 */ unsigned long NumNSOffloadIPv6Addresses;
  /* 0x0028 */ enum _NDIS_DEVICE_POWER_STATE MinMagicPacketWakeUp;
  /* 0x002c */ enum _NDIS_DEVICE_POWER_STATE MinPatternWakeUp;
  /* 0x0030 */ enum _NDIS_DEVICE_POWER_STATE MinLinkChangeWakeUp;
  /* 0x0034 */ unsigned long SupportedWakeUpEvents;
  /* 0x0038 */ unsigned long MediaSpecificWakeUpEvents;
} NDIS_PM_CAPABILITIES, *PNDIS_PM_CAPABILITIES; /* size: 0x003c */

typedef struct _NDIS_PM_PARAMETERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long EnabledWoLPacketPatterns;
  /* 0x0008 */ unsigned long EnabledProtocolOffloads;
  /* 0x000c */ unsigned long WakeUpFlags;
  /* 0x0010 */ unsigned long MediaSpecificWakeUpEvents;
} NDIS_PM_PARAMETERS, *PNDIS_PM_PARAMETERS; /* size: 0x0014 */

typedef struct _DEVICE_CAPABILITIES
{
  /* 0x0000 */ unsigned short Size;
  /* 0x0002 */ unsigned short Version;
  struct /* bitfield */
  {
    /* 0x0004 */ unsigned long DeviceD1 : 1; /* bit position: 0 */
    /* 0x0004 */ unsigned long DeviceD2 : 1; /* bit position: 1 */
    /* 0x0004 */ unsigned long LockSupported : 1; /* bit position: 2 */
    /* 0x0004 */ unsigned long EjectSupported : 1; /* bit position: 3 */
    /* 0x0004 */ unsigned long Removable : 1; /* bit position: 4 */
    /* 0x0004 */ unsigned long DockDevice : 1; /* bit position: 5 */
    /* 0x0004 */ unsigned long UniqueID : 1; /* bit position: 6 */
    /* 0x0004 */ unsigned long SilentInstall : 1; /* bit position: 7 */
    /* 0x0004 */ unsigned long RawDeviceOK : 1; /* bit position: 8 */
    /* 0x0004 */ unsigned long SurpriseRemovalOK : 1; /* bit position: 9 */
    /* 0x0004 */ unsigned long WakeFromD0 : 1; /* bit position: 10 */
    /* 0x0004 */ unsigned long WakeFromD1 : 1; /* bit position: 11 */
    /* 0x0004 */ unsigned long WakeFromD2 : 1; /* bit position: 12 */
    /* 0x0004 */ unsigned long WakeFromD3 : 1; /* bit position: 13 */
    /* 0x0004 */ unsigned long HardwareDisabled : 1; /* bit position: 14 */
    /* 0x0004 */ unsigned long NonDynamic : 1; /* bit position: 15 */
    /* 0x0004 */ unsigned long WarmEjectSupported : 1; /* bit position: 16 */
    /* 0x0004 */ unsigned long NoDisplayInUI : 1; /* bit position: 17 */
    /* 0x0004 */ unsigned long Reserved1 : 1; /* bit position: 18 */
    /* 0x0004 */ unsigned long WakeFromInterrupt : 1; /* bit position: 19 */
    /* 0x0004 */ unsigned long SecureDevice : 1; /* bit position: 20 */
    /* 0x0004 */ unsigned long ChildOfVgaEnabledBridge : 1; /* bit position: 21 */
    /* 0x0004 */ unsigned long DecodeIoOnBoot : 1; /* bit position: 22 */
    /* 0x0004 */ unsigned long Reserved : 9; /* bit position: 23 */
  }; /* bitfield */
  /* 0x0008 */ unsigned long Address;
  /* 0x000c */ unsigned long UINumber;
  /* 0x0010 */ enum _DEVICE_POWER_STATE DeviceState[7];
  /* 0x002c */ enum _SYSTEM_POWER_STATE SystemWake;
  /* 0x0030 */ enum _DEVICE_POWER_STATE DeviceWake;
  /* 0x0034 */ unsigned long D1Latency;
  /* 0x0038 */ unsigned long D2Latency;
  /* 0x003c */ unsigned long D3Latency;
} DEVICE_CAPABILITIES, *PDEVICE_CAPABILITIES; /* size: 0x0040 */

typedef enum _NDIS_WORK_ITEM_TYPE
{
  NdisWorkItemRequest = 0,
  NdisWorkItemSend = 1,
  NdisWorkItemReturnPackets = 2,
  NdisWorkItemResetRequested = 3,
  NdisWorkItemResetInProgress = 4,
  NdisWorkItemReserved = 5,
  NdisWorkItemMiniportCallback = 6,
  NdisMaxWorkItems = 7,
} NDIS_WORK_ITEM_TYPE, *PNDIS_WORK_ITEM_TYPE;

typedef struct _NDIS_MINIPORT_WORK_ITEM
{
  /* 0x0000 */ struct _SINGLE_LIST_ENTRY Link;
  /* 0x0004 */ enum _NDIS_WORK_ITEM_TYPE WorkItemType;
  /* 0x0008 */ void* WorkItemContext;
} NDIS_MINIPORT_WORK_ITEM, *PNDIS_MINIPORT_WORK_ITEM; /* size: 0x000c */

typedef struct _KBUGCHECK_CALLBACK_RECORD
{
  /* 0x0000 */ struct _LIST_ENTRY Entry;
  /* 0x0008 */ void* CallbackRoutine /* function */;
  /* 0x000c */ void* Buffer;
  /* 0x0010 */ unsigned long Length;
  /* 0x0014 */ unsigned char* Component;
  /* 0x0018 */ unsigned long Checksum;
  /* 0x001c */ unsigned char State;
  /* 0x001d */ char __PADDING__[3];
} KBUGCHECK_CALLBACK_RECORD, *PKBUGCHECK_CALLBACK_RECORD; /* size: 0x0020 */

typedef struct _NDIS_RECEIVE_SCALE_CAPABILITIES
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long CapabilitiesFlags;
  /* 0x0008 */ unsigned long NumberOfInterruptMessages;
  /* 0x000c */ unsigned long NumberOfReceiveQueues;
  /* 0x0010 */ unsigned short NumberOfIndirectionTableEntries;
  /* 0x0012 */ char __PADDING__[2];
} NDIS_RECEIVE_SCALE_CAPABILITIES, *PNDIS_RECEIVE_SCALE_CAPABILITIES; /* size: 0x0014 */

typedef struct _NDIS_WORK_ITEM
{
  /* 0x0000 */ void* Context;
  /* 0x0004 */ void* Routine /* function */;
  /* 0x0008 */ unsigned char WrapperReserved[32];
} NDIS_WORK_ITEM, *PNDIS_WORK_ITEM; /* size: 0x0028 */

typedef struct _NDIS_RESTART_GENERAL_ATTRIBUTES
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long MtuSize;
  /* 0x0008 */ unsigned __int64 MaxXmitLinkSpeed;
  /* 0x0010 */ unsigned __int64 MaxRcvLinkSpeed;
  /* 0x0018 */ unsigned long LookaheadSize;
  /* 0x001c */ unsigned long MacOptions;
  /* 0x0020 */ unsigned long SupportedPacketFilters;
  /* 0x0024 */ unsigned long MaxMulticastListSize;
  /* 0x0028 */ struct _NDIS_RECEIVE_SCALE_CAPABILITIES* RecvScaleCapabilities;
  /* 0x002c */ enum _NET_IF_ACCESS_TYPE AccessType;
  /* 0x0030 */ unsigned long Flags;
  /* 0x0034 */ enum _NET_IF_CONNECTION_TYPE ConnectionType;
  /* 0x0038 */ unsigned long SupportedStatistics;
  /* 0x003c */ unsigned long DataBackFillSize;
  /* 0x0040 */ unsigned long ContextBackFillSize;
  /* 0x0044 */ unsigned long* SupportedOidList;
  /* 0x0048 */ unsigned long SupportedOidListLength;
  /* 0x004c */ unsigned long MaxLookaheadSizeAccessed;
} NDIS_RESTART_GENERAL_ATTRIBUTES, *PNDIS_RESTART_GENERAL_ATTRIBUTES; /* size: 0x0050 */

typedef struct _NDIS_PCI_DEVICE_CUSTOM_PROPERTIES
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned int DeviceType;
  /* 0x0008 */ unsigned int CurrentSpeedAndMode;
  /* 0x000c */ unsigned int CurrentPayloadSize;
  /* 0x0010 */ unsigned int MaxPayloadSize;
  /* 0x0014 */ unsigned int MaxReadRequestSize;
  /* 0x0018 */ unsigned int CurrentLinkSpeed;
  /* 0x001c */ unsigned int CurrentLinkWidth;
  /* 0x0020 */ unsigned int MaxLinkSpeed;
  /* 0x0024 */ unsigned int MaxLinkWidth;
  /* 0x0028 */ unsigned int PciExpressVersion;
  /* 0x002c */ unsigned int InterruptType;
  /* 0x0030 */ unsigned int MaxInterruptMessages;
} NDIS_PCI_DEVICE_CUSTOM_PROPERTIES, *PNDIS_PCI_DEVICE_CUSTOM_PROPERTIES; /* size: 0x0034 */

typedef struct _PCI_CAPABILITIES_HEADER
{
  /* 0x0000 */ unsigned char CapabilityID;
  /* 0x0001 */ unsigned char Next;
} PCI_CAPABILITIES_HEADER, *PPCI_CAPABILITIES_HEADER; /* size: 0x0002 */

typedef union _PCI_MSI_MESSAGE_CONTROL
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned short MSIEnable : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned short MultipleMessageCapable : 3; /* bit position: 1 */
      /* 0x0000 */ unsigned short MultipleMessageEnable : 3; /* bit position: 4 */
      /* 0x0000 */ unsigned short CapableOf64Bits : 1; /* bit position: 7 */
      /* 0x0000 */ unsigned short PerVectorMaskCapable : 1; /* bit position: 8 */
      /* 0x0000 */ unsigned short Reserved : 7; /* bit position: 9 */
    }; /* bitfield */
    /* 0x0000 */ unsigned short AsUSHORT;
  }; /* size: 0x0002 */
} PCI_MSI_MESSAGE_CONTROL, *PPCI_MSI_MESSAGE_CONTROL; /* size: 0x0002 */

struct PCI_MSI_CAPABILITY
{
  /* 0x0000 */ struct _PCI_CAPABILITIES_HEADER Header;
  /* 0x0002 */ union _PCI_MSI_MESSAGE_CONTROL MessageControl;
  union
  {
    union
    {
      struct
      {
        struct /* bitfield */
        {
          /* 0x0004 */ unsigned long Reserved : 2; /* bit position: 0 */
          /* 0x0004 */ unsigned long Address : 30; /* bit position: 2 */
        }; /* bitfield */
      } /* size: 0x0004 */ Register;
      /* 0x0004 */ unsigned long Raw;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ MessageAddressLower;
  union
  {
    struct
    {
      /* 0x0008 */ unsigned short MessageData;
      /* 0x000a */ unsigned short Reserved;
      /* 0x000c */ unsigned long MaskBits;
      /* 0x0010 */ unsigned long PendingBits;
    } /* size: 0x000c */ Option32Bit;
    struct
    {
      /* 0x0008 */ unsigned long MessageAddressUpper;
      /* 0x000c */ unsigned short MessageData;
      /* 0x000e */ unsigned short Reserved;
      /* 0x0010 */ unsigned long MaskBits;
      /* 0x0014 */ unsigned long PendingBits;
    } /* size: 0x0010 */ Option64Bit;
  }; /* size: 0x0010 */
}; /* size: 0x0018 */

struct MSIX_TABLE_POINTER
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long BaseIndexRegister : 3; /* bit position: 0 */
      /* 0x0000 */ unsigned long Reserved : 29; /* bit position: 3 */
    }; /* bitfield */
    /* 0x0000 */ unsigned long TableOffset;
  }; /* size: 0x0004 */
}; /* size: 0x0004 */

struct PCI_MSIX_CAPABILITY
{
  /* 0x0000 */ struct _PCI_CAPABILITIES_HEADER Header;
  struct
  {
    struct /* bitfield */
    {
      /* 0x0002 */ unsigned short TableSize : 11; /* bit position: 0 */
      /* 0x0002 */ unsigned short Reserved : 3; /* bit position: 11 */
      /* 0x0002 */ unsigned short FunctionMask : 1; /* bit position: 14 */
      /* 0x0002 */ unsigned short MSIXEnable : 1; /* bit position: 15 */
    }; /* bitfield */
  } /* size: 0x0002 */ MessageControl;
  /* 0x0004 */ struct MSIX_TABLE_POINTER MessageTable;
  /* 0x0008 */ struct MSIX_TABLE_POINTER PBATable;
}; /* size: 0x000c */

typedef struct _NDIS_MINIPORT_OFFLOAD_REG
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long IPv4XSumTxDisabled : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned long IPv4XSumRxDisabled : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned long TCPv4XSumTxDisabled : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned long TCPv4XSumRxDisabled : 1; /* bit position: 3 */
      /* 0x0000 */ unsigned long UDPv4XSumTxDisabled : 1; /* bit position: 4 */
      /* 0x0000 */ unsigned long UDPv4XSumRxDisabled : 1; /* bit position: 5 */
      /* 0x0000 */ unsigned long TCPv6XSumTxDisabled : 1; /* bit position: 6 */
      /* 0x0000 */ unsigned long TCPv6XSumRxDisabled : 1; /* bit position: 7 */
      /* 0x0000 */ unsigned long UDPv6XSumTxDisabled : 1; /* bit position: 8 */
      /* 0x0000 */ unsigned long UDPv6XSumRxDisabled : 1; /* bit position: 9 */
      /* 0x0000 */ unsigned long LsoV1IPv4Disabled : 1; /* bit position: 10 */
      /* 0x0000 */ unsigned long LsoV2IPv4Disabled : 1; /* bit position: 11 */
      /* 0x0000 */ unsigned long LsoV2IPv6Disabled : 1; /* bit position: 12 */
      /* 0x0000 */ unsigned long IPsecAHDisabled : 1; /* bit position: 13 */
      /* 0x0000 */ unsigned long IPsecESPDisabled : 1; /* bit position: 14 */
      /* 0x0000 */ unsigned long TCPv4ConnectionOffloadDisabled : 1; /* bit position: 15 */
      /* 0x0000 */ unsigned long TCPv6ConnectionOffloadDisabled : 1; /* bit position: 16 */
      /* 0x0000 */ unsigned long ReadRegistry : 1; /* bit position: 17 */
      /* 0x0000 */ unsigned long IPsecV2AHDisabled : 1; /* bit position: 18 */
      /* 0x0000 */ unsigned long IPsecV2ESPDisabled : 1; /* bit position: 19 */
      /* 0x0000 */ unsigned long IPsecV2IPv4AHDisabled : 1; /* bit position: 20 */
      /* 0x0000 */ unsigned long IPsecV2IPv4ESPDisabled : 1; /* bit position: 21 */
      /* 0x0000 */ unsigned long IPSecV2IPv6Disabled : 1; /* bit position: 22 */
      /* 0x0000 */ unsigned long RscIPv4Disabled : 1; /* bit position: 23 */
      /* 0x0000 */ unsigned long RscIPv6Disabled : 1; /* bit position: 24 */
      /* 0x0000 */ unsigned long EncapsulatedPacketTaskOffloadDisabled : 1; /* bit position: 25 */
      /* 0x0000 */ unsigned long EncapsulatedPacketTaskOffloadNvgreDisabled : 1; /* bit position: 26 */
      /* 0x0000 */ unsigned long EncapsulatedPacketTaskOffloadVxlanDisabled : 1; /* bit position: 27 */
      /* 0x0000 */ unsigned long UsoIPv4Disabled : 1; /* bit position: 28 */
      /* 0x0000 */ unsigned long UsoIPv6Disabled : 1; /* bit position: 29 */
    }; /* bitfield */
    /* 0x0000 */ unsigned long Value;
  }; /* size: 0x0004 */
} NDIS_MINIPORT_OFFLOAD_REG, *PNDIS_MINIPORT_OFFLOAD_REG; /* size: 0x0004 */

typedef struct _NDIS_EVENT
{
  /* 0x0000 */ struct _KEVENT Event;
} NDIS_EVENT, *PNDIS_EVENT; /* size: 0x0010 */

typedef struct _NDIS_PM_ADMIN_CONFIG
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long WakeOnPattern : 2; /* bit position: 0 */
      /* 0x0000 */ unsigned long WakeOnMagicPacket : 2; /* bit position: 2 */
      /* 0x0000 */ unsigned long DeviceSleepOnDisconnect : 2; /* bit position: 4 */
      /* 0x0000 */ unsigned long PMARPOffload : 2; /* bit position: 6 */
      /* 0x0000 */ unsigned long PMNSOffload : 2; /* bit position: 8 */
      /* 0x0000 */ unsigned long PMWiFiRekeyOffload : 2; /* bit position: 10 */
      /* 0x0000 */ unsigned long SelectiveSuspend : 2; /* bit position: 12 */
      /* 0x0000 */ unsigned long NicAutoPowerSaver : 2; /* bit position: 14 */
    }; /* bitfield */
    /* 0x0000 */ unsigned long Value;
  }; /* size: 0x0004 */
} NDIS_PM_ADMIN_CONFIG, *PNDIS_PM_ADMIN_CONFIG; /* size: 0x0004 */

typedef struct _KSEMAPHORE
{
  /* 0x0000 */ struct _DISPATCHER_HEADER Header;
  /* 0x0010 */ long Limit;
} KSEMAPHORE, *PKSEMAPHORE; /* size: 0x0014 */

typedef struct _IO_REMOVE_LOCK_COMMON_BLOCK
{
  /* 0x0000 */ unsigned char Removed;
  /* 0x0001 */ unsigned char Reserved[3];
  /* 0x0004 */ long IoCount;
  /* 0x0008 */ struct _KEVENT RemoveEvent;
} IO_REMOVE_LOCK_COMMON_BLOCK, *PIO_REMOVE_LOCK_COMMON_BLOCK; /* size: 0x0018 */

typedef struct _IO_REMOVE_LOCK
{
  /* 0x0000 */ struct _IO_REMOVE_LOCK_COMMON_BLOCK Common;
} IO_REMOVE_LOCK, *PIO_REMOVE_LOCK; /* size: 0x0018 */

typedef struct _ULONG_REFERENCE
{
  /* 0x0000 */ unsigned long SpinLock;
  /* 0x0004 */ unsigned long ReferenceCount;
  /* 0x0008 */ unsigned char Closing;
  /* 0x0009 */ char __PADDING__[3];
} ULONG_REFERENCE, *PULONG_REFERENCE; /* size: 0x000c */

typedef struct _NDIS_D0_SIGNAL_WORK_ITEM
{
  /* 0x0000 */ struct _NDIS_WORK_ITEM WorkItem;
  /* 0x0028 */ long CompletionStatus;
  /* 0x002c */ unsigned char Scheduled;
  /* 0x002d */ char __PADDING__[3];
} NDIS_D0_SIGNAL_WORK_ITEM, *PNDIS_D0_SIGNAL_WORK_ITEM; /* size: 0x0030 */

typedef struct _VPCI_INVALIDATE_BLOCK_OUTPUT
{
  /* 0x0000 */ unsigned __int64 BlockMask;
} VPCI_INVALIDATE_BLOCK_OUTPUT, *PVPCI_INVALIDATE_BLOCK_OUTPUT; /* size: 0x0008 */

class Rtl::KArray<wistd::unique_ptr<NDIS_BIND_PROTOCOL_LINK,wistd::default_delete<NDIS_BIND_PROTOCOL_LINK> >,1>
{
  /* 0x0000 */ unsigned long m_bufferSize;
  /* 0x0004 */ unsigned long m_numElements;
  /* 0x0008 */ class wistd::unique_ptr<NDIS_BIND_PROTOCOL_LINK,wistd::default_delete<NDIS_BIND_PROTOCOL_LINK> >* _p;
}; /* size: 0x000c */

class Rtl::KArray<wistd::unique_ptr<NDIS_BIND_FILTER_LINK,wistd::default_delete<NDIS_BIND_FILTER_LINK> >,1>
{
  /* 0x0000 */ unsigned long m_bufferSize;
  /* 0x0004 */ unsigned long m_numElements;
  /* 0x0008 */ class wistd::unique_ptr<NDIS_BIND_FILTER_LINK,wistd::default_delete<NDIS_BIND_FILTER_LINK> >* _p;
}; /* size: 0x000c */

class Rtl::KArray<void *,1>
{
  /* 0x0000 */ unsigned long m_bufferSize;
  /* 0x0004 */ unsigned long m_numElements;
  /* 0x0008 */ void** _p;
}; /* size: 0x000c */

class Ndis::BindState
{
  /* 0x0000 */ struct _NDIS_MINIPORT_BLOCK* Miniport;
  /* 0x0004 */ BOOL AllowBindDespiteMandatory;
  /* 0x0005 */ BOOL PretendBindingActive;
  /* 0x0006 */ BOOL NeedsPauseAction;
  /* 0x0007 */ char Padding_16;
  /* 0x0008 */ void* m_AdditionalContext;
  /* 0x000c */ int m_LastErrorCode;
  /* 0x0010 */ unsigned long m_bindSources;
  /* 0x0014 */ unsigned long m_unbindReasons;
  /* 0x0018 */ unsigned long m_pauseReasons;
  /* 0x001c */ enum PAUSE_OR_RESTART m_actualPauseState;
  /* 0x0020 */ class Rtl::KArray<void *,1> m_bindContext;
}; /* size: 0x002c */

struct Ndis::BindStack
{
  /* 0x0000 */ class Rtl::KArray<wistd::unique_ptr<NDIS_BIND_PROTOCOL_LINK,wistd::default_delete<NDIS_BIND_PROTOCOL_LINK> >,1> Protocols;
  /* 0x000c */ class Rtl::KArray<wistd::unique_ptr<NDIS_BIND_FILTER_LINK,wistd::default_delete<NDIS_BIND_FILTER_LINK> >,1> Filters;
  /* 0x0018 */ class Ndis::BindState Miniport;
  /* 0x0044 */ unsigned long ChangeEpoch;
}; /* size: 0x0048 */

class KPushLock
{
}; /* size: 0x0004 */

class KWaitEvent
{
}; /* size: 0x0010 */

class KWorkItem<Ndis::BindEngine>
{
}; /* size: 0x0018 */

struct Ndis::BindEngine
{
  union
  {
    struct
    {
      /* 0x0000 */ struct _NDIS_MINIPORT_BLOCK* m_miniport;
      /* 0x0004 */ struct _KTHREAD* m_bindThread;
      /* 0x0008 */ struct NDIS_BIND_LINK_BASE* m_currentOperation;
      /* 0x000c */ class KPushLock m_lock;
      /* 0x0010 */ class KWaitEvent m_bindCompleteEvent;
      /* 0x0020 */ class KWorkItem<Ndis::BindEngine> m_asyncBindWorkItem;
      /* 0x0038 */ BOOL m_isDirty;
      /* 0x0039 */ char Padding_17[3];
      /* 0x003c */ class KWaitEvent* m_removeReadyEvent;
    }; /* size: 0x003d */
    struct
    {
      /* 0x0000 */ unsigned long s_NumBindOperationsInProgress;
      /* 0x0004 */ long __PADDING__[15];
    }; /* size: 0x0040 */
  }; /* size: 0x0040 */
}; /* size: 0x0040 */

class Rtl::KNeutralLock<enum NDIS_MINIPORT_POLICY_OWNER>
{
  union
  {
    /* 0x0000 */ enum NDIS_MINIPORT_POLICY_OWNER UnownedValue;
    /* 0x0000 */ enum NDIS_MINIPORT_POLICY_OWNER m_owner;
  }; /* size: 0x0004 */
  /* 0x0004 */ class KPushLock m_lock;
  /* 0x0008 */ class KWaitEvent m_isUnowned;
}; /* size: 0x0018 */

typedef struct _IF_PHYSICAL_ADDRESS_LH
{
  /* 0x0000 */ unsigned short Length;
  /* 0x0002 */ unsigned char Address[32];
} IF_PHYSICAL_ADDRESS_LH, *PIF_PHYSICAL_ADDRESS_LH; /* size: 0x0022 */

struct WORKITEM_WITH_IRP
{
  /* 0x0000 */ struct _WORK_QUEUE_ITEM Workitem;
  /* 0x0010 */ struct _IRP* Irp;
}; /* size: 0x0014 */

class wil::unique_any_t<wil::details::unique_storage<wil::details::resource_policy<NDISWATCHDOG__ *,void (__stdcall*)(NDISWATCHDOG__ *),&ndisFreeWatchdog,wistd::integral_constant<unsigned int,1>,NDISWATCHDOG__ *,int,-1,std::nullptr_t> > >
{
}; /* size: 0x0004 */

typedef struct _PKTMON_COMPONENT_CONTEXT
{
  /* 0x0000 */ void* CompHandle;
  /* 0x0004 */ enum _PKTMON_PACKET_TYPE PacketType;
  struct /* bitfield */
  {
    /* 0x0008 */ int FlowEnabled : 1; /* bit position: 0 */
    /* 0x0008 */ int DropEnabled : 1; /* bit position: 1 */
  }; /* bitfield */
} PKTMON_COMPONENT_CONTEXT, *PPKTMON_COMPONENT_CONTEXT; /* size: 0x000c */

typedef struct _PKTMON_EDGE_CONTEXT
{
  /* 0x0000 */ void* EdgeHandle;
  /* 0x0004 */ struct _PKTMON_COMPONENT_CONTEXT* CompContext;
  /* 0x0008 */ enum _PKTMON_PACKET_TYPE PacketType;
} PKTMON_EDGE_CONTEXT, *PPKTMON_EDGE_CONTEXT; /* size: 0x000c */

typedef struct _NDIS_MINIPORT_BLOCK
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ struct _NDIS_MINIPORT_BLOCK* NextMiniport;
  /* 0x0008 */ struct _NDIS_MINIPORT_BLOCK* BaseMiniport;
  /* 0x000c */ void* MiniportAdapterContext;
  union
  {
    /* 0x0010 */ struct _UNICODE_STRING Reserved4;
    struct
    {
      /* 0x0010 */ unsigned char MajorNdisVersion;
      /* 0x0011 */ unsigned char MinorNdisVersion;
      /* 0x0012 */ char Padding_18[2];
      /* 0x0014 */ struct _NDIS_PCW_DATA_BLOCK* PcwDataBlock;
    }; /* size: 0x0006 */
  }; /* size: 0x0008 */
  union
  {
    /* 0x0018 */ long PcwDatapathEventMask;
    /* 0x0018 */ void* Reserved28;
  }; /* size: 0x0004 */
  /* 0x001c */ struct _NDIS_OPEN_BLOCK* OpenQueue;
  /* 0x0020 */ struct _REFERENCE ShortRef;
  union
  {
    /* 0x0028 */ long PcwDatapathCycleMask;
    /* 0x0028 */ void* Reserved29;
  }; /* size: 0x0004 */
  /* 0x002c */ unsigned char LinkStateIndicationFlags;
  /* 0x002d */ unsigned char LockAcquired;
  /* 0x002e */ unsigned char PmodeOpens;
  /* 0x002f */ unsigned char LoopbackOpens;
  /* 0x0030 */ unsigned long Lock;
  /* 0x0034 */ void* Reserved25;
  /* 0x0038 */ struct _NDIS_MINIPORT_INTERRUPT* Interrupt;
  /* 0x003c */ unsigned long Flags;
  /* 0x0040 */ unsigned long PnPFlags;
  /* 0x0044 */ struct _LIST_ENTRY PacketList;
  /* 0x004c */ struct _NDIS_PACKET* FirstPendingPacket;
  /* 0x0050 */ struct _NDIS_PACKET* ReturnPacketsQueue;
  /* 0x0054 */ unsigned long RequestBuffer;
  /* 0x0058 */ void* Reserved26;
  /* 0x005c */ struct _NDIS_MINIPORT_BLOCK* PrimaryMiniport;
  /* 0x0060 */ void* NextCancelSendNetBufferListsHandler /* function */;
  /* 0x0064 */ void* OidContext;
  /* 0x0068 */ unsigned long SupportedOidListLength;
  /* 0x006c */ struct _CM_RESOURCE_LIST* Resources;
  /* 0x0070 */ struct _NDIS_TIMER WakeUpDpcTimer;
  union
  {
    /* 0x00b8 */ struct _UNICODE_STRING Reserved20;
    struct
    {
      /* 0x00b8 */ enum _NET_IF_MEDIA_CONNECT_STATE MiniportMediaConnectState;
      /* 0x00bc */ enum _NET_IF_MEDIA_DUPLEX_STATE MiniportMediaDuplexState;
    }; /* size: 0x0008 */
  }; /* size: 0x0008 */
  /* 0x00c0 */ struct _UNICODE_STRING SymbolicLinkName;
  /* 0x00c8 */ unsigned long CheckForHangSeconds;
  /* 0x00cc */ unsigned short CFHangTicks;
  /* 0x00ce */ unsigned short CFHangCurrentTick;
  /* 0x00d0 */ int ResetStatus;
  /* 0x00d4 */ struct _NDIS_OPEN_BLOCK* ResetOpen;
  union
  {
    /* 0x00d8 */ struct _X_FILTER* EthDB;
    /* 0x00d8 */ struct _X_FILTER* NullDB;
  }; /* size: 0x0004 */
  /* 0x00dc */ void* Unused1;
  /* 0x00e0 */ void* Unused2;
  /* 0x00e4 */ void* Unused3;
  /* 0x00e8 */ void* PacketIndicateHandler /* function */;
  /* 0x00ec */ void* SendCompleteHandler /* function */;
  /* 0x00f0 */ void* SendResourcesHandler /* function */;
  /* 0x00f4 */ void* ResetCompleteHandler /* function */;
  /* 0x00f8 */ enum _NDIS_MEDIUM MediaType;
  /* 0x00fc */ unsigned long AutoNegotiationFlags;
  /* 0x0100 */ enum _NDIS_INTERFACE_TYPE Reserved5;
  /* 0x0104 */ enum _NDIS_INTERFACE_TYPE AdapterType;
  union
  {
    /* 0x0108 */ struct _DEVICE_OBJECT* Reserved6;
    /* 0x0108 */ enum _NET_IF_MEDIA_CONNECT_STATE MediaConnectState;
  }; /* size: 0x0004 */
  union
  {
    /* 0x010c */ struct _DEVICE_OBJECT* Reserved7;
    /* 0x010c */ enum _NET_IF_MEDIA_DUPLEX_STATE MediaDuplexState;
  }; /* size: 0x0004 */
  /* 0x0110 */ unsigned long* SupportedOidList;
  /* 0x0114 */ struct _NDIS_SG_DMA_BLOCK* MiniportSGDmaBlock;
  /* 0x0118 */ struct _NDIS_AF_LIST* CallMgrAfList;
  /* 0x011c */ void* MiniportThread;
  /* 0x0120 */ void* SetInfoBuf;
  /* 0x0124 */ unsigned short SetInfoBufLen;
  /* 0x0126 */ unsigned short MaxSendPackets;
  /* 0x0128 */ int FakeStatus;
  union
  {
    /* 0x012c */ void* Reserved24;
    /* 0x012c */ void* GlobalTriageBlock;
  }; /* size: 0x0004 */
  /* 0x0130 */ struct _NDIS_RECEIVE_SCALE_PARAMETERS* CombinedNdisRSSParameters;
  union
  {
    /* 0x0134 */ struct _NDIS_MINIPORT_TIMER* TimerQueue;
    /* 0x0134 */ struct _NDIS_TIMER_ENTRY* TimerObjectQueue;
  }; /* size: 0x0004 */
  /* 0x0138 */ unsigned int MacOptions;
  /* 0x013c */ struct _NDIS_REQUEST* PendingRequest;
  /* 0x0140 */ unsigned int MaximumLongAddresses;
  /* 0x0144 */ unsigned int Reserved27;
  /* 0x0148 */ unsigned int MiniportCurrentLookahead;
  /* 0x014c */ unsigned int MiniportMaximumLookahead;
  union
  {
    /* 0x0150 */ unsigned long Reserved1;
    /* 0x0150 */ struct _X_FILTER* NullMediaFilter;
  }; /* size: 0x0004 */
  /* 0x0154 */ void* DisableInterruptHandler /* function */;
  /* 0x0158 */ void* EnableInterruptHandler /* function */;
  /* 0x015c */ void* SendPacketsHandler /* function */;
  /* 0x0160 */ void* DeferredSendHandler /* function */;
  /* 0x0164 */ void* EthRxIndicateHandler /* function */;
  /* 0x0168 */ void* Reserved30;
  /* 0x016c */ void* NextSendNetBufferListsHandler /* function */;
  /* 0x0170 */ void* EthRxCompleteHandler /* function */;
  /* 0x0174 */ void* Reserved31;
  /* 0x0178 */ void* SavedNextSendNetBufferListsHandler /* function */;
  /* 0x017c */ void* StatusHandler /* function */;
  /* 0x0180 */ void* StatusCompleteHandler /* function */;
  /* 0x0184 */ void* TDCompleteHandler /* function */;
  /* 0x0188 */ void* QueryCompleteHandler /* function */;
  /* 0x018c */ void* SetCompleteHandler /* function */;
  /* 0x0190 */ void* WanSendCompleteHandler /* function */;
  /* 0x0194 */ void* WanRcvHandler /* function */;
  /* 0x0198 */ void* WanRcvCompleteHandler /* function */;
  /* 0x019c */ void* SendNetBufferListsCompleteHandler /* function */;
  /* 0x01a0 */ struct _KEVENT* PnPEventLockEvent;
  /* 0x01a4 */ struct _NDIS_OBJECT_HEADER* MediaSpecificAttributes;
  /* 0x01a8 */ struct _IRP* PendingQueryPowerIrp;
  /* 0x01ac */ struct _NDIS_INTERRUPT_BLOCK* InterruptEx;
  /* 0x01b0 */ unsigned __int64 XmitLinkSpeed;
  /* 0x01b8 */ unsigned __int64 RcvLinkSpeed;
  /* 0x01c0 */ enum _NDIS_SUPPORTED_PAUSE_FUNCTIONS PauseFunctions;
  /* 0x01c4 */ enum _NDIS_SUPPORTED_PAUSE_FUNCTIONS MiniportPauseFunctions;
  /* 0x01c8 */ unsigned long MiniportAutoNegotiationFlags;
  /* 0x01cc */ struct _SINGLE_LIST_ENTRY WorkQueue[7];
  /* 0x01e8 */ struct _SINGLE_LIST_ENTRY SingleWorkItems[6];
  /* 0x0200 */ unsigned char SendFlags;
  /* 0x0201 */ unsigned char MP6SupportPM;
  /* 0x0202 */ unsigned char XState;
  /* 0x0203 */ char Padding_19;
  /* 0x0204 */ struct _NDIS_LOG* Log;
  /* 0x0208 */ struct _CM_RESOURCE_LIST* AllocatedResources;
  /* 0x020c */ struct _CM_RESOURCE_LIST* AllocatedResourcesTranslated;
  /* 0x0210 */ struct _SINGLE_LIST_ENTRY PatternList;
  /* 0x0214 */ struct _SINGLE_LIST_ENTRY WOLPatternList;
  /* 0x0218 */ struct _SINGLE_LIST_ENTRY PMProtocolOffloadList;
  /* 0x021c */ struct _NDIS_PNP_CAPABILITIES PMCapabilities61;
  /* 0x022c */ struct _NDIS_PM_CAPABILITIES PMHardwareCapabilities;
  /* 0x0268 */ struct _NDIS_PM_CAPABILITIES PMAdvertisedCapabilities;
  /* 0x02a4 */ struct _NDIS_PM_PARAMETERS PMCurrentParameters;
  /* 0x02b8 */ struct _NDIS_PM_PARAMETERS PMWmiParameters;
  /* 0x02cc */ struct _DEVICE_CAPABILITIES OriginalDeviceCaps;
  /* 0x030c */ struct _DEVICE_CAPABILITIES DeviceCaps;
  /* 0x034c */ unsigned char S0WakeupSupported;
  /* 0x034d */ char Padding_20[3];
  /* 0x0350 */ unsigned long WakeUpEnable;
  /* 0x0354 */ struct _IRP* WaitWakeIrp;
  /* 0x0358 */ struct _KEVENT WaitWakeIrpCompleted;
  /* 0x0368 */ BOOL WaitWakeIoCompletionRoutineRan;
  /* 0x0369 */ BOOL WaitWakeCancelInProgress;
  /* 0x036a */ BOOL WaitWakeCancelAttempted;
  /* 0x036b */ char Padding_21;
  /* 0x036c */ enum _SYSTEM_POWER_STATE WaitWakeSystemState;
  /* 0x0370 */ union _LARGE_INTEGER VcIndex;
  /* 0x0378 */ unsigned long VcCountLock;
  /* 0x037c */ struct _LIST_ENTRY WmiEnabledVcs;
  /* 0x0384 */ struct _NDIS_GUID* pNdisGuidMap;
  /* 0x0388 */ struct _NDIS_GUID* pCustomGuidMap;
  /* 0x038c */ unsigned short VcCount;
  /* 0x038e */ unsigned short cNdisGuidMap;
  /* 0x0390 */ unsigned short cCustomGuidMap;
  /* 0x0392 */ char Padding_22[6];
  /* 0x0398 */ struct _NDIS_TIMER MediaDisconnectTimer;
  /* 0x03e0 */ enum _NDIS_PNP_DEVICE_STATE PnPDeviceState;
  /* 0x03e4 */ enum _NDIS_PNP_DEVICE_STATE OldPnPDeviceState;
  /* 0x03e8 */ struct _KDPC DeferredDpc;
  /* 0x0408 */ union _LARGE_INTEGER StartTicks;
  /* 0x0410 */ struct _NDIS_PACKET** IndicatedPacket;
  /* 0x0414 */ struct _KEVENT* RemoveReadyEvent;
  /* 0x0418 */ struct _KEVENT* AllRequestsCompletedEvent;
  /* 0x041c */ unsigned long InitTimeMs;
  /* 0x0420 */ struct _NDIS_MINIPORT_WORK_ITEM WorkItemBuffer[6];
  /* 0x0468 */ struct _OID_LIST* OidList;
  /* 0x046c */ unsigned short InternalResetCount;
  /* 0x046e */ unsigned short MiniportResetCount;
  /* 0x0470 */ unsigned short MediaSenseConnectCount;
  /* 0x0472 */ unsigned short MediaSenseDisconnectCount;
  /* 0x0474 */ struct _NDIS_PACKET** xPackets;
  /* 0x0478 */ unsigned long UserModeOpenReferences;
  /* 0x047c */ void* WSendPacketsHandler /* function */;
  /* 0x0480 */ unsigned long MiniportAttributes;
  /* 0x0484 */ unsigned short NumOpens;
  /* 0x0486 */ unsigned short CFHangXTicks;
  /* 0x0488 */ unsigned long RequestCount;
  /* 0x048c */ unsigned long IndicatedPacketsCount;
  /* 0x0490 */ enum _NDIS_PHYSICAL_MEDIUM PhysicalMediumType;
  /* 0x0494 */ enum _NDIS_MEDIUM MiniportMediaType;
  /* 0x0498 */ enum _NDIS_MEDIUM DataLinkLayerType;
  /* 0x049c */ enum _NDIS_MEDIUM MpSpecifiedMediaType;
  /* 0x04a0 */ struct _NDIS_REQUEST* LastRequest;
  /* 0x04a4 */ void* FakeMac;
  /* 0x04a8 */ void* LockThread;
  /* 0x04ac */ unsigned long InfoFlags;
  /* 0x04b0 */ unsigned long TimerQueueLock;
  /* 0x04b4 */ struct _KEVENT* ResetCompletedEvent;
  /* 0x04b8 */ void* SavedPacketIndicateHandler /* function */;
  /* 0x04bc */ long RegisteredInterrupts;
  /* 0x04c0 */ unsigned long SetOid;
  /* 0x04c4 */ struct _KEVENT CFHCompletedEvent;
  /* 0x04d4 */ struct _WORK_QUEUE_ITEM CFHWorkItem;
  /* 0x04e4 */ volatile long CFHWorkItemQueued;
  /* 0x04e8 */ void* DeviceContext;
  /* 0x04ec */ struct _NDIS_MINIPORT_RSS_PARAMETERS_CACHE* RssParametersBuffer;
  /* 0x04f0 */ unsigned char UsingMSIX;
  /* 0x04f1 */ unsigned char Miniport5InNdis6Mode;
  /* 0x04f2 */ unsigned char Miniport5HasNdis6Component;
  /* 0x04f3 */ unsigned char InitMode;
  /* 0x04f4 */ unsigned char InitModeNotNeededAnymore;
  /* 0x04f5 */ char MediaChangeFilters;
  /* 0x04f6 */ unsigned char CheckPacketFilters;
  /* 0x04f7 */ unsigned char ReceiveFilters;
  /* 0x04f8 */ unsigned long RecvLock;
  /* 0x04fc */ enum _NDIS_MINIPORT_STATE RecvState;
  /* 0x0500 */ unsigned long OutstandingReceives;
  /* 0x0504 */ void* MiniportRecvLockThread;
  /* 0x0508 */ void* NextSendPacketsHandler /* function */;
  /* 0x050c */ void* FinalSendPacketsHandler /* function */;
  /* 0x0510 */ struct _NDIS_FILTER_BLOCK* LowestFilter;
  /* 0x0514 */ struct _NDIS_FILTER_BLOCK* HighestFilter;
  /* 0x0518 */ void* ShutdownContext;
  /* 0x051c */ void* ShutdownHandler /* function */;
  /* 0x0520 */ struct _KBUGCHECK_CALLBACK_RECORD BugcheckCallbackRecord;
  /* 0x0540 */ void* TopIndicateNetBufferListsHandler /* function */;
  /* 0x0544 */ void* TopIndicateLoopbackNetBufferListsHandler /* function */;
  /* 0x0548 */ void* Ndis5PacketIndicateHandler /* function */;
  /* 0x054c */ void* MiniportReturnPacketHandler /* function */;
  /* 0x0550 */ void* MiniportReturnPacketContext;
  /* 0x0554 */ void* SynchronousReturnPacketHandler /* function */;
  /* 0x0558 */ void* SynchronousReturnPacketContext;
  /* 0x055c */ struct _LIST_ENTRY OidRequestList;
  /* 0x0564 */ struct _NDIS_OID_REQUEST* PendingOidRequest;
  /* 0x0568 */ struct _NDIS_OID_REQUEST* ProcessedOidRequest;
  /* 0x056c */ struct _NDIS_OID_REQUEST* HookedOidRequest;
  /* 0x0570 */ void* NextCoOidRequestHandle;
  /* 0x0574 */ unsigned long Ndis6ProtocolsBound;
  /* 0x0578 */ unsigned long PmodeOpen6;
  /* 0x057c */ enum _NDIS_MINIPORT_STATE State;
  /* 0x0580 */ struct _KEVENT* AsyncOpCompletionEvent;
  /* 0x0584 */ int AsyncOpCompletionStatus;
  /* 0x0588 */ unsigned __int64 MaxXmitLinkSpeed;
  /* 0x0590 */ unsigned __int64 MaxRcvLinkSpeed;
  /* 0x0598 */ unsigned long SupportedPacketFilters;
  /* 0x059c */ struct _NDIS_MINIPORT_HANDLERS NoFilter;
  /* 0x05f8 */ struct _NDIS_MINIPORT_HANDLERS Next;
  /* 0x0654 */ unsigned char ReceivePathEnabled;
  /* 0x0655 */ unsigned char NormalTopReceive;
  /* 0x0656 */ char Padding_23[2];
  /* 0x0658 */ enum _NDIS_SEND_PATH_TYPE SendPathType;
  /* 0x065c */ enum _NDIS_SEND_PATH_TYPE SavedSendPathType;
  /* 0x0660 */ unsigned char SavedReceivePathEnabled;
  /* 0x0661 */ char Padding_24[3];
  /* 0x0664 */ unsigned long TimestampFlags;
  /* 0x0668 */ unsigned long FilterPnPFlags;
  /* 0x066c */ unsigned long SupportedStatistics;
  /* 0x0670 */ struct _NDIS_RECEIVE_SCALE_CAPABILITIES RecvScaleCapabilities;
  /* 0x0684 */ struct _NDIS_MINIPORT_ADAPTER_GENERAL_ATTRIBUTES* GeneralAttributes;
  /* 0x0688 */ struct _LIST_ENTRY PortList;
  /* 0x0690 */ unsigned char* AllocatedPortIndices;
  /* 0x0694 */ unsigned long AllocatedPortIndicesLength;
  /* 0x0698 */ unsigned long NumberOfPorts;
  /* 0x069c */ unsigned long NumberOfActivePorts;
  /* 0x06a0 */ unsigned __int64 MiniportXmitLinkSpeed;
  /* 0x06a8 */ unsigned __int64 MiniportRcvLinkSpeed;
  /* 0x06b0 */ struct _NDIS_TIMER InitModeTimeoutTimer;
  /* 0x06f8 */ struct _NDIS_WORK_ITEM InitModeTimeoutWorkItem;
  /* 0x0720 */ struct _KEVENT InitModeTimeoutTimerQueuedEvent;
  /* 0x0730 */ unsigned long DataBackFillSize;
  /* 0x0734 */ unsigned long ContextBackFillSize;
  /* 0x0738 */ struct _NDIS_RESTART_GENERAL_ATTRIBUTES TopFilterRestartAttributes;
  /* 0x0788 */ struct _NDIS_RECEIVE_SCALE_CAPABILITIES TopRecvScaleCapabilities;
  /* 0x079c */ unsigned long NsiOpenReferences;
  /* 0x07a0 */ void* ProcessingOpen;
  /* 0x07a4 */ struct _KEVENT* NsiRequestsCompletedEvent;
  /* 0x07a8 */ enum _DEVICE_POWER_STATE QueryPowerDeviceState;
  /* 0x07ac */ unsigned char MinimumNdisMajorVersion;
  /* 0x07ad */ unsigned char MinimumNdisMinorVersion;
  /* 0x07ae */ char Padding_25[2];
  /* 0x07b0 */ struct _NDIS_MINIPORT_STATS* BottomIfStats;
  /* 0x07b4 */ struct _NDIS_M_PERIODIC_RECEIVES PeriodicReceiveQueue;
  /* 0x080c */ struct PNDIS_PER_PROCESSOR_SLOT__* PeriodicReceivesNblCountIndex;
  /* 0x0810 */ enum _NDIS_PORT_CONTROL_STATE DefaultSendControlState;
  /* 0x0814 */ enum _NDIS_PORT_CONTROL_STATE DefaultRcvControlState;
  /* 0x0818 */ enum _NDIS_PORT_AUTHORIZATION_STATE DefaultSendAuthorizationState;
  /* 0x081c */ enum _NDIS_PORT_AUTHORIZATION_STATE DefaultRcvAuthorizationState;
  /* 0x0820 */ enum _NDIS_PORT_CONTROL_STATE DefaultPortSendControlState;
  /* 0x0824 */ enum _NDIS_PORT_CONTROL_STATE DefaultPortRcvControlState;
  /* 0x0828 */ enum _NDIS_PORT_AUTHORIZATION_STATE DefaultPortSendAuthorizationState;
  /* 0x082c */ enum _NDIS_PORT_AUTHORIZATION_STATE DefaultPortRcvAuthorizationState;
  /* 0x0830 */ struct _NDIS_PCI_DEVICE_CUSTOM_PROPERTIES PciDeviceCustomProperties;
  /* 0x0864 */ void* TopNdis5PacketIndicateHandler /* function */;
  /* 0x0868 */ unsigned long* ndisSupportedOidList;
  /* 0x086c */ unsigned long ndisSupportedOidListLength;
  /* 0x0870 */ unsigned long MsiIntCount;
  /* 0x0874 */ struct _WORK_QUEUE_ITEM MiniportDpcWorkItem;
  /* 0x0884 */ long Padding_26;
  /* 0x0888 */ unsigned __int64 InvalidFrames;
  /* 0x0890 */ long PagingPathCount;
  /* 0x0894 */ struct _LIST_ENTRY ReceiveQueueList;
  /* 0x089c */ unsigned char* AllocatedQueueIndices;
  /* 0x08a0 */ unsigned long AllocatedQueueIndicesLength;
  /* 0x08a4 */ unsigned long NumReceiveQueues;
  /* 0x08a8 */ struct _LIST_ENTRY ReceiveFilterList;
  /* 0x08b0 */ unsigned char* AllocatedReceiveFilterIndices;
  /* 0x08b4 */ unsigned long AllocatedReceiveFilterIndicesLength;
  /* 0x08b8 */ unsigned long NumReceiveFilters;
  /* 0x08bc */ unsigned long EnabledReceiveFilterTypes;
  /* 0x08c0 */ unsigned long EnabledReceiveQueueTypes;
  /* 0x08c4 */ struct _NDIS_RECEIVE_FILTER_CAPABILITIES* ReceiveFilterHwCapabilities;
  /* 0x08c8 */ struct _NDIS_RECEIVE_FILTER_CAPABILITIES* ReceiveFilterCurrentCapabilities;
  /* 0x08cc */ struct _NDIS_RECEIVE_FILTER_CAPABILITIES* TopReceiveFilterCurrentCapabilities;
  /* 0x08d0 */ struct _NDIS_NIC_SWITCH_CAPABILITIES* NicSwitchHwCapabilities;
  /* 0x08d4 */ struct _NDIS_NIC_SWITCH_CAPABILITIES* NicSwitchCurrentCapabilities;
  /* 0x08d8 */ struct _NDIS_NIC_SWITCH_CAPABILITIES* TopNicSwitchCurrentCapabilities;
  /* 0x08dc */ struct _LIST_ENTRY SharedMemoryBlockList;
  /* 0x08e4 */ void* AllocateSharedMemoryHandler /* function */;
  /* 0x08e8 */ void* FreeSharedMemoryHandler /* function */;
  /* 0x08ec */ void* AllocateSharedMemoryContext;
  /* 0x08f0 */ struct PCI_MSI_CAPABILITY MsiCaps;
  /* 0x0908 */ struct PCI_MSIX_CAPABILITY MsiXCaps;
  /* 0x0914 */ long Padding_27;
  /* 0x0918 */ unsigned __int64 NumberOfIndirectionTableChanges;
  /* 0x0920 */ unsigned int PciDeviceSriovSupport;
  union
  {
    /* 0x0924 */ unsigned char BeginSavedFields;
    /* 0x0924 */ unsigned long NumUserOpens;
  }; /* size: 0x0004 */
  /* 0x0928 */ struct _NDIS_MINIPORT_OFFLOAD_REG OffloadRegistry;
  /* 0x092c */ unsigned short MediaDisconnectTimeOut;
  /* 0x092e */ unsigned short SGMapRegistersNeeded;
  /* 0x0930 */ unsigned long DriverVerifyFlags;
  /* 0x0934 */ void* SetBusData /* function */;
  /* 0x0938 */ void* GetBusData /* function */;
  /* 0x093c */ void* BusDataContext;
  /* 0x0940 */ enum _INTERFACE_TYPE BusType;
  /* 0x0944 */ unsigned long BusNumber;
  /* 0x0948 */ struct _NDIS_EVENT OpenReadyEvent;
  /* 0x0958 */ unsigned long NumAdminOpens;
  /* 0x095c */ struct _NDIS_M_DRIVER_BLOCK* DriverHandle;
  /* 0x0960 */ struct _NDIS_BIND_PATHS* BindPaths;
  /* 0x0964 */ enum _NDIS_PHYSICAL_MEDIUM MiniportPhysicalMediumType;
  /* 0x0968 */ void* SecurityDescriptor;
  /* 0x096c */ struct _UNICODE_STRING BaseName;
  /* 0x0974 */ struct _UNICODE_STRING MiniportName;
  /* 0x097c */ struct _DEVICE_OBJECT* DeviceObject;
  /* 0x0980 */ struct _DEVICE_OBJECT* PhysicalDeviceObject;
  /* 0x0984 */ struct _DEVICE_OBJECT* NextDeviceObject;
  /* 0x0988 */ struct _NDIS_MINIPORT_BLOCK* NextGlobalMiniport;
  /* 0x098c */ struct _UNICODE_STRING* pAdapterInstanceName;
  /* 0x0990 */ unsigned long PnPCapabilities;
  /* 0x0994 */ enum _DEVICE_POWER_STATE CurrentDevicePowerState;
  /* 0x0998 */ unsigned long PowerStateLock;
  /* 0x099c */ enum _DEVICE_POWER_STATE DriverPowerState;
  /* 0x09a0 */ enum _DEVICE_POWER_STATE PrevDriverPowerState;
  /* 0x09a4 */ struct _NET_BUFFER_LIST* LowPowerRcvReturnNbls;
  /* 0x09a8 */ unsigned long PendingReturnNBLCount;
  /* 0x09ac */ unsigned char SurpriseRemoveFlushedRcvReturnQueue;
  /* 0x09ad */ char Padding_28[3];
  /* 0x09b0 */ struct NDIS_NBL_TRACKER_HANDLE__* LowPowerRcvReturnNblTracker;
  /* 0x09b4 */ struct _NDIS_PM_ADMIN_CONFIG PMAdminConfig;
  /* 0x09b8 */ struct _KSEMAPHORE PMPatternSemaphore;
  /* 0x09cc */ struct _KSEMAPHORE PMOffloadSemaphore;
  /* 0x09e0 */ void* BusInterface;
  /* 0x09e4 */ unsigned short InstanceNumber;
  /* 0x09e6 */ char Padding_29[2];
  /* 0x09e8 */ void* ConfigurationHandle;
  /* 0x09ec */ struct _GUID InterfaceGuid;
  /* 0x09fc */ long Padding_30;
  /* 0x0a00 */ union _NET_LUID_LH NetLuid;
  /* 0x0a08 */ unsigned char IfBlockAvailable;
  /* 0x0a09 */ char Padding_31[3];
  /* 0x0a0c */ struct _NDIS_IF_BLOCK* IfBlock;
  /* 0x0a10 */ struct _KEVENT* IfBlockPointerRefZeroEvent;
  /* 0x0a14 */ unsigned int IfIndex;
  /* 0x0a18 */ enum _NET_IF_ADMIN_STATUS AdminStatus;
  /* 0x0a1c */ enum _NET_IF_OPER_STATUS OperStatus;
  /* 0x0a20 */ unsigned long OperStatusFlags;
  union
  {
    /* 0x0a24 */ void* SendHandler /* function */;
    /* 0x0a24 */ void* WanSendHandler /* function */;
  }; /* size: 0x0004 */
  /* 0x0a28 */ struct NDIS_NBL_TRACKER_HANDLE__* NblTracker;
  /* 0x0a2c */ struct _DEVICE_RESET_INTERFACE_STANDARD* ReenumerateSelfInterface;
  /* 0x0a30 */ struct _NDIS_MINIPORT_OFFLOAD* Offload;
  /* 0x0a34 */ void* NDKBlock;
  /* 0x0a38 */ void* AddDeviceContext;
  /* 0x0a3c */ struct _IO_REMOVE_LOCK RemoveLock;
  /* 0x0a54 */ struct _UNICODE_STRING DevinterfaceNetSymbolicLinkName;
  /* 0x0a5c */ unsigned long PhysicalMediumInInf;
  /* 0x0a60 */ class wistd::unique_ptr<Rtl::KString,wistd::default_delete<Rtl::KString> > ExportName;
  /* 0x0a64 */ class wistd::unique_ptr<Rtl::KString,wistd::default_delete<Rtl::KString> > FilterClass;
  /* 0x0a68 */ void* StatusProcessingThread;
  /* 0x0a6c */ struct _UNICODE_STRING FdoName;
  /* 0x0a74 */ struct _KEVENT PowerD0CompleteEvent;
  /* 0x0a84 */ long LastD0CompleteStatus;
  /* 0x0a88 */ enum _NDIS_MINIPORT_EVENT LastD0Reason;
  /* 0x0a8a */ char Padding_32[2];
  /* 0x0a8c */ unsigned long DirectOidRequestCount;
  /* 0x0a90 */ struct _KEVENT* AllDirectRequestsCompletedEvent;
  /* 0x0a94 */ struct _NDIS_HD_SPLIT_CURRENT_CONFIG* HDSplitCurrentConfig;
  /* 0x0a98 */ void* MSIXConfigContext;
  /* 0x0a9c */ void* SetMSIXTableEntry /* function */;
  /* 0x0aa0 */ void* MaskMSIXTableEntry /* function */;
  /* 0x0aa4 */ void* UnmaskMSIXTableEntry /* function */;
  /* 0x0aa8 */ struct _WORK_QUEUE_ITEM DevicePowerStateWorkItem;
  /* 0x0ab8 */ struct _WORK_QUEUE_ITEM SystemPowerStateWorkItem;
  /* 0x0ac8 */ struct _NDIS_RECEIVE_QUEUE_BLOCK* DefaultReceiveQueue;
  /* 0x0acc */ unsigned long MaxNumRssProcessors;
  /* 0x0ad0 */ struct _PROCESSOR_NUMBER RssBaseProcessor;
  /* 0x0ad4 */ struct _PROCESSOR_NUMBER RssMaxProcessor;
  /* 0x0ad8 */ enum _NDIS_RSS_PROFILE RssProfile;
  /* 0x0adc */ unsigned short NumaNodeId;
  /* 0x0ade */ char Padding_33[2];
  /* 0x0ae0 */ unsigned short* NumaDistances;
  /* 0x0ae4 */ struct _UNICODE_STRING* pModifiedInstanceName;
  /* 0x0ae8 */ unsigned long SyncFlags;
  /* 0x0aec */ unsigned long WSyncFlags;
  /* 0x0af0 */ unsigned long InterlockedFlags;
  /* 0x0af4 */ struct _ULONG_REFERENCE Ref;
  /* 0x0b00 */ struct _NDIS_SELECTIVE_SUSPEND* SelectiveSuspend;
  /* 0x0b04 */ struct _NDIS_MINIPORT_AOAC* AoAc;
  /* 0x0b08 */ enum _NDIS_PM_WAKE_REASON_TYPE LastWakeReason;
  /* 0x0b0c */ struct NDIS_EVENT_LOG_HANDLE__* PnpEventLog;
  /* 0x0b10 */ struct _NDIS_D0_SIGNAL_WORK_ITEM D0CompleteSignalWorkItem;
  /* 0x0b40 */ struct _NDIS_PHYSICAL_PERFORMANCE_COUNTERS* PhysicalPerformanceCounters;
  /* 0x0b44 */ long Padding_34;
  /* 0x0b48 */ union _LARGE_INTEGER TimeOfInitialization;
  /* 0x0b50 */ union _LARGE_INTEGER LastSystemSleepTime;
  /* 0x0b58 */ unsigned __int64 TotalSystemSleepTimeMs;
  /* 0x0b60 */ struct _NDIS_SRIOV_CAPABILITIES* SriovHwCapabilities;
  /* 0x0b64 */ struct _NDIS_SRIOV_CAPABILITIES* SriovCurrentCapabilities;
  /* 0x0b68 */ unsigned __int64 InvalidateBlockMask;
  /* 0x0b70 */ struct _IRP* InvalidateBlockIoctlPf;
  /* 0x0b74 */ struct _IRP* InvalidateBlockIoctlVf;
  /* 0x0b78 */ struct _VPCI_INVALIDATE_BLOCK_OUTPUT InvalidateBlockVfParams;
  /* 0x0b80 */ struct _KEVENT InvalidateBlockEvent;
  /* 0x0b90 */ unsigned short InvalidateVfId;
  /* 0x0b92 */ unsigned char InvalidateBlockCancelling;
  /* 0x0b93 */ char Padding_35;
  /* 0x0b94 */ struct _NDIS_PF_BLOCK* PFBlock;
  /* 0x0b98 */ unsigned long NumSwitches;
  /* 0x0b9c */ struct _LIST_ENTRY NicSwitchList;
  /* 0x0ba4 */ unsigned long NumAllocatedVFs;
  /* 0x0ba8 */ struct _LIST_ENTRY VFList;
  /* 0x0bb0 */ unsigned long NumActiveVPorts;
  /* 0x0bb4 */ struct _LIST_ENTRY VPortList;
  /* 0x0bbc */ unsigned char* AllocatedVPortIndices;
  /* 0x0bc0 */ unsigned long AllocatedVPortIndicesLength;
  /* 0x0bc4 */ void* SetVirtualFunctionData /* function */;
  /* 0x0bc8 */ void* GetVirtualFunctionData /* function */;
  /* 0x0bcc */ void* EnableVirtualization /* function */;
  /* 0x0bd0 */ void* GetVirtualDeviceLocation /* function */;
  /* 0x0bd4 */ void* GetVirtualFunctionProbedBars /* function */;
  /* 0x0bd8 */ void* VirtInterfaceContext;
  /* 0x0bdc */ struct _UNICODE_STRING DevinterfaceVirtSymbolicLinkName;
  /* 0x0be4 */ void* VpciInterfaceDereference /* function */;
  /* 0x0be8 */ void* WriteVfConfigBlock /* function */;
  /* 0x0bec */ void* ReadVfConfigBlock /* function */;
  /* 0x0bf0 */ void* VpciInterfaceContext;
  /* 0x0bf4 */ unsigned int VfSerialNumber;
  /* 0x0bf8 */ struct _LUID SriovLuid;
  /* 0x0c00 */ struct NDIS_REFCOUNT_HANDLE__* RefCountTracker;
  /* 0x0c04 */ struct NDIS_REFCOUNT_HANDLE__* NsiRefCountTracker;
  /* 0x0c08 */ struct _NDIS_QOS_CAPABILITIES* QosHwCapabilities;
  /* 0x0c0c */ struct _NDIS_QOS_CAPABILITIES* QosCurrentCapabilities;
  /* 0x0c10 */ struct _NDIS_QOS_PARAMETERS* QosOperationalParameters;
  /* 0x0c14 */ unsigned long QosOperationalParametersBufferSize;
  /* 0x0c18 */ struct _NDIS_QOS_PARAMETERS* QosRemoteParameters;
  /* 0x0c1c */ unsigned long QosRemoteParametersBufferSize;
  /* 0x0c20 */ unsigned __int64 DeviceFlags;
  /* 0x0c28 */ void* VerifierContext;
  /* 0x0c2c */ struct _WORK_QUEUE_ITEM SurpriseRemovalWorkItem;
  /* 0x0c3c */ struct Ndis::BindStack Bindings;
  /* 0x0c84 */ struct Ndis::BindEngine BindEngine;
  /* 0x0cc4 */ class Rtl::KNeutralLock<enum NDIS_MINIPORT_POLICY_OWNER> MiniportOwner;
  /* 0x0cdc */ BOOL PmInterruptedByPnp;
  /* 0x0cdd */ BOOL DoNotBlockOnMiniportLock;
  /* 0x0cde */ BOOL PoFxDStateReportingEnabled;
  /* 0x0cdf */ char Padding_36;
  /* 0x0ce0 */ struct NDIS_MINIPORT_HOOK_ADAPTER_HANDLE__* HookAdapterHandle;
  /* 0x0ce4 */ struct _WORK_QUEUE_ITEM InterfaceUpdateWorkItem;
  /* 0x0cf4 */ BOOL InterfaceUpdateInProgress;
  /* 0x0cf5 */ BOOL MacAddressUpdateQueued;
  /* 0x0cf6 */ BOOL MtuUpdateQueued;
  /* 0x0cf7 */ char Padding_37;
  /* 0x0cf8 */ struct _IF_PHYSICAL_ADDRESS_LH PendingMacAddress;
  /* 0x0d1a */ char Padding_38[2];
  /* 0x0d1c */ unsigned long PendingMtuSize;
  /* 0x0d20 */ wchar_t* PnPInstanceId;
  /* 0x0d24 */ struct WORKITEM_WITH_IRP DevicePowerOnWorkItem;
  /* 0x0d38 */ struct WORKITEM_WITH_IRP DevicePowerDownWorkItem;
  /* 0x0d4c */ class wil::unique_any_t<wil::details::unique_storage<wil::details::resource_policy<NDISWATCHDOG__ *,void (__stdcall*)(NDISWATCHDOG__ *),&ndisFreeWatchdog,wistd::integral_constant<unsigned int,1>,NDISWATCHDOG__ *,int,-1,std::nullptr_t> > > PendingOidWatchdog;
  /* 0x0d50 */ class wil::unique_any_t<wil::details::unique_storage<wil::details::resource_policy<NDISWATCHDOG__ *,void (__stdcall*)(NDISWATCHDOG__ *),&ndisFreeWatchdog,wistd::integral_constant<unsigned int,1>,NDISWATCHDOG__ *,int,-1,std::nullptr_t> > > HookedOidWatchdog;
  /* 0x0d54 */ class wil::unique_any_t<wil::details::unique_storage<wil::details::resource_policy<NDISWATCHDOG__ *,void (__stdcall*)(NDISWATCHDOG__ *),&ndisFreeWatchdog,wistd::integral_constant<unsigned int,1>,NDISWATCHDOG__ *,int,-1,std::nullptr_t> > > ReenumerateWatchdog;
  /* 0x0d58 */ void* PdcHandle;
  /* 0x0d5c */ long Padding_39;
  /* 0x0d60 */ struct _NDIS_TIMER PdcTaskClientDisableTimer;
  /* 0x0da8 */ struct _NDIS_WORK_ITEM PdcTaskClientDisableWorkItem;
  /* 0x0dd0 */ volatile long PdcTaskClientMode;
  /* 0x0dd4 */ unsigned long ModernStandbyWoLMagicPacketEnable;
  /* 0x0dd8 */ BOOL ModernStandbySystemWakeEnabled;
  /* 0x0dd9 */ char Padding_40[3];
  /* 0x0ddc */ struct _NDIS_RSS_DPC_WORKER_CONTEXT* RssV2Context;
  /* 0x0de0 */ volatile long RssV2CompletionCount;
  /* 0x0de4 */ struct _KEVENT RssV2CompletionEvent;
  /* 0x0df4 */ unsigned char RssV2Initialized;
  /* 0x0df5 */ char Padding_41[3];
  /* 0x0df8 */ struct _LIST_ENTRY SynchronousOidCalls;
  /* 0x0e00 */ struct _NDIS_TIMESTAMP_CAPABILITIES* HwTimestampCapabilities;
  /* 0x0e04 */ struct _NDIS_TIMESTAMP_CAPABILITIES* HwTimestampCurrentConfig;
  /* 0x0e08 */ struct _NDIS_TIMESTAMP_CAPABILITIES* TopTimestampConfig;
  /* 0x0e0c */ struct _NDIS_TIMESTAMP_CAPABILITIES* TopHwTimestampCapabilities;
  /* 0x0e10 */ struct _PKTMON_COMPONENT_CONTEXT PktMonComp;
  /* 0x0e1c */ struct _PKTMON_EDGE_CONTEXT PktMonEdge;
  /* 0x0e28 */ enum NetSetupStoreType LWMConfigurationStore;
  /* 0x0e2c */ long __PADDING__[1];
} NDIS_MINIPORT_BLOCK, *PNDIS_MINIPORT_BLOCK; /* size: 0x0e30 */

typedef enum _DEVICE_RESET_TYPE
{
  FunctionLevelDeviceReset = 0,
  PlatformLevelDeviceReset = 1,
} DEVICE_RESET_TYPE, *PDEVICE_RESET_TYPE;

typedef enum _NDIS_802_11_WEP_STATUS
{
  Ndis802_11WEPEnabled = 0,
  Ndis802_11Encryption1Enabled = 0,
  Ndis802_11WEPDisabled = 1,
  Ndis802_11EncryptionDisabled = 1,
  Ndis802_11WEPKeyAbsent = 2,
  Ndis802_11Encryption1KeyAbsent = 2,
  Ndis802_11WEPNotSupported = 3,
  Ndis802_11EncryptionNotSupported = 3,
  Ndis802_11Encryption2Enabled = 4,
  Ndis802_11Encryption2KeyAbsent = 5,
  Ndis802_11Encryption3Enabled = 6,
  Ndis802_11Encryption3KeyAbsent = 7,
} NDIS_802_11_WEP_STATUS, *PNDIS_802_11_WEP_STATUS;

typedef enum _FSINFOCLASS
{
  FileFsVolumeInformation = 1,
  FileFsLabelInformation = 2,
  FileFsSizeInformation = 3,
  FileFsDeviceInformation = 4,
  FileFsAttributeInformation = 5,
  FileFsControlInformation = 6,
  FileFsFullSizeInformation = 7,
  FileFsObjectIdInformation = 8,
  FileFsDriverPathInformation = 9,
  FileFsVolumeFlagsInformation = 10,
  FileFsSectorSizeInformation = 11,
  FileFsDataCopyInformation = 12,
  FileFsMetadataSizeInformation = 13,
  FileFsFullSizeInformationEx = 14,
  FileFsMaximumInformation = 15,
} FSINFOCLASS, *PFSINFOCLASS;

typedef enum _NDIS_INTERRUPT_MODERATION
{
  NdisInterruptModerationUnknown = 0,
  NdisInterruptModerationNotSupported = 1,
  NdisInterruptModerationEnabled = 2,
  NdisInterruptModerationDisabled = 3,
} NDIS_INTERRUPT_MODERATION, *PNDIS_INTERRUPT_MODERATION;

typedef struct _NDIS_LINK_PARAMETERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ enum _NET_IF_MEDIA_DUPLEX_STATE MediaDuplexState;
  /* 0x0008 */ unsigned __int64 XmitLinkSpeed;
  /* 0x0010 */ unsigned __int64 RcvLinkSpeed;
  /* 0x0018 */ enum _NDIS_SUPPORTED_PAUSE_FUNCTIONS PauseFunctions;
  /* 0x001c */ unsigned long AutoNegotiationFlags;
} NDIS_LINK_PARAMETERS, *PNDIS_LINK_PARAMETERS; /* size: 0x0020 */

typedef enum _NETSETUP_BINDING_PATH_TYPE
{
  NetSetupBindingPathNdisProtocol = 0,
  NetSetupBindingPathNdisFilter = 1,
  NetSetupBindingPathTdi = 2,
} NETSETUP_BINDING_PATH_TYPE, *PNETSETUP_BINDING_PATH_TYPE;

typedef enum _WWAN_STRUCT_TYPE
{
  WwanStructTN = 0,
  WwanStructContext = 1,
  WwanStructProvider = 2,
  WwanStructSmsPdu = 3,
  WwanStructReserved0 = 4,
  WwanStructReserved1 = 5,
  WwanStructReserved2 = 6,
  WwanStructSmsCdma = 7,
  WwanStructReserved3 = 8,
  WwanStructDeviceServiceEntry = 9,
  WwanStructProvider2 = 10,
  WwanStructDeviceServiceGuid = 11,
  WwanStructDeviceServiceCommandId = 12,
  WwanStructCellularClass = 13,
  WwanStructDeviceSlotMap = 14,
  WwanStructUiccApplication = 15,
  WwanStructRegisterAcquisitionOrder = 16,
  WwanStructRegistrationState = 17,
  WwanStructSignalState = 18,
  WwanStructUiccTerminalCapability = 19,
  WwanStructSarConfig = 20,
  WwanStructContextV2 = 21,
  WwanStructNetworkBlacklistProvider = 22,
  WwanStructMPDPChildInterface = 23,
  WwantStructSNSSAI = 24,
  WwantStructTAI = 25,
  WwanStructMax = 26,
} WWAN_STRUCT_TYPE, *PWWAN_STRUCT_TYPE;

typedef enum _DEVICE_RELATION_TYPE
{
  BusRelations = 0,
  EjectionRelations = 1,
  PowerRelations = 2,
  RemovalRelations = 3,
  TargetDeviceRelation = 4,
  SingleBusRelations = 5,
  TransportRelations = 6,
} DEVICE_RELATION_TYPE, *PDEVICE_RELATION_TYPE;

typedef enum _REG_NOTIFY_CLASS
{
  RegNtDeleteKey = 0,
  RegNtPreDeleteKey = 0,
  RegNtSetValueKey = 1,
  RegNtPreSetValueKey = 1,
  RegNtDeleteValueKey = 2,
  RegNtPreDeleteValueKey = 2,
  RegNtSetInformationKey = 3,
  RegNtPreSetInformationKey = 3,
  RegNtRenameKey = 4,
  RegNtPreRenameKey = 4,
  RegNtEnumerateKey = 5,
  RegNtPreEnumerateKey = 5,
  RegNtEnumerateValueKey = 6,
  RegNtPreEnumerateValueKey = 6,
  RegNtQueryKey = 7,
  RegNtPreQueryKey = 7,
  RegNtQueryValueKey = 8,
  RegNtPreQueryValueKey = 8,
  RegNtQueryMultipleValueKey = 9,
  RegNtPreQueryMultipleValueKey = 9,
  RegNtPreCreateKey = 10,
  RegNtPostCreateKey = 11,
  RegNtPreOpenKey = 12,
  RegNtPostOpenKey = 13,
  RegNtKeyHandleClose = 14,
  RegNtPreKeyHandleClose = 14,
  RegNtPostDeleteKey = 15,
  RegNtPostSetValueKey = 16,
  RegNtPostDeleteValueKey = 17,
  RegNtPostSetInformationKey = 18,
  RegNtPostRenameKey = 19,
  RegNtPostEnumerateKey = 20,
  RegNtPostEnumerateValueKey = 21,
  RegNtPostQueryKey = 22,
  RegNtPostQueryValueKey = 23,
  RegNtPostQueryMultipleValueKey = 24,
  RegNtPostKeyHandleClose = 25,
  RegNtPreCreateKeyEx = 26,
  RegNtPostCreateKeyEx = 27,
  RegNtPreOpenKeyEx = 28,
  RegNtPostOpenKeyEx = 29,
  RegNtPreFlushKey = 30,
  RegNtPostFlushKey = 31,
  RegNtPreLoadKey = 32,
  RegNtPostLoadKey = 33,
  RegNtPreUnLoadKey = 34,
  RegNtPostUnLoadKey = 35,
  RegNtPreQueryKeySecurity = 36,
  RegNtPostQueryKeySecurity = 37,
  RegNtPreSetKeySecurity = 38,
  RegNtPostSetKeySecurity = 39,
  RegNtCallbackObjectContextCleanup = 40,
  RegNtPreRestoreKey = 41,
  RegNtPostRestoreKey = 42,
  RegNtPreSaveKey = 43,
  RegNtPostSaveKey = 44,
  RegNtPreReplaceKey = 45,
  RegNtPostReplaceKey = 46,
  RegNtPreQueryKeyName = 47,
  RegNtPostQueryKeyName = 48,
  MaxRegNtNotifyClass = 49,
} REG_NOTIFY_CLASS, *PREG_NOTIFY_CLASS;

typedef enum _SECURITY_IMPERSONATION_LEVEL
{
  SecurityAnonymous = 0,
  SecurityIdentification = 1,
  SecurityImpersonation = 2,
  SecurityDelegation = 3,
} SECURITY_IMPERSONATION_LEVEL, *PSECURITY_IMPERSONATION_LEVEL;

typedef struct _wil_details_UsageSubscriptionData
{
  /* 0x0000 */ unsigned int featureId;
  /* 0x0004 */ unsigned short serviceReportingKind;
  /* 0x0006 */ char __PADDING__[2];
} wil_details_UsageSubscriptionData, *Pwil_details_UsageSubscriptionData; /* size: 0x0008 */

typedef enum _NDIS_PT_REFTAG
{
  PTREF_BIND_ITER = 0,
  PTREF_READREGISTRY = 1,
  PTREF_BINDNOTIFY = 2,
  PTREF_UNBINDNOTIFY = 3,
  PTREF_RECONFIG = 4,
  PTREF_UNLOADNOTIFY = 5,
  PTREF_UNBINDING = 6,
  PTREF_BINDING = 7,
  PTREF_BINDINGX = 8,
  PTREF_OPEN = 9,
  PTREF_REENUMERATE = 10,
  PTREF_QUNBIND = 11,
  PTREF_BINDCOMPLETE = 12,
  PTREF_BINDFAILNOTIFY = 13,
  PTREF_PD_CLIENT = 14,
  PTREF_NUMBER_OF_TAGS = 15,
} NDIS_PT_REFTAG, *PNDIS_PT_REFTAG;

typedef enum _NDIS_NBL_TRACKER_OWNERSHIP_EVENT
{
  NdisNblTrackerEvent_MiniportIndicated = 128,
  NdisNblTrackerEvent_MiniportIndicatedResources = 129,
  NdisNblTrackerEvent_FilterIndicated = 130,
  NdisNblTrackerEvent_FilterIndicatedResources = 131,
  NdisNblTrackerEvent_IndicatedToProtocol = 132,
  NdisNblTrackerEvent_IndicatedToProtocolResources = 133,
  NdisNblTrackerEvent_IndicatedToProtocolPacket = 134,
  NdisNblTrackerEvent_ProtocolReturned = 135,
  NdisNblTrackerEvent_ProtocolReturnedResources = 136,
  NdisNblTrackerEvent_ProtocolReturnedPacket = 137,
  NdisNblTrackerEvent_FilterReturned = 138,
  NdisNblTrackerEvent_ReturnedToFilter = 139,
  NdisNblTrackerEvent_ReturnedToFilterResources = 140,
  NdisNblTrackerEvent_ReturnedToMiniport = 141,
  NdisNblTrackerEvent_ReturnedToMiniportResources = 142,
  NdisNblTrackerEvent_ProtocolSent = 143,
  NdisNblTrackerEvent_FilterSent = 144,
  NdisNblTrackerEvent_SentToFilter = 145,
  NdisNblTrackerEvent_SentToMiniport = 146,
  NdisNblTrackerEvent_MiniportSendCompleted = 147,
  NdisNblTrackerEvent_FilterSendCompleted = 148,
  NdisNblTrackerEvent_SendCompletedToOpen = 149,
  NdisNblTrackerEvent_CustomReceived = 150,
  NdisNblTrackerEvent_CustomReturned = 151,
  NdisNblTrackerEvent_CustomSent = 152,
  NdisNblTrackerEvent_CustomSendCompleted = 153,
  NdisNblTrackerEvent_OtherDatapath = 154,
  NdisNblTrackerEvent_LoopbackIndicated = 155,
  NdisNblTrackerEvent_LoopbackReturned = 156,
  NdisNblTrackerEvent_OwnershipMax = 157,
} NDIS_NBL_TRACKER_OWNERSHIP_EVENT, *PNDIS_NBL_TRACKER_OWNERSHIP_EVENT;

typedef enum _NDIS_MSIX_TABLE_CONFIG
{
  NdisMSIXTableConfigSetTableEntry = 0,
  NdisMSIXTableConfigMaskTableEntry = 1,
  NdisMSIXTableConfigUnmaskTableEntry = 2,
  NdisMSIXTableConfigMax = 3,
} NDIS_MSIX_TABLE_CONFIG, *PNDIS_MSIX_TABLE_CONFIG;

typedef enum __vc_attributes::event_sourceAttribute::type_e
{
  native = 0,
  com = 1,
  managed = 2,
} _vc_attributes::event_sourceAttribute::type_e, *P_vc_attributes::event_sourceAttribute::type_e;

typedef struct _NDIS_CALL_MANAGER_CHARACTERISTICS
{
  /* 0x0000 */ unsigned char MajorVersion;
  /* 0x0001 */ unsigned char MinorVersion;
  /* 0x0002 */ unsigned short Filler;
  /* 0x0004 */ unsigned int Reserved;
  /* 0x0008 */ void* CmCreateVcHandler /* function */;
  /* 0x000c */ void* CmDeleteVcHandler /* function */;
  /* 0x0010 */ void* CmOpenAfHandler /* function */;
  /* 0x0014 */ void* CmCloseAfHandler /* function */;
  /* 0x0018 */ void* CmRegisterSapHandler /* function */;
  /* 0x001c */ void* CmDeregisterSapHandler /* function */;
  /* 0x0020 */ void* CmMakeCallHandler /* function */;
  /* 0x0024 */ void* CmCloseCallHandler /* function */;
  /* 0x0028 */ void* CmIncomingCallCompleteHandler /* function */;
  /* 0x002c */ void* CmAddPartyHandler /* function */;
  /* 0x0030 */ void* CmDropPartyHandler /* function */;
  /* 0x0034 */ void* CmActivateVcCompleteHandler /* function */;
  /* 0x0038 */ void* CmDeactivateVcCompleteHandler /* function */;
  /* 0x003c */ void* CmModifyCallQoSHandler /* function */;
  /* 0x0040 */ void* CmRequestHandler /* function */;
  /* 0x0044 */ void* CmRequestCompleteHandler /* function */;
} NDIS_CALL_MANAGER_CHARACTERISTICS, *PNDIS_CALL_MANAGER_CHARACTERISTICS; /* size: 0x0048 */

typedef enum _NDIS_802_11_STATUS_TYPE
{
  Ndis802_11StatusType_Authentication = 0,
  Ndis802_11StatusType_MediaStreamMode = 1,
  Ndis802_11StatusType_PMKID_CandidateList = 2,
  Ndis802_11StatusTypeMax = 3,
} NDIS_802_11_STATUS_TYPE, *PNDIS_802_11_STATUS_TYPE;

typedef enum _NDIS_NBL_TRACKER_LIFETIME_EVENT
{
  NdisNblTrackerEvent_QueuedByNdis = 1,
  NdisNblTrackerEvent_NblAllocated = 2,
  NdisNblTrackerEvent_NblAllocatedWithNb = 3,
  NdisNblTrackerEvent_NblFreed = 4,
  NdisNblTrackerEvent_NblAllocatedClone = 5,
  NdisNblTrackerEvent_NblFreedClone = 6,
  NdisNblTrackerEvent_NblAllocatedFragment = 7,
  NdisNblTrackerEvent_NblFreedFragment = 8,
  NdisNblTrackerEvent_NblAllocatedReassembled = 9,
  NdisNblTrackerEvent_NetioAllocatedClone = 10,
  NdisNblTrackerEvent_NetioFreedClone = 11,
  NdisNblTrackerEvent_CustomAllocatedChild = 12,
  NdisNblTrackerEvent_CustomFreedChild = 13,
  NdisNblTrackerEvent_CustomAllocatedNbl = 14,
  NdisNblTrackerEvent_CustomFreedNbl = 15,
  NdisNblTrackerEvent_OtherNotDatapath = 16,
  NdisNblTrackerEvent_PacketTranslationCached = 17,
  NdisNblTrackerEvent_PacketTranslationReused = 18,
  NdisNblTrackerEvent_Translate6To5TxOut = 19,
  NdisNblTrackerEvent_Translate6To5TxReturn = 20,
  NdisNblTrackerEvent_Translate5To6TxOut = 21,
  NdisNblTrackerEvent_Translate5To6TxReturn = 22,
  NdisNblTrackerEvent_Translate5To5TxOut = 23,
  NdisNblTrackerEvent_Translate5To5TxReturn = 24,
  NdisNblTrackerEvent_Translate6To5RxOut = 25,
  NdisNblTrackerEvent_Translate6To5RxReturn = 26,
  NdisNblTrackerEvent_Translate5To6RxOut = 27,
  NdisNblTrackerEvent_Translate5To6RxReturn = 28,
  NdisNblTrackerEvent_Translate5To5RxOut = 29,
  NdisNblTrackerEvent_Translate5To5RxReturn = 30,
  NdisNblTrackerEvent_LifetimeMax = 31,
} NDIS_NBL_TRACKER_LIFETIME_EVENT, *PNDIS_NBL_TRACKER_LIFETIME_EVENT;

typedef enum _DIRECTORY_NOTIFY_INFORMATION_CLASS
{
  DirectoryNotifyInformation = 1,
  DirectoryNotifyExtendedInformation = 2,
} DIRECTORY_NOTIFY_INFORMATION_CLASS, *PDIRECTORY_NOTIFY_INFORMATION_CLASS;

enum CPU_VENDORS
{
  CPU_NONE = 0,
  CPU_INTEL = 1,
  CPU_AMD = 2,
  CPU_CYRIX = 3,
  CPU_TRANSMETA = 4,
  CPU_VIA = 5,
  CPU_CENTAUR = 5,
  CPU_RISE = 6,
  CPU_UNKNOWN = 7,
};

typedef enum _WWAN_VOICE_CLASS
{
  WwanVoiceClassUnknown = 0,
  WwanVoiceClassNoVoice = 1,
  WwanVoiceClassSeparateVoiceData = 2,
  WwanVoiceClassSimultaneousVoiceData = 3,
  WwanVoiceClassMax = 4,
} WWAN_VOICE_CLASS, *PWWAN_VOICE_CLASS;

typedef enum _NDIS_GFT_FLOW_ENTRY_TYPE
{
  NdisGftFlowEntryTypeUndefined = 0,
  NdisGftFlowEntryTypeExactMatch = 1,
  NdisGftFlowEntryTypeWildcard = 2,
  NdisGftFlowEntryTypeMax = 3,
} NDIS_GFT_FLOW_ENTRY_TYPE, *PNDIS_GFT_FLOW_ENTRY_TYPE;

typedef enum _PKG_TYPE
{
  NPNP_PKG = 0,
  NDCO_PKG = 1,
  MAX_PKG = 2,
} PKG_TYPE, *PPKG_TYPE;

enum DEVICE_TEXT_TYPE
{
  DeviceTextDescription = 0,
  DeviceTextLocationInformation = 1,
};

enum TCP_UPLOAD_REASON
{
  LowActivity = 1,
  HighDropRate = 2,
  SmallIO = 3,
  NoBufferPreposting = 4,
  NoBufferProposting = 4,
  ReceivedUrgentData = 5,
  HighFragmentation = 6,
  HighOutOfOrderPackets = 7,
  TimeoutExpiration = 8,
  InvalidState = 9,
  UploadRequested = 10,
  HardwareFailure = 11,
  MaxUploadReason = 12,
};

typedef enum _PERFINFO_KERNELMEMORY_USAGE_TYPE
{
  PerfInfoMemUsagePfnMetadata = 0,
  PerfInfoMemUsageMax = 1,
} PERFINFO_KERNELMEMORY_USAGE_TYPE, *PPERFINFO_KERNELMEMORY_USAGE_TYPE;

typedef enum _POOL_BLOCK_TYPE
{
  NDIS_PACKET_POOL_BLOCK_FREE = 0,
  NDIS_PACKET_POOL_BLOCK_USED = 1,
  NDIS_PACKET_POOL_BLOCK_AGING = 2,
} POOL_BLOCK_TYPE, *PPOOL_BLOCK_TYPE;

struct DOT11_IBSS_PARAMS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned char bJoinOnly;
  /* 0x0005 */ char Padding_42[3];
  /* 0x0008 */ unsigned long uIEsOffset;
  /* 0x000c */ unsigned long uIEsLength;
}; /* size: 0x0010 */

typedef enum _NDIS_SHARED_MEMORY_USAGE
{
  NdisSharedMemoryUsageUndefined = 0,
  NdisSharedMemoryUsageXmit = 1,
  NdisSharedMemoryUsageXmitHeader = 2,
  NdisSharedMemoryUsageXmitData = 3,
  NdisSharedMemoryUsageReceive = 4,
  NdisSharedMemoryUsageReceiveLookahead = 5,
  NdisSharedMemoryUsageReceivePostLookahead = 6,
  NdisSharedMemoryUsageReceiveHeader = 7,
  NdisSharedMemoryUsageReceiveData = 8,
  NdisSharedMemoryUsageOther = 9,
  NdisSharedMemoryUsageMax = 10,
} NDIS_SHARED_MEMORY_USAGE, *PNDIS_SHARED_MEMORY_USAGE;

typedef enum _IO_ALLOCATION_ACTION
{
  KeepObject = 1,
  DeallocateObject = 2,
  DeallocateObjectKeepRegisters = 3,
} IO_ALLOCATION_ACTION, *PIO_ALLOCATION_ACTION;

typedef enum _WWAN_DEVICE_TYPE
{
  WwanDeviceTypeUnknown = 0,
  WwanDeviceTypeEmbedded = 1,
  WwanDeviceTypeRemovable = 2,
  WwanDeviceTypeRemote = 3,
  WwanDeviceTypeMax = 4,
} WWAN_DEVICE_TYPE, *PWWAN_DEVICE_TYPE;

typedef struct _NDIS_NBL_TRACKER_BUCKET
{
  /* 0x0000 */ struct PNDIS_PER_PROCESSOR_SLOT__* Slot;
  /* 0x0004 */ long PassiveCounter;
} NDIS_NBL_TRACKER_BUCKET, *PNDIS_NBL_TRACKER_BUCKET; /* size: 0x0008 */

typedef enum _MODE
{
  KernelMode = 0,
  UserMode = 1,
  MaximumMode = 2,
} MODE, *PMODE;

typedef enum _NDIS_IPV6_HEADER_FIELD
{
  NdisIPv6HeaderFieldUndefined = 0,
  NdisIPv6HeaderFieldProtocol = 1,
  NdisIPv6HeaderFieldMaximum = 2,
} NDIS_IPV6_HEADER_FIELD, *PNDIS_IPV6_HEADER_FIELD;

typedef struct _NDIS_GFT_PACKET_COUNTER_VALUE
{
  /* 0x0000 */ unsigned __int64 Packets;
  /* 0x0008 */ union _LARGE_INTEGER LastUpdate;
} NDIS_GFT_PACKET_COUNTER_VALUE, *PNDIS_GFT_PACKET_COUNTER_VALUE; /* size: 0x0010 */

typedef struct _NDIS_GFT_BYTE_COUNTER_VALUE
{
  /* 0x0000 */ unsigned __int64 Bytes;
  /* 0x0008 */ union _LARGE_INTEGER LastUpdate;
} NDIS_GFT_BYTE_COUNTER_VALUE, *PNDIS_GFT_BYTE_COUNTER_VALUE; /* size: 0x0010 */

typedef struct _NDIS_GFT_PACKET_BYTE_COUNTER_VALUE
{
  /* 0x0000 */ unsigned __int64 Packets;
  /* 0x0008 */ unsigned __int64 Bytes;
  /* 0x0010 */ union _LARGE_INTEGER LastUpdate;
} NDIS_GFT_PACKET_BYTE_COUNTER_VALUE, *PNDIS_GFT_PACKET_BYTE_COUNTER_VALUE; /* size: 0x0018 */

typedef struct _NDIS_GFT_FLOW_STATE
{
  /* 0x0000 */ unsigned long TcpSeqNum;
  /* 0x0004 */ unsigned long TcpAckNum;
} NDIS_GFT_FLOW_STATE, *PNDIS_GFT_FLOW_STATE; /* size: 0x0008 */

typedef struct _NDIS_GFT_PACKET_BYTE_COUNTER_VALUE_AND_STATE
{
  /* 0x0000 */ volatile struct _NDIS_GFT_PACKET_BYTE_COUNTER_VALUE PacketByteCounterValue;
  /* 0x0018 */ volatile struct _NDIS_GFT_FLOW_STATE FlowState;
} NDIS_GFT_PACKET_BYTE_COUNTER_VALUE_AND_STATE, *PNDIS_GFT_PACKET_BYTE_COUNTER_VALUE_AND_STATE; /* size: 0x0020 */

typedef struct _NDIS_GFT_COUNTER_VALUE
{
  /* 0x0000 */ enum _NDIS_GFT_COUNTER_TYPE CounterType;
  /* 0x0004 */ long Padding_43;
  union
  {
    union
    {
      /* 0x0008 */ volatile struct _NDIS_GFT_PACKET_COUNTER_VALUE Packets;
      /* 0x0008 */ volatile struct _NDIS_GFT_BYTE_COUNTER_VALUE Bytes;
      /* 0x0008 */ volatile struct _NDIS_GFT_PACKET_BYTE_COUNTER_VALUE PacketsBytes;
      /* 0x0008 */ volatile struct _NDIS_GFT_PACKET_BYTE_COUNTER_VALUE_AND_STATE PacketsBytesAndState;
    }; /* size: 0x0020 */
  } /* size: 0x0020 */ CounterValue;
} NDIS_GFT_COUNTER_VALUE, *PNDIS_GFT_COUNTER_VALUE; /* size: 0x0028 */

typedef struct _NDIS_GFT_FLOW_ENTRY_ID_AND_COUNTER
{
  /* 0x0000 */ unsigned long FlowEntryId;
  /* 0x0004 */ long Padding_44;
  /* 0x0008 */ struct _NDIS_GFT_COUNTER_VALUE CounterValue;
} NDIS_GFT_FLOW_ENTRY_ID_AND_COUNTER, *PNDIS_GFT_FLOW_ENTRY_ID_AND_COUNTER; /* size: 0x0030 */

typedef enum _NDIS_GFT_HEADER_GROUP_TRANSPOSITION_ACTION
{
  NdisGftHeaderGroupTranspositionActionUndefined = 0,
  NdisGftHeaderGroupTranspositionActionModify = 1,
  NdisGftHeaderGroupTranspositionActionIgnore = 2,
  NdisGftHeaderGroupTranspositionActionPush = 3,
  NdisGftHeaderGroupTranspositionActionPop = 4,
  NdisGftHeaderGroupTranspositionActionMax = 5,
} NDIS_GFT_HEADER_GROUP_TRANSPOSITION_ACTION, *PNDIS_GFT_HEADER_GROUP_TRANSPOSITION_ACTION;

typedef enum _KINTERRUPT_MODE
{
  LevelSensitive = 0,
  Latched = 1,
} KINTERRUPT_MODE, *PKINTERRUPT_MODE;

typedef enum _NET_IF_DIRECTION_TYPE
{
  NET_IF_DIRECTION_SENDRECEIVE = 0,
  NET_IF_DIRECTION_SENDONLY = 1,
  NET_IF_DIRECTION_RECEIVEONLY = 2,
  NET_IF_DIRECTION_MAXIMUM = 3,
} NET_IF_DIRECTION_TYPE, *PNET_IF_DIRECTION_TYPE;

typedef enum _NDIS_PORT_PNP_STATE
{
  NdisPortPnPStateAllocating = 1,
  NdisPortPnPStateAllocated = 2,
  NdisPortPnPStateActivating = 3,
  NdisPortPnPStateActivated = 4,
  NdisPortPnPStateDeactivating = 5,
  NdisPortPnPStateDeactivated = 6,
  NdisPortPnPStateDeallocating = 7,
  NdisPortPnPStateDeallocated = 8,
} NDIS_PORT_PNP_STATE, *PNDIS_PORT_PNP_STATE;

typedef enum _POWER_STATE_TYPE
{
  SystemPowerState = 0,
  DevicePowerState = 1,
} POWER_STATE_TYPE, *PPOWER_STATE_TYPE;

typedef enum _MEMORY_CACHING_TYPE_ORIG
{
  MmFrameBufferCached = 2,
} MEMORY_CACHING_TYPE_ORIG, *PMEMORY_CACHING_TYPE_ORIG;

typedef enum _NDIS_802_11_AUTHENTICATION_MODE
{
  Ndis802_11AuthModeOpen = 0,
  Ndis802_11AuthModeShared = 1,
  Ndis802_11AuthModeAutoSwitch = 2,
  Ndis802_11AuthModeWPA = 3,
  Ndis802_11AuthModeWPAPSK = 4,
  Ndis802_11AuthModeWPANone = 5,
  Ndis802_11AuthModeWPA2 = 6,
  Ndis802_11AuthModeWPA2PSK = 7,
  Ndis802_11AuthModeWPA3 = 8,
  Ndis802_11AuthModeWPA3SAE = 9,
  Ndis802_11AuthModeOWE = 10,
  Ndis802_11AuthModeMax = 11,
} NDIS_802_11_AUTHENTICATION_MODE, *PNDIS_802_11_AUTHENTICATION_MODE;

typedef enum _IRQ_PRIORITY
{
  IrqPriorityUndefined = 0,
  IrqPriorityLow = 1,
  IrqPriorityNormal = 2,
  IrqPriorityHigh = 3,
} IRQ_PRIORITY, *PIRQ_PRIORITY;

typedef struct _IO_RESOURCE_DESCRIPTOR
{
  /* 0x0000 */ unsigned char Option;
  /* 0x0001 */ unsigned char Type;
  /* 0x0002 */ unsigned char ShareDisposition;
  /* 0x0003 */ unsigned char Spare1;
  /* 0x0004 */ unsigned short Flags;
  /* 0x0006 */ unsigned short Spare2;
  union
  {
    union
    {
      struct
      {
        /* 0x0008 */ unsigned long Length;
        /* 0x000c */ unsigned long Alignment;
        /* 0x0010 */ union _LARGE_INTEGER MinimumAddress;
        /* 0x0018 */ union _LARGE_INTEGER MaximumAddress;
      } /* size: 0x0018 */ Port;
      struct
      {
        /* 0x0008 */ unsigned long Length;
        /* 0x000c */ unsigned long Alignment;
        /* 0x0010 */ union _LARGE_INTEGER MinimumAddress;
        /* 0x0018 */ union _LARGE_INTEGER MaximumAddress;
      } /* size: 0x0018 */ Memory;
      struct
      {
        /* 0x0008 */ unsigned long MinimumVector;
        /* 0x000c */ unsigned long MaximumVector;
        /* 0x0010 */ unsigned short AffinityPolicy;
        /* 0x0012 */ unsigned short Group;
        /* 0x0014 */ enum _IRQ_PRIORITY PriorityPolicy;
        /* 0x0018 */ unsigned long TargetedProcessors;
      } /* size: 0x0014 */ Interrupt;
      struct
      {
        /* 0x0008 */ unsigned long MinimumChannel;
        /* 0x000c */ unsigned long MaximumChannel;
      } /* size: 0x0008 */ Dma;
      struct
      {
        /* 0x0008 */ unsigned long RequestLine;
        /* 0x000c */ unsigned long Reserved;
        /* 0x0010 */ unsigned long Channel;
        /* 0x0014 */ unsigned long TransferWidth;
      } /* size: 0x0010 */ DmaV3;
      struct
      {
        /* 0x0008 */ unsigned long Length;
        /* 0x000c */ unsigned long Alignment;
        /* 0x0010 */ union _LARGE_INTEGER MinimumAddress;
        /* 0x0018 */ union _LARGE_INTEGER MaximumAddress;
      } /* size: 0x0018 */ Generic;
      struct
      {
        /* 0x0008 */ unsigned long Data[3];
      } /* size: 0x000c */ DevicePrivate;
      struct
      {
        /* 0x0008 */ unsigned long Length;
        /* 0x000c */ unsigned long MinBusNumber;
        /* 0x0010 */ unsigned long MaxBusNumber;
        /* 0x0014 */ unsigned long Reserved;
      } /* size: 0x0010 */ BusNumber;
      struct
      {
        /* 0x0008 */ unsigned long Priority;
        /* 0x000c */ unsigned long Reserved1;
        /* 0x0010 */ unsigned long Reserved2;
      } /* size: 0x000c */ ConfigData;
      struct
      {
        /* 0x0008 */ unsigned long Length40;
        /* 0x000c */ unsigned long Alignment40;
        /* 0x0010 */ union _LARGE_INTEGER MinimumAddress;
        /* 0x0018 */ union _LARGE_INTEGER MaximumAddress;
      } /* size: 0x0018 */ Memory40;
      struct
      {
        /* 0x0008 */ unsigned long Length48;
        /* 0x000c */ unsigned long Alignment48;
        /* 0x0010 */ union _LARGE_INTEGER MinimumAddress;
        /* 0x0018 */ union _LARGE_INTEGER MaximumAddress;
      } /* size: 0x0018 */ Memory48;
      struct
      {
        /* 0x0008 */ unsigned long Length64;
        /* 0x000c */ unsigned long Alignment64;
        /* 0x0010 */ union _LARGE_INTEGER MinimumAddress;
        /* 0x0018 */ union _LARGE_INTEGER MaximumAddress;
      } /* size: 0x0018 */ Memory64;
      struct
      {
        /* 0x0008 */ unsigned char Class;
        /* 0x0009 */ unsigned char Type;
        /* 0x000a */ unsigned char Reserved1;
        /* 0x000b */ unsigned char Reserved2;
        /* 0x000c */ unsigned long IdLowPart;
        /* 0x0010 */ unsigned long IdHighPart;
      } /* size: 0x000c */ Connection;
    }; /* size: 0x0018 */
  } /* size: 0x0018 */ u;
} IO_RESOURCE_DESCRIPTOR, *PIO_RESOURCE_DESCRIPTOR; /* size: 0x0020 */

typedef struct _IO_RESOURCE_LIST
{
  /* 0x0000 */ unsigned short Version;
  /* 0x0002 */ unsigned short Revision;
  /* 0x0004 */ unsigned long Count;
  /* 0x0008 */ struct _IO_RESOURCE_DESCRIPTOR Descriptors[1];
} IO_RESOURCE_LIST, *PIO_RESOURCE_LIST; /* size: 0x0028 */

typedef enum _TlgBlob_t
{
  _TlgBlobNone = 0,
  _TlgBlobEnd = 1,
  _TlgBlobProvider = 2,
  _TlgBlobEvent3 = 3,
  _TlgBlobProvider3 = 4,
  _TlgBlobEvent2 = 5,
  _TlgBlobEvent4 = 6,
  _TlgBlobMax = 7,
} TlgBlob_t, *PTlgBlob_t;

typedef enum _NETSETUP_QUERY_STATE
{
  NetSetupQueryStateInitialized = 0,
  NetSetupQueryStateEnumCompleted = 1,
  NetSetupQueryStateAborted = 2,
  NetSetupQueryStateClosed = 3,
} NETSETUP_QUERY_STATE, *PNETSETUP_QUERY_STATE;

typedef struct _NDIS_GFP_TRANSPORT_PORT_WILDCARD_MATCH
{
  /* 0x0000 */ enum _NDIS_GFP_WILDCARD_MATCH_TYPE MatchType;
  /* 0x0004 */ unsigned short Port;
  /* 0x0006 */ unsigned short Range;
} NDIS_GFP_TRANSPORT_PORT_WILDCARD_MATCH, *PNDIS_GFP_TRANSPORT_PORT_WILDCARD_MATCH; /* size: 0x0008 */

struct NdisDebugBlock<1282691138>
{
}; /* size: 0x0001 */

struct _NDIS_IF_NETWORK_BLOCK;

typedef enum _NDIS_WDF_CX_DRIVER_STATE
{
  NdisCxDriverStateInvalid = 0,
  NdisCxDriverStateRegistered = 1,
  NdisCxDriverStateDeregistered = 2,
} NDIS_WDF_CX_DRIVER_STATE, *PNDIS_WDF_CX_DRIVER_STATE;

struct wistd::integral_constant<bool,0>
{
  /* 0x0000 */ const BOOL value;
}; /* size: 0x0001 */

typedef enum _SYSTEM_PROCESS_CLASSIFICATION
{
  SystemProcessClassificationNormal = 0,
  SystemProcessClassificationSystem = 1,
  SystemProcessClassificationSecureSystem = 2,
  SystemProcessClassificationMemCompression = 3,
  SystemProcessClassificationRegistry = 4,
  SystemProcessClassificationMaximum = 5,
} SYSTEM_PROCESS_CLASSIFICATION, *PSYSTEM_PROCESS_CLASSIFICATION;

typedef struct _KDEVICE_QUEUE_ENTRY
{
  /* 0x0000 */ struct _LIST_ENTRY DeviceListEntry;
  /* 0x0008 */ unsigned long SortKey;
  /* 0x000c */ unsigned char Inserted;
  /* 0x000d */ char __PADDING__[3];
} KDEVICE_QUEUE_ENTRY, *PKDEVICE_QUEUE_ENTRY; /* size: 0x0010 */

struct wil::details::resource_policy<unsigned long *,void __stdcall(unsigned long *) noexcept,&wil::details::ReleaseSpinLockFromDpcLevel,wistd::integral_constant<unsigned int,2>,unsigned long *,unsigned long *,0,std::nullptr_t>
{
}; /* size: 0x0001 */

typedef enum _NDIS_RECEIVE_QUEUE_TYPE
{
  NdisReceiveQueueTypeUnspecified = 0,
  NdisReceiveQueueTypeVMQueue = 1,
  NdisReceiveQueueTypeMaximum = 2,
} NDIS_RECEIVE_QUEUE_TYPE, *PNDIS_RECEIVE_QUEUE_TYPE;

typedef enum _KSPIN_LOCK_QUEUE_NUMBER
{
  LockQueueUnusedSpare0 = 0,
  LockQueueUnusedSpare1 = 1,
  LockQueueUnusedSpare2 = 2,
  LockQueueUnusedSpare3 = 3,
  LockQueueVacbLock = 4,
  LockQueueMasterLock = 5,
  LockQueueNonPagedPoolLock = 6,
  LockQueueIoCancelLock = 7,
  LockQueueUnusedSpare8 = 8,
  LockQueueIoVpbLock = 9,
  LockQueueIoDatabaseLock = 10,
  LockQueueIoCompletionLock = 11,
  LockQueueNtfsStructLock = 12,
  LockQueueAfdWorkQueueLock = 13,
  LockQueueBcbLock = 14,
  LockQueueUnusedSpare15 = 15,
  LockQueueUnusedSpare16 = 16,
  LockQueueMaximumLock = 17,
} KSPIN_LOCK_QUEUE_NUMBER, *PKSPIN_LOCK_QUEUE_NUMBER;

typedef struct _NDIS_WDF_CX_CHARACTERISTICS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ void* EvtCxPowerReference /* function */;
  /* 0x0008 */ void* EvtCxPowerDereference /* function */;
  /* 0x000c */ void* EvtCxPowerAoAcEngage /* function */;
  /* 0x0010 */ void* EvtCxPowerAoAcDisengage /* function */;
  /* 0x0014 */ void* EvtCxGetDeviceObject /* function */;
  /* 0x0018 */ void* EvtCxGetNextDeviceObject /* function */;
  /* 0x001c */ void* EvtCxGetAssignedFdoName /* function */;
  /* 0x0020 */ void* EvtCxGetNdisHandleFromDeviceObject /* function */;
  /* 0x0024 */ void* EvtCxUpdatePMParameters /* function */;
  /* 0x0028 */ void* EvtCxAllocateMiniportBlock /* function */;
  /* 0x002c */ void* EvtCxMiniportCompleteAdd /* function */;
  /* 0x0030 */ void* EvtCxDeviceStartComplete /* function */;
  /* 0x0034 */ void* EvtCxMiniportDeviceReset /* function */;
  /* 0x0038 */ void* EvtCxMiniportQueryDeviceResetSupport /* function */;
  /* 0x003c */ void* EvtCxGetWmiEventGuid /* function */;
} NDIS_WDF_CX_CHARACTERISTICS, *PNDIS_WDF_CX_CHARACTERISTICS; /* size: 0x0040 */

typedef struct _KSYSTEM_TIME
{
  /* 0x0000 */ unsigned long LowPart;
  /* 0x0004 */ long High1Time;
  /* 0x0008 */ long High2Time;
} KSYSTEM_TIME, *PKSYSTEM_TIME; /* size: 0x000c */

class KRef<NDIS_BIND_FILTER_DRIVER>
{
  /* 0x0000 */ class KRef<NDIS_BIND_FILTER_DRIVER>::KRefHolder* _p;
}; /* size: 0x0004 */

struct NDIS_BIND_FILTER_LINK
{
  /* 0x0000 */ long Padding_45[13];
  /* 0x0034 */ class KRef<NDIS_BIND_FILTER_DRIVER> BindDriver;
  /* 0x0038 */ unsigned long FilterIndex;
}; /* size: 0x003c */

typedef enum _NDIS_PER_PACKET_INFO
{
  TcpIpChecksumPacketInfo = 0,
  IpSecPacketInfo = 1,
  TcpLargeSendPacketInfo = 2,
  ClassificationHandlePacketInfo = 3,
  NdisReserved = 4,
  ScatterGatherListPacketInfo = 5,
  Ieee8021QInfo = 6,
  OriginalPacketInfo = 7,
  PacketCancelId = 8,
  OriginalNetBufferList = 9,
  CachedNetBufferList = 10,
  ShortPacketPaddingInfo = 11,
  MaxPerPacketInfo = 12,
} NDIS_PER_PACKET_INFO, *PNDIS_PER_PACKET_INFO;

typedef enum _NDIS_WAN_QUALITY
{
  NdisWanRaw = 0,
  NdisWanErrorControl = 1,
  NdisWanReliable = 2,
} NDIS_WAN_QUALITY, *PNDIS_WAN_QUALITY;

struct LIST_ENTRY64
{
  /* 0x0000 */ unsigned __int64 Flink;
  /* 0x0008 */ unsigned __int64 Blink;
}; /* size: 0x0010 */

typedef enum _NETSETUP_PNP_DEVICE_CLASS
{
  NetSetupPnpDeviceClassNet = 0,
  NetSetupPnpDeviceClassInfrared = 1,
} NETSETUP_PNP_DEVICE_CLASS, *PNETSETUP_PNP_DEVICE_CLASS;

typedef struct _TCP_OFFLOAD_STATE_CONST
{
  /* 0x0000 */ struct _OFFLOAD_STATE_HEADER Header;
  /* 0x0008 */ unsigned short Flags;
  /* 0x000a */ unsigned short RemotePort;
  /* 0x000c */ unsigned short LocalPort;
  struct /* bitfield */
  {
    /* 0x000e */ unsigned char SndWindScale : 4; /* bit position: 0 */
    /* 0x000e */ unsigned char RcvWindScale : 4; /* bit position: 4 */
  }; /* bitfield */
  /* 0x000f */ char Padding_46;
  /* 0x0010 */ unsigned short RemoteMss;
  /* 0x0012 */ char Padding_47[2];
  /* 0x0014 */ unsigned long HashValue;
} TCP_OFFLOAD_STATE_CONST, *PTCP_OFFLOAD_STATE_CONST; /* size: 0x0018 */

typedef enum _NDIS_POWER_PROFILE
{
  NdisPowerProfileBattery = 0,
  NdisPowerProfileAcOnLine = 1,
} NDIS_POWER_PROFILE, *PNDIS_POWER_PROFILE;

typedef enum _NDIS_NIC_SWITCH_VPORT_INTERRUPT_MODERATION
{
  NdisNicSwitchVPortInterruptModerationUndefined = 0,
  NdisNicSwitchVPortInterruptModerationAdaptive = 1,
  NdisNicSwitchVPortInterruptModerationOff = 2,
  NdisNicSwitchVPortInterruptModerationLow = 100,
  NdisNicSwitchVPortInterruptModerationMedium = 200,
  NdisNicSwitchVPortInterruptModerationHigh = 300,
} NDIS_NIC_SWITCH_VPORT_INTERRUPT_MODERATION, *PNDIS_NIC_SWITCH_VPORT_INTERRUPT_MODERATION;

typedef struct _flowspec
{
  /* 0x0000 */ unsigned long TokenRate;
  /* 0x0004 */ unsigned long TokenBucketSize;
  /* 0x0008 */ unsigned long PeakBandwidth;
  /* 0x000c */ unsigned long Latency;
  /* 0x0010 */ unsigned long DelayVariation;
  /* 0x0014 */ unsigned long ServiceType;
  /* 0x0018 */ unsigned long MaxSduSize;
  /* 0x001c */ unsigned long MinimumPolicedSize;
} flowspec, *Pflowspec; /* size: 0x0020 */

typedef enum _NDIS_ENVIRONMENT_TYPE
{
  NdisEnvironmentWindows = 0,
  NdisEnvironmentWindowsNt = 1,
} NDIS_ENVIRONMENT_TYPE, *PNDIS_ENVIRONMENT_TYPE;

typedef struct _NDIS_REQUEST::_DATA::_QUERY_INFORMATION
{
  /* 0x0000 */ unsigned long Oid;
  /* 0x0004 */ void* InformationBuffer;
  /* 0x0008 */ unsigned int InformationBufferLength;
  /* 0x000c */ unsigned int BytesWritten;
  /* 0x0010 */ unsigned int BytesNeeded;
} NDIS_REQUEST::_DATA::_QUERY_INFORMATION, *PNDIS_REQUEST::_DATA::_QUERY_INFORMATION; /* size: 0x0014 */

typedef struct _NDIS_REQUEST::_DATA::_SET_INFORMATION
{
  /* 0x0000 */ unsigned long Oid;
  /* 0x0004 */ void* InformationBuffer;
  /* 0x0008 */ unsigned int InformationBufferLength;
  /* 0x000c */ unsigned int BytesRead;
  /* 0x0010 */ unsigned int BytesNeeded;
} NDIS_REQUEST::_DATA::_SET_INFORMATION, *PNDIS_REQUEST::_DATA::_SET_INFORMATION; /* size: 0x0014 */

typedef union _NDIS_REQUEST::_DATA
{
  union
  {
    /* 0x0000 */ struct _NDIS_REQUEST::_DATA::_QUERY_INFORMATION QUERY_INFORMATION;
    /* 0x0000 */ struct _NDIS_REQUEST::_DATA::_SET_INFORMATION SET_INFORMATION;
  }; /* size: 0x0014 */
} NDIS_REQUEST::_DATA, *PNDIS_REQUEST::_DATA; /* size: 0x0014 */

typedef struct _NDIS_REQUEST
{
  /* 0x0000 */ unsigned char MacReserved[16];
  /* 0x0010 */ enum _NDIS_REQUEST_TYPE RequestType;
  /* 0x0014 */ union _NDIS_REQUEST::_DATA DATA;
  /* 0x0028 */ unsigned char NdisReserved[36];
  union
  {
    /* 0x004c */ unsigned char CallMgrReserved[8];
    /* 0x004c */ unsigned char ProtocolReserved[8];
  }; /* size: 0x0008 */
  /* 0x0054 */ unsigned char MiniportReserved[8];
} NDIS_REQUEST, *PNDIS_REQUEST; /* size: 0x005c */

typedef enum _NDIS_DEVICE_PNP_EVENT
{
  NdisDevicePnPEventQueryRemoved = 0,
  NdisDevicePnPEventRemoved = 1,
  NdisDevicePnPEventSurpriseRemoved = 2,
  NdisDevicePnPEventQueryStopped = 3,
  NdisDevicePnPEventStopped = 4,
  NdisDevicePnPEventPowerProfileChanged = 5,
  NdisDevicePnPEventFilterListChanged = 6,
  NdisDevicePnPEventMaximum = 7,
} NDIS_DEVICE_PNP_EVENT, *PNDIS_DEVICE_PNP_EVENT;

struct wil_details_StagingConfigWnfStateName
{
  /* 0x0000 */ unsigned int Data[2];
}; /* size: 0x0008 */

struct wil_details_StagingConfigUsageTrigger
{
  /* 0x0000 */ unsigned int featureId;
  /* 0x0004 */ struct wil_details_StagingConfigWnfStateName trigger;
  struct /* bitfield */
  {
    /* 0x000c */ unsigned int serviceReportingKind : 16; /* bit position: 0 */
    /* 0x000c */ unsigned int isVariantConfig : 1; /* bit position: 16 */
    /* 0x000c */ unsigned int unused : 15; /* bit position: 17 */
  }; /* bitfield */
}; /* size: 0x0010 */

struct KALLOCATION_TAG<1920090443,1>
{
  union
  {
    /* 0x0000 */ const unsigned long AllocationTag;
    /* 0x0000 */ const unsigned long AllocationArena;
  }; /* size: 0x0004 */
  /* 0x0004 */ char __PADDING__[4294967293];
}; /* size: 0x0001 */

enum TlgOut_t
{
  TlgOutNULL = 0,
  TlgOutNOPRINT = 1,
  TlgOutSTRING = 2,
  TlgOutBOOLEAN = 3,
  TlgOutHEX = 4,
  TlgOutPID = 5,
  TlgOutTID = 6,
  TlgOutPORT = 7,
  TlgOutIPV4 = 8,
  TlgOutIPV6 = 9,
  TlgOutSOCKETADDRESS = 10,
  TlgOutXML = 11,
  TlgOutJSON = 12,
  TlgOutWIN32ERROR = 13,
  TlgOutNTSTATUS = 14,
  TlgOutHRESULT = 15,
  TlgOutFILETIME = 16,
  TlgOutSIGNED = 17,
  TlgOutUNSIGNED = 18,
  TlgOutUTF8 = 35,
  TlgOutPKCS7_WITH_TYPE_INFO = 36,
  TlgOutCODE_POINTER = 37,
  TlgOutDATETIME_UTC = 38,
  _TlgOutMax = 39,
  _TlgOutChain = 128,
  _TlgOutTypeMask = 127,
};

typedef enum _USER_ACTIVITY_PRESENCE
{
  PowerUserPresent = 0,
  PowerUserNotPresent = 1,
  PowerUserInactive = 2,
  PowerUserMaximum = 3,
  PowerUserInvalid = 3,
} USER_ACTIVITY_PRESENCE, *PUSER_ACTIVITY_PRESENCE;

typedef struct _SECURITY_SUBJECT_CONTEXT
{
  /* 0x0000 */ void* ClientToken;
  /* 0x0004 */ enum _SECURITY_IMPERSONATION_LEVEL ImpersonationLevel;
  /* 0x0008 */ void* PrimaryToken;
  /* 0x000c */ void* ProcessAuditId;
} SECURITY_SUBJECT_CONTEXT, *PSECURITY_SUBJECT_CONTEXT; /* size: 0x0010 */

typedef struct _NDIS_FILTER_PARTIAL_CHARACTERISTICS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ void* SendNetBufferListsHandler /* function */;
  /* 0x000c */ void* SendNetBufferListsCompleteHandler /* function */;
  /* 0x0010 */ void* CancelSendNetBufferListsHandler /* function */;
  /* 0x0014 */ void* ReceiveNetBufferListsHandler /* function */;
  /* 0x0018 */ void* ReturnNetBufferListsHandler /* function */;
} NDIS_FILTER_PARTIAL_CHARACTERISTICS, *PNDIS_FILTER_PARTIAL_CHARACTERISTICS; /* size: 0x001c */

typedef struct _MCGEN_TRACE_CONTEXT
{
  /* 0x0000 */ unsigned __int64 RegistrationHandle;
  /* 0x0008 */ unsigned __int64 Logger;
  /* 0x0010 */ unsigned __int64 MatchAnyKeyword;
  /* 0x0018 */ unsigned __int64 MatchAllKeyword;
  /* 0x0020 */ unsigned long Flags;
  /* 0x0024 */ unsigned long IsEnabled;
  /* 0x0028 */ unsigned char Level;
  /* 0x0029 */ unsigned char Reserve;
  /* 0x002a */ unsigned short EnableBitsCount;
  /* 0x002c */ unsigned long* EnableBitMask;
  /* 0x0030 */ const unsigned __int64* EnableKeyWords;
  /* 0x0034 */ const unsigned char* EnableLevel;
} MCGEN_TRACE_CONTEXT, *PMCGEN_TRACE_CONTEXT; /* size: 0x0038 */

typedef struct _XSTATE_FEATURE
{
  /* 0x0000 */ unsigned long Offset;
  /* 0x0004 */ unsigned long Size;
} XSTATE_FEATURE, *PXSTATE_FEATURE; /* size: 0x0008 */

typedef struct _XSTATE_CONFIGURATION
{
  /* 0x0000 */ unsigned __int64 EnabledFeatures;
  /* 0x0008 */ unsigned __int64 EnabledVolatileFeatures;
  /* 0x0010 */ unsigned long Size;
  union
  {
    /* 0x0014 */ unsigned long ControlFlags;
    struct /* bitfield */
    {
      /* 0x0014 */ unsigned long OptimizedSave : 1; /* bit position: 0 */
      /* 0x0014 */ unsigned long CompactionEnabled : 1; /* bit position: 1 */
    }; /* bitfield */
  }; /* size: 0x0004 */
  /* 0x0018 */ struct _XSTATE_FEATURE Features[64];
  /* 0x0218 */ unsigned __int64 EnabledSupervisorFeatures;
  /* 0x0220 */ unsigned __int64 AlignedFeatures;
  /* 0x0228 */ unsigned long AllFeatureSize;
  /* 0x022c */ unsigned long AllFeatures[64];
  /* 0x032c */ long Padding_48;
  /* 0x0330 */ unsigned __int64 EnabledUserVisibleSupervisorFeatures;
} XSTATE_CONFIGURATION, *PXSTATE_CONFIGURATION; /* size: 0x0338 */

typedef struct _KUSER_SHARED_DATA
{
  /* 0x0000 */ unsigned long TickCountLowDeprecated;
  /* 0x0004 */ unsigned long TickCountMultiplier;
  /* 0x0008 */ volatile struct _KSYSTEM_TIME InterruptTime;
  /* 0x0014 */ volatile struct _KSYSTEM_TIME SystemTime;
  /* 0x0020 */ volatile struct _KSYSTEM_TIME TimeZoneBias;
  /* 0x002c */ unsigned short ImageNumberLow;
  /* 0x002e */ unsigned short ImageNumberHigh;
  /* 0x0030 */ wchar_t NtSystemRoot[260];
  /* 0x0238 */ unsigned long MaxStackTraceDepth;
  /* 0x023c */ unsigned long CryptoExponent;
  /* 0x0240 */ unsigned long TimeZoneId;
  /* 0x0244 */ unsigned long LargePageMinimum;
  /* 0x0248 */ unsigned long AitSamplingValue;
  /* 0x024c */ unsigned long AppCompatFlag;
  /* 0x0250 */ unsigned __int64 RNGSeedVersion;
  /* 0x0258 */ unsigned long GlobalValidationRunlevel;
  /* 0x025c */ volatile long TimeZoneBiasStamp;
  /* 0x0260 */ unsigned long NtBuildNumber;
  /* 0x0264 */ enum _NT_PRODUCT_TYPE NtProductType;
  /* 0x0268 */ unsigned char ProductTypeIsValid;
  /* 0x0269 */ unsigned char Reserved0[1];
  /* 0x026a */ unsigned short NativeProcessorArchitecture;
  /* 0x026c */ unsigned long NtMajorVersion;
  /* 0x0270 */ unsigned long NtMinorVersion;
  /* 0x0274 */ unsigned char ProcessorFeatures[64];
  /* 0x02b4 */ unsigned long Reserved1;
  /* 0x02b8 */ unsigned long Reserved3;
  /* 0x02bc */ volatile unsigned long TimeSlip;
  /* 0x02c0 */ enum _ALTERNATIVE_ARCHITECTURE_TYPE AlternativeArchitecture;
  /* 0x02c4 */ unsigned long BootId;
  /* 0x02c8 */ union _LARGE_INTEGER SystemExpirationDate;
  /* 0x02d0 */ unsigned long SuiteMask;
  /* 0x02d4 */ unsigned char KdDebuggerEnabled;
  union
  {
    /* 0x02d5 */ unsigned char MitigationPolicies;
    struct /* bitfield */
    {
      /* 0x02d5 */ unsigned char NXSupportPolicy : 2; /* bit position: 0 */
      /* 0x02d5 */ unsigned char SEHValidationPolicy : 2; /* bit position: 2 */
      /* 0x02d5 */ unsigned char CurDirDevicesSkippedForDlls : 2; /* bit position: 4 */
      /* 0x02d5 */ unsigned char Reserved : 2; /* bit position: 6 */
    }; /* bitfield */
  }; /* size: 0x0001 */
  /* 0x02d6 */ unsigned short CyclesPerYield;
  /* 0x02d8 */ volatile unsigned long ActiveConsoleId;
  /* 0x02dc */ volatile unsigned long DismountCount;
  /* 0x02e0 */ unsigned long ComPlusPackage;
  /* 0x02e4 */ unsigned long LastSystemRITEventTickCount;
  /* 0x02e8 */ unsigned long NumberOfPhysicalPages;
  /* 0x02ec */ unsigned char SafeBootMode;
  /* 0x02ed */ unsigned char VirtualizationFlags;
  /* 0x02ee */ unsigned char Reserved12[2];
  union
  {
    /* 0x02f0 */ unsigned long SharedDataFlags;
    struct /* bitfield */
    {
      /* 0x02f0 */ unsigned long DbgErrorPortPresent : 1; /* bit position: 0 */
      /* 0x02f0 */ unsigned long DbgElevationEnabled : 1; /* bit position: 1 */
      /* 0x02f0 */ unsigned long DbgVirtEnabled : 1; /* bit position: 2 */
      /* 0x02f0 */ unsigned long DbgInstallerDetectEnabled : 1; /* bit position: 3 */
      /* 0x02f0 */ unsigned long DbgLkgEnabled : 1; /* bit position: 4 */
      /* 0x02f0 */ unsigned long DbgDynProcessorEnabled : 1; /* bit position: 5 */
      /* 0x02f0 */ unsigned long DbgConsoleBrokerEnabled : 1; /* bit position: 6 */
      /* 0x02f0 */ unsigned long DbgSecureBootEnabled : 1; /* bit position: 7 */
      /* 0x02f0 */ unsigned long DbgMultiSessionSku : 1; /* bit position: 8 */
      /* 0x02f0 */ unsigned long DbgMultiUsersInSessionSku : 1; /* bit position: 9 */
      /* 0x02f0 */ unsigned long DbgStateSeparationEnabled : 1; /* bit position: 10 */
      /* 0x02f0 */ unsigned long SpareBits : 21; /* bit position: 11 */
    }; /* bitfield */
  }; /* size: 0x0004 */
  /* 0x02f4 */ unsigned long DataFlagsPad[1];
  /* 0x02f8 */ unsigned __int64 TestRetInstruction;
  /* 0x0300 */ __int64 QpcFrequency;
  /* 0x0308 */ unsigned long SystemCall;
  union
  {
    union
    {
      /* 0x030c */ unsigned long AllFlags;
      struct /* bitfield */
      {
        /* 0x030c */ unsigned long Win32Process : 1; /* bit position: 0 */
        /* 0x030c */ unsigned long Sgx2Enclave : 1; /* bit position: 1 */
        /* 0x030c */ unsigned long VbsBasicEnclave : 1; /* bit position: 2 */
        /* 0x030c */ unsigned long SpareBits : 29; /* bit position: 3 */
      }; /* bitfield */
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ UserCetAvailableEnvironments;
  /* 0x0310 */ unsigned __int64 SystemCallPad[2];
  union
  {
    /* 0x0320 */ volatile struct _KSYSTEM_TIME TickCount;
    /* 0x0320 */ volatile unsigned __int64 TickCountQuad;
    /* 0x0320 */ unsigned long ReservedTickCountOverlay[3];
  }; /* size: 0x000c */
  /* 0x032c */ unsigned long TickCountPad[1];
  /* 0x0330 */ unsigned long Cookie;
  /* 0x0334 */ unsigned long CookiePad[1];
  /* 0x0338 */ __int64 ConsoleSessionForegroundProcessId;
  /* 0x0340 */ unsigned __int64 TimeUpdateLock;
  /* 0x0348 */ unsigned __int64 BaselineSystemTimeQpc;
  /* 0x0350 */ unsigned __int64 BaselineInterruptTimeQpc;
  /* 0x0358 */ unsigned __int64 QpcSystemTimeIncrement;
  /* 0x0360 */ unsigned __int64 QpcInterruptTimeIncrement;
  /* 0x0368 */ unsigned char QpcSystemTimeIncrementShift;
  /* 0x0369 */ unsigned char QpcInterruptTimeIncrementShift;
  /* 0x036a */ unsigned short UnparkedProcessorCount;
  /* 0x036c */ unsigned long EnclaveFeatureMask[4];
  /* 0x037c */ unsigned long TelemetryCoverageRound;
  /* 0x0380 */ unsigned short UserModeGlobalLogger[16];
  /* 0x03a0 */ unsigned long ImageFileExecutionOptions;
  /* 0x03a4 */ unsigned long LangGenerationCount;
  /* 0x03a8 */ unsigned __int64 Reserved4;
  /* 0x03b0 */ volatile unsigned __int64 InterruptTimeBias;
  /* 0x03b8 */ volatile unsigned __int64 QpcBias;
  /* 0x03c0 */ unsigned long ActiveProcessorCount;
  /* 0x03c4 */ volatile unsigned char ActiveGroupCount;
  /* 0x03c5 */ unsigned char Reserved9;
  union
  {
    /* 0x03c6 */ unsigned short QpcData;
    struct
    {
      /* 0x03c6 */ volatile unsigned char QpcBypassEnabled;
      /* 0x03c7 */ unsigned char QpcShift;
    }; /* size: 0x0002 */
  }; /* size: 0x0002 */
  /* 0x03c8 */ union _LARGE_INTEGER TimeZoneBiasEffectiveStart;
  /* 0x03d0 */ union _LARGE_INTEGER TimeZoneBiasEffectiveEnd;
  /* 0x03d8 */ struct _XSTATE_CONFIGURATION XState;
  /* 0x0710 */ struct _KSYSTEM_TIME FeatureConfigurationChangeStamp;
  /* 0x071c */ unsigned long Spare;
} KUSER_SHARED_DATA, *PKUSER_SHARED_DATA; /* size: 0x0720 */

enum INDICATE_OFFLOAD_EVENT
{
  NeighborReachabilityInDoubt = 1,
  NeighborReachabilityQuery = 2,
  MaxOffloadEvent = 3,
};

typedef enum _NDIS_PORT_TYPE
{
  NdisPortTypeUndefined = 0,
  NdisPortTypeBridge = 1,
  NdisPortTypeRasConnection = 2,
  NdisPortType8021xSupplicant = 3,
  NdisPortTypeNdisImPlatform = 4,
  NdisPortTypeMax = 5,
} NDIS_PORT_TYPE, *PNDIS_PORT_TYPE;

typedef struct _NDIS_802_11_SSID
{
  /* 0x0000 */ unsigned long SsidLength;
  /* 0x0004 */ unsigned char Ssid[32];
} NDIS_802_11_SSID, *PNDIS_802_11_SSID; /* size: 0x0024 */

typedef struct _NDIS_802_11_NON_BCAST_SSID_LIST
{
  /* 0x0000 */ unsigned long NumberOfItems;
  /* 0x0004 */ struct _NDIS_802_11_SSID Non_Bcast_Ssid[1];
} NDIS_802_11_NON_BCAST_SSID_LIST, *PNDIS_802_11_NON_BCAST_SSID_LIST; /* size: 0x0028 */

struct LIST_ENTRY32
{
  /* 0x0000 */ unsigned long Flink;
  /* 0x0004 */ unsigned long Blink;
}; /* size: 0x0008 */

struct NDIS_BIND_PROTOCOL_DRIVER
{
  /* 0x0000 */ long Padding_49[3];
  /* 0x000c */ class wistd::unique_ptr<Rtl::KString,wistd::default_delete<Rtl::KString> > Name;
  /* 0x0010 */ unsigned long ProtocolBindFlags;
  /* 0x0014 */ struct _NDIS_PROTOCOL_BLOCK* RunningDriver;
}; /* size: 0x0018 */

struct wil::details::resource_policy<void *,long (__stdcall*)(void *),&ZwClose,wistd::integral_constant<unsigned int,0>,void *,void *,0,std::nullptr_t>
{
}; /* size: 0x0001 */

typedef struct _NDIS_OID_REQUEST_FLAGS
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned long Completed : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned long FreeRequest : 1; /* bit position: 1 */
    /* 0x0000 */ unsigned long OidInTable : 1; /* bit position: 2 */
    /* 0x0000 */ unsigned long SignalEvent : 1; /* bit position: 3 */
    /* 0x0000 */ unsigned long CoNdis : 1; /* bit position: 4 */
    /* 0x0000 */ unsigned long FromProtocol : 1; /* bit position: 5 */
    /* 0x0000 */ unsigned long FromFilter : 1; /* bit position: 6 */
    /* 0x0000 */ unsigned long Passthrough : 1; /* bit position: 7 */
    /* 0x0000 */ unsigned long LastRestoreFilter : 1; /* bit position: 8 */
    /* 0x0000 */ unsigned long OnlyDerefOpen : 1; /* bit position: 9 */
    /* 0x0000 */ unsigned long SignalAndExit : 1; /* bit position: 10 */
    /* 0x0000 */ unsigned long MpSaveBuf : 1; /* bit position: 11 */
    /* 0x0000 */ unsigned long Reserved2 : 1; /* bit position: 12 */
    /* 0x0000 */ unsigned long DownLevel : 1; /* bit position: 13 */
    /* 0x0000 */ unsigned long Cloned : 1; /* bit position: 14 */
    /* 0x0000 */ unsigned long Mandatory : 1; /* bit position: 15 */
    /* 0x0000 */ unsigned long SentToMiniport : 1; /* bit position: 16 */
    /* 0x0000 */ unsigned long SentToFilter : 1; /* bit position: 17 */
    /* 0x0000 */ unsigned long ForReset : 1; /* bit position: 18 */
    /* 0x0000 */ unsigned long ForRestore : 1; /* bit position: 19 */
    /* 0x0000 */ unsigned long ForMpDirect : 1; /* bit position: 20 */
    /* 0x0000 */ unsigned long DirectRequest : 1; /* bit position: 21 */
    /* 0x0000 */ unsigned long RevisionChanged : 1; /* bit position: 22 */
    /* 0x0000 */ unsigned long SkipPreProc : 1; /* bit position: 23 */
    /* 0x0000 */ unsigned long SkipPostProc : 1; /* bit position: 24 */
    /* 0x0000 */ unsigned long SkipSourceCompletion : 1; /* bit position: 25 */
    /* 0x0000 */ unsigned long SourceCompletionOnly : 1; /* bit position: 26 */
    /* 0x0000 */ unsigned long InternalClone : 1; /* bit position: 27 */
    /* 0x0000 */ unsigned long Remainder : 4; /* bit position: 28 */
  }; /* bitfield */
} NDIS_OID_REQUEST_FLAGS, *PNDIS_OID_REQUEST_FLAGS; /* size: 0x0004 */

typedef enum _TRACE_INFORMATION_CLASS
{
  TraceIdClass = 0,
  TraceHandleClass = 1,
  TraceEnableFlagsClass = 2,
  TraceEnableLevelClass = 3,
  GlobalLoggerHandleClass = 4,
  EventLoggerHandleClass = 5,
  AllLoggerHandlesClass = 6,
  TraceHandleByNameClass = 7,
  LoggerEventsLostClass = 8,
  TraceSessionSettingsClass = 9,
  LoggerEventsLoggedClass = 10,
  DiskIoNotifyRoutinesClass = 11,
  TraceInformationClassReserved1 = 12,
  AllPossibleNotifyRoutinesClass = 12,
  FltIoNotifyRoutinesClass = 13,
  TraceInformationClassReserved2 = 14,
  WdfNotifyRoutinesClass = 15,
  MaxTraceInformationClass = 16,
} TRACE_INFORMATION_CLASS, *PTRACE_INFORMATION_CLASS;

typedef struct _LUID_AND_ATTRIBUTES
{
  /* 0x0000 */ struct _LUID Luid;
  /* 0x0008 */ unsigned long Attributes;
} LUID_AND_ATTRIBUTES, *PLUID_AND_ATTRIBUTES; /* size: 0x000c */

typedef struct _NDIS_MINIPORT_ADAPTER_PACKET_DIRECT_ATTRIBUTES
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ unsigned char DmaAddressWidth;
  /* 0x0009 */ char __PADDING__[3];
} NDIS_MINIPORT_ADAPTER_PACKET_DIRECT_ATTRIBUTES, *PNDIS_MINIPORT_ADAPTER_PACKET_DIRECT_ATTRIBUTES; /* size: 0x000c */

typedef enum _WWAN_AUTH_METHOD
{
  WwanAuthSim = 0,
  WwanAuthAka = 1,
  WwanAuthAkaPrime = 2,
  WwanAuthMethodMax = 3,
} WWAN_AUTH_METHOD, *PWWAN_AUTH_METHOD;

typedef struct _WWAN_AUTH_SIM_CHALLENGE
{
  /* 0x0000 */ unsigned char Rand1[16];
  /* 0x0010 */ unsigned char Rand2[16];
  /* 0x0020 */ unsigned char Rand3[16];
  /* 0x0030 */ unsigned long n;
} WWAN_AUTH_SIM_CHALLENGE, *PWWAN_AUTH_SIM_CHALLENGE; /* size: 0x0034 */

typedef struct _WWAN_AUTH_AKA_CHALLENGE
{
  /* 0x0000 */ unsigned char Rand[16];
  /* 0x0010 */ unsigned char Autn[16];
} WWAN_AUTH_AKA_CHALLENGE, *PWWAN_AUTH_AKA_CHALLENGE; /* size: 0x0020 */

typedef struct _WWAN_AUTH_AKAP_CHALLENGE
{
  /* 0x0000 */ unsigned char Rand[16];
  /* 0x0010 */ unsigned char Autn[16];
  /* 0x0020 */ unsigned char NetworkName[256];
  /* 0x0120 */ unsigned long NetworkNameLength;
} WWAN_AUTH_AKAP_CHALLENGE, *PWWAN_AUTH_AKAP_CHALLENGE; /* size: 0x0124 */

typedef struct _WWAN_AUTH_CHALLENGE
{
  /* 0x0000 */ enum _WWAN_AUTH_METHOD AuthMethod;
  union
  {
    union
    {
      /* 0x0004 */ struct _WWAN_AUTH_SIM_CHALLENGE AuthSim;
      /* 0x0004 */ struct _WWAN_AUTH_AKA_CHALLENGE AuthAka;
      /* 0x0004 */ struct _WWAN_AUTH_AKAP_CHALLENGE AuthAkap;
    }; /* size: 0x0124 */
  } /* size: 0x0124 */ u;
} WWAN_AUTH_CHALLENGE, *PWWAN_AUTH_CHALLENGE; /* size: 0x0128 */

typedef struct _NDIS_WWAN_AUTH_CHALLENGE
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ struct _WWAN_AUTH_CHALLENGE AuthChallenge;
} NDIS_WWAN_AUTH_CHALLENGE, *PNDIS_WWAN_AUTH_CHALLENGE; /* size: 0x012c */

typedef enum _EXCEPTION_DISPOSITION
{
  ExceptionContinueExecution = 0,
  ExceptionContinueSearch = 1,
  ExceptionNestedException = 2,
  ExceptionCollidedUnwind = 3,
} EXCEPTION_DISPOSITION, *PEXCEPTION_DISPOSITION;

typedef enum _NDIS_PARAMETER_TYPE
{
  NdisParameterInteger = 0,
  NdisParameterHexInteger = 1,
  NdisParameterString = 2,
  NdisParameterMultiString = 3,
  NdisParameterBinary = 4,
} NDIS_PARAMETER_TYPE, *PNDIS_PARAMETER_TYPE;

enum NDIS_CHIMNEY_OFFLOAD_TYPE
{
  NdisTcpChimneyOffload = 1,
  NdisIpsecChimneyOffload = 2,
  NdisRdmaChimneyOffload = 3,
  NdisMaxChimneyOffload = 4,
};

typedef struct _DOT11_WFD_ATTRIBUTES
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long uNumConcurrentGORole;
  /* 0x0008 */ unsigned long uNumConcurrentClientRole;
  /* 0x000c */ unsigned long WPSVersionsSupported;
  /* 0x0010 */ unsigned char bServiceDiscoverySupported;
  /* 0x0011 */ unsigned char bClientDiscoverabilitySupported;
  /* 0x0012 */ unsigned char bInfrastructureManagementSupported;
  /* 0x0013 */ char Padding_50;
  /* 0x0014 */ unsigned long uMaxSecondaryDeviceTypeListSize;
  /* 0x0018 */ unsigned char DeviceAddress[6];
  /* 0x001e */ char Padding_51[2];
  /* 0x0020 */ unsigned long uInterfaceAddressListCount;
  /* 0x0024 */ unsigned char* pInterfaceAddressList[6];
  /* 0x0028 */ unsigned long uNumSupportedCountryOrRegionStrings;
  /* 0x002c */ unsigned char* pSupportedCountryOrRegionStrings[3];
  /* 0x0030 */ unsigned long uDiscoveryFilterListSize;
  /* 0x0034 */ unsigned long uGORoleClientTableSize;
} DOT11_WFD_ATTRIBUTES, *PDOT11_WFD_ATTRIBUTES; /* size: 0x0038 */

typedef enum _NDIS_MPIF_REFTAG
{
  MPIFREF_IMDEINIT = 0,
  MPIFREF_AOAC = 1,
  MPIFREF_QUERYOBJ = 2,
  MPIFREF_GETTOP = 3,
  MPIFREF_GETRCVADDR = 4,
  MPIFREF_GETALLRCVADDR = 5,
  MPIFREF_CHIIB = 6,
  MPIFREF_CHIIUF = 7,
  MPIFREF_CHIIC = 8,
  MPIFREF_ENUMRCVADDR = 9,
  MPIFREF_SETISTATE = 10,
  MPIFREF_PMINIT = 11,
  MPIFREF_DEVPOWERUPFAIL = 12,
  MPIFREF_DEVPOWERUP = 13,
  MPIFREF_POWERDOWN = 14,
  MPIFREF_POWERDOWNFAIL = 15,
  MPIFREF_WMI = 16,
  MPIFREF_INITIALSTATE = 17,
  MPIFREF_REFMPGUID = 18,
  MPIFREF_FATAL_ERROR = 19,
  MPIFREF_DELIFBLOCK = 20,
  MPIFREF_UPDATECHARS = 21,
  MPIFREF_CREATE = 22,
  MPIFREF_SET_ATTRIBUTES = 23,
  MPIFREF_GET_MTYPE = 24,
  MPIFREF_DEVICE_RESET = 25,
  MPIFREF_TIMESTAMPING = 26,
  MPIFREF_PKTMON = 27,
  MPIFREF_SWTIMESTAMPING = 28,
  MPIFREF_NUMBER_OF_TAGS = 29,
} NDIS_MPIF_REFTAG, *PNDIS_MPIF_REFTAG;

struct _NDIS_IF_PROVIDER_BLOCK;

struct wil_details_StagingConfig
{
  /* 0x0000 */ enum wil_FeatureStore store;
  /* 0x0004 */ int forUpdate;
  /* 0x0008 */ unsigned long readChangeStamp;
  /* 0x000c */ unsigned char readVersion;
  /* 0x000d */ char Padding_52[3];
  /* 0x0010 */ int modified;
  /* 0x0014 */ struct wil_details_StagingConfigHeader* header;
  /* 0x0018 */ struct wil_details_StagingConfigFeature* features;
  /* 0x001c */ struct wil_details_StagingConfigUsageTrigger* triggers;
  /* 0x0020 */ int changedInSession;
  /* 0x0024 */ void* buffer;
  /* 0x0028 */ unsigned long bufferSize;
  /* 0x002c */ unsigned long bufferAlloc;
  /* 0x0030 */ int bufferOwned;
}; /* size: 0x0034 */

enum TCP_OFFLOAD_EVENT_TYPE
{
  TcpIndicateSendBacklogChange = 1,
  TcpIndicateDisconnect = 2,
  TcpIndicateRetrieve = 3,
  TcpIndicateAbort = 4,
};

typedef struct _DOT11_VWIFI_COMBINATION
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long uNumInfrastructure;
  /* 0x0008 */ unsigned long uNumAdhoc;
  /* 0x000c */ unsigned long uNumSoftAP;
} DOT11_VWIFI_COMBINATION, *PDOT11_VWIFI_COMBINATION; /* size: 0x0010 */

struct DOT11_VWIFI_ATTRIBUTES
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long uTotalNumOfEntries;
  /* 0x0008 */ struct _DOT11_VWIFI_COMBINATION Combinations[1];
}; /* size: 0x0018 */

enum TCP_OFFLOAD_CONNECTION_STATE
{
  TcpConnectionClosed = 0,
  TcpConnectionListen = 1,
  TcpConnectionSynSent = 2,
  TcpConnectionSynRcvd = 3,
  TcpConnectionEstablished = 4,
  TcpConnectionFinWait1 = 5,
  TcpConnectionFinWait2 = 6,
  TcpConnectionCloseWait = 7,
  TcpConnectionClosing = 8,
  TcpConnectionLastAck = 9,
  TcpConnectionTimeWait = 10,
  TcpConnectionMaxState = 11,
};

typedef enum _NDIS_BIND_FILTER_FLAGS
{
  NdisBindFilter_Optional = 1,
  NdisBindFilter_Monitoring = 2,
  NdisBindFilter_UnbindOnAttach = 4,
  NdisBindFilter_UnbindOnDetach = 8,
  NdisBindFilter_NoStartAtBootHint = 16,
} NDIS_BIND_FILTER_FLAGS, *PNDIS_BIND_FILTER_FLAGS;

typedef enum _PERFINFO_MM_STAT
{
  PerfInfoMMStatNotUsed = 0,
  PerfInfoMMStatAggregatePageCombine = 1,
  PerfInfoMMStatIterationPageCombine = 2,
  PerfInfoMMStatMax = 3,
} PERFINFO_MM_STAT, *PPERFINFO_MM_STAT;

typedef struct _CM_FULL_RESOURCE_DESCRIPTOR
{
  /* 0x0000 */ enum _INTERFACE_TYPE InterfaceType;
  /* 0x0004 */ unsigned long BusNumber;
  /* 0x0008 */ struct _CM_PARTIAL_RESOURCE_LIST PartialResourceList;
} CM_FULL_RESOURCE_DESCRIPTOR, *PCM_FULL_RESOURCE_DESCRIPTOR; /* size: 0x0020 */

typedef struct _CM_RESOURCE_LIST
{
  /* 0x0000 */ unsigned long Count;
  /* 0x0004 */ struct _CM_FULL_RESOURCE_DESCRIPTOR List[1];
} CM_RESOURCE_LIST, *PCM_RESOURCE_LIST; /* size: 0x0024 */

typedef struct _CURDIR
{
  /* 0x0000 */ struct _UNICODE_STRING DosPath;
  /* 0x0008 */ void* Handle;
} CURDIR, *PCURDIR; /* size: 0x000c */

typedef struct _STRING
{
  /* 0x0000 */ unsigned short Length;
  /* 0x0002 */ unsigned short MaximumLength;
  /* 0x0004 */ char* Buffer;
} STRING, *PSTRING; /* size: 0x0008 */

typedef struct _RTL_DRIVE_LETTER_CURDIR
{
  /* 0x0000 */ unsigned short Flags;
  /* 0x0002 */ unsigned short Length;
  /* 0x0004 */ unsigned long TimeStamp;
  /* 0x0008 */ struct _STRING DosPath;
} RTL_DRIVE_LETTER_CURDIR, *PRTL_DRIVE_LETTER_CURDIR; /* size: 0x0010 */

typedef struct _RTL_USER_PROCESS_PARAMETERS
{
  /* 0x0000 */ unsigned long MaximumLength;
  /* 0x0004 */ unsigned long Length;
  /* 0x0008 */ unsigned long Flags;
  /* 0x000c */ unsigned long DebugFlags;
  /* 0x0010 */ void* ConsoleHandle;
  /* 0x0014 */ unsigned long ConsoleFlags;
  /* 0x0018 */ void* StandardInput;
  /* 0x001c */ void* StandardOutput;
  /* 0x0020 */ void* StandardError;
  /* 0x0024 */ struct _CURDIR CurrentDirectory;
  /* 0x0030 */ struct _UNICODE_STRING DllPath;
  /* 0x0038 */ struct _UNICODE_STRING ImagePathName;
  /* 0x0040 */ struct _UNICODE_STRING CommandLine;
  /* 0x0048 */ void* Environment;
  /* 0x004c */ unsigned long StartingX;
  /* 0x0050 */ unsigned long StartingY;
  /* 0x0054 */ unsigned long CountX;
  /* 0x0058 */ unsigned long CountY;
  /* 0x005c */ unsigned long CountCharsX;
  /* 0x0060 */ unsigned long CountCharsY;
  /* 0x0064 */ unsigned long FillAttribute;
  /* 0x0068 */ unsigned long WindowFlags;
  /* 0x006c */ unsigned long ShowWindowFlags;
  /* 0x0070 */ struct _UNICODE_STRING WindowTitle;
  /* 0x0078 */ struct _UNICODE_STRING DesktopInfo;
  /* 0x0080 */ struct _UNICODE_STRING ShellInfo;
  /* 0x0088 */ struct _UNICODE_STRING RuntimeData;
  /* 0x0090 */ struct _RTL_DRIVE_LETTER_CURDIR CurrentDirectores[32];
  /* 0x0290 */ unsigned long EnvironmentSize;
  /* 0x0294 */ unsigned long EnvironmentVersion;
  /* 0x0298 */ void* PackageDependencyData;
  /* 0x029c */ unsigned long ProcessGroupId;
  /* 0x02a0 */ unsigned long LoaderThreads;
  /* 0x02a4 */ struct _UNICODE_STRING RedirectionDllName;
  /* 0x02ac */ struct _UNICODE_STRING HeapPartitionName;
  /* 0x02b4 */ unsigned __int64* DefaultThreadpoolCpuSetMasks;
  /* 0x02b8 */ unsigned long DefaultThreadpoolCpuSetMaskCount;
  /* 0x02bc */ unsigned long DefaultThreadpoolThreadMaximum;
} RTL_USER_PROCESS_PARAMETERS, *PRTL_USER_PROCESS_PARAMETERS; /* size: 0x02c0 */

enum OFFLOAD_STATE_TYPE
{
  NeighborOffloadConstState = 1,
  NeighborOffloadCachedState = 2,
  NeighborOffloadDelegatedState = 3,
  NeighborOffloadState = 4,
  Ip4OffloadConstState = 5,
  Ip4OffloadCachedState = 6,
  Ip4OffloadDelegatedState = 7,
  Ip4OffloadState = 8,
  Ip6OffloadConstState = 9,
  Ip6OffloadCachedState = 10,
  Ip6OffloadDelegatedState = 11,
  Ip6OffloadState = 12,
  TcpOffloadConstState = 13,
  TcpOffloadCachedState = 14,
  TcpOffloadDelegatedState = 15,
  TcpOffloadResourceState = 16,
  TcpOffloadState = 17,
  FilterReservedOffloadState = 254,
  MaximumOffloadState = 255,
};

typedef enum _WWAN_REGISTER_ACTION
{
  WwanRegisterActionAutomatic = 0,
  WwanRegisterActionManual = 1,
  WwanRegisterActionMax = 2,
} WWAN_REGISTER_ACTION, *PWWAN_REGISTER_ACTION;

class KAutoEvent
{
}; /* size: 0x0010 */

typedef enum _NDIS_NSI_REFTAG
{
  NSIREF_IOCTL = 0,
  NSIREF_STATUS = 1,
  NSIREF_IFTOP = 2,
  NSIREF_IFSTATS = 3,
  NSIREF_IFOID = 4,
  NSIREF_NUMBER_OF_TAGS = 5,
} NDIS_NSI_REFTAG, *PNDIS_NSI_REFTAG;

typedef enum _WWAN_CONTEXT_TYPE
{
  WwanContextTypeNone = 0,
  WwanContextTypeInternet = 1,
  WwanContextTypeVpn = 2,
  WwanContextTypeVoice = 3,
  WwanContextTypeVideoShare = 4,
  WwanContextTypeCustom = 5,
  WwanContextTypePurchase = 6,
  WwanContextTypeMms = 7,
  WwanContextTypeIms = 8,
  WwanContextTypeAdmin = 9,
  WwanContextTypeApp = 10,
  WwanContextTypeXcap = 11,
  WwanContextTypeTethering = 12,
  WwanContextTypeEmergencyCall = 13,
  WwanContextTypeLteAttach = 14,
  WwanContextTypeMax = 15,
} WWAN_CONTEXT_TYPE, *PWWAN_CONTEXT_TYPE;

class wil::details::unique_storage<wil::details::resource_policy<unsigned long *,void __stdcall(unsigned long *) noexcept,&wil::details::ReleaseSpinLockFromDpcLevel,wistd::integral_constant<unsigned int,2>,unsigned long *,unsigned long *,0,std::nullptr_t> >
{
  /* 0x0000 */ unsigned long* m_ptr;
}; /* size: 0x0004 */

typedef enum _WWAN_COMPRESSION
{
  WwanCompressionNone = 0,
  WwanCompressionEnable = 1,
  WwanCompressionMax = 2,
} WWAN_COMPRESSION, *PWWAN_COMPRESSION;

typedef enum _WWAN_AUTH_PROTOCOL
{
  WwanAuthProtocolNone = 0,
  WwanAuthProtocolPap = 1,
  WwanAuthProtocolChap = 2,
  WwanAuthProtocolMsChapV2 = 3,
  WwanAuthProtocolAuto = 4,
  WwanAuthProtocolMax = 5,
} WWAN_AUTH_PROTOCOL, *PWWAN_AUTH_PROTOCOL;

typedef struct _NDK_SHARED_ENDPOINT_DISPATCH
{
  /* 0x0000 */ void* NdkCloseSharedEndpoint /* function */;
  /* 0x0004 */ void* NdkQueryExtension /* function */;
  /* 0x0008 */ void* NdkGetLocalAddress /* function */;
} NDK_SHARED_ENDPOINT_DISPATCH, *PNDK_SHARED_ENDPOINT_DISPATCH; /* size: 0x000c */

typedef struct _FILE_OBJECT
{
  /* 0x0000 */ short Type;
  /* 0x0002 */ short Size;
  /* 0x0004 */ struct _DEVICE_OBJECT* DeviceObject;
  /* 0x0008 */ struct _VPB* Vpb;
  /* 0x000c */ void* FsContext;
  /* 0x0010 */ void* FsContext2;
  /* 0x0014 */ struct _SECTION_OBJECT_POINTERS* SectionObjectPointer;
  /* 0x0018 */ void* PrivateCacheMap;
  /* 0x001c */ long FinalStatus;
  /* 0x0020 */ struct _FILE_OBJECT* RelatedFileObject;
  /* 0x0024 */ unsigned char LockOperation;
  /* 0x0025 */ unsigned char DeletePending;
  /* 0x0026 */ unsigned char ReadAccess;
  /* 0x0027 */ unsigned char WriteAccess;
  /* 0x0028 */ unsigned char DeleteAccess;
  /* 0x0029 */ unsigned char SharedRead;
  /* 0x002a */ unsigned char SharedWrite;
  /* 0x002b */ unsigned char SharedDelete;
  /* 0x002c */ unsigned long Flags;
  /* 0x0030 */ struct _UNICODE_STRING FileName;
  /* 0x0038 */ union _LARGE_INTEGER CurrentByteOffset;
  /* 0x0040 */ unsigned long Waiters;
  /* 0x0044 */ unsigned long Busy;
  /* 0x0048 */ void* LastLock;
  /* 0x004c */ struct _KEVENT Lock;
  /* 0x005c */ struct _KEVENT Event;
  /* 0x006c */ struct _IO_COMPLETION_CONTEXT* CompletionContext;
  /* 0x0070 */ unsigned long IrpListLock;
  /* 0x0074 */ struct _LIST_ENTRY IrpList;
  /* 0x007c */ void* FileObjectExtension;
} FILE_OBJECT, *PFILE_OBJECT; /* size: 0x0080 */

typedef enum _NDIS_IF_REFTAG
{
  IFREF_REGISTER = 0,
  IFREF_GETII = 1,
  IFREF_TOPGETII = 2,
  IFREF_GETALL = 3,
  IFREF_TOPGETALL = 4,
  IFREF_SET = 5,
  IFREF_ENUMALL = 6,
  IFREF_TOPENUMALL = 7,
  IFREF_GETRCVADDR = 8,
  IFREF_GETALLRCVADDR = 9,
  IFREF_ASYNCCHANGE = 10,
  IFREF_CHALIAS = 11,
  IFREF_MINIPORT = 12,
  IFREF_SETDESCR = 13,
  IFREF_UPDATECHARS = 14,
  IFREF_UPDATE = 15,
  IFREF_TIMESTAMPING = 16,
  IFREF_NUMBER_OF_TAGS = 17,
} NDIS_IF_REFTAG, *PNDIS_IF_REFTAG;

enum PDCCLIENTID
{
  PDC_INVALID_CLIENT = 0,
  PDC_PLM_CLIENT = 1,
  PDC_NQM_CLIENT = 2,
  PDC_WNS_CLIENT = 3,
  PDC_DAM_CLIENT = 4,
  PDC_WCM_CLIENT = 5,
  PDC_NCSI_CLIENT = 7,
  PDC_DHCP_CLIENT = 8,
  PDC_TCPIP_CLIENT = 9,
  PDC_WU_CLIENT = 11,
  PDC_GP_CLIENT = 12,
  PDC_NCA_CLIENT = 14,
  PDC_BI_CLIENT = 15,
  PDC_MSCHED_CLIENT = 16,
  PDC_SUSPENDRESUME_CLIENT = 17,
  PDC_INTERNAL_CLIENT = 18,
  PDC_DEFAULT_KM_TEST_CLIENT_EXEMPTED = 19,
  PDC_DEFAULT_UM_TEST_CLIENT_EXEMPTED = 20,
  PDC_DAM_PHASE_TEST_CLIENT = 21,
  PDC_LOW_POWER_PHASE_TEST_CLIENT = 22,
  PDC_RESILIENCY_NOTIFICATION_PHASE_TEST_CLIENT = 23,
  PDC_NQM_RESILIENCY_TEST_CLIENT = 24,
  PDC_DAM_RESILIENCY_TEST_CLIENT = 25,
  PDC_DAM_KM_TEST_CLIENT = 26,
  PDC_DAM_UM_TEST_CLIENT = 27,
  PDC_SINGLETON_TEST_CLIENT = 28,
  PDC_NETWORK_SERVICE_TEST_CLIENT = 29,
  PDC_NETWORK_SERVICE2_TEST_CLIENT = 30,
  PDC_SYSTEM_SERVICE_TEST_CLIENT = 31,
  PDC_ACTIV_NOTIF_DAM_RESIL_TEST_CLIENT = 32,
  PDC_ACTIV_NOTIF_NET_RESIL_TEST_CLIENT = 33,
  PDC_SHELL_CLIENT = 34,
  PDC_MAINTENANCE_CLIENT = 35,
  PDC_SYNC_CLIENT = 36,
  PDC_IDM_CLIENT = 37,
  PDC_CORTANA_VOICE_ACTIVATION_CLIENT = 38,
  PDC_TETHERING_CLIENT = 39,
  PDC_AUDIO_CLIENT = 40,
  PDC_LOCK_SCREEN = 41,
  PDC_LREC_CLIENT = 42,
  PDC_WP_BW_CLIENT = 43,
  PDC_WP_MEDIA_STREAMING_CLIENT = 44,
  PDC_WP_MAPS_CLIENT = 46,
  PDC_WP_SYNC_CLIENT = 47,
  PDC_SETTING_SYNC_CLIENT = 48,
  PDC_WP_EDM_CLIENT = 49,
  PDC_WP_WALLET_CLIENT = 50,
  PDC_WP_LOCATION_CLIENT = 51,
  PDC_WP_CM_CLIENT = 53,
  PDC_WP_DCP_CLIENT = 54,
  PDC_WP_WIFIAUTO_CLIENT = 55,
  PDC_BITLOCKER_CLIENT = 56,
  PDC_MDM_CERTINSTALLER_CLIENT = 57,
  PDC_WP_IM_CLIENT = 58,
  PDC_WP_MMS_CLIENT = 59,
  PDC_DEVICEENROLLER_CLIENT = 60,
  PDC_WP_WIFI_SCANNING_CLIENT = 61,
  PDC_WP_OMADM_CLIENT = 62,
  PDC_WP_TELEMETRY_CHECK_CLIENT = 63,
  PDC_WP_DIS_CLIENT = 64,
  PDC_BITS_CLIENT = 65,
  PDC_WP_VOIP_EXECUTION_CLIENT = 66,
  PDC_WP_RESERVED_CLIENT3 = 67,
  PDC_SLEEP_STUDY_CLIENT = 68,
  PDC_WP_AUTOTIMEUPDATE_CLIENT = 69,
  PDC_HYPERV_CLIENT = 70,
  PDC_KM_SIGNAL_CLIENT = 71,
  PDC_UM_SIGNAL_CLIENT = 72,
  PDC_DEVICE_HEALTH_ATTESTATION_CLIENT = 73,
  PDC_XB_SYSTEM_CLIENT = 74,
  PDC_XB_HOST_CLIENT = 75,
  PDC_PRINT_JOB_MANAGER_CLIENT = 76,
  PDC_TELEMETRY_CLIENT = 77,
  PDC_ERROR_REPORTING_CLIENT = 78,
  PDC_XBOX_NTM = 79,
  PDC_CBE_CLIENT = 80,
  PDC_FIND_MY_PHONE_CLIENT = 81,
  PDC_COMMAND_CHANNEL_CLIENT = 82,
  PDC_PPM_PROFILES_CLIENT = 83,
  PDC_WIFI_CALLING_CLIENT = 84,
  PDC_WU_REBOOT_CLIENT = 85,
  PDC_SYSMAIN_CLIENT = 86,
  PDC_XBOX_UPDATE_CLIENT = 87,
  PDC_CHAT_SERVICE_CLIENT = 88,
  PDC_FIND_MY_DEVICE_CLIENT = 89,
  PDC_NOTIFICATION_FORWARDING_AND_ACTION_CLIENT = 90,
  PDC_INSTALL_AGENT_CLIENT = 91,
  PDC_XBOX_WAKE_ON_VOICE = 92,
  PDC_PLM_AUDIO_CLIENT = 93,
  PDC_WP_BCKAUDIO_CLIENT = 94,
  PDC_WAKE_ON_LAN_CLIENT = 95,
  PDC_WP_CLOUD_MESSAGING_CLIENT = 96,
  PDC_DATA_MIGRATION_MANAGER = 97,
  PDC_EVENT_SOUND_MANAGER_CLIENT = 98,
  PDC_WWAN_DORMANCY_HINT_CLIENT = 99,
  PDC_HAM_CLIENT = 100,
  PDC_FILESHARINGSERVER_CLIENT = 101,
  PDC_DIRECTED_DRIPS_TASK_CLIENT = 102,
  PDC_DIRECTED_DRIPS_LPE_CLIENT = 103,
  PDC_DIRECTED_DRIPS_PLM_CLIENT = 104,
  PDC_HTTPSDATASOURCE_CLIENT = 105,
  PDC_TERMINALSERVER_CONNECTION_CLIENT = 106,
  PDC_TERMINALSERVER_SESSION_CLIENT = 107,
  PDC_ANYNETWORK_RESILIENCY_CLIENT = 108,
  PDC_XBOX_NUI_CLIENT = 110,
  PDC_WIFI_CALLING_IMS_CLIENT = 111,
  PDC_SLEEPSTUDY_HELPER_USER_CLIENT = 112,
  PDC_SLEEPSTUDY_HELPER_KERNEL_CLIENT = 113,
  PDC_CONTAINER_MANAGER_CLIENT = 114,
  PDC_NUMBER_OF_CLIENTS = 115,
};

struct DOT11_EXTSTA_ATTRIBUTES
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long uScanSSIDListSize;
  /* 0x0008 */ unsigned long uDesiredBSSIDListSize;
  /* 0x000c */ unsigned long uDesiredSSIDListSize;
  /* 0x0010 */ unsigned long uExcludedMacAddressListSize;
  /* 0x0014 */ unsigned long uPrivacyExemptionListSize;
  /* 0x0018 */ unsigned long uKeyMappingTableSize;
  /* 0x001c */ unsigned long uDefaultKeyTableSize;
  /* 0x0020 */ unsigned long uWEPKeyValueMaxLength;
  /* 0x0024 */ unsigned long uPMKIDCacheSize;
  /* 0x0028 */ unsigned long uMaxNumPerSTADefaultKeyTables;
  /* 0x002c */ unsigned char bStrictlyOrderedServiceClassImplemented;
  /* 0x002d */ unsigned char ucSupportedQoSProtocolFlags;
  /* 0x002e */ unsigned char bSafeModeImplemented;
  /* 0x002f */ char Padding_53;
  /* 0x0030 */ unsigned long uNumSupportedCountryOrRegionStrings;
  /* 0x0034 */ unsigned char* pSupportedCountryOrRegionStrings[3];
  /* 0x0038 */ unsigned long uInfraNumSupportedUcastAlgoPairs;
  /* 0x003c */ struct DOT11_AUTH_CIPHER_PAIR* pInfraSupportedUcastAlgoPairs;
  /* 0x0040 */ unsigned long uInfraNumSupportedMcastAlgoPairs;
  /* 0x0044 */ struct DOT11_AUTH_CIPHER_PAIR* pInfraSupportedMcastAlgoPairs;
  /* 0x0048 */ unsigned long uAdhocNumSupportedUcastAlgoPairs;
  /* 0x004c */ struct DOT11_AUTH_CIPHER_PAIR* pAdhocSupportedUcastAlgoPairs;
  /* 0x0050 */ unsigned long uAdhocNumSupportedMcastAlgoPairs;
  /* 0x0054 */ struct DOT11_AUTH_CIPHER_PAIR* pAdhocSupportedMcastAlgoPairs;
  /* 0x0058 */ unsigned char bAutoPowerSaveMode;
  /* 0x0059 */ char Padding_54[3];
  /* 0x005c */ unsigned long uMaxNetworkOffloadListSize;
  /* 0x0060 */ unsigned char bMFPCapable;
  /* 0x0061 */ char Padding_55[3];
  /* 0x0064 */ unsigned long uInfraNumSupportedMcastMgmtAlgoPairs;
  /* 0x0068 */ struct DOT11_AUTH_CIPHER_PAIR* pInfraSupportedMcastMgmtAlgoPairs;
  /* 0x006c */ unsigned char bNeighborReportSupported;
  /* 0x006d */ unsigned char bAPChannelReportSupported;
  /* 0x006e */ unsigned char bActionFramesSupported;
  /* 0x006f */ unsigned char bANQPQueryOffloadSupported;
  /* 0x0070 */ unsigned char bHESSIDConnectionSupported;
  /* 0x0071 */ char __PADDING__[3];
}; /* size: 0x0074 */

typedef enum _WWAN_SMS_CDMA_ENCODING
{
  WwanSmsCdmaEncodingOctet = 0,
  WwanSmsCdmaEncodingEpm = 1,
  WwanSmsCdmaEncoding7BitAscii = 2,
  WwanSmsCdmaEncodingIa5 = 3,
  WwanSmsCdmaEncodingUnicode = 4,
  WwanSmsCdmaEncodingShiftJis = 5,
  WwanSmsCdmaEncodingKorean = 6,
  WwanSmsCdmaEncodingLatinHebrew = 7,
  WwanSmsCdmaEncodingLatin = 8,
  WwanSmsCdmaEncodingGsm7Bit = 9,
  WwanSmsCdmaEncodingMax = 10,
} WWAN_SMS_CDMA_ENCODING, *PWWAN_SMS_CDMA_ENCODING;

typedef enum _WWAN_SMS_CDMA_LANG
{
  WwanSmsCdmaLangUnknown = 0,
  WwanSmsCdmaLangEnglish = 1,
  WwanSmsCdmaLangFrench = 2,
  WwanSmsCdmaLangSpanish = 3,
  WwanSmsCdmaLangJapanese = 4,
  WwanSmsCdmaLangKorean = 5,
  WwanSmsCdmaLangChinese = 6,
  WwanSmsCdmaLangHebrew = 7,
  WwanSmsCdmaLangMax = 8,
} WWAN_SMS_CDMA_LANG, *PWWAN_SMS_CDMA_LANG;

typedef struct _NDIS_OID_REQUEST::_REQUEST_DATA::_QUERY
{
  /* 0x0000 */ unsigned long Oid;
  /* 0x0004 */ void* InformationBuffer;
  /* 0x0008 */ unsigned int InformationBufferLength;
  /* 0x000c */ unsigned int BytesWritten;
  /* 0x0010 */ unsigned int BytesNeeded;
} NDIS_OID_REQUEST::_REQUEST_DATA::_QUERY, *PNDIS_OID_REQUEST::_REQUEST_DATA::_QUERY; /* size: 0x0014 */

typedef struct _NDIS_OID_REQUEST::_REQUEST_DATA::_SET
{
  /* 0x0000 */ unsigned long Oid;
  /* 0x0004 */ void* InformationBuffer;
  /* 0x0008 */ unsigned int InformationBufferLength;
  /* 0x000c */ unsigned int BytesRead;
  /* 0x0010 */ unsigned int BytesNeeded;
} NDIS_OID_REQUEST::_REQUEST_DATA::_SET, *PNDIS_OID_REQUEST::_REQUEST_DATA::_SET; /* size: 0x0014 */

typedef struct _NDIS_OID_REQUEST::_REQUEST_DATA::_METHOD
{
  /* 0x0000 */ unsigned long Oid;
  /* 0x0004 */ void* InformationBuffer;
  /* 0x0008 */ unsigned long InputBufferLength;
  /* 0x000c */ unsigned long OutputBufferLength;
  /* 0x0010 */ unsigned long MethodId;
  /* 0x0014 */ unsigned int BytesWritten;
  /* 0x0018 */ unsigned int BytesRead;
  /* 0x001c */ unsigned int BytesNeeded;
} NDIS_OID_REQUEST::_REQUEST_DATA::_METHOD, *PNDIS_OID_REQUEST::_REQUEST_DATA::_METHOD; /* size: 0x0020 */

typedef union _NDIS_OID_REQUEST::_REQUEST_DATA
{
  union
  {
    /* 0x0000 */ struct _NDIS_OID_REQUEST::_REQUEST_DATA::_QUERY QUERY_INFORMATION;
    /* 0x0000 */ struct _NDIS_OID_REQUEST::_REQUEST_DATA::_SET SET_INFORMATION;
    /* 0x0000 */ struct _NDIS_OID_REQUEST::_REQUEST_DATA::_METHOD METHOD_INFORMATION;
  }; /* size: 0x0020 */
} NDIS_OID_REQUEST::_REQUEST_DATA, *PNDIS_OID_REQUEST::_REQUEST_DATA; /* size: 0x0020 */

typedef struct _NDIS_OID_REQUEST
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ enum _NDIS_REQUEST_TYPE RequestType;
  /* 0x0008 */ unsigned long PortNumber;
  /* 0x000c */ unsigned int Timeout;
  /* 0x0010 */ void* RequestId;
  /* 0x0014 */ void* RequestHandle;
  /* 0x0018 */ union _NDIS_OID_REQUEST::_REQUEST_DATA DATA;
  /* 0x0038 */ unsigned char NdisReserved[64];
  /* 0x0078 */ unsigned char MiniportReserved[8];
  /* 0x0080 */ unsigned char SourceReserved[8];
  /* 0x0088 */ unsigned char SupportedRevision;
  /* 0x0089 */ unsigned char Reserved1;
  /* 0x008a */ unsigned short Reserved2;
  /* 0x008c */ unsigned long SwitchId;
  /* 0x0090 */ unsigned long VPortId;
  /* 0x0094 */ unsigned long Flags;
} NDIS_OID_REQUEST, *PNDIS_OID_REQUEST; /* size: 0x0098 */

struct _ACTIVATION_CONTEXT;

typedef enum _NDK_RDMA_TECHNOLOGY
{
  NdkUndefined = 0,
  NdkiWarp = 1,
  NdkInfiniBand = 2,
  NdkRoCE = 3,
  NdkRoCEv2 = 4,
  NdkMaxTechnology = 5,
} NDK_RDMA_TECHNOLOGY, *PNDK_RDMA_TECHNOLOGY;

typedef struct _NDIS_REFCOUNT_STACK_ENTRY
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned long Stack : 26; /* bit position: 0 */
    /* 0x0000 */ unsigned long RefCount : 6; /* bit position: 26 */
  }; /* bitfield */
} NDIS_REFCOUNT_STACK_ENTRY, *PNDIS_REFCOUNT_STACK_ENTRY; /* size: 0x0004 */

typedef struct _NDIS_REFCOUNT_STACK_BLOCK
{
  /* 0x0000 */ struct _NDIS_REFCOUNT_STACK_BLOCK* Next;
  /* 0x0004 */ struct _NDIS_REFCOUNT_STACK_ENTRY References[6];
  /* 0x001c */ struct _NDIS_REFCOUNT_STACK_ENTRY Dereferences[6];
} NDIS_REFCOUNT_STACK_BLOCK, *PNDIS_REFCOUNT_STACK_BLOCK; /* size: 0x0034 */

typedef struct _NDIS_REFCOUNT_WITH_STACK
{
  /* 0x0000 */ struct _NDIS_REFCOUNT_STACK_BLOCK Block;
  struct /* bitfield */
  {
    /* 0x0034 */ unsigned long ReferenceAllocationFailed : 1; /* bit position: 0 */
    /* 0x0034 */ unsigned long TotalReferences : 15; /* bit position: 1 */
    /* 0x0034 */ unsigned long DereferenceAllocationFailed : 1; /* bit position: 16 */
    /* 0x0034 */ unsigned long TotalDereferences : 15; /* bit position: 17 */
  }; /* bitfield */
} NDIS_REFCOUNT_WITH_STACK, *PNDIS_REFCOUNT_WITH_STACK; /* size: 0x0038 */

struct KDefaultRegion
{
}; /* size: 0x0001 */

typedef enum _WWAN_PIN_MODE
{
  WwanPinModeNotSupported = 0,
  WwanPinModeEnabled = 1,
  WwanPinModeDisabled = 2,
  WwanPinModeMax = 3,
} WWAN_PIN_MODE, *PWWAN_PIN_MODE;

typedef struct _NDIS_PD_QUEUE
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ const struct _NDIS_PD_QUEUE_DISPATCH* Dispatch;
  /* 0x000c */ void* PDPlatformReserved[2];
  /* 0x0014 */ void* PDClientReserved[2];
} NDIS_PD_QUEUE, *PNDIS_PD_QUEUE; /* size: 0x001c */

typedef enum _WWAN_PIN_FORMAT
{
  WwanPinFormatUnknown = 0,
  WwanPinFormatNumeric = 1,
  WwanPinFormatAlphaNumeric = 2,
  WwanPinFormatMax = 3,
} WWAN_PIN_FORMAT, *PWWAN_PIN_FORMAT;

typedef enum _HV_EXT_EPF_MODE
{
  HvExtEpfModeMin = 0,
  HvExtEpfModeNt = 0,
  HvExtEpfModeMax = 1,
} HV_EXT_EPF_MODE, *PHV_EXT_EPF_MODE;

typedef enum _MM_PAGE_PRIORITY
{
  LowPagePriority = 0,
  NormalPagePriority = 16,
  HighPagePriority = 32,
} MM_PAGE_PRIORITY, *PMM_PAGE_PRIORITY;

struct _TP_POOL;

typedef enum _WWAN_READY_STATE
{
  WwanReadyStateOff = 0,
  WwanReadyStateInitialized = 1,
  WwanReadyStateSimNotInserted = 2,
  WwanReadyStateBadSim = 3,
  WwanReadyStateFailure = 4,
  WwanReadyStateNotActivated = 5,
  WwanReadyStateDeviceLocked = 6,
  WwanReadyStateNoEsimProfile = 7,
  WwanReadyStateMax = 8,
} WWAN_READY_STATE, *PWWAN_READY_STATE;

typedef enum _WWAN_EMERGENCY_MODE
{
  WwanEmergencyModeOff = 0,
  WwanEmergencyModeOn = 1,
  WwanEmergencyModeMax = 2,
} WWAN_EMERGENCY_MODE, *PWWAN_EMERGENCY_MODE;

typedef struct _DRIVER_EXTENSION
{
  /* 0x0000 */ struct _DRIVER_OBJECT* DriverObject;
  /* 0x0004 */ void* AddDevice /* function */;
  /* 0x0008 */ unsigned long Count;
  /* 0x000c */ struct _UNICODE_STRING ServiceKeyName;
} DRIVER_EXTENSION, *PDRIVER_EXTENSION; /* size: 0x0014 */

typedef enum _SYSTEM_FEATURE_CONFIGURATION_SECTION_TYPE
{
  SystemFeatureConfigurationSectionTypeBoot = 0,
  SystemFeatureConfigurationSectionTypeRuntime = 1,
  SystemFeatureConfigurationSectionTypeUsageTriggers = 2,
  SystemFeatureConfigurationSectionTypeCount = 3,
} SYSTEM_FEATURE_CONFIGURATION_SECTION_TYPE, *PSYSTEM_FEATURE_CONFIGURATION_SECTION_TYPE;

typedef struct _TP_CALLBACK_ENVIRON_V3
{
  /* 0x0000 */ unsigned long Version;
  /* 0x0004 */ struct _TP_POOL* Pool;
  /* 0x0008 */ struct _TP_CLEANUP_GROUP* CleanupGroup;
  /* 0x000c */ void* CleanupGroupCancelCallback /* function */;
  /* 0x0010 */ void* RaceDll;
  /* 0x0014 */ struct _ACTIVATION_CONTEXT* ActivationContext;
  /* 0x0018 */ void* FinalizationCallback /* function */;
  union
  {
    union
    {
      /* 0x001c */ unsigned long Flags;
      struct
      {
        struct /* bitfield */
        {
          /* 0x001c */ unsigned long LongFunction : 1; /* bit position: 0 */
          /* 0x001c */ unsigned long Persistent : 1; /* bit position: 1 */
          /* 0x001c */ unsigned long Private : 30; /* bit position: 2 */
        }; /* bitfield */
      } /* size: 0x0004 */ s;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ u;
  /* 0x0020 */ enum _TP_CALLBACK_PRIORITY CallbackPriority;
  /* 0x0024 */ unsigned long Size;
} TP_CALLBACK_ENVIRON_V3, *PTP_CALLBACK_ENVIRON_V3; /* size: 0x0028 */

enum NDIS_PD_COUNTER_TYPE
{
  PDCounterTypeUnknown = 0,
  PDCounterTypeReceiveQueue = 1,
  PDCounterTypeTransmitQueue = 2,
  PDCounterTypeReceiveFilter = 3,
  PDCounterTypeMax = 4,
};

typedef enum _NDIS_MDRV_REFTAG
{
  MDRVREF_IMDEINIT = 0,
  MDRVREF_REMOVINGMP = 1,
  MDRVREF_MINIPORT = 2,
  MDRVREF_IOWORKITEM = 3,
  MDRVREF_IOWORKITEMC = 4,
  MDRVREF_NOTIFYMINI = 5,
  MDRVREF_MPREFH = 6,
  MDRVREF_MPREFN = 7,
  MDRVREF_MPREFT = 8,
  MDRVREF_CHECKPT = 9,
  MDRVREF_TIMEROBJDPC = 10,
  MDRVREF_TIMERDPCX = 11,
  MDRVREF_NUMBER_OF_TAGS = 12,
} NDIS_MDRV_REFTAG, *PNDIS_MDRV_REFTAG;

typedef struct _DOT11_SUPPORTED_DATA_RATES_VALUE_V2
{
  /* 0x0000 */ unsigned char ucSupportedTxDataRatesValue[255];
  /* 0x00ff */ unsigned char ucSupportedRxDataRatesValue[255];
} DOT11_SUPPORTED_DATA_RATES_VALUE_V2, *PDOT11_SUPPORTED_DATA_RATES_VALUE_V2; /* size: 0x01fe */

typedef enum _NDIS_NBL_TRACKER_MODE
{
  NdisTrackNblDisabled = 0,
  NdisTrackNblLogOnly = 1,
  NdisTrackNblRuntimeCheck = 2,
  NdisTrackNblFullLogNoStack = 3,
  NdisTrackNblFullLogWithStack = 4,
} NDIS_NBL_TRACKER_MODE, *PNDIS_NBL_TRACKER_MODE;

typedef enum _VRF_TRIAGE_CONTEXT
{
  VRF_TRIAGE_CONTEXT_NONE = 0,
  VRF_TRIAGE_CONTEXT_DEFAULT = 1,
  VRF_TRIAGE_CONTEXT_DEVELOPMENT = 1,
  VRF_TRIAGE_CONTEXT_CERTIFICATION = 2,
  VRF_TRIAGE_CONTEXT_FLIGHT_TARGETED = 3,
  VRF_TRIAGE_CONTEXT_FLIGHT_DIAGNOSTICS = 4,
  VRF_TRIAGE_CONTEXT_FLIGHT_MONITORING = 5,
  NUM_VRF_TRIAGE_CONTEXTS = 6,
} VRF_TRIAGE_CONTEXT, *PVRF_TRIAGE_CONTEXT;

typedef struct _WWAN_SMS_SEND_PDU
{
  /* 0x0000 */ unsigned char Size;
  /* 0x0001 */ char PduData[366];
} WWAN_SMS_SEND_PDU, *PWWAN_SMS_SEND_PDU; /* size: 0x016f */

typedef struct _WWAN_SMS_SEND_CDMA
{
  /* 0x0000 */ enum _WWAN_SMS_CDMA_ENCODING EncodingId;
  /* 0x0004 */ enum _WWAN_SMS_CDMA_LANG LanguageId;
  /* 0x0008 */ char Address[50];
  /* 0x003a */ unsigned short SizeInBytes;
  /* 0x003c */ unsigned char SizeInCharacters;
  /* 0x003d */ unsigned char EncodedMsg[160];
  /* 0x00dd */ char __PADDING__[3];
} WWAN_SMS_SEND_CDMA, *PWWAN_SMS_SEND_CDMA; /* size: 0x00e0 */

typedef struct _WWAN_SMS_SEND
{
  /* 0x0000 */ enum _WWAN_SMS_FORMAT SmsFormat;
  union
  {
    union
    {
      /* 0x0004 */ struct _WWAN_SMS_SEND_PDU Pdu;
      /* 0x0004 */ struct _WWAN_SMS_SEND_CDMA Cdma;
    }; /* size: 0x016f */
  } /* size: 0x0170 */ u;
} WWAN_SMS_SEND, *PWWAN_SMS_SEND; /* size: 0x0174 */

typedef struct _NDIS_WWAN_SMS_SEND
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ struct _WWAN_SMS_SEND SmsSend;
} NDIS_WWAN_SMS_SEND, *PNDIS_WWAN_SMS_SEND; /* size: 0x0178 */

typedef enum _NDIS_RECEIVE_FILTER_TYPE
{
  NdisReceiveFilterTypeUndefined = 0,
  NdisReceiveFilterTypeVMQueue = 1,
  NdisReceiveFilterTypePacketCoalescing = 2,
  NdisReceiveFilterTypeMaximum = 3,
} NDIS_RECEIVE_FILTER_TYPE, *PNDIS_RECEIVE_FILTER_TYPE;

typedef enum _NDK_OBJECT_TYPE
{
  NdkObjectTypeUndefined = 0,
  NdkObjectTypeAdapter = 1,
  NdkObjectTypeQp = 2,
  NdkObjectTypeCq = 3,
  NdkObjectTypeMr = 4,
  NdkObjectTypeMw = 5,
  NdkObjectTypePd = 6,
  NdkObjectTypeSharedEndpoint = 7,
  NdkObjectTypeConnector = 8,
  NdkObjectTypeListener = 9,
  NdkObjectTypeSrq = 10,
  NdkObjectTypeMax = 11,
} NDK_OBJECT_TYPE, *PNDK_OBJECT_TYPE;

typedef struct _tlgWrapperBinary
{
  union
  {
    /* 0x0000 */ const unsigned int DataDescCount;
    /* 0x0000 */ const void* const Ptr;
  }; /* size: 0x0004 */
  /* 0x0004 */ const unsigned short Size;
  /* 0x0006 */ char __PADDING__[2];
} tlgWrapperBinary, *PtlgWrapperBinary; /* size: 0x0008 */

enum ReplacesCorHdrNumericDefines
{
  COMIMAGE_FLAGS_ILONLY = 1,
  COMIMAGE_FLAGS_32BITREQUIRED = 2,
  COMIMAGE_FLAGS_IL_LIBRARY = 4,
  COMIMAGE_FLAGS_STRONGNAMESIGNED = 8,
  COMIMAGE_FLAGS_NATIVE_ENTRYPOINT = 16,
  COMIMAGE_FLAGS_TRACKDEBUGDATA = 0x10000,
  COMIMAGE_FLAGS_32BITPREFERRED = 0x20000,
  COR_VERSION_MAJOR_V2 = 2,
  COR_VERSION_MAJOR = 2,
  COR_VERSION_MINOR = 5,
  COR_DELETED_NAME_LENGTH = 8,
  COR_VTABLEGAP_NAME_LENGTH = 8,
  NATIVE_TYPE_MAX_CB = 1,
  COR_ILMETHOD_SECT_SMALL_MAX_DATASIZE = 255,
  IMAGE_COR_MIH_METHODRVA = 1,
  IMAGE_COR_MIH_EHRVA = 2,
  IMAGE_COR_MIH_BASICBLOCK = 8,
  COR_VTABLE_32BIT = 1,
  COR_VTABLE_64BIT = 2,
  COR_VTABLE_FROM_UNMANAGED = 4,
  COR_VTABLE_FROM_UNMANAGED_RETAIN_APPDOMAIN = 8,
  COR_VTABLE_CALL_MOST_DERIVED = 16,
  IMAGE_COR_EATJ_THUNK_SIZE = 32,
  MAX_CLASS_NAME = 1024,
  MAX_PACKAGE_NAME = 1024,
};

typedef struct __WIL__WNF_TYPE_ID
{
  /* 0x0000 */ struct _GUID TypeId;
} _WIL__WNF_TYPE_ID, *P_WIL__WNF_TYPE_ID; /* size: 0x0010 */

typedef struct _NDIS_TCP_CONNECTION_OFFLOAD_ENCAPSULATION
{
  struct
  {
    /* 0x0000 */ unsigned char Enabled;
    /* 0x0001 */ char Padding_56[3];
    /* 0x0004 */ unsigned long EncapsulationType;
    /* 0x0008 */ unsigned long HeaderSize;
  } /* size: 0x000c */ V4;
  struct
  {
    /* 0x000c */ unsigned char Enabled;
    /* 0x0001 */ char Padding_57[3];
    /* 0x0010 */ unsigned long EncapsulationType;
    /* 0x0014 */ unsigned long HeaderSize;
  } /* size: 0x000c */ V6;
} NDIS_TCP_CONNECTION_OFFLOAD_ENCAPSULATION, *PNDIS_TCP_CONNECTION_OFFLOAD_ENCAPSULATION; /* size: 0x0018 */

typedef enum _NDIS_PM_PROTOCOL_OFFLOAD_TYPE
{
  NdisPMProtocolOffloadIdUnspecified = 0,
  NdisPMProtocolOffloadIdIPv4ARP = 1,
  NdisPMProtocolOffloadIdIPv6NS = 2,
  NdisPMProtocolOffload80211RSNRekey = 3,
  NdisPMProtocolOffload80211RSNRekeyV2 = 4,
  NdisPMProtocolOffloadIdMaximum = 5,
} NDIS_PM_PROTOCOL_OFFLOAD_TYPE, *PNDIS_PM_PROTOCOL_OFFLOAD_TYPE;

typedef struct _NDIS_IF_PROVIDER_CHARACTERISTICS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ void* QueryObjectHandler /* function */;
  /* 0x0008 */ void* SetObjectHandler /* function */;
  /* 0x000c */ void* Reserved1;
  /* 0x0010 */ void* Reserved2;
} NDIS_IF_PROVIDER_CHARACTERISTICS, *PNDIS_IF_PROVIDER_CHARACTERISTICS; /* size: 0x0014 */

enum PDC_ACTIVITY_TYPE
{
  PdcNetwork = 0,
  PdcSystem = 1,
  PdcTimer = 2,
  PdcAllNetworks = 3,
  PdcAnyNetwork = 4,
  PdcInvalidActivity = 5,
  PdcMaxActivity = 5,
};

struct NDK_VERSION
{
  /* 0x0000 */ unsigned short Major;
  /* 0x0002 */ unsigned short Minor;
}; /* size: 0x0004 */

typedef struct _NDK_OBJECT_HEADER_RESERVED_BLOCK
{
  /* 0x0000 */ void* rf[4];
} NDK_OBJECT_HEADER_RESERVED_BLOCK, *PNDK_OBJECT_HEADER_RESERVED_BLOCK; /* size: 0x0010 */

typedef struct _NDK_OBJECT_HEADER
{
  /* 0x0000 */ struct NDK_VERSION Version;
  /* 0x0004 */ enum _NDK_OBJECT_TYPE ObjectType;
  /* 0x0008 */ struct _NDK_OBJECT_HEADER_RESERVED_BLOCK NdkReserved;
} NDK_OBJECT_HEADER, *PNDK_OBJECT_HEADER; /* size: 0x0018 */

typedef struct _NDK_CONNECTOR
{
  /* 0x0000 */ struct _NDK_OBJECT_HEADER Header;
  /* 0x0018 */ const struct _NDK_CONNECTOR_DISPATCH* Dispatch;
} NDK_CONNECTOR, *PNDK_CONNECTOR; /* size: 0x001c */

typedef enum _NDIS_QOS_SQ_TYPE
{
  NdisQosSqTypeUndefined = 0,
  NdisQosSqTypeStandard = 1,
  NdisQosSqTypeGFT = 2,
  NdisQosSqTypeMax = 3,
} NDIS_QOS_SQ_TYPE, *PNDIS_QOS_SQ_TYPE;

typedef struct _WAIT_CONTEXT_BLOCK
{
  union
  {
    /* 0x0000 */ struct _KDEVICE_QUEUE_ENTRY WaitQueueEntry;
    struct
    {
      /* 0x0000 */ struct _LIST_ENTRY DmaWaitEntry;
      /* 0x0008 */ unsigned long NumberOfChannels;
      struct /* bitfield */
      {
        /* 0x000c */ unsigned long SyncCallback : 1; /* bit position: 0 */
        /* 0x000c */ unsigned long DmaContext : 1; /* bit position: 1 */
        /* 0x000c */ unsigned long ZeroMapRegisters : 1; /* bit position: 2 */
        /* 0x000c */ unsigned long Reserved : 9; /* bit position: 3 */
        /* 0x000c */ unsigned long NumberOfRemapPages : 20; /* bit position: 12 */
      }; /* bitfield */
    }; /* size: 0x0010 */
  }; /* size: 0x0010 */
  /* 0x0010 */ void* DeviceRoutine /* function */;
  /* 0x0014 */ void* DeviceContext;
  /* 0x0018 */ unsigned long NumberOfMapRegisters;
  /* 0x001c */ void* DeviceObject;
  /* 0x0020 */ void* CurrentIrp;
  /* 0x0024 */ struct _KDPC* BufferChainingDpc;
} WAIT_CONTEXT_BLOCK, *PWAIT_CONTEXT_BLOCK; /* size: 0x0028 */

typedef struct _KDEVICE_QUEUE
{
  /* 0x0000 */ short Type;
  /* 0x0002 */ short Size;
  /* 0x0004 */ struct _LIST_ENTRY DeviceListHead;
  /* 0x000c */ unsigned long Lock;
  /* 0x0010 */ unsigned char Busy;
  /* 0x0011 */ char __PADDING__[3];
} KDEVICE_QUEUE, *PKDEVICE_QUEUE; /* size: 0x0014 */

typedef struct _DEVICE_OBJECT
{
  /* 0x0000 */ short Type;
  /* 0x0002 */ unsigned short Size;
  /* 0x0004 */ long ReferenceCount;
  /* 0x0008 */ struct _DRIVER_OBJECT* DriverObject;
  /* 0x000c */ struct _DEVICE_OBJECT* NextDevice;
  /* 0x0010 */ struct _DEVICE_OBJECT* AttachedDevice;
  /* 0x0014 */ struct _IRP* CurrentIrp;
  /* 0x0018 */ struct _IO_TIMER* Timer;
  /* 0x001c */ unsigned long Flags;
  /* 0x0020 */ unsigned long Characteristics;
  /* 0x0024 */ struct _VPB* Vpb;
  /* 0x0028 */ void* DeviceExtension;
  /* 0x002c */ unsigned long DeviceType;
  /* 0x0030 */ char StackSize;
  /* 0x0031 */ char Padding_58[3];
  union
  {
    union
    {
      /* 0x0034 */ struct _LIST_ENTRY ListEntry;
      /* 0x0034 */ struct _WAIT_CONTEXT_BLOCK Wcb;
    }; /* size: 0x0028 */
  } /* size: 0x0028 */ Queue;
  /* 0x005c */ unsigned long AlignmentRequirement;
  /* 0x0060 */ struct _KDEVICE_QUEUE DeviceQueue;
  /* 0x0074 */ struct _KDPC Dpc;
  /* 0x0094 */ unsigned long ActiveThreadCount;
  /* 0x0098 */ void* SecurityDescriptor;
  /* 0x009c */ struct _KEVENT DeviceLock;
  /* 0x00ac */ unsigned short SectorSize;
  /* 0x00ae */ unsigned short Spare1;
  /* 0x00b0 */ struct _DEVOBJ_EXTENSION* DeviceObjectExtension;
  /* 0x00b4 */ void* Reserved;
} DEVICE_OBJECT, *PDEVICE_OBJECT; /* size: 0x00b8 */

typedef enum _NDIS_ARP_HEADER_FIELD
{
  NdisARPHeaderFieldUndefined = 0,
  NdisARPHeaderFieldOperation = 1,
  NdisARPHeaderFieldSPA = 2,
  NdisARPHeaderFieldTPA = 3,
  NdisARPHeaderFieldMaximum = 4,
} NDIS_ARP_HEADER_FIELD, *PNDIS_ARP_HEADER_FIELD;

typedef enum _NDIS_MP_REFTAG
{
  MPREF_AOAC_NA_ACQUIRE = 0,
  MPREF_AOAC_NA_RELEASE = 1,
  MPREF_AOAC_REFTIMER = 2,
  MPREF_AOAC_CLEANUP = 3,
  MPREF_AOAC_REFWAKE = 4,
  MPREF_AOAC_WAKE_ENABLE = 5,
  MPREF_AOAC_WAKE_DISABLE = 6,
  MPREF_CS_WNF_CALLBACK = 7,
  MPREF_API_RESET = 8,
  MPREF_API_REENUMERATE = 9,
  MPREF_PM_WAITWAKE = 10,
  MPREF_PM_D3D = 11,
  MPREF_PM_DEVPOWERUP = 12,
  MPREF_PM_POWERIRP = 13,
  MPREF_PM_OID = 14,
  MPREF_PM_REJECT = 15,
  MPREF_PM_UPDATECAPS = 16,
  MPREF_PM_D0COMPLETE = 17,
  MPREF_PM_PDCTASKCLIENT = 18,
  MPREF_PM_PDCTASKCLIENTDISABLE = 19,
  MPREF_SS_IDLETIMER = 20,
  MPREF_SS_IDLEREQ = 21,
  MPREF_PNP_IMDEINIT = 22,
  MPREF_PNP_INITMODE = 23,
  MPREF_PNP_INITIALIZED = 24,
  MPREF_PNP_CHECKBIND = 25,
  MPREF_PNP_PAUSING = 26,
  MPREF_PNP_RESTARTING = 27,
  MPREF_PNP_STOPPING = 28,
  MPREF_PNP_SURPRISE_REMOVAL = 29,
  MPREF_PNP_REMOVING = 30,
  MPREF_PNP_BASEINIT = 31,
  MPREF_PNP_BINDENUM = 32,
  MPREF_PNP_PROMOTE = 33,
  MPREF_PNP_REFRESH = 34,
  MPREF_LWF_RESTART = 35,
  MPREF_LWF_CHECKBIND = 36,
  MPREF_LWF_ENUMAPI = 37,
  MPREF_LWF_PNPNOTIFY = 38,
  MPREF_LWF_ATTACHING = 39,
  MPREF_LWF_ATTACHED = 40,
  MPREF_LWF_DETACHING = 41,
  MPREF_LWF_DETACHMON = 42,
  MPREF_LWF_ASYNCBIND = 43,
  MPREF_PT_OPENING = 44,
  MPREF_PT_OPENINGX = 45,
  MPREF_PT_OPENED = 46,
  MPREF_PT_BINDNOTIFY = 47,
  MPREF_PT_UNBINDNOTIFY = 48,
  MPREF_PT_UNBINDAPI = 49,
  MPREF_PT_FINISHCLOSE = 50,
  MPREF_PT_ASYNCCLOSE = 51,
  MPREF_PT_RECONFIG = 52,
  MPREF_PT_CHECKMDRV = 53,
  MPREF_PT_LEGACYREBIND = 54,
  MPREF_PT_NDPROXY_RULE = 55,
  MPREF_SI_BASE = 56,
  MPREF_SI_NSI = 57,
  MPREF_SI_CHANGEMACMTU = 58,
  MPREF_IF_STATS = 59,
  MPREF_IF_FINDTOP = 60,
  MPREF_IF_OID = 61,
  MPREF_IF_BASE = 62,
  MPREF_IF_STACKENTRY = 63,
  MPREF_IF_DELSTACK = 64,
  MPREF_RES_ASYNCSHM = 65,
  MPREF_RES_FREESHM = 66,
  MPREF_RES_ADDCPU = 67,
  MPREF_RES_IOV = 68,
  MPREF_RES_QUEUE = 69,
  MPREF_RES_RCVFILTER = 70,
  MPREF_OID_QUEUED = 71,
  MPREF_OID_QUEUEING = 72,
  MPREF_OID_QUEUEINGD = 73,
  MPREF_OID_TOPQUEUE = 74,
  MPREF_OID_COMPLETING = 75,
  MPREF_IO_PERIODICRCV = 76,
  MPREF_IO_QUEUEDDPC = 77,
  MPREF_IO_LEGACYDPC = 78,
  MPREF_CO_REGAF = 79,
  MPREF_CO_REGAFX = 80,
  MPREF_CO_OPENAF = 81,
  MPREF_MISC_PROCESS = 82,
  MPREF_MISC_CFH = 83,
  MPREF_MISC_WPPRUNDOWN = 84,
  MPREF_MISC_PKTMON = 85,
  MPREF_UM_HANDLE = 86,
  MPREF_UM_IOCTL = 87,
  MPREF_PCW_ENUM = 88,
  MPREF_PCW_COLLECT = 89,
  MPREF_PCW_REF = 90,
  MPREF_PCW_ENUMNDK = 91,
  MPREF_PCW_ADDING = 92,
  MPREF_PCW_ADDED = 93,
  MPREF_PCW_PCFOID = 94,
  MPREF_WMI_CHANGE = 95,
  MPREF_WMI_QUERYALL = 96,
  MPREF_WMI_QUERYONE = 97,
  MPREF_WMI_EXEC = 98,
  MPREF_API_IOWORKITEM = 99,
  MPREF_API_PORT = 100,
  MPREF_PD_PROVIDER = 101,
  MPREF_PD_MEM = 102,
  MPREF_CS_RESILIENCY_CALLBACK = 103,
  MPREF_NBL_TRACK_WATCHDOG = 104,
  MPREF_LWM_START = 105,
  MPREF_LWM_UNINITIALIZE = 106,
  MPREF_DEVICE_RESET = 107,
  MPREF_QUERY_DEVICE_RESET = 108,
  MPREF_WDF_DEFAULT = 109,
  MPREF_NUMBER_OF_TAGS = 110,
} NDIS_MP_REFTAG, *PNDIS_MP_REFTAG;

typedef struct _NDIS_NIC_SWITCH_CAPABILITIES
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ unsigned long NdisReserved1;
  /* 0x000c */ unsigned long NumTotalMacAddresses;
  /* 0x0010 */ unsigned long NumMacAddressesPerPort;
  /* 0x0014 */ unsigned long NumVlansPerPort;
  /* 0x0018 */ unsigned long NdisReserved2;
  /* 0x001c */ unsigned long NdisReserved3;
  /* 0x0020 */ unsigned long NicSwitchCapabilities;
  /* 0x0024 */ unsigned long MaxNumSwitches;
  /* 0x0028 */ unsigned long MaxNumVPorts;
  /* 0x002c */ unsigned long NdisReserved4;
  /* 0x0030 */ unsigned long MaxNumVFs;
  /* 0x0034 */ unsigned long MaxNumQueuePairs;
  /* 0x0038 */ unsigned long NdisReserved5;
  /* 0x003c */ unsigned long NdisReserved6;
  /* 0x0040 */ unsigned long NdisReserved7;
  /* 0x0044 */ unsigned long MaxNumQueuePairsPerNonDefaultVPort;
  /* 0x0048 */ unsigned long NdisReserved8;
  /* 0x004c */ unsigned long NdisReserved9;
  /* 0x0050 */ unsigned long NdisReserved10;
  /* 0x0054 */ unsigned long NdisReserved11;
  /* 0x0058 */ unsigned long NdisReserved12;
  /* 0x005c */ unsigned long MaxNumMacAddresses;
  /* 0x0060 */ unsigned long NdisReserved13;
  /* 0x0064 */ unsigned long NdisReserved14;
  /* 0x0068 */ unsigned long NdisReserved15;
  /* 0x006c */ unsigned long NdisReserved16;
  /* 0x0070 */ unsigned long NdisReserved17;
  /* 0x0074 */ unsigned long MaxNumRssCapableNonDefaultPFVPorts;
  /* 0x0078 */ unsigned long NumberOfIndirectionTableEntriesForDefaultVPort;
  /* 0x007c */ unsigned long NumberOfIndirectionTableEntriesPerNonDefaultPFVPort;
  /* 0x0080 */ unsigned long MaxNumQueuePairsForDefaultVPort;
} NDIS_NIC_SWITCH_CAPABILITIES, *PNDIS_NIC_SWITCH_CAPABILITIES; /* size: 0x0084 */

enum NdisIfBlockSource
{
  NdisIfBlockSourcePublicApi = 0,
  NdisIfBlockSourcePersistedNetSetup = 1,
  NdisIfBlockSourceAutomaticLwFilter = 2,
  NdisIfBlockSourceAutomaticLoopback = 3,
};

union wil_details_ReportedState
{
  union
  {
    /* 0x0000 */ unsigned int exchange;
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned int queuedForReporting : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned int reportedDeviceUsage : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned int reportedDevicePotential : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned int reportedDeviceOpportunity : 1; /* bit position: 3 */
      /* 0x0000 */ unsigned int reportedDevicePotentialOpportunity : 1; /* bit position: 4 */
      /* 0x0000 */ unsigned int usageCount : 9; /* bit position: 5 */
      /* 0x0000 */ unsigned int usageCountRepresentsPotential : 1; /* bit position: 14 */
      /* 0x0000 */ unsigned int opportunityCount : 7; /* bit position: 15 */
      /* 0x0000 */ unsigned int opportunityCountRepresentsPotential : 1; /* bit position: 22 */
      /* 0x0000 */ unsigned int unused : 9; /* bit position: 23 */
    }; /* bitfield */
  }; /* size: 0x0004 */
}; /* size: 0x0004 */

typedef enum _NDIS_NSI_INTERFACE_PURPOSE
{
  NDIS_NSI_INTERFACE_PURPOSE_DEFAULT = 0,
  NDIS_NSI_INTERFACE_PURPOSE_INTERNAL_VSWITCH_NIC = 1,
  NDIS_NSI_INTERFACE_PURPOSE_MAX = 2,
} NDIS_NSI_INTERFACE_PURPOSE, *PNDIS_NSI_INTERFACE_PURPOSE;

typedef enum _NDIS_LWF_REFTAG
{
  LWFREF_DETACHING = 0,
  LWFREF_WORKITEM = 1,
  LWFREF_PKTMON = 2,
  LWFREF_NUMBER_OF_TAGS = 3,
} NDIS_LWF_REFTAG, *PNDIS_LWF_REFTAG;

enum DMA_COMPLETION_STATUS
{
  DmaComplete = 0,
  DmaAborted = 1,
  DmaError = 2,
  DmaCancelled = 3,
};

typedef enum _NDIS_FPNP_REFTAG
{
  FPNPREF_FCANCELOID = 0,
  FPNPREF_PCANCELOID = 1,
  FPNPREF_PCANCELDOID = 2,
  FPNPREF_FCANCELDOID = 3,
  FPNPREF_DOCANCELDOID = 4,
  FPNPREF_DPNPNOTIFYF = 5,
  FPNPREF_DPNPNOTIFYM = 6,
  FPNPREF_DPNPNOTIFYT = 7,
  FPNPREF_FSTATUS = 8,
  FPNPREF_MSTATS = 9,
  FPNPREF_NPNPEVENT = 10,
  FPNPREF_IFTOP = 11,
  FPNPREF_OIDQUEUED = 12,
  FPNPREF_FSYNCOID = 13,
  FPNPREF_PSYNCOID = 14,
  FPNPREF_OIDPENDING = 15,
  FPNPREF_DOIDPENDING = 16,
  FPNPREF_OIDSEARCH = 17,
  FPNPREF_DOIDSEARCH = 18,
  FPNPREF_COMPLETEOID = 19,
  FPNPREF_DOIDCOMPLETE = 20,
  FPNPREF_PREDETACH = 21,
  FPNPREF_APIRESTART = 22,
  FPNPREF_SYNCHRONOUSOID = 23,
  FPNPREF_PKTMON = 24,
  FPNPREF_NUMBER_OF_TAGS = 25,
} NDIS_FPNP_REFTAG, *PNDIS_FPNP_REFTAG;

typedef enum _NDIS_CLASS_ID
{
  NdisClass802_3Priority = 0,
  NdisClassWirelessWanMbxMailbox = 1,
  NdisClassIrdaPacketInfo = 2,
  NdisClassAtmAALInfo = 3,
} NDIS_CLASS_ID, *PNDIS_CLASS_ID;

typedef enum _DOT11_DIVERSITY_SUPPORT
{
  dot11_diversity_support_unknown = 0,
  dot11_diversity_support_fixedlist = 1,
  dot11_diversity_support_notsupported = 2,
  dot11_diversity_support_dynamic = 3,
} DOT11_DIVERSITY_SUPPORT, *PDOT11_DIVERSITY_SUPPORT;

typedef struct _NDIS_NBL_TRACKER
{
  /* 0x0000 */ struct _LIST_ENTRY Linkage;
  struct /* bitfield */
  {
    /* 0x0008 */ enum _NDIS_NBL_TRACKER_SOURCE Source : 16; /* bit position: 0 */
    /* 0x0008 */ unsigned long Flags : 16; /* bit position: 16 */
  }; /* bitfield */
  /* 0x000c */ void* Context;
  /* 0x0010 */ const struct _UNICODE_STRING* Name;
  /* 0x0014 */ struct _NDIS_NBL_TRACKER_BUCKET Buckets[2];
} NDIS_NBL_TRACKER, *PNDIS_NBL_TRACKER; /* size: 0x0024 */

typedef enum _NDIS_GFT_PROFILE_TYPE
{
  NdisGftProfileTypeUndefined = 0,
  NdisGftProfileTypeExactMatch = 1,
  NdisGftProfileTypeHeaderTransposition = 2,
  NdisGftProfileTypeWildcardMatch = 3,
  NdisGftProfileTypeMax = 4,
} NDIS_GFT_PROFILE_TYPE, *PNDIS_GFT_PROFILE_TYPE;

enum Ndis::ReadBindingsOptions::Flags
{
  Default = 0,
  DoNotRemoveMissingBindings = 1,
};

typedef struct _EXCEPTION_REGISTRATION_RECORD
{
  /* 0x0000 */ struct _EXCEPTION_REGISTRATION_RECORD* Next;
  /* 0x0004 */ void* Handler /* function */;
} EXCEPTION_REGISTRATION_RECORD, *PEXCEPTION_REGISTRATION_RECORD; /* size: 0x0008 */

typedef struct _NDIS_GFP_HEADER_GROUP_WILDCARD_MATCH_PROFILE
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ unsigned long HeadersPresent;
  /* 0x000c */ long Padding_59;
  /* 0x0010 */ unsigned __int64 MatchFields;
  /* 0x0018 */ enum _NDIS_GFP_WILDCARD_MATCH_TYPE SourceIPv4AddressMatchType;
  /* 0x001c */ enum _NDIS_GFP_WILDCARD_MATCH_TYPE DestinationIPv4AddressMatchType;
  /* 0x0020 */ enum _NDIS_GFP_WILDCARD_MATCH_TYPE SourceIPv6AddressMatchType;
  /* 0x0024 */ enum _NDIS_GFP_WILDCARD_MATCH_TYPE DestinationIPv6AddressMatchType;
  /* 0x0028 */ enum _NDIS_GFP_WILDCARD_MATCH_TYPE SourcePortMatchType;
  /* 0x002c */ enum _NDIS_GFP_WILDCARD_MATCH_TYPE DestinationPortMatchType;
  /* 0x0030 */ unsigned char TcpFlags;
  /* 0x0031 */ char __PADDING__[7];
} NDIS_GFP_HEADER_GROUP_WILDCARD_MATCH_PROFILE, *PNDIS_GFP_HEADER_GROUP_WILDCARD_MATCH_PROFILE; /* size: 0x0038 */

enum NDIS_PD_CONTROL_TYPE
{
  NdisPDCTL_IN = 0,
  NdisPDCTL_OUT = 1,
  NdisPDCTL_INOUT = 2,
};

enum NDIS_PD_QUEUE_CONTROL_CODE
{
  NdisPDQCTLUnknown = 0,
  NdisPDQCTLQueueDepthThreshold = 1,
  NdisPDQCTLModerationInterval = 2,
  NdisPDQCTLModerationCount = 3,
  NdisPDQCTLNotificationGroupId = 4,
  NdisPDQCTLSchedulerQueueId = 5,
  NdisPDQCTLMax = 6,
};

struct wil_details_StagingConfigFeature
{
  /* 0x0000 */ unsigned int featureId;
  struct /* bitfield */
  {
    /* 0x0004 */ unsigned int changedInSession : 1; /* bit position: 0 */
    /* 0x0004 */ unsigned int isVariantConfig : 1; /* bit position: 1 */
    /* 0x0004 */ unsigned int unused1 : 6; /* bit position: 2 */
    /* 0x0004 */ unsigned int serviceState : 2; /* bit position: 8 */
    /* 0x0004 */ unsigned int userState : 2; /* bit position: 10 */
    /* 0x0004 */ unsigned int testState : 2; /* bit position: 12 */
    /* 0x0004 */ unsigned int unused2 : 2; /* bit position: 14 */
    /* 0x0004 */ unsigned int unused3 : 8; /* bit position: 16 */
    /* 0x0004 */ unsigned int variant : 6; /* bit position: 24 */
    /* 0x0004 */ unsigned int payloadKind : 2; /* bit position: 30 */
  }; /* bitfield */
  /* 0x0008 */ unsigned int payload;
}; /* size: 0x000c */

enum NDIS_PD_PROVIDER_CONTROL_CODE
{
  NdisPDPCTLUnknown = 0,
  NdisPDPCTLCapabilities = 1,
  NdisPDPCTLMax = 2,
};

typedef struct _IPSEC_OFFLOAD_V2_ALGORITHM_INFO
{
  /* 0x0000 */ unsigned long Identifier;
  /* 0x0004 */ unsigned long KeyLength;
  /* 0x0008 */ unsigned long KeyOffsetBytes;
  /* 0x000c */ unsigned long AdditionalInfo;
} IPSEC_OFFLOAD_V2_ALGORITHM_INFO, *PIPSEC_OFFLOAD_V2_ALGORITHM_INFO; /* size: 0x0010 */

typedef struct _IPSEC_OFFLOAD_V2_SECURITY_ASSOCIATION
{
  /* 0x0000 */ unsigned long Flags;
  /* 0x0004 */ enum _IPSEC_OFFLOAD_V2_OPERATION Operation;
  /* 0x0008 */ unsigned long Spi;
  /* 0x000c */ struct _IPSEC_OFFLOAD_V2_ALGORITHM_INFO AuthenticationAlgorithm;
  /* 0x001c */ struct _IPSEC_OFFLOAD_V2_ALGORITHM_INFO EncryptionAlgorithm;
  /* 0x002c */ unsigned long SequenceNumberHighOrder;
} IPSEC_OFFLOAD_V2_SECURITY_ASSOCIATION, *PIPSEC_OFFLOAD_V2_SECURITY_ASSOCIATION; /* size: 0x0030 */

typedef enum _NDIS_TASK
{
  TcpIpChecksumNdisTask = 0,
  IpSecNdisTask = 1,
  TcpLargeSendNdisTask = 2,
  MaxNdisTask = 3,
} NDIS_TASK, *PNDIS_TASK;

typedef enum _NDIS_PM_WOL_PACKET
{
  NdisPMWoLPacketUnspecified = 0,
  NdisPMWoLPacketBitmapPattern = 1,
  NdisPMWoLPacketMagicPacket = 2,
  NdisPMWoLPacketIPv4TcpSyn = 3,
  NdisPMWoLPacketIPv6TcpSyn = 4,
  NdisPMWoLPacketEapolRequestIdMessage = 5,
  NdisPMWoLPacketMaximum = 6,
} NDIS_PM_WOL_PACKET, *PNDIS_PM_WOL_PACKET;

typedef struct _NET_BUFFER_LIST_POOL_PARAMETERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned char ProtocolId;
  /* 0x0005 */ unsigned char fAllocateNetBuffer;
  /* 0x0006 */ unsigned short ContextSize;
  /* 0x0008 */ unsigned long PoolTag;
  /* 0x000c */ unsigned long DataSize;
} NET_BUFFER_LIST_POOL_PARAMETERS, *PNET_BUFFER_LIST_POOL_PARAMETERS; /* size: 0x0010 */

typedef enum _WWAN_ACTIVATION_COMMAND
{
  WwanActivationCommandDeactivate = 0,
  WwanActivationCommandActivate = 1,
  WwanActivationCommandCancel = 2,
  WwanActivationCommandMax = 3,
} WWAN_ACTIVATION_COMMAND, *PWWAN_ACTIVATION_COMMAND;

typedef enum _WWAN_IP_TYPE
{
  WwanIPTypeDefault = 0,
  WwanIPTypeIPv4 = 1,
  WwanIPTypeIPv6 = 2,
  WwanIPTypeIpv4v6 = 3,
  WwanIPTypeXlat = 4,
  WwanSessionTypeEthernet = 5,
  WwanSessionTypeUnstructured = 6,
  WwanSessionTypeMax = 7,
} WWAN_IP_TYPE, *PWWAN_IP_TYPE;

typedef enum _WWAN_PSMEDIA_PREFERENCE
{
  WwanPsMediaPreferenceNone = 0,
  WwanPsMediaPreferenceCellularOnly = 1,
  WwanPsMediaPreferenceCellularPreferred = 2,
  WwanPsMediaPreferenceWiFiOnly = 3,
  WwanPsMediaPreferenceWiFiPreferred = 4,
  WwanPsMediaPreferenceMax = 5,
} WWAN_PSMEDIA_PREFERENCE, *PWWAN_PSMEDIA_PREFERENCE;

typedef enum _WWAN_CONFIGURATION_SOURCE
{
  WwanUserProvisioned = 0,
  WwanAdminProvisioned = 1,
  WwanOperatorProvisioned = 2,
  WwanDeviceProvisioned = 3,
  WwanModemProvisioned = 4,
  WwanModemOperatorProvisioned = 5,
  WwanMaxProvisionSource = 6,
} WWAN_CONFIGURATION_SOURCE, *PWWAN_CONFIGURATION_SOURCE;

typedef struct _REFERENCE_EX
{
  /* 0x0000 */ unsigned long SpinLock;
  /* 0x0004 */ unsigned short ReferenceCount;
  /* 0x0006 */ unsigned char Closing;
  /* 0x0007 */ unsigned char ZeroBased;
  /* 0x0008 */ struct NDIS_REFCOUNT_HANDLE__* RefCountTracker;
} REFERENCE_EX, *PREFERENCE_EX; /* size: 0x000c */

typedef struct _NDIS_FILTER_DRIVER_CHARACTERISTICS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned char MajorNdisVersion;
  /* 0x0005 */ unsigned char MinorNdisVersion;
  /* 0x0006 */ unsigned char MajorDriverVersion;
  /* 0x0007 */ unsigned char MinorDriverVersion;
  /* 0x0008 */ unsigned long Flags;
  /* 0x000c */ struct _UNICODE_STRING FriendlyName;
  /* 0x0014 */ struct _UNICODE_STRING UniqueName;
  /* 0x001c */ struct _UNICODE_STRING ServiceName;
  /* 0x0024 */ void* SetOptionsHandler /* function */;
  /* 0x0028 */ void* SetFilterModuleOptionsHandler /* function */;
  /* 0x002c */ void* AttachHandler /* function */;
  /* 0x0030 */ void* DetachHandler /* function */;
  /* 0x0034 */ void* RestartHandler /* function */;
  /* 0x0038 */ void* PauseHandler /* function */;
  /* 0x003c */ void* SendNetBufferListsHandler /* function */;
  /* 0x0040 */ void* SendNetBufferListsCompleteHandler /* function */;
  /* 0x0044 */ void* CancelSendNetBufferListsHandler /* function */;
  /* 0x0048 */ void* ReceiveNetBufferListsHandler /* function */;
  /* 0x004c */ void* ReturnNetBufferListsHandler /* function */;
  /* 0x0050 */ void* OidRequestHandler /* function */;
  /* 0x0054 */ void* OidRequestCompleteHandler /* function */;
  /* 0x0058 */ void* CancelOidRequestHandler /* function */;
  /* 0x005c */ void* DevicePnPEventNotifyHandler /* function */;
  /* 0x0060 */ void* NetPnPEventHandler /* function */;
  /* 0x0064 */ void* StatusHandler /* function */;
  /* 0x0068 */ void* DirectOidRequestHandler /* function */;
  /* 0x006c */ void* DirectOidRequestCompleteHandler /* function */;
  /* 0x0070 */ void* CancelDirectOidRequestHandler /* function */;
  /* 0x0074 */ void* SynchronousOidRequestHandler /* function */;
  /* 0x0078 */ void* SynchronousOidRequestCompleteHandler /* function */;
} NDIS_FILTER_DRIVER_CHARACTERISTICS, *PNDIS_FILTER_DRIVER_CHARACTERISTICS; /* size: 0x007c */

typedef struct _NDIS_FILTER_DRIVER_BLOCK
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ struct _NDIS_FILTER_DRIVER_BLOCK* NextFilterDriver;
  /* 0x0008 */ struct _DRIVER_OBJECT* DriverObject;
  /* 0x000c */ struct _NDIS_FILTER_BLOCK* FilterQueue;
  /* 0x0010 */ void* FilterDriverContext;
  /* 0x0014 */ unsigned long Lock;
  /* 0x0018 */ unsigned long Flags;
  /* 0x001c */ struct _LIST_ENTRY DeviceList;
  /* 0x0024 */ struct _REFERENCE_EX Ref;
  /* 0x0030 */ struct _NDIS_FILTER_DRIVER_CHARACTERISTICS DefaultFilterCharacteristics;
  /* 0x00ac */ void* TcpOffloadReceiveReturnHandler /* function */;
  /* 0x00b0 */ class KRef<NDIS_BIND_FILTER_DRIVER> Bind;
  /* 0x00b4 */ struct _UNICODE_STRING ImageName;
} NDIS_FILTER_DRIVER_BLOCK, *PNDIS_FILTER_DRIVER_BLOCK; /* size: 0x00bc */

typedef enum _NDIS_802_11_NETWORK_TYPE
{
  Ndis802_11FH = 0,
  Ndis802_11DS = 1,
  Ndis802_11OFDM5 = 2,
  Ndis802_11OFDM24 = 3,
  Ndis802_11Automode = 4,
  Ndis802_11NetworkTypeMax = 5,
} NDIS_802_11_NETWORK_TYPE, *PNDIS_802_11_NETWORK_TYPE;

class wil::unique_any_t<wil::details::unique_storage<wil::details::resource_policy<unsigned long *,void __stdcall(wil::details::kspin_lock_saved_irql const &),&wil::details::kspin_lock_saved_irql::Release,wistd::integral_constant<unsigned int,2>,wil::details::kspin_lock_saved_irql,unsigned long *,0,std::nullptr_t> > >
{
}; /* size: 0x0008 */

typedef struct _PEB
{
  /* 0x0000 */ unsigned char InheritedAddressSpace;
  /* 0x0001 */ unsigned char ReadImageFileExecOptions;
  /* 0x0002 */ unsigned char BeingDebugged;
  union
  {
    /* 0x0003 */ unsigned char BitField;
    struct /* bitfield */
    {
      /* 0x0003 */ unsigned char ImageUsesLargePages : 1; /* bit position: 0 */
      /* 0x0003 */ unsigned char IsProtectedProcess : 1; /* bit position: 1 */
      /* 0x0003 */ unsigned char IsImageDynamicallyRelocated : 1; /* bit position: 2 */
      /* 0x0003 */ unsigned char SkipPatchingUser32Forwarders : 1; /* bit position: 3 */
      /* 0x0003 */ unsigned char IsPackagedProcess : 1; /* bit position: 4 */
      /* 0x0003 */ unsigned char IsAppContainer : 1; /* bit position: 5 */
      /* 0x0003 */ unsigned char IsProtectedProcessLight : 1; /* bit position: 6 */
      /* 0x0003 */ unsigned char IsLongPathAwareProcess : 1; /* bit position: 7 */
    }; /* bitfield */
  }; /* size: 0x0001 */
  /* 0x0004 */ void* Mutant;
  /* 0x0008 */ void* ImageBaseAddress;
  /* 0x000c */ struct _PEB_LDR_DATA* Ldr;
  /* 0x0010 */ struct _RTL_USER_PROCESS_PARAMETERS* ProcessParameters;
  /* 0x0014 */ void* SubSystemData;
  /* 0x0018 */ void* ProcessHeap;
  /* 0x001c */ struct _RTL_CRITICAL_SECTION* FastPebLock;
  /* 0x0020 */ union _SLIST_HEADER* volatile AtlThunkSListPtr;
  /* 0x0024 */ void* IFEOKey;
  union
  {
    /* 0x0028 */ unsigned long CrossProcessFlags;
    struct /* bitfield */
    {
      /* 0x0028 */ unsigned long ProcessInJob : 1; /* bit position: 0 */
      /* 0x0028 */ unsigned long ProcessInitializing : 1; /* bit position: 1 */
      /* 0x0028 */ unsigned long ProcessUsingVEH : 1; /* bit position: 2 */
      /* 0x0028 */ unsigned long ProcessUsingVCH : 1; /* bit position: 3 */
      /* 0x0028 */ unsigned long ProcessUsingFTH : 1; /* bit position: 4 */
      /* 0x0028 */ unsigned long ProcessPreviouslyThrottled : 1; /* bit position: 5 */
      /* 0x0028 */ unsigned long ProcessCurrentlyThrottled : 1; /* bit position: 6 */
      /* 0x0028 */ unsigned long ProcessImagesHotPatched : 1; /* bit position: 7 */
      /* 0x0028 */ unsigned long ReservedBits0 : 24; /* bit position: 8 */
    }; /* bitfield */
  }; /* size: 0x0004 */
  union
  {
    /* 0x002c */ void* KernelCallbackTable;
    /* 0x002c */ void* UserSharedInfoPtr;
  }; /* size: 0x0004 */
  /* 0x0030 */ unsigned long SystemReserved;
  /* 0x0034 */ union _SLIST_HEADER* volatile AtlThunkSListPtr32;
  /* 0x0038 */ void* ApiSetMap;
  /* 0x003c */ unsigned long TlsExpansionCounter;
  /* 0x0040 */ void* TlsBitmap;
  /* 0x0044 */ unsigned long TlsBitmapBits[2];
  /* 0x004c */ void* ReadOnlySharedMemoryBase;
  /* 0x0050 */ void* SharedData;
  /* 0x0054 */ void** ReadOnlyStaticServerData;
  /* 0x0058 */ void* AnsiCodePageData;
  /* 0x005c */ void* OemCodePageData;
  /* 0x0060 */ void* UnicodeCaseTableData;
  /* 0x0064 */ unsigned long NumberOfProcessors;
  /* 0x0068 */ unsigned long NtGlobalFlag;
  /* 0x006c */ long Padding_60;
  /* 0x0070 */ union _LARGE_INTEGER CriticalSectionTimeout;
  /* 0x0078 */ unsigned long HeapSegmentReserve;
  /* 0x007c */ unsigned long HeapSegmentCommit;
  /* 0x0080 */ unsigned long HeapDeCommitTotalFreeThreshold;
  /* 0x0084 */ unsigned long HeapDeCommitFreeBlockThreshold;
  /* 0x0088 */ unsigned long NumberOfHeaps;
  /* 0x008c */ unsigned long MaximumNumberOfHeaps;
  /* 0x0090 */ void** ProcessHeaps;
  /* 0x0094 */ void* GdiSharedHandleTable;
  /* 0x0098 */ void* ProcessStarterHelper;
  /* 0x009c */ unsigned long GdiDCAttributeList;
  /* 0x00a0 */ struct _RTL_CRITICAL_SECTION* LoaderLock;
  /* 0x00a4 */ unsigned long OSMajorVersion;
  /* 0x00a8 */ unsigned long OSMinorVersion;
  /* 0x00ac */ unsigned short OSBuildNumber;
  /* 0x00ae */ unsigned short OSCSDVersion;
  /* 0x00b0 */ unsigned long OSPlatformId;
  /* 0x00b4 */ unsigned long ImageSubsystem;
  /* 0x00b8 */ unsigned long ImageSubsystemMajorVersion;
  /* 0x00bc */ unsigned long ImageSubsystemMinorVersion;
  /* 0x00c0 */ unsigned long ActiveProcessAffinityMask;
  /* 0x00c4 */ unsigned long GdiHandleBuffer[34];
  /* 0x014c */ void* PostProcessInitRoutine /* function */;
  /* 0x0150 */ void* TlsExpansionBitmap;
  /* 0x0154 */ unsigned long TlsExpansionBitmapBits[32];
  /* 0x01d4 */ unsigned long SessionId;
  /* 0x01d8 */ union _ULARGE_INTEGER AppCompatFlags;
  /* 0x01e0 */ union _ULARGE_INTEGER AppCompatFlagsUser;
  /* 0x01e8 */ void* pShimData;
  /* 0x01ec */ void* AppCompatInfo;
  /* 0x01f0 */ struct _UNICODE_STRING CSDVersion;
  /* 0x01f8 */ const struct _ACTIVATION_CONTEXT_DATA* ActivationContextData;
  /* 0x01fc */ struct _ASSEMBLY_STORAGE_MAP* ProcessAssemblyStorageMap;
  /* 0x0200 */ const struct _ACTIVATION_CONTEXT_DATA* SystemDefaultActivationContextData;
  /* 0x0204 */ struct _ASSEMBLY_STORAGE_MAP* SystemAssemblyStorageMap;
  /* 0x0208 */ unsigned long MinimumStackCommit;
  /* 0x020c */ void* SparePointers[4];
  /* 0x021c */ unsigned long SpareUlongs[5];
  /* 0x0230 */ void* WerRegistrationData;
  /* 0x0234 */ void* WerShipAssertPtr;
  /* 0x0238 */ void* pUnused;
  /* 0x023c */ void* pImageHeaderHash;
  union
  {
    /* 0x0240 */ unsigned long TracingFlags;
    struct /* bitfield */
    {
      /* 0x0240 */ unsigned long HeapTracingEnabled : 1; /* bit position: 0 */
      /* 0x0240 */ unsigned long CritSecTracingEnabled : 1; /* bit position: 1 */
      /* 0x0240 */ unsigned long LibLoaderTracingEnabled : 1; /* bit position: 2 */
      /* 0x0240 */ unsigned long SpareTracingBits : 29; /* bit position: 3 */
    }; /* bitfield */
  }; /* size: 0x0004 */
  /* 0x0244 */ long Padding_61;
  /* 0x0248 */ unsigned __int64 CsrServerReadOnlySharedMemoryBase;
  /* 0x0250 */ unsigned long TppWorkerpListLock;
  /* 0x0254 */ struct _LIST_ENTRY TppWorkerpList;
  /* 0x025c */ void* WaitOnAddressHashTable[128];
  /* 0x045c */ void* TelemetryCoverageHeader;
  /* 0x0460 */ unsigned long CloudFileFlags;
  /* 0x0464 */ unsigned long CloudFileDiagFlags;
  /* 0x0468 */ char PlaceholderCompatibilityMode;
  /* 0x0469 */ char PlaceholderCompatibilityModeReserved[7];
  /* 0x0470 */ struct _LEAP_SECOND_DATA* LeapSecondData;
  union
  {
    /* 0x0474 */ unsigned long LeapSecondFlags;
    struct /* bitfield */
    {
      /* 0x0474 */ unsigned long SixtySecondEnabled : 1; /* bit position: 0 */
      /* 0x0474 */ unsigned long Reserved : 31; /* bit position: 1 */
    }; /* bitfield */
  }; /* size: 0x0004 */
  /* 0x0478 */ unsigned long NtGlobalFlag2;
  /* 0x047c */ long __PADDING__[1];
} PEB, *PPEB; /* size: 0x0480 */

typedef enum _NDIS_802_11_NETWORK_INFRASTRUCTURE
{
  Ndis802_11IBSS = 0,
  Ndis802_11Infrastructure = 1,
  Ndis802_11AutoUnknown = 2,
  Ndis802_11InfrastructureMax = 3,
} NDIS_802_11_NETWORK_INFRASTRUCTURE, *PNDIS_802_11_NETWORK_INFRASTRUCTURE;

struct wil_details_RecordUsageResult
{
  /* 0x0000 */ int queueBackground;
  /* 0x0004 */ unsigned int countImmediate;
  /* 0x0008 */ enum wil_details_ServiceReportingKind kindImmediate;
  /* 0x000c */ unsigned int payloadId;
  /* 0x0010 */ int ignoredUse;
  /* 0x0014 */ int isVariantConfiguration;
}; /* size: 0x0018 */

typedef enum _DOT11_PHY_TYPE
{
  dot11_phy_type_unknown = 0,
  dot11_phy_type_any = 0,
  dot11_phy_type_fhss = 1,
  dot11_phy_type_dsss = 2,
  dot11_phy_type_irbaseband = 3,
  dot11_phy_type_ofdm = 4,
  dot11_phy_type_hrdsss = 5,
  dot11_phy_type_erp = 6,
  dot11_phy_type_ht = 7,
  dot11_phy_type_vht = 8,
  dot11_phy_type_dmg = 9,
  dot11_phy_type_he = 10,
  dot11_phy_type_IHV_start = -2147483648,
  dot11_phy_type_IHV_end = -1,
} DOT11_PHY_TYPE, *PDOT11_PHY_TYPE;

typedef enum _DMA_WIDTH
{
  Width8Bits = 0,
  Width16Bits = 1,
  Width32Bits = 2,
  Width64Bits = 3,
  WidthNoWrap = 4,
  MaximumDmaWidth = 5,
} DMA_WIDTH, *PDMA_WIDTH;

typedef struct _NDIS_PD_COUNTER_PARAMETERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ const wchar_t* CounterName;
  /* 0x000c */ enum NDIS_PD_COUNTER_TYPE Type;
} NDIS_PD_COUNTER_PARAMETERS, *PNDIS_PD_COUNTER_PARAMETERS; /* size: 0x0010 */

typedef enum _DMA_SPEED
{
  Compatible = 0,
  TypeA = 1,
  TypeB = 2,
  TypeC = 3,
  TypeF = 4,
  MaximumDmaSpeed = 5,
} DMA_SPEED, *PDMA_SPEED;

enum NDIS_PD_QUEUE_TYPE
{
  PDQueueTypeUnknown = 0,
  PDQueueTypeReceive = 1,
  PDQueueTypeTransmit = 2,
  PDQueueTypeMax = 3,
};

typedef struct _NDIS_802_11_AI_RESFI
{
  /* 0x0000 */ unsigned short Capabilities;
  /* 0x0002 */ unsigned short StatusCode;
  /* 0x0004 */ unsigned short AssociationId;
} NDIS_802_11_AI_RESFI, *PNDIS_802_11_AI_RESFI; /* size: 0x0006 */

typedef enum __vc_attributes::moduleAttribute::type_e
{
  dll = 1,
  exe = 2,
  service = 3,
  unspecified = 4,
  EXE = 2,
  SERVICE = 3,
} _vc_attributes::moduleAttribute::type_e, *P_vc_attributes::moduleAttribute::type_e;

class KCriticalRegion
{
  /* 0x0000 */ BOOL m_Entered;
}; /* size: 0x0001 */

typedef struct _NDIS_PORT_CHARACTERISTICS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long PortNumber;
  /* 0x0008 */ unsigned long Flags;
  /* 0x000c */ enum _NDIS_PORT_TYPE Type;
  /* 0x0010 */ enum _NET_IF_MEDIA_CONNECT_STATE MediaConnectState;
  /* 0x0014 */ long Padding_62;
  /* 0x0018 */ unsigned __int64 XmitLinkSpeed;
  /* 0x0020 */ unsigned __int64 RcvLinkSpeed;
  /* 0x0028 */ enum _NET_IF_DIRECTION_TYPE Direction;
  /* 0x002c */ enum _NDIS_PORT_CONTROL_STATE SendControlState;
  /* 0x0030 */ enum _NDIS_PORT_CONTROL_STATE RcvControlState;
  /* 0x0034 */ enum _NDIS_PORT_AUTHORIZATION_STATE SendAuthorizationState;
  /* 0x0038 */ enum _NDIS_PORT_AUTHORIZATION_STATE RcvAuthorizationState;
  /* 0x003c */ long __PADDING__[1];
} NDIS_PORT_CHARACTERISTICS, *PNDIS_PORT_CHARACTERISTICS; /* size: 0x0040 */

typedef struct _NDIS_PORT_BLOCK
{
  /* 0x0000 */ struct _LIST_ENTRY Link;
  /* 0x0008 */ enum _NDIS_PORT_PNP_STATE PortPnPState;
  /* 0x000c */ enum _NDIS_PORT_PNP_STATE PrevPortPnPState;
  /* 0x0010 */ struct _NDIS_PORT_CHARACTERISTICS PortCharacteristics;
} NDIS_PORT_BLOCK, *PNDIS_PORT_BLOCK; /* size: 0x0050 */

typedef enum __vc_attributes::aggregatableAttribute::type_e
{
  never = 0,
  allowed = 1,
  always = 2,
} _vc_attributes::aggregatableAttribute::type_e, *P_vc_attributes::aggregatableAttribute::type_e;

typedef struct _SYSTEM_POWER_STATE_CONTEXT
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long Reserved1 : 8; /* bit position: 0 */
      /* 0x0000 */ unsigned long TargetSystemState : 4; /* bit position: 8 */
      /* 0x0000 */ unsigned long EffectiveSystemState : 4; /* bit position: 12 */
      /* 0x0000 */ unsigned long CurrentSystemState : 4; /* bit position: 16 */
      /* 0x0000 */ unsigned long IgnoreHibernationPath : 1; /* bit position: 20 */
      /* 0x0000 */ unsigned long PseudoTransition : 1; /* bit position: 21 */
      /* 0x0000 */ unsigned long KernelSoftReboot : 1; /* bit position: 22 */
      /* 0x0000 */ unsigned long DirectedDripsTransition : 1; /* bit position: 23 */
      /* 0x0000 */ unsigned long Reserved2 : 8; /* bit position: 24 */
    }; /* bitfield */
    /* 0x0000 */ unsigned long ContextAsUlong;
  }; /* size: 0x0004 */
} SYSTEM_POWER_STATE_CONTEXT, *PSYSTEM_POWER_STATE_CONTEXT; /* size: 0x0004 */

typedef struct _RECORDER_LOG_CREATE_PARAMS
{
  /* 0x0000 */ unsigned long Size;
  /* 0x0004 */ unsigned long LogTag;
  /* 0x0008 */ unsigned long TotalBufferSize;
  /* 0x000c */ unsigned long ErrorPartitionSize;
  /* 0x0010 */ unsigned long LogIdentifierAppendValue;
  /* 0x0014 */ unsigned char LogIdentifierAppendValueSet;
  /* 0x0015 */ char Padding_63[3];
  /* 0x0018 */ unsigned long LogIdentifierSize;
  /* 0x001c */ char LogIdentifier[16];
} RECORDER_LOG_CREATE_PARAMS, *PRECORDER_LOG_CREATE_PARAMS; /* size: 0x002c */

typedef struct _PEB_LDR_DATA
{
  /* 0x0000 */ unsigned long Length;
  /* 0x0004 */ unsigned char Initialized;
  /* 0x0005 */ char Padding_64[3];
  /* 0x0008 */ void* SsHandle;
  /* 0x000c */ struct _LIST_ENTRY InLoadOrderModuleList;
  /* 0x0014 */ struct _LIST_ENTRY InMemoryOrderModuleList;
  /* 0x001c */ struct _LIST_ENTRY InInitializationOrderModuleList;
  /* 0x0024 */ void* EntryInProgress;
  /* 0x0028 */ unsigned char ShutdownInProgress;
  /* 0x0029 */ char Padding_65[3];
  /* 0x002c */ void* ShutdownThreadId;
} PEB_LDR_DATA, *PPEB_LDR_DATA; /* size: 0x0030 */

typedef enum __vc_attributes::threadingAttribute::threading_e
{
  apartment = 1,
  single = 2,
  free = 3,
  neutral = 4,
  both = 5,
} _vc_attributes::threadingAttribute::threading_e, *P_vc_attributes::threadingAttribute::threading_e;

typedef struct _NDIS_PACKET_EXTENSION
{
  /* 0x0000 */ void* NdisPacketInfo[12];
} NDIS_PACKET_EXTENSION, *PNDIS_PACKET_EXTENSION; /* size: 0x0030 */

typedef enum __vc_attributes::helper_attributes::usageAttribute::usage_e
{
  eAnyUsage = 0,
  eCoClassUsage = 1,
  eCOMInterfaceUsage = 2,
  eInterfaceUsage = 6,
  eMemberUsage = 8,
  eMethodUsage = 16,
  eInterfaceMethodUsage = 32,
  eInterfaceMemberUsage = 64,
  eCoClassMemberUsage = 128,
  eCoClassMethodUsage = 256,
  eGlobalMethodUsage = 768,
  eGlobalDataUsage = 1024,
  eClassUsage = 2048,
  eInterfaceParameterUsage = 4096,
  eMethodParameterUsage = 12288,
  eIDLModuleUsage = 16384,
  eAnonymousUsage = 0xffff8000,
  eTypedefUsage = 0x10000,
  eUnionUsage = 0x20000,
  eEnumUsage = 0x40000,
  eDefineTagUsage = 0x80000,
  eStructUsage = 0x100000,
  eLocalUsage = 0x200000,
  ePropertyUsage = 0x400000,
  eEventUsage = 0x800000,
  eTemplateUsage = 0x1000000,
  eModuleUsage = 0x1000000,
  eIllegalUsage = 0x2000000,
  eAsynchronousUsage = 0x4000000,
  eAnyIDLUsage = 0x3f7fff,
} _vc_attributes::helper_attributes::usageAttribute::usage_e, *P_vc_attributes::helper_attributes::usageAttribute::usage_e;

typedef enum __vc_attributes::helper_attributes::v1_alttypeAttribute::type_e
{
  eBoolean = 0,
  eInteger = 1,
  eFloat = 2,
  eDouble = 3,
} _vc_attributes::helper_attributes::v1_alttypeAttribute::type_e, *P_vc_attributes::helper_attributes::v1_alttypeAttribute::type_e;

typedef enum __vc_attributes::event_sourceAttribute::optimize_e
{
  speed = 0,
  size = 1,
} _vc_attributes::event_sourceAttribute::optimize_e, *P_vc_attributes::event_sourceAttribute::optimize_e;

typedef enum _NDIS_PROCESSOR_TYPE
{
  NdisProcessorX86 = 0,
  NdisProcessorMips = 1,
  NdisProcessorAlpha = 2,
  NdisProcessorPpc = 3,
  NdisProcessorAmd64 = 4,
  NdisProcessorIA64 = 5,
  NdisProcessorArm = 6,
  NdisProcessorArm64 = 7,
} NDIS_PROCESSOR_TYPE, *PNDIS_PROCESSOR_TYPE;

typedef enum _NDIS_RECEIVE_FILTER_TEST
{
  NdisReceiveFilterTestUndefined = 0,
  NdisReceiveFilterTestEqual = 1,
  NdisReceiveFilterTestMaskEqual = 2,
  NdisReceiveFilterTestNotEqual = 3,
  NdisReceiveFilterTestMaximum = 4,
} NDIS_RECEIVE_FILTER_TEST, *PNDIS_RECEIVE_FILTER_TEST;

typedef enum _NET_DEVICE_POWER_STATE
{
  NetDeviceStateUnspecified = 0,
  NetDeviceStateD0 = 1,
  NetDeviceStateD1 = 2,
  NetDeviceStateD2 = 3,
  NetDeviceStateD3 = 4,
  NetDeviceStateMaximum = 5,
} NET_DEVICE_POWER_STATE, *PNET_DEVICE_POWER_STATE;

typedef struct _NDIS_GFT_TABLE_INFO
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ unsigned long TableId;
  /* 0x000c */ enum _NDIS_GFP_TABLE_TYPE TableType;
  /* 0x0010 */ unsigned long NextTableId;
  /* 0x0014 */ unsigned long NumFlowEntries;
} NDIS_GFT_TABLE_INFO, *PNDIS_GFT_TABLE_INFO; /* size: 0x0018 */

typedef enum _FILE_INFORMATION_CLASS
{
  FileDirectoryInformation = 1,
  FileFullDirectoryInformation = 2,
  FileBothDirectoryInformation = 3,
  FileBasicInformation = 4,
  FileStandardInformation = 5,
  FileInternalInformation = 6,
  FileEaInformation = 7,
  FileAccessInformation = 8,
  FileNameInformation = 9,
  FileRenameInformation = 10,
  FileLinkInformation = 11,
  FileNamesInformation = 12,
  FileDispositionInformation = 13,
  FilePositionInformation = 14,
  FileFullEaInformation = 15,
  FileModeInformation = 16,
  FileAlignmentInformation = 17,
  FileAllInformation = 18,
  FileAllocationInformation = 19,
  FileEndOfFileInformation = 20,
  FileAlternateNameInformation = 21,
  FileStreamInformation = 22,
  FilePipeInformation = 23,
  FilePipeLocalInformation = 24,
  FilePipeRemoteInformation = 25,
  FileMailslotQueryInformation = 26,
  FileMailslotSetInformation = 27,
  FileCompressionInformation = 28,
  FileObjectIdInformation = 29,
  FileCompletionInformation = 30,
  FileMoveClusterInformation = 31,
  FileQuotaInformation = 32,
  FileReparsePointInformation = 33,
  FileNetworkOpenInformation = 34,
  FileAttributeTagInformation = 35,
  FileTrackingInformation = 36,
  FileIdBothDirectoryInformation = 37,
  FileIdFullDirectoryInformation = 38,
  FileValidDataLengthInformation = 39,
  FileShortNameInformation = 40,
  FileIoCompletionNotificationInformation = 41,
  FileIoStatusBlockRangeInformation = 42,
  FileIoPriorityHintInformation = 43,
  FileSfioReserveInformation = 44,
  FileSfioVolumeInformation = 45,
  FileHardLinkInformation = 46,
  FileProcessIdsUsingFileInformation = 47,
  FileNormalizedNameInformation = 48,
  FileNetworkPhysicalNameInformation = 49,
  FileIdGlobalTxDirectoryInformation = 50,
  FileIsRemoteDeviceInformation = 51,
  FileUnusedInformation = 52,
  FileNumaNodeInformation = 53,
  FileStandardLinkInformation = 54,
  FileRemoteProtocolInformation = 55,
  FileRenameInformationBypassAccessCheck = 56,
  FileLinkInformationBypassAccessCheck = 57,
  FileVolumeNameInformation = 58,
  FileIdInformation = 59,
  FileIdExtdDirectoryInformation = 60,
  FileReplaceCompletionInformation = 61,
  FileHardLinkFullIdInformation = 62,
  FileIdExtdBothDirectoryInformation = 63,
  FileDispositionInformationEx = 64,
  FileRenameInformationEx = 65,
  FileRenameInformationExBypassAccessCheck = 66,
  FileDesiredStorageClassInformation = 67,
  FileStatInformation = 68,
  FileMemoryPartitionInformation = 69,
  FileStatLxInformation = 70,
  FileCaseSensitiveInformation = 71,
  FileLinkInformationEx = 72,
  FileLinkInformationExBypassAccessCheck = 73,
  FileStorageReserveIdInformation = 74,
  FileCaseSensitiveInformationForceAccessCheck = 75,
  FileMaximumInformation = 76,
} FILE_INFORMATION_CLASS, *PFILE_INFORMATION_CLASS;

enum BUS_QUERY_ID_TYPE
{
  BusQueryDeviceID = 0,
  BusQueryHardwareIDs = 1,
  BusQueryCompatibleIDs = 2,
  BusQueryInstanceID = 3,
  BusQueryDeviceSerialNumber = 4,
  BusQueryContainerID = 5,
};

typedef enum _DEVICE_USAGE_NOTIFICATION_TYPE
{
  DeviceUsageTypeUndefined = 0,
  DeviceUsageTypePaging = 1,
  DeviceUsageTypeHibernation = 2,
  DeviceUsageTypeDumpFile = 3,
  DeviceUsageTypeBoot = 4,
  DeviceUsageTypePostDisplay = 5,
  DeviceUsageTypeGuestAssigned = 6,
} DEVICE_USAGE_NOTIFICATION_TYPE, *PDEVICE_USAGE_NOTIFICATION_TYPE;

enum POWER_ACTION
{
  PowerActionNone = 0,
  PowerActionReserved = 1,
  PowerActionSleep = 2,
  PowerActionHibernate = 3,
  PowerActionShutdown = 4,
  PowerActionShutdownReset = 5,
  PowerActionShutdownOff = 6,
  PowerActionWarmEject = 7,
  PowerActionDisplayOff = 8,
};

typedef enum _WWAN_CELLULAR_CLASS
{
  WwanCellularClassUnknown = 0,
  WwanCellularClassGsm = 1,
  WwanCellularClassCdma = 2,
  WwanCellularClassMax = 3,
} WWAN_CELLULAR_CLASS, *PWWAN_CELLULAR_CLASS;

typedef enum _WWAN_SIM_CLASS
{
  WwanSimClassUnknown = 0,
  WwanSimClassSimLogical = 1,
  WwanSimClassSimRemovable = 2,
  WwanSimClassSimRemote = 3,
  WwanSimClassMax = 4,
} WWAN_SIM_CLASS, *PWWAN_SIM_CLASS;

typedef enum _DOT11_TEMP_TYPE
{
  dot11_temp_type_unknown = 0,
  dot11_temp_type_1 = 1,
  dot11_temp_type_2 = 2,
} DOT11_TEMP_TYPE, *PDOT11_TEMP_TYPE;

typedef struct _NDIS_NET_BUFFER_LIST_MEDIA_SPECIFIC_INFO
{
  union
  {
    /* 0x0000 */ void* MediaSpecificInfo;
    /* 0x0000 */ void* NativeWifiSpecificInfo;
    /* 0x0000 */ void* Value;
  }; /* size: 0x0004 */
} NDIS_NET_BUFFER_LIST_MEDIA_SPECIFIC_INFO, *PNDIS_NET_BUFFER_LIST_MEDIA_SPECIFIC_INFO; /* size: 0x0004 */

typedef enum _NDIS_MAC_HEADER_FIELD
{
  NdisMacHeaderFieldUndefined = 0,
  NdisMacHeaderFieldDestinationAddress = 1,
  NdisMacHeaderFieldSourceAddress = 2,
  NdisMacHeaderFieldProtocol = 3,
  NdisMacHeaderFieldVlanId = 4,
  NdisMacHeaderFieldPriority = 5,
  NdisMacHeaderFieldPacketType = 6,
  NdisMacHeaderFieldMaximum = 7,
} NDIS_MAC_HEADER_FIELD, *PNDIS_MAC_HEADER_FIELD;

typedef enum _NDIS_IPV4_HEADER_FIELD
{
  NdisIPv4HeaderFieldUndefined = 0,
  NdisIPv4HeaderFieldProtocol = 1,
  NdisIPv4HeaderFieldMaximum = 2,
} NDIS_IPV4_HEADER_FIELD, *PNDIS_IPV4_HEADER_FIELD;

typedef enum _NDIS_UDP_HEADER_FIELD
{
  NdisUdpHeaderFieldUndefined = 0,
  NdisUdpHeaderFieldDestinationPort = 1,
  NdisUdpHeaderFieldMaximum = 2,
} NDIS_UDP_HEADER_FIELD, *PNDIS_UDP_HEADER_FIELD;

typedef enum _NDK_OPERATION_TYPE
{
  NdkOperationTypeReceive = 1,
  NdkOperationTypeReceiveAndInvalidate = 0xffff8001,
  NdkOperationTypeSend = 2,
  NdkOperationTypeFastRegister = 4,
  NdkOperationTypeBind = 8,
  NdkOperationTypeInvalidate = 16,
  NdkOperationTypeRead = 32,
  NdkOperationTypeWrite = 64,
} NDK_OPERATION_TYPE, *PNDK_OPERATION_TYPE;

typedef enum _NDIS_NIC_SWITCH_VPORT_STATE
{
  NdisNicSwitchVPortStateUndefined = 0,
  NdisNicSwitchVPortStateActivated = 1,
  NdisNicSwitchVPortStateDeactivated = 2,
  NdisNicSwitchVPortStateMaximum = 3,
} NDIS_NIC_SWITCH_VPORT_STATE, *PNDIS_NIC_SWITCH_VPORT_STATE;

