typedef struct _RTL_FEATURE_USAGE_SUBSCRIPTION_TARGET
{
  /* 0x0000 */ unsigned long Data[2];
} RTL_FEATURE_USAGE_SUBSCRIPTION_TARGET, *PRTL_FEATURE_USAGE_SUBSCRIPTION_TARGET; /* size: 0x0008 */

typedef struct _RTL_FEATURE_USAGE_SUBSCRIPTION_DETAILS
{
  /* 0x0000 */ unsigned int FeatureId;
  /* 0x0004 */ unsigned short ReportingKind;
  /* 0x0006 */ unsigned short ReportingOptions;
  /* 0x0008 */ struct _RTL_FEATURE_USAGE_SUBSCRIPTION_TARGET ReportingTarget;
} RTL_FEATURE_USAGE_SUBSCRIPTION_DETAILS, *PRTL_FEATURE_USAGE_SUBSCRIPTION_DETAILS; /* size: 0x0010 */

typedef struct _SYSTEM_FEATURE_USAGE_SUBSCRIPTION_UPDATE_ENTRY
{
  /* 0x0000 */ unsigned long Remove;
  /* 0x0004 */ struct _RTL_FEATURE_USAGE_SUBSCRIPTION_DETAILS Details;
} SYSTEM_FEATURE_USAGE_SUBSCRIPTION_UPDATE_ENTRY, *PSYSTEM_FEATURE_USAGE_SUBSCRIPTION_UPDATE_ENTRY; /* size: 0x0014 */

typedef struct _SYSTEM_FEATURE_USAGE_SUBSCRIPTION_UPDATE
{
  /* 0x0000 */ unsigned long UpdateCount;
  /* 0x0004 */ struct _SYSTEM_FEATURE_USAGE_SUBSCRIPTION_UPDATE_ENTRY Updates[1];
} SYSTEM_FEATURE_USAGE_SUBSCRIPTION_UPDATE, *PSYSTEM_FEATURE_USAGE_SUBSCRIPTION_UPDATE; /* size: 0x0018 */

