struct _IMAGE_RESOURCE_DIRECTORY_ENTRY;
enum __scrt_module_type;
struct IPicture2;
class Microsoft::WRL::ComPtr<IApplicationAssociationRegistration>;
enum _NT_PRODUCT_TYPE;
union std::_Align_type<double,72>;
enum DISPLAYCONFIG_SCANLINE_ORDERING;
class allocateExtra_t;
enum _PNP_QUERY_RELATION;
class CLimitedWritableStorage::Stat::__l2::<lambda_c61124bf9311369ccd740ead4f8d81ee>;
class wil::details::StoredCallContextInfo;
enum wil::FailureType;
enum wil::FailureFlags;
struct wil::CallContextInfo;
struct wil::FailureInfo;
class wil::details::shared_buffer;
class wil::StoredFailureInfo;
struct _RTL_SRWLOCK;
class wil::srwlock;
class wil::ActivityBase<DragDropLogging,1,70368744177664,5,33554432,_TlgReflectorTag_Param0IsProviderType>::ActivityData<DragDropLogging,_TlgReflectorTag_Param0IsProviderType>;
struct wil::details::shared_object<wil::ActivityBase<DragDropLogging,1,70368744177664,5,33554432,_TlgReflectorTag_Param0IsProviderType>::ActivityData<DragDropLogging,_TlgReflectorTag_Param0IsProviderType> >::RefAndObject;
enum JOB_OBJECT_NET_RATE_CONTROL_FLAGS;
struct _RTL_RB_TREE;
struct tagCAUUID;
struct Windows::Foundation::Collections::IIterator_impl<Windows::UI::WindowId,0>;
enum JOB_OBJECT_IO_RATE_CONTROL_FLAGS;
struct Windows::Foundation::Collections::IIterable_impl<__int64>;
struct wistd::__libcpp_is_integral<long>;
enum wil::details::PendingCallbackCancellationBehavior;
struct IXMLDOMImplementation;
struct Windows::Foundation::Internal::AggregateType<bool,unsigned char>;

struct wil::details::resource_policy<void *,void * (__cdecl*)(void *),&LocalFree,wistd::integral_constant<unsigned __int64,0>,void *,void *,0,std::nullptr_t>;
struct Windows::Foundation::IEventHandler<bool>;
struct Windows::Foundation::Internal::AggregateType<Windows::ApplicationModel::DataTransfer::OperationCompletedEventArgs *,Windows::ApplicationModel::DataTransfer::IOperationCompletedEventArgs *>;
struct Windows::Foundation::IReference_impl<_GUID>;
struct __vcrt_va_list_is_reference<unsigned short const * const>;
struct _WOW64_FLOATING_SAVE_AREA;
struct _OSVERSIONINFOW;
struct Windows::Foundation::Collections::IIterator<Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,float> *>;
struct Windows::Foundation::Collections::supports_cleanup<Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,Windows::Foundation::Collections::IVector<HSTRING__ *> *> *>;
struct _RPC_BINDING_HANDLE_SECURITY_V1_A;
struct _REFS_DEALLOCATE_RANGES_RANGE;
class wil::condition_variable;
class CLimitedWritableStream::Commit::__l2::<lambda_0a18120dc7dcec8cb07768015f9b0617>;
struct _BCRYPT_ECCKEY_BLOB;
struct Windows::Foundation::Collections::IMap<_GUID,IInspectable *>;
struct Windows::Foundation::Collections::IIterator<Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,Windows::Storage::Streams::RandomAccessStreamReference *> *>;
struct Windows::Foundation::Collections::IIterator<Windows::ApplicationModel::Internal::DataTransfer::ClipboardHistoryItemInternal *>;
struct Windows::Foundation::Collections::is_pointer<Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,Windows::Foundation::IPropertyValue *> *>;
struct Windows::Foundation::Collections::is_foundation_struct<unsigned int>;
struct XSAVE_CPU_ERRATA;
struct tagIMMAPPTIMESTAMPS;
struct IClipboardBrokerInternal;
struct Windows::Foundation::Collections::IVectorView_impl<unsigned char,1>;
class Microsoft::WRL::ComPtr<IImpersonateClipboardOwner>;
struct wil::details::EnabledStateManager::CachedFeaturePropertyData;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<Windows::Foundation::IAsyncAction> const >;
struct _TAPE_GET_MEDIA_PARAMETERS;
struct Windows::Foundation::Collections::IIterator_impl<Windows::Storage::Streams::IRandomAccessStreamReference *,1>;
class wil::com_ptr_t<IOleVerb,wil::err_returncode_policy>;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IImpersonateClipboardOwner> const >;
struct std::_Default_allocator_traits<std::allocator<unsigned short> >;
struct Windows::Foundation::IAsyncOperationCompletedHandler<Windows::ApplicationModel::DataTransfer::ClipboardHistoryItemsResult *>;
struct std::_Num_int_base;
struct Microsoft::WRL::Details::VerifyInterfaceHelper<1,Windows::Foundation::Collections::IIterable<Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,IInspectable *> *>,1,0>;
struct std::_Num_float_base;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<TypeLibRegistrationEnumerator> const >;
struct _TIME_FIELDS;
struct wil::read_lock_required;
struct IAsyncCallback;
class CWrapperBase<IStorage>::{dtor}::__l2::<lambda_1fabf05943988ec97a03c569b9148d41>;
class XWinRT::XHashMap<HSTRING__ *,IInspectable *,Windows::Foundation::Collections::Internal::HashMap<HSTRING__ *,IInspectable *,Windows::Foundation::Collections::Internal::DefaultHash<HSTRING__ *>,Windows::Foundation::Collections::Internal::DefaultEqualityPredicate<HSTRING__ *>,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<HSTRING__ *>,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<IInspectable *>,Windows::Foundation::Collections::Internal::DefaultHashMapOptions<HSTRING__ *,IInspectable *,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<HSTRING__ *> > >::KeyTraits,XWinRT::CElementTraits<IInspectable *> >::CPair;
class SafeIntCompare<unsigned short,unsigned short>;
struct _ACCESS_ALLOWED_CALLBACK_ACE;
struct _SERVICE_CONTROL_STATUS_REASON_PARAMSW;
class CEnumFmt;
struct CCompositeMonikerEnum::se;
struct Windows::Foundation::Collections::IIterator_impl<Windows::Foundation::Collections::IKeyValuePair<_GUID,Windows::ApplicationModel::Background::BackgroundTaskRegistration *> *,1>;
struct Windows::Foundation::ITypedEventHandler<Windows::ApplicationModel::Internal::DataTransfer::ClipboardSignalProducer *,IInspectable *>;
struct Windows::Foundation::IAsyncOperationCompletedHandler_impl<Windows::Foundation::Collections::IVector<Windows::ApplicationModel::Internal::DataTransfer::ClipboardHistoryItemInternal *> *>;
struct _JOBOBJECT_WAKE_INFORMATION;
struct wil::details::close_invoke_helper<1,void (__cdecl*)(_TP_WAIT *),&wil::details::DestroyThreadPoolWait<0>::Destroy,_TP_WAIT *>;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IOleClassInfo> const >;
struct __vc_attributes::atl::registration_scriptAttribute;
struct Windows::Foundation::Collections::is_pointer<Windows::Foundation::Collections::IKeyValuePair<_GUID,bool> *>;
struct _SYSTEM_QUERY_TIME_ADJUST_INFORMATION_PRECISE;
struct wil::details::SystemThreadPoolMethods;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<CClipboardBroker> const >;
struct wil::details::string_allocator<wil::unique_any_t<wil::details::unique_storage<wil::details::resource_policy<unsigned short *,void * (__cdecl*)(void *),&GlobalFree,wistd::integral_constant<unsigned __int64,0>,unsigned short *,unsigned short *,0,std::nullptr_t> > > >;
class Microsoft::WRL::Details::MakeAllocator<ReferencedRegistryKey>;
struct Windows::Foundation::IAsyncOperation<Windows::Storage::FileProperties::DocumentProperties *>;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<RegistryVerb> const >;
struct CMemString_PolicyAutoMem;
class XWinRT::detail::LockHolder<XWinRT::SRWLock,XWinRT::detail::TryAcquireRead>;
class XWinRT::CElementTraitsBase<HSTRING__ *>;
struct wil::details::resource_policy<_CERT_CONTEXT const *,int (__cdecl*)(_CERT_CONTEXT const *),&CertFreeCertificateContext,wistd::integral_constant<unsigned __int64,0>,_CERT_CONTEXT const *,_CERT_CONTEXT const *,0,std::nullptr_t>;
struct wil::details_abi::SubscriptionList::Subscription;
struct _FILE_NETWORK_PHYSICAL_NAME_INFORMATION;
struct __vc_attributes::stringAttribute;
struct _EXTENDED_ENCRYPTED_DATA_INFO;
struct wil::details::close_invoke_helper<1,void (__cdecl*)(_RTL_SRWLOCK *),&RtlReleaseSRWLockExclusive,_RTL_SRWLOCK *>;
struct IEnumOLEVERB;
struct Microsoft::WRL::Details::ImplementsHelper<Microsoft::WRL::RuntimeClassFlags<2>,0,IConversionClass>;
struct Windows::Foundation::Collections::IIterable<Windows::Foundation::Collections::IKeyValuePair<IInspectable *,IInspectable *> *>;
class Windows::Storage::BulkAccess::FolderInformation;
class SafeIntException;
class CDragDropBroker;
class CEnumFmt10;
struct _PS_PKG_CLAIM;
struct IImmersiveApplicationWindow;
struct Microsoft::WRL::Details::VerifyInterfaceHelper<2,IClipboardBroker,0,0>;
struct Windows::Foundation::Collections::IIterator<Windows::Storage::BulkAccess::FileInformation *>;
class wil::details::<lambda_f6f5a2d65a5be6901b153907bff1bc07>;
struct wistd::unique_ptr<wil::details::folder_change_reader_state,wistd::default_delete<wil::details::folder_change_reader_state> >::__nat;
struct Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Storage::IStorageItem *> *>;
struct _JOBOBJECT_IO_PRIORITY_LIMIT;
struct __vcrt_assert_va_start_is_not_reference<unsigned short * *>;
struct _CRITICAL_PROCESS_EXCEPTION_DATA;
struct wil::ExpiredFeatureTraits<wil::details::FeatureTraitsBase>;
class Microsoft::WRL::Details::RuntimeClassImpl<Microsoft::WRL::RuntimeClassFlags<2>,1,0,0,ITypeLibRegistrationReader,Microsoft::WRL::FtmBase>;
struct wil::details::close_invoke_helper<1,void (__cdecl*)(_RTL_SRWLOCK *),&RtlReleaseSRWLockShared,_RTL_SRWLOCK *>;
struct Windows::Foundation::IActivatableClassRegistration;
class Microsoft::WRL::Details::MakeAllocator<CEnumFmt>;
struct EVENT_ENTRY;
class Microsoft::WRL::Details::MakeAllocator<CEnumFmt10>;
struct IPackagedComClassIdIterator;
struct _CRYPTNET_URL_CACHE_FLUSH_INFO;
struct _tlgDataDescInit<_tlgIndexSequence<9,0,1,2,3,4,5,6,7,8> >;
struct __vc_attributes::helper_attributes::multi_valueAttribute;
class Microsoft::WRL::ComPtr<IObjectProvider>;
struct wil::details::close_invoke_helper<1,void (__cdecl*)(void *) noexcept,&wil::details::ResetEvent,void *>;
struct _SYSTEM_PROCESSOR_IDLE_INFORMATION;
struct Windows::Foundation::IReference<Windows::Foundation::TimeSpan>;
struct wil::details::close_invoke_helper<1,void * (__cdecl*)(void *),&LocalFree,unsigned short *>;
struct __vc_attributes::size_isAttribute;
struct Microsoft::WRL::Details::Selector<Microsoft::WRL::Details::ImplementsHelper<Microsoft::WRL::RuntimeClassFlags<2>,1>,Microsoft::WRL::Details::ImplementsHelper<Microsoft::WRL::RuntimeClassFlags<2>,1,Microsoft::WRL::Details::ImplementsMarker<Microsoft::WRL::FtmBase> > >;
struct _CERT_LOGOTYPE_EXT_INFO;
struct Microsoft::WRL::Details::VerifyInterfaceHelper<2,IDataObject,0,0>;
struct Microsoft::WRL::Details::VerifyInterfaceHelper<2,IClipboardTaskCompletion,0,0>;
struct wistd::__function::__maybe_derive_from_unary_function<long __cdecl(unsigned short *,unsigned __int64,unsigned __int64 *)>;
struct _CERT_LOGOTYPE_DATA;
struct Microsoft::WRL::Details::VerifyInterfaceHelper<2,Microsoft::WRL::FtmBase,1,1>;
struct GetTypeValueImpl<long,unsigned short const *,long>;
struct CClipDataObject::GetFormatEtcDataArray::__l12::SUPPORTED_EDP_ACCESS_DENIED_FORMATS_MAP;
struct _CERT_CREATE_CONTEXT_PARA;
struct PICTINFO;
class Common::AutoBaseHandle<HKEY__ *,&Common::AutoHandleCloseHKEY<HKEY__ *> >;
class BinaryAndHelper<long,int,0>;
struct wil::details::close_invoke_helper<1,void (__cdecl*)(unsigned short *),&SysFreeString,unsigned short *>;
class Windows::ApplicationModel::Internal::DataTransfer::ClipboardSignalProducedEventArgs;
struct wil::details::close_invoke_helper<1,void (__cdecl*)(_RTL_SRWLOCK *),&ReleaseSRWLockShared,_RTL_SRWLOCK *>;
struct wil::details::wnf_subscription_state_base;
struct wistd::__compressed_pair_elem<_TOKEN_GROUPS_AND_PRIVILEGES *,0,0>;
struct _RGNDATAHEADER;
struct _APP_MEMORY_INFORMATION;
class Microsoft::WRL::Details::RuntimeClassImpl<Microsoft::WRL::RuntimeClassFlags<2>,1,0,0,IComProgIdIterator>;
struct wil::details::close_invoke_helper<1,void (__cdecl*)(_TP_TIMER *),&wil::details::DestroyThreadPoolTimer<wil::details::SystemThreadPoolMethods,0>::Destroy,_TP_TIMER *>;
struct Windows::Foundation::Collections::supports_cleanup<Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,unsigned char> *>;
struct _SECURITY_SEED_AND_LENGTH;
class Common::AutoHandle;
class CFunctionDiscoveryNotificationWrapper;
struct _BY_HANDLE_FILE_INFORMATION;
class Common::AutoBaseHandle<void *,&Common::CloseHandleHelper>;
struct GetTypeValueImpl<long,unsigned long,long>;
struct __vc_attributes::atl::db_paramAttribute;
class CAutoHandle_Policy<HRGN__ *>;
struct GetTypeValueImpl<long,unsigned short *,long>;
struct Windows::Foundation::Collections::is_pointer<Windows::Storage::IStorageFolder *>;
class wil::details::<lambda_80d4cd0177896705b6a0b81f0b1f02f0>;
struct wil::details::ResultStatus;
struct _DROPFILES;
union _userHGLOBAL::__MIDL_IWinTypes_0003;
struct IWrappedProtocol;
struct Windows::Foundation::Collections::supports_cleanup<Windows::Foundation::Internal::AggregateType<Windows::Storage::StorageFolder *,Windows::Storage::IStorageFolder *> >;
struct wil::details::static_lazy<wil::details::ApiTelemetryLogger>::Completer;
struct _DEVICE_DSM_DEFINITION;
struct Windows::Foundation::Collections::IIterable<Windows::Storage::StorageFolder *>;
class EnumMap<MAP_KEY_GUID,NdrTypeInfo *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>;
class CThreadCheck;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IApplicationAssociationRegistration> >;
struct tagPOINTFX;
struct tagTTPOLYCURVE;
struct Windows::Foundation::Collections::is_foundation_struct<Windows::Foundation::Collections::IKeyValuePair<EventRegistrationToken,int> *>;
struct Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Foundation::Collections::IPropertySet *> *>;
struct Windows::Foundation::Collections::IIterator_impl<Windows::Foundation::Internal::AggregateType<Windows::Storage::StorageLibraryChange *,Windows::Storage::IStorageLibraryChange *>,1>;
struct wistd::__unique_ptr_deleter_sfinae<wil::function_deleter<void (__cdecl*)(void *),&PrivMemFree> >;
struct _Real_widened<double,double>;
class wil::com_ptr_t<IComProgIdIterator,wil::err_returncode_policy>;
class wil::ActivityBase<DragDropLogging,1,0,5,0,_TlgReflectorTag_Param0IsProviderType>;
struct _SC_ACTION;
class std::_Lockit;
struct _FILE_STORAGE_TIER;
struct wil::details::shared_object<wil::ActivityBase<DragDropLogging,1,0,5,0,_TlgReflectorTag_Param0IsProviderType>::ActivityData<DragDropLogging,_TlgReflectorTag_Param0IsProviderType> >::RefAndObject;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IOleDragDropBrokerHost> const >;
struct Windows::Foundation::Collections::IVectorView_impl<Windows::Foundation::Internal::AggregateType<Windows::Storage::StorageLibraryChange *,Windows::Storage::IStorageLibraryChange *>,1>;
struct Windows::Foundation::Collections::supports_cleanup<Windows::Foundation::Collections::IKeyValuePair<unsigned int,IInspectable *> *>;
struct Windows::Foundation::Collections::IVectorView_impl<Windows::Foundation::Internal::AggregateType<Windows::Foundation::Uri *,Windows::Foundation::IUriRuntimeClass *>,1>;
class MAP_KEY_GUID;
struct wil::details::close_invoke_helper<1,void (__cdecl*)(void *),&CoTaskMemFree,unsigned short *>;
struct Windows::Foundation::IAsyncOperationCompletedHandler_impl<Windows::Storage::IStorageItem *>;
struct _PROCESS_HANDLE_TRACING_ENTRY;
struct _PROCESS_HANDLE_TRACING_QUERY;
struct _WIN32_FILE_ATTRIBUTE_DATA;
struct _PLUGPLAY_CONTROL_DEPTH_DATA;
class wil::details::static_lazy<DragDropTelemetry>;
class AdHocCallFrame<IPersistPropertyBag,<lambda_4f665fe9629adf1b6321c2bb89cc94f4> >;
class Microsoft::WRL::ComPtr<IEnterpriseDropTarget>;
class CPrivDragDrop;
struct Windows::Storage::Streams::IBuffer;
class IsInt<int>;
struct _RTL_IMAGE_MITIGATION_EXTENSION_POINT_DISABLE_POLICY;
struct Windows::Foundation::Collections::supports_cleanup<Windows::Foundation::Internal::AggregateType<Windows::ApplicationModel::DataTransfer::ClipboardHistoryItem *,Windows::ApplicationModel::DataTransfer::IClipboardHistoryItem *> >;
struct _XSAVE_FEATURE;
struct Windows::Foundation::Internal::AggregateType<Windows::Storage::Streams::RandomAccessStreamReference *,Windows::Storage::Streams::IRandomAccessStreamReference *>;
struct tagFULLPROPSPEC;
struct _DMA_CONFIGURATION_BYTE1;
struct Windows::Foundation::Collections::is_pointer<Windows::Storage::IStorageFile *>;
struct _JOURNAL_SET_KEY_LAST_WRITE_TIME_INFORMATION;
struct __vc_attributes::immediatebindAttribute;
struct _SECTION_IMAGE_INFORMATION;
struct _SECTION_INTERNAL_IMAGE_INFORMATION;
struct _CERT_QC_STATEMENT;
struct wil::details::shared_object<wil::ActivityBase<OleDragDropTracing,1,0,5,0,_TlgReflectorTag_Param0IsProviderType>::ActivityData<OleDragDropTracing,_TlgReflectorTag_Param0IsProviderType> >::RefAndObject;
class SafeIntCompare<unsigned int,unsigned __int64>;
struct _HEAP_REGION_INFORMATION;
struct _HEAP_RANGE_INFORMATION;
struct _HEAP_BLOCK_INFORMATION;
struct _SEGMENT_HEAP_PERFORMANCE_COUNTER_INFORMATION;
struct _HEAP_PERFORMANCE_COUNTERS_INFORMATION;
struct _HEAP_INFORMATION_ITEM;
class IntRegion<unsigned int,unsigned __int64>;
struct Windows::Foundation::Collections::IMapChangedEventArgs<_GUID>;
struct Windows::Foundation::Collections::IIterator_impl<enum Windows::System::UserWatcherUpdateKind,1>;
struct _GDI_TEB_BATCH32;
struct _TEB32;
struct Windows::Foundation::Collections::IKeyValuePair_impl<HSTRING__ *,Windows::Foundation::Internal::AggregateType<Windows::Storage::Streams::RandomAccessStreamReference *,Windows::Storage::Streams::IRandomAccessStreamReference *> >;
class wil::details_abi::LoadWnfUsageIndex::__l9::<lambda_b791f461fdcdf6803f8b1ec4cfa018be>;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<CClipboardBroker::CClipboardBrokerMTAHelper> const >;
struct Windows::Storage::IStorageLibrary;
struct FRAME_RemoteInvoke;
struct _CRYPT_CONTEXTS;
class wil::details::<lambda_d19d7f1b8bdf8a926ead7d5f6c722f80>;
struct XWinRT::TXPOSITION;
struct tagRPC_CALL_ATTRIBUTES_V2_A;
class wil::manually_managed_shutdown_aware_object<wil::details::EnabledStateManager>;
class wil::shutdown_aware_object<wil::details::EnabledStateManager>;
struct _CRYPT_PKCS8_IMPORT_PARAMS;
struct Windows::Foundation::Collections::is_pointer<Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,unsigned int> *>;
class wil::details_abi::ProcessLocalStorage<wil::details_abi::ProcessLocalData>;
struct __vc_attributes::propputrefAttribute;
class CallFrame;
struct _STARTUPINFOA;
struct _STARTUPINFOEXA;
struct tagLASTINPUTINFO;
struct INTERPRETER_OPT_FLAGS2;
struct NDR_PROC_HEADER_EXTS;
struct _ENCLAVE_INIT_INFO_VBS_BASIC;
struct ICallFrameEvents;
struct _QUOTA_LIMITS;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<ITypeLibRegistrationIterator> const >;
struct __vc_attributes::helper_attributes::repeatableAttribute;
class wil::ThreadErrorContext;
struct Windows::Foundation::Collections::is_pointer<Windows::Storage::Search::SortEntry>;
struct _tlgDataDescInit<_tlgIndexSequence<23,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22> >;
struct POWER_ACTION_POLICY;
struct SYSTEM_POWER_LEVEL;
class Microsoft::WRL::Details::MakeAllocator<CDragOperation>;
struct _TIMER_SET_COALESCABLE_TIMER_INFO;
struct HMETAFILE__;
struct tagRemBRUSH;
class AdditionHelper<unsigned long,unsigned long,1>;
struct METAINFO;
struct tagCREATESTRUCTA;
struct tagLOGPALETTE;
struct Windows::Foundation::Diagnostics::ITracingStatusChangedEventArgs;
struct Windows::Foundation::Collections::IIterator<Windows::Storage::Search::SortEntry>;
struct _TRANSACTIONMANAGER_BASIC_INFORMATION;
struct _NCRYPT_KEY_ATTEST_PADDING_INFO;
class CReadOnlyStorage;
class Windows::Foundation::Collections::Internal::NaiveSplitView<HSTRING__ *,IInspectable *,Windows::Foundation::Collections::Internal::DefaultEqualityPredicate<HSTRING__ *>,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<HSTRING__ *>,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<IInspectable *>,Windows::Foundation::Collections::Internal::DefaultHashMapOptions<HSTRING__ *,IInspectable *,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<HSTRING__ *> > >::ChunkView;
class MAP<XSLOCK,MAP_KEY_GUID,NdrTypeInfo *>::iterator;
class wistd::__function::__base<bool __cdecl(void *,unsigned __int64,void *,unsigned __int64,unsigned int)>;
struct _CRYPT_KEY_PROV_PARAM;
struct Windows::Foundation::Collections::is_pointer<Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,Windows::Foundation::Collections::IVector<HSTRING__ *> *> *>;
struct _TOKEN_DEFAULT_DACL;
struct _TOKEN_APPCONTAINER_INFORMATION;
struct Windows::Foundation::Collections::IIterator_impl<Windows::Foundation::Internal::AggregateType<Windows::Storage::StorageFile *,Windows::Storage::IStorageFile *>,1>;
struct tagUPDATELAYEREDWINDOWINFO;
struct _CERT_REVOCATION_STATUS;
struct DESCRIPTOR;
class SafeInt<unsigned long,SafeIntInternal::SafeIntExceptionHandler<SafeIntException> >;
struct _FLAGGED_WORD_BLOB;
class Microsoft::WRL::Details::ComPtrRefBase<Microsoft::WRL::ComPtr<IDataObjectEx> >;
struct wistd::unique_ptr<_TOKEN_DEFAULT_DACL,wil::function_deleter<void * (__cdecl*)(void *),&LocalFree> >::__nat;
class GetCastMethod<unsigned long,unsigned long>;
class CLimitedWritableStorage::SetStateBits::__l2::<lambda_239dc36ff89ef9343f5be4bc17d5a8ef>;
struct _TOKEN_SECURITY_ATTRIBUTE_FQBN_VALUE;
struct Windows::ApplicationModel::Background::IBackgroundTaskYieldable;
struct _STREAM_LAYOUT_ENTRY;
class CWrapperBase<IEnumFORMATETC>::{dtor}::__l2::<lambda_1ff6a892073f82b990ab0d153c3cb3e5>;
struct _CERT_OR_CRL_BLOB;
class CLimitedEnum<IEnumFORMATETC,tagFORMATETC>::Clone::__l2::<lambda_32dfadbef8f2a61c0d809fa552c11f81>;
struct _RTL_BALANCED_LINKS;
struct wistd::unique_ptr<unsigned short,wil::function_deleter<void * (__cdecl*)(void *),&LocalFree> >::__nat;
class CTrackingFileMoniker;
class CBrokeredClipDataObject::EnumFormatEtc::__l8::<lambda_99540f1d7c5160d07270185966a2dced>;
struct Windows::Foundation::Collections::supports_cleanup<Windows::Storage::AccessCache::AccessListEntry>;
struct _FS_BPIO_INPUT;
struct Windows::Foundation::Collections::is_pointer<__int64>;
class CReadOnlyStream::Clone::__l2::<lambda_baecf777eea7d88e008ba381e7d7d0c9>;
struct Windows::Foundation::Collections::IIterable_impl<Windows::Storage::AccessCache::AccessListEntry>;
class CLimitedStreamBase::Seek::__l2::<lambda_b2e3b810243455f1068e53fb5cb0f92b>;
struct Windows::Foundation::Collections::supports_cleanup<double>;
struct Windows::Foundation::Collections::IVectorView_impl<Windows::Foundation::IWwwFormUrlDecoderEntry *,1>;
struct _SERVERSILO_BASIC_INFORMATION;
struct _SSL_HPKP_HEADER_EXTRA_CERT_CHAIN_POLICY_PARA;
struct Windows::Foundation::Collections::IVector_impl<Windows::Foundation::Internal::AggregateType<Windows::System::User *,Windows::System::IUser *>,1>;
struct Windows::Foundation::Collections::IIterator_impl<float,1>;
struct tagEMRSELECTPALETTE;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IEnumFORMATETC> const >;
struct wil::details::close_invoke_helper<1,void * (__cdecl*)(void *),&LocalFree,void *>;
struct _COUNTER_READING;
class wil::details_abi::RecordWnfUsageIndex::__l4::<lambda_8db0ce862824541f40dfb767113f1e28>;
class wistd::__function::__func<<lambda_8db0ce862824541f40dfb767113f1e28>,bool __cdecl(void *,unsigned __int64,void *,unsigned __int64,unsigned int)>;
struct IHttpSecurity;
struct Windows::Foundation::Collections::supports_cleanup<Windows::Foundation::Internal::AggregateType<Windows::Storage::BulkAccess::FileInformation *,Windows::Storage::BulkAccess::IStorageItemInformation *> >;
struct __vc_attributes::nonextensibleAttribute;
struct __vc_attributes::max_isAttribute;
struct Windows::Foundation::Collections::is_pointer<Windows::Foundation::Rect>;
struct _CM_PARTIAL_RESOURCE_DESCRIPTOR;
struct _CM_PARTIAL_RESOURCE_LIST;
struct IEncodingFilterFactory;
struct __vc_attributes::library_blockAttribute;
struct JOBOBJECT_NOTIFICATION_LIMIT_INFORMATION_2;
struct __vc_attributes::atl::synchronizeAttribute;
class CoInitializeIfNecessaryRAII;
class Microsoft::WRL::Details::MakeAllocator<Windows::Foundation::Collections::Internal::HashMap<HSTRING__ *,IInspectable *,Windows::Foundation::Collections::Internal::DefaultHash<HSTRING__ *>,Windows::Foundation::Collections::Internal::DefaultEqualityPredicate<HSTRING__ *>,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<HSTRING__ *>,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<IInspectable *>,Windows::Foundation::Collections::Internal::DefaultHashMapOptions<HSTRING__ *,IInspectable *,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<HSTRING__ *> > >::Iterator>;
struct wistd::unique_ptr<wil::details_abi::ProcessLocalStorageData<wil::details_abi::FeatureStateData>,wil::process_heap_deleter>::__nat;
struct Windows::Foundation::IAsyncOperationCompletedHandler<_GUID>;
class wil::details::<lambda_1ebcff27000e5705e9c69ccc51294205>;
class wistd::__compressed_pair<wil::details_abi::ProcessLocalStorageData<wil::details_abi::FeatureStateData> *,wil::process_heap_deleter>;
class wil::details::<lambda_04ef605d2e5b33bd13b080eb8696f49e>;
struct _PS_SYSTEM_DLL_INIT_BLOCK;
struct Windows::Storage::IStorageFile;
struct _DSSSEED;
struct Microsoft::WRL::Details::VerifyInterfaceHelper<2,IEnumGUID,0,0>;
class ComTrace::LogTokenInfoImp::__l2::<lambda_ffa983ffbf68526ea3a3e363083aba95>;
struct Windows::Foundation::Collections::is_pointer<Windows::UI::WindowId>;
struct _PS_CREATE_INFO;
struct _PROCESS_POWER_THROTTLING_STATE;
struct Windows::Foundation::Collections::supports_cleanup<Windows::UI::WindowId>;
struct ITypeLibRegistrationReader;
struct _MENU_EVENT_RECORD;
class XWinRT::detail::LockHolder<XWinRT::ComLock,XWinRT::detail::AcquireRead>;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<Windows::Foundation::Collections::Internal::NaiveSplitView<HSTRING__ *,IInspectable *,Windows::Foundation::Collections::Internal::DefaultEqualityPredicate<HSTRING__ *>,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<HSTRING__ *>,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<IInspectable *>,Windows::Foundation::Collections::Internal::DefaultHashMapOptions<HSTRING__ *,IInspectable *,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<HSTRING__ *> > > > >;
class Windows::ApplicationModel::DataTransfer::DataPackage;
struct Windows::Foundation::Internal::AggregateType<Windows::ApplicationModel::DataTransfer::DataPackage *,Windows::ApplicationModel::DataTransfer::IDataPackage *>;
struct Windows::Foundation::IAsyncOperationCompletedHandler<IInspectable *>;
struct Windows::Foundation::ITypedEventHandler<Windows::ApplicationModel::DataTransfer::DataPackage *,IInspectable *>;
struct wistd::__compressed_pair_elem<wistd::default_delete<_GUID [0]>,1,1>;
struct _SE_PACKAGE_CAPABILITY_INFO;
class MultiplicationMethod<unsigned long,unsigned __int64>;
struct Windows::Foundation::ITypedEventHandler_impl<Windows::Foundation::Internal::AggregateType<Windows::ApplicationModel::DataTransfer::DataPackage *,Windows::ApplicationModel::DataTransfer::IDataPackage *>,IInspectable *>;
struct _RTL_TRACE_BLOCK;
struct wistd::__unique_ptr_deleter_sfinae<wistd::default_delete<_GUID [0]> >;
class wil::details::EnabledStateManager::EnsureSubscribedToFeatureConfigurationChangesImpl::__l5::<lambda_fee8cea507d2413a58be13acfb66740a>;
struct _CSV_QUERY_MDS_PATH;
struct Windows::Foundation::IReferenceArray_impl<int>;
struct Windows::Foundation::Collections::IMap<HSTRING__ *,Windows::Storage::Streams::RandomAccessStreamReference *>;
struct _CERT_CRL_CONTEXT_PAIR;
struct _CERT_POLICY_MAPPINGS_INFO;
struct Windows::Foundation::IAsyncOperationCompletedHandler_impl<Windows::Foundation::Collections::IMap<HSTRING__ *,HSTRING__ *> *>;
struct wistd::unique_ptr<_GUID [0],wistd::default_delete<_GUID [0]> >::_CheckArrayPointerConversion<_GUID *>;
class GetCastMethod<unsigned long,unsigned int>;
struct Windows::Foundation::Collections::IMap_impl<HSTRING__ *,Windows::Foundation::Internal::AggregateType<Windows::Storage::Streams::RandomAccessStreamReference *,Windows::Storage::Streams::IRandomAccessStreamReference *> >;
struct Windows::Foundation::IAsyncOperationProgressHandler_impl<unsigned int,unsigned int>;
struct IActivationPropertiesOut;
struct DVTDINFO;
struct _JOBOBJECT_LIMIT_VIOLATION_INFORMATION_V2;
class ImpersonationStateChecker;
class Windows::ApplicationModel::DataTransfer::ShareCompletedEventArgs;
struct _ICONINFO;
struct Windows::Foundation::Internal::AggregateType<Windows::ApplicationModel::DataTransfer::ShareCompletedEventArgs *,Windows::ApplicationModel::DataTransfer::IShareCompletedEventArgs *>;
struct _COMPATIBILITY_CONTEXT_ELEMENT;
struct _SYSTEM_THREAD_INFORMATION;
struct _SYSTEM_EXTENDED_THREAD_INFORMATION;
struct Windows::Foundation::IReferenceArray<__int64>;
struct Windows::ApplicationModel::DataTransfer::IShareCompletedEventArgs;
class CTCoAllocPolicy;
struct Windows::Foundation::Collections::Internal::SimpleKeyValuePair<HSTRING__ *,IInspectable *,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<HSTRING__ *>,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<IInspectable *>,0>::permission;
struct _KEY_WOW64_FLAGS_INFORMATION;
struct Windows::Foundation::Collections::Internal::HashMapOptions<HSTRING__ *,IInspectable *,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<HSTRING__ *>,0,0,0>;
struct _IMAGE_DELAYLOAD_DESCRIPTOR;
union _RATE_QUOTA_LIMIT;
struct Windows::ApplicationModel::DataTransfer::IShareProvider;
struct _DEVICE_MANAGE_DATA_SET_ATTRIBUTES_OUTPUT;
struct _RemotableHandle;
struct Windows::Foundation::IReference_impl<double>;
struct Windows::ApplicationModel::DataTransfer::IShareTargetInfo;
struct _IMAGEINFO;
struct _QUOTA_LIMITS_EX;
struct _IMAGELIST;
class exception;
struct Windows::Foundation::Collections::Internal::NoVersionTag;
struct _RTL_VERIFIER_HEAP_TABLE;
struct tagTVITEMEXW;
struct _FILE_PIPE_LOCAL_INFORMATION;
struct Windows::Foundation::Collections::is_pointer<Windows::ApplicationModel::DataTransfer::IClipboardHistoryItem *>;
struct _NETRESOURCEA;
struct Windows::Foundation::Collections::is_foundation_struct<Windows::ApplicationModel::DataTransfer::IClipboardHistoryItem *>;
struct _SYSTEM_PROCESSOR_PERFORMANCE_INFORMATION_EX;
struct _THREAD_BASIC_INFORMATION;
struct Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<bool> *>;
class Windows::ApplicationModel::DataTransfer::ClipboardHistoryItem;
struct _FILE_BOTH_DIR_INFORMATION;
struct Windows::Foundation::Internal::AggregateType<Windows::ApplicationModel::DataTransfer::ClipboardHistoryItem *,Windows::ApplicationModel::DataTransfer::IClipboardHistoryItem *>;
class CLimitedEnum<IEnumSTATSTG,tagSTATSTG>::Reset::__l2::<lambda_442dbdd4e627d94aee8ed7535ac6295a>;
struct _SYSTEM_SECURITY_MODEL_INFORMATION;
struct Windows::Foundation::Collections::IIterable_impl<Windows::Foundation::Internal::AggregateType<Windows::ApplicationModel::DataTransfer::ClipboardHistoryItem *,Windows::ApplicationModel::DataTransfer::IClipboardHistoryItem *> >;
struct _SYSTEM_ISOLATED_USER_MODE_INFORMATION;
class CStabilize;
class CSafeRefCount;
struct _BOOT_ENTROPY_SOURCE_NT_RESULT;
struct Windows::Foundation::Collections::Internal::NaiveSplitView<HSTRING__ *,IInspectable *,Windows::Foundation::Collections::Internal::DefaultEqualityPredicate<HSTRING__ *>,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<HSTRING__ *>,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<IInspectable *>,Windows::Foundation::Collections::Internal::DefaultHashMapOptions<HSTRING__ *,IInspectable *,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<HSTRING__ *> > >::permission;
struct localeinfo_struct;
struct _VIRTUALIZATION_INSTANCE_INFO_INPUT_EX;
struct Windows::Foundation::Collections::IIterable<Windows::ApplicationModel::DataTransfer::ClipboardHistoryItem *>;
struct Windows::Foundation::IAsyncOperationWithProgressCompletedHandler<unsigned __int64,unsigned __int64>;
struct Windows::Foundation::Collections::IVectorView<Windows::ApplicationModel::DataTransfer::ClipboardHistoryItem *>;
struct _SYSTEM_ALARM_OBJECT_ACE;
class CLimitedWritableStorage::EnumElements::__l2::<lambda_447c46b66cbb21333d1664f5793f81f3>;
struct Windows::Foundation::IAsyncOperationWithProgressCompletedHandler<int,int>;
struct _IMAGE_SEPARATE_DEBUG_HEADER;
struct Windows::Foundation::IAsyncOperationCompletedHandler_impl<Windows::Foundation::Internal::AggregateType<Windows::ApplicationModel::DataTransfer::ClipboardHistoryItemsResult *,Windows::ApplicationModel::DataTransfer::IClipboardHistoryItemsResult *> >;
struct _TP_TASK;
struct _DELAYLOAD_PROC_DESCRIPTOR;
struct _DELAYLOAD_INFO;
struct Windows::Foundation::IReference_impl<float>;
struct _TP_DIRECT;
struct Windows::Foundation::IReference_impl<Windows::Foundation::TimeSpan>;
struct Windows::Foundation::Collections::Internal::detail::BaseHashValidator<HSTRING__ *>;
struct Windows::Foundation::IAsyncOperation_impl<Windows::Foundation::Internal::AggregateType<Windows::ApplicationModel::DataTransfer::ClipboardHistoryItemsResult *,Windows::ApplicationModel::DataTransfer::IClipboardHistoryItemsResult *> >;
struct _IMAGE_ALPHA64_RUNTIME_FUNCTION_ENTRY;
struct Windows::Foundation::IReferenceArray<Windows::Foundation::Rect>;
struct Windows::ApplicationModel::DataTransfer::IClipboardHistoryItemsResult;
class AdHocInterceptorForwarders<ISearchProtocol,ISearchProtocol2>::CloseAccessor::__l2::<lambda_202ebde2c4736aa82d78f43a76d480cf>;
struct Windows::Foundation::IReferenceArray<float>;
struct _IMAGE_THUNK_DATA64;
struct _MEMORY_PARTITION_CONFIGURATION_INFORMATION;
struct Windows::Foundation::Internal::AggregateType<Windows::ApplicationModel::DataTransfer::ClipboardHistoryChangedEventArgs *,Windows::ApplicationModel::DataTransfer::IClipboardHistoryChangedEventArgs *>;
struct tagLOGBRUSH32;
struct tagEMRCREATEBRUSHINDIRECT;
struct Windows::Foundation::IEventHandler_impl<Windows::Foundation::Internal::AggregateType<Windows::ApplicationModel::DataTransfer::ClipboardHistoryChangedEventArgs *,Windows::ApplicationModel::DataTransfer::IClipboardHistoryChangedEventArgs *> >;
struct UDATE;
struct Windows::Foundation::Collections::Internal::HashMap<HSTRING__ *,IInspectable *,Windows::Foundation::Collections::Internal::DefaultHash<HSTRING__ *>,Windows::Foundation::Collections::Internal::DefaultEqualityPredicate<HSTRING__ *>,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<HSTRING__ *>,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<IInspectable *>,Windows::Foundation::Collections::Internal::DefaultHashMapOptions<HSTRING__ *,IInspectable *,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<HSTRING__ *> > >::KeyTraits;
struct _JOBOBJECT_MEMORY_USAGE_INFORMATION;
struct Windows::ApplicationModel::DataTransfer::IClipboardHistoryChangedEventArgs;
struct Windows::Foundation::IReferenceArray<unsigned char>;
struct _IMAGE_BOUND_FORWARDER_REF;
struct ICheckCalledServer;
struct Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorView<bool> *>;
struct Windows::Foundation::Collections::MapChangedEventHandler_impl<HSTRING__ *,Windows::Foundation::Internal::AggregateType<Windows::Storage::Streams::RandomAccessStreamReference *,Windows::Storage::Streams::IRandomAccessStreamReference *> >;
struct _cpinfo;
struct Windows::Foundation::Collections::Internal::HashMap<HSTRING__ *,IInspectable *,Windows::Foundation::Collections::Internal::DefaultHash<HSTRING__ *>,Windows::Foundation::Collections::Internal::DefaultEqualityPredicate<HSTRING__ *>,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<HSTRING__ *>,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<IInspectable *>,Windows::Foundation::Collections::Internal::DefaultHashMapOptions<HSTRING__ *,IInspectable *,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<HSTRING__ *> > >::permission;
struct IWeakReferenceSource;
struct val_context;
struct _CERT_POLICY95_QUALIFIER1;
struct IImageList;
struct SimpleQIHelper<CAggregatable<AdHocInterceptor<IPersistPropertyBag>,InterfaceList<AdHocInterceptorForwarders<IPersistPropertyBag,IPersistPropertyBag>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> >,InterfaceList<> >,InterfaceList<Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> > >;
struct Windows::Foundation::Collections::IObservableMap_impl<HSTRING__ *,Windows::Foundation::Internal::AggregateType<Windows::Storage::Streams::RandomAccessStreamReference *,Windows::Storage::Streams::IRandomAccessStreamReference *> >;
struct Windows::Foundation::IReference<int>;
struct _STORAGE_RESERVE_AREA_DEFINITION;
struct Windows::Foundation::Collections::IObservableMap<HSTRING__ *,Windows::Storage::Streams::RandomAccessStreamReference *>;
struct _RTL_PROCESS_VERIFIER_OPTIONS;
class RunSyncOnMTAThread::__l2::<lambda_38ef1b70e7c7bbb6bcbf325f13bce3ad>;
struct _SYSTEM_HANDLE_TABLE_ENTRY_INFO;
struct _SYSTEM_HANDLE_INFORMATION;
class CClipDataObject::CacheDataPointer::__l54::<lambda_27a1cab33e266522ee12881589f1a48d>;
struct _CMSG_CTRL_KEY_TRANS_DECRYPT_PARA;
struct _RESOLVED_USERNAME_INFO;
struct _RESOLVED_USERNAME_LIST;
struct _CONSOLE_FONT_INFO;
struct _PLUGPLAY_CONTROL_CONFLICT_STRINGS;
struct ITaskAdvise;
struct Windows::Foundation::Collections::supports_cleanup<Windows::Storage::Streams::IRandomAccessStream *>;
struct _ALPC_DATA_VIEW_ATTR;
struct Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVector<unsigned int> *>;
struct _SYSTEM_BOOT_LOGO_INFORMATION;
class wil::details::<lambda_03b8815c4721609e5712acf28470b934>;
struct Windows::Foundation::Collections::IIterator<Windows::Storage::Streams::IRandomAccessStream *>;
struct _EFI_DRIVER_ENTRY;
struct Windows::Foundation::IAsyncActionProgressHandler<unsigned __int64>;
struct _MANAGE_HOT_PATCH_APPLY_IMAGE_PATCH;
struct _EFI_DRIVER_ENTRY_LIST;
class XWinRT::CDefaultElementTraits<HSTRING__ *>;
struct IAsyncRpcChannelBuffer;
struct Windows::Foundation::Collections::IIterable<Windows::Storage::Streams::IRandomAccessStream *>;
struct _CRYPT_PROVIDER_REF;
struct Windows::Foundation::IAsyncOperation<Windows::Foundation::TimeSpan>;
struct tagPOINTER_TOUCH_INFO;
struct Windows::Foundation::Collections::is_foundation_struct<Windows::Storage::Streams::IRandomAccessStreamReference *>;
struct Windows::Foundation::Collections::IIterator<Windows::Storage::Streams::IRandomAccessStreamReference *>;
struct Windows::Foundation::IReference<_GUID>;
struct IZoneIdentifier;
struct Windows::Foundation::Collections::IIterable_impl<Windows::Storage::Streams::IRandomAccessStreamReference *>;
class Microsoft::WRL::Details::ComPtrRefBase<Microsoft::WRL::ComPtr<IOSTaskCompletion> >;
struct _RPC_CLIENT_INTERFACE;
struct _CACHE_DESCRIPTOR;
struct _SYSTEM_LOGICAL_PROCESSOR_INFORMATION;
struct Windows::Foundation::Collections::IVectorView<Windows::Storage::Streams::IRandomAccessStream *>;
struct Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IMap<HSTRING__ *,IInspectable *> *>;
struct _REARRANGE_FILE_DATA32;
struct Windows::Foundation::Collections::IVector<Windows::Storage::Streams::IRandomAccessStream *>;
struct _SHCREATEPROCESSINFOW;
struct Windows::Foundation::Collections::IVectorView<Windows::Storage::Streams::IRandomAccessStreamReference *>;
struct _SYSTEM_WATCHDOG_TIMER_INFORMATION;
struct XWinRT::StorageTempTraits<IInspectable *,IInspectable *,IInspectable *,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<IInspectable *> >;
struct tagDATAELEMENT;
struct XWinRT::StorageTempTraits<IInspectable *,IInspectable *,IInspectable *,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<IInspectable *> >::type;
struct tagOBJREFDATA;
struct _PO_WAKE_SOURCE_INFO;
struct XWinRT::SerializingLockPolicy;
struct Windows::Foundation::Collections::IVector<Windows::ApplicationModel::DataTransfer::ClipboardHistoryItem *>;
struct Windows::Foundation::IAsyncOperationCompletedHandler_impl<unsigned int>;
struct tagWIN16BITMAP;
struct _tagpropertykey;
struct tagEXTLOGFONTW;
struct tagEMREXTCREATEFONTINDIRECTW;
struct Windows::Foundation::Collections::is_pointer<Windows::ApplicationModel::Internal::DataTransfer::IClipboardHistoryItemInternal *>;
struct XWinRT::StringEquals;
struct Windows::Foundation::Collections::is_foundation_struct<Windows::ApplicationModel::Internal::DataTransfer::IClipboardHistoryItemInternal *>;
struct Windows::Foundation::IReferenceArray<int>;
struct XWinRT::StringHash;
struct _RTL_IMAGE_MITIGATION_IMAGE_LOAD_POLICY;
struct Windows::Foundation::Collections::supports_cleanup<Windows::Foundation::Internal::AggregateType<Windows::ApplicationModel::Internal::DataTransfer::ClipboardHistoryItemInternal *,Windows::ApplicationModel::Internal::DataTransfer::IClipboardHistoryItemInternal *> >;
struct wistd::__libcpp_is_integral<char32_t>;
struct IFunctionInstance;
struct wistd::__libcpp_is_integral<unsigned int>;
class Windows::ApplicationModel::Internal::DataTransfer::ClipboardHistoryItemInternal;
struct Windows::Foundation::Internal::AggregateType<Windows::ApplicationModel::Internal::DataTransfer::ClipboardHistoryItemInternal *,Windows::ApplicationModel::Internal::DataTransfer::IClipboardHistoryItemInternal *>;
struct IXMLHttpRequest;
struct _SD_CHANGE_MACHINE_SID_OUTPUT;
struct tagEMRTEXT;
struct XWinRT::StringLifetimeTraits;
struct Windows::Foundation::Collections::IIterable_impl<Windows::Foundation::Internal::AggregateType<Windows::ApplicationModel::Internal::DataTransfer::ClipboardHistoryItemInternal *,Windows::ApplicationModel::Internal::DataTransfer::IClipboardHistoryItemInternal *> >;
struct Windows::Foundation::Collections::IIterable<Windows::ApplicationModel::Internal::DataTransfer::ClipboardHistoryItemInternal *>;
struct _FILE_PIPE_ASSIGN_EVENT_BUFFER;
struct Windows::Foundation::IAsyncOperationProgressHandler<unsigned __int64,unsigned __int64>;
struct _TOKEN_DEVICE_CLAIMS;
struct IWinInetCacheHints;
class XWinRT::StaReentrancyLock;
struct _CM_ROM_BLOCK;
struct _SYSTEM_CODEINTEGRITYVERIFICATION_INFORMATION;
struct Windows::Foundation::IAsyncOperation_impl<unsigned int>;
class XWinRT::detail::AtomicUpdater<0>;
struct Windows::Foundation::IAsyncOperationCompletedHandler_impl<Windows::Foundation::Collections::IVectorView<Windows::ApplicationModel::Internal::DataTransfer::ClipboardHistoryItemInternal *> *>;
class XWinRT::detail::StorageReference<HSTRING__ *,HSTRING__ *,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<HSTRING__ *> >;
struct _SYSTEM_PREFETCH_OPTIONS;
struct _KEY_BASIC_INFORMATION;
class XWinRT::detail::LockHolder<XWinRT::ComLock,XWinRT::detail::TryAcquireWrite>;
struct _IMAGE_THUNK_DATA32;
struct tagEMRSETTEXTCOLOR;
struct IShellItem2;
struct _PROCESS_ASSIGN_CPU_PARTITION_INFO;
struct Windows::Foundation::IAsyncActionWithProgress<unsigned int>;
struct _PROCESS_FAULT_INFORMATION;
struct _QUERY_CACHED_RUNS_RUN;
struct tagEMRPOLYDRAW;
struct Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::ApplicationModel::Internal::DataTransfer::ClipboardHistoryItemInternal *> *>;
struct _IMAGE_ARM_RUNTIME_FUNCTION_ENTRY;
struct XWinRT::detail::TryAcquireWrite;
struct _PATCH_MAIN_CALLOUT_PARAMS;
struct XWinRT::detail::ReentrancyGuard<0>;
union _GDI_NONREMOTE::__MIDL_IWinTypes_0002;
struct Windows::Foundation::ITypedEventHandler<Windows::ApplicationModel::Internal::DataTransfer::ClipboardSignalProducer *,Windows::ApplicationModel::Internal::DataTransfer::ClipboardSignalProducedEventArgs *>;
struct Windows::Foundation::IReferenceArray<unsigned __int64>;
struct IClassClassicInfo3;
class XWinRT::detail::LockHolder<XWinRT::StaReentrancyLock,XWinRT::detail::TryAcquireRead>;
class Map<MAP_KEY_GUID,NdrTypeInfo *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>;
struct _REPAIR_COPIES_OUTPUT;
struct _SERVICE_TRIGGER_SPECIFIC_DATA_ITEM;
class Windows::ApplicationModel::Internal::DataTransfer::ClipboardSignalProducer;
struct Windows::Foundation::IAsyncOperationWithProgressCompletedHandler<unsigned int,unsigned int>;
struct Windows::Foundation::Internal::AggregateType<Windows::ApplicationModel::Internal::DataTransfer::ClipboardSignalProducer *,Windows::ApplicationModel::Internal::DataTransfer::IClipboardSignalProducer *>;
struct tagCUSTDATA;
struct Windows::Foundation::ITypedEventHandler_impl<Windows::Foundation::Internal::AggregateType<Windows::ApplicationModel::Internal::DataTransfer::ClipboardSignalProducer *,Windows::ApplicationModel::Internal::DataTransfer::IClipboardSignalProducer *>,Windows::Foundation::Internal::AggregateType<Windows::ApplicationModel::Internal::DataTransfer::ClipboardSignalProducedEventArgs *,Windows::ApplicationModel::Internal::DataTransfer::IClipboardSignalProducedEventArgs *> >;
struct _KLDR_DATA_TABLE_ENTRY64;
struct IProcessInitControl;
class wil::com_ptr_t<ITypeInfo,wil::err_returncode_policy>;
struct XWinRT::detail::AcquireWrite;
struct _COMPONENT_FILTER;
struct XWinRT::detail::AcquireRead;
struct tagPOINTER_DEVICE_CURSOR_INFO;
struct Windows::Foundation::IPropertyValue;
class XWinRT::detail::AbiReference<HSTRING__ *,HSTRING__ *,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<HSTRING__ *> >;
class XWinRT::detail::LockHolder<XWinRT::StaReentrancyLock,XWinRT::detail::AcquireRead>;
struct _SE_AUDIT_INFO;
struct Windows::ApplicationModel::Internal::DataTransfer::IClipboardOperationAppInfo;
struct Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IMap<HSTRING__ *,HSTRING__ *> *>;
struct _BCRYPT_ECC_CURVE_NAMES;
struct _CRYPT_TIME_STAMP_REQUEST_INFO;
struct CONFLICT_ITEM_METADATA;
class CBrokeredClipDataObject::SetData::__l23::<lambda_eb30775d835ce1aa7514baf3cb9520bf>;
class CLimitedWritableStorage::MoveElementTo::__l11::<lambda_f3ee3880bbfa881d18ec7e87344dd5a6>;
class XWinRT::detail::LockHolder<XWinRT::SRWLock,XWinRT::detail::AcquireWrite>;
struct _TXFS_LIST_TRANSACTIONS_ENTRY;
struct _THREAD_TLS_INFORMATION;
struct Windows::Foundation::ITypedEventHandler_impl<Windows::Foundation::Internal::AggregateType<Windows::ApplicationModel::Internal::DataTransfer::ClipboardSignalProducer *,Windows::ApplicationModel::Internal::DataTransfer::IClipboardSignalProducer *>,IInspectable *>;
struct tagRECT16;
struct tagEMRSETDIBITSTODEVICE;
struct _CLILIST;
struct wistd::enable_if<1,void *>;
struct Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVector<HSTRING__ *> *>;
struct _HOSTNAMES;
struct _FILE_NAME_INFORMATION;
struct XWinRT::detail::TryAcquireRead;
struct _FILE_ID_GLOBAL_TX_DIR_INFORMATION;
class XWinRT::detail::LockHolder<XWinRT::SRWLock,XWinRT::detail::AcquireRead>;
struct _MM_ETW_PAGE_INFO_EX;
struct _FILE_INTERNAL_INFORMATION;
struct _FILE_ACCESS_INFORMATION;
struct _FILE_POSITION_INFORMATION;
struct _FILE_ALL_INFORMATION;
struct Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorView<HSTRING__ *> *>;
struct wistd::__lazy_or_impl<0>;
struct _MM_ETW_WORKING_SET_PFN_RUNDOWN;
class XWinRT::detail::LockHolder<XWinRT::ComLock,XWinRT::detail::AcquireWrite>;
struct _ENUM_FLAG_SIZED_INTEGER<enum _NT_WRITE_FLAGS>;
struct _PORT_DATA_INFORMATION;
struct Windows::Foundation::Collections::IVector<Windows::ApplicationModel::Internal::DataTransfer::ClipboardHistoryItemInternal *>;
class CLimitedEnum<IEnumSTATSTG,tagSTATSTG>::Next::__l2::<lambda_5c690cab17f385c97bf7142c1739781b>;
struct _RTL_FEATURE_CONFIGURATION;
struct XWinRT::detail::ReentrancyGuard<1>;
struct IDataObjectEx;
struct _CHAR_INFO;
class wil::unique_any_t<wil::details::unique_storage<wil::details::resource_policy<unsigned short *,void (__cdecl*)(void *),&MIDL_user_free,wistd::integral_constant<unsigned __int64,0>,unsigned short *,unsigned short *,0,std::nullptr_t> > >;
union _TIMELINE_BITMAP;
struct _PROCESS_ENERGY_VALUES_EXTENSION;
struct _PROCESS_EXTENDED_ENERGY_VALUES;
class AdHocInterceptorForwarders<IOleInPlaceObject,IOleInPlaceObject>::ReactivateAndUndo::__l2::<lambda_8cabb7dbc03479911dce050d042462ba>;
class XWinRT::detail::PresentationReference<HSTRING__ *,HSTRING__ *,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<HSTRING__ *> >;
struct IOleCache2;
class CRefExportCount;
struct _ImageArchitectureHeader;
class XWinRT::detail::LockHolder<XWinRT::ComLock,XWinRT::detail::TryAcquireRead>;
class AdHocInterceptorForwarders<ISearchProtocol,ISearchProtocol>::ShutDown::__l2::<lambda_df48ef4dbe2e03a3af657bac67c3638a>;
struct wil_details_RecordCachedUsage::__l2::Change;
struct wil::details::close_invoke_helper<1,void (__cdecl*)(void *),&PrivMemFree,unsigned short *>;
struct _IMAGE_TLS_DIRECTORY32;
struct wil::details::resource_policy<unsigned short *,void (__cdecl*)(void *),&MIDL_user_free,wistd::integral_constant<unsigned __int64,0>,unsigned short *,unsigned short *,0,std::nullptr_t>;
class CRefStabilize;
struct wil::details::close_invoke_helper<1,void (__cdecl*)(void *),&MIDL_user_free,unsigned short *>;
struct _LDR_FAILURE_DATA;
struct Windows::Foundation::IAsyncOperation_impl<Windows::Foundation::Collections::IVector<Windows::ApplicationModel::Internal::DataTransfer::ClipboardHistoryItemInternal *> *>;
struct wil::details::resource_policy<unsigned short *,void (__cdecl*)(void *),&PrivMemFree,wistd::integral_constant<unsigned __int64,0>,unsigned short *,unsigned short *,0,std::nullptr_t>;
struct AsyncIPipeByte;
struct _NLSTABLEINFO;
struct _PLUGPLAY_CONTROL_CONFLICT_LIST;
struct Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVector<Windows::ApplicationModel::Internal::DataTransfer::ClipboardHistoryItemInternal *> *>;
struct _GET_FILTER_FILE_IDENTIFIER_OUTPUT;
struct _IMAGE_VXD_HEADER;
class wil::details::weak_query_policy;
class DragDropLogging::Instance::__l2::<lambda_de72991bb9618b65cb2927d0cc7a4ae8>;
struct _GS_HANDLER_DATA;
class wil::details::<lambda_cd2002921047d4d26e2a55727e023aae>;
struct wil_FeatureTestState;
struct tagACTCTXW;
class XWinRT::CDefaultHashTraits<HSTRING__ *>;
struct XWinRT::InterfaceLifetimeTraits;
class XWinRT::CDefaultCompareTraits<HSTRING__ *>;
struct _HIBERFILE_BUCKET;
struct _FILE_QUERY_METADATA_OPTIMIZATION_OUTPUT;
class wil::details::<lambda_161ef7638cd2cc94aeb4fe05f7a304b3>;
struct FEATURE_ERROR;
struct wil::details::string_allocator<wil::unique_any_t<wil::details::unique_storage<wil::details::resource_policy<unsigned short *,void (__cdecl*)(void *),&PrivMemFree,wistd::integral_constant<unsigned __int64,0>,unsigned short *,unsigned short *,0,std::nullptr_t> > > >;
struct _STREAMS_QUERY_ID_OUTPUT_BUFFER;
struct __WIL__WNF_TYPE_ID;
union _RTL_ELEVATION_FLAGS;
struct _wil_details_UsageSubscriptionData;
struct _OFLONGSTRUCTA;
struct _OFLONGSTRUCTW;
class wil::details::unique_storage<wil::details::resource_policy<unsigned short *,void (__cdecl*)(void *),&MIDL_user_free,wistd::integral_constant<unsigned __int64,0>,unsigned short *,unsigned short *,0,std::nullptr_t> >;
struct wistd::less<void>;
struct FEATURE_STATE_CHANGE_SUBSCRIPTION__;
struct wistd::__struct_double;
struct _TXFS_READ_BACKUP_INFORMATION_OUT;
struct wil::details::string_allocator<wil::unique_any_t<wil::details::unique_storage<wil::details::resource_policy<unsigned short *,void (__cdecl*)(void *),&MIDL_user_free,wistd::integral_constant<unsigned __int64,0>,unsigned short *,unsigned short *,0,std::nullptr_t> > > >;
struct wistd::__libcpp_is_floating_point<float>;
class CPictioFileStream;
struct _PROCESS_UPTIME_INFORMATION;
class CGenObject;
class CLimitedWritableStorage::DestroyElement::__l2::<lambda_7d1fe11c787a4af78d8dd42692fd1f09>;
struct wistd::__type_list<wistd::__align_type<unsigned char>,wistd::__type_list<wistd::__align_type<unsigned short>,wistd::__type_list<wistd::__align_type<unsigned int>,wistd::__type_list<wistd::__align_type<unsigned long>,wistd::__type_list<wistd::__align_type<unsigned __int64>,wistd::__type_list<wistd::__align_type<double>,wistd::__type_list<wistd::__align_type<long double>,wistd::__type_list<wistd::__align_type<wistd::__struct_double>,wistd::__type_list<wistd::__align_type<wistd::__struct_double4>,wistd::__type_list<wistd::__align_type<int *>,wistd::__nat> > > > > > > > > >;
struct wil_details_RecordUsageResult;
struct _PLUGPLAY_CONTROL_QUERY_AND_REMOVE_DATA;
class wil::details::<lambda_3a34d3073f23e15fe303eff655bcc4f6>;
struct _MEMORY_PARTITION_DEDICATED_MEMORY_INFORMATION;
class CContainer_PolicySysFree;
struct wil_details_FeatureDescriptor;
struct wistd::__type_list<unsigned short,wistd::__type_list<unsigned int,wistd::__type_list<unsigned long,wistd::__type_list<unsigned __int64,wistd::__nat> > > >;
union wil_details_FeatureStateCache;
struct _FSCTL_SET_INTEGRITY_INFORMATION_BUFFER;
struct wistd::__make_signed<unsigned long,1>;
struct wistd::__type_list<short,wistd::__type_list<int,wistd::__type_list<long,wistd::__type_list<__int64,wistd::__nat> > > >;
struct wil_FeatureState;
struct __vcrt_va_list_is_reference<_UNICODE_STRING *>;
struct wistd::__libcpp_is_function_imp::__dummy_type;
struct __vcrt_va_list_is_reference<unsigned short * *>;
struct wistd::__libcpp_is_integral<bool>;
struct wil_details_FeatureTestState;
struct wistd::__libcpp_is_integral<wchar_t>;
struct _PROCESS_COMMIT_RELEASE_INFORMATION;
struct __WIL_RTL_SRWLOCK;
class CTContainer_PolicyCoTaskMem;
class CTContainer_PolicyLocalMem;
struct wistd::__libcpp_is_integral<int>;
class CTContainer_PolicyHeapMem;
class wil::details::StagingFailureInformation;
struct _RTL_GENERIC_TABLE;
class CAutoHandle_Policy<void *>;
struct wil::details_abi::buffer_range;
class CLimitedWritableStream::CopyTo::__l11::<lambda_85adfdbc59dc2fecc6c73766ac5726d0>;
struct wistd::__make_unsigned<bool,1>;
class CAutoHandle_Policy<HINSTANCE__ *>;
struct MarshallingChannel;
class CAutoHandle_Policy<HKEY__ *>;
class CAutoHandle_Policy<HACCEL__ *>;
struct _RPC_BINDING_HANDLE_TEMPLATE_V1_W;
class CAutoHandle_Policy<HWND__ *>;
struct LEGACY_FRAME;
class CAutoHandle_Policy<HDESK__ *>;
class CAutoHandle_Policy<HICON__ *>;
struct _IMAGE_FUNCTION_ENTRY;
class CMarshalImplPStream;
class CBaseMoniker;
struct tagABORTPATH;
struct __vc_attributes::restrictedAttribute;
class CAutoHandle_Policy<HWINSTA__ *>;
struct _FILE_NAMES_INFORMATION;
class wil::details_abi::heap_vector_iterator<wil_details_FeatureUsageSRUM>;
class CAutoHandle_Policy<HMENU__ *>;
struct HTOUCHINPUT__;
struct wil_details_FeatureUsageSRUM;
struct DISPATCH_CLIENT_FRAME;
class CTSmartPtr<unsigned short,CTContainer_PolicyCoTaskMem>;
struct _FILE_FS_METADATA_SIZE_INFORMATION;
struct _FILE_PIPE_REMOTE_INFORMATION;
class CAutoHandle_Policy<HBRUSH__ *>;
class wil::details::pointer_range<wil_details_FeatureUsageSRUM *>;
class Microsoft::WRL::Details::MakeAllocator<CClipboardBroker::CClipboardBrokerMTAHelper>;
struct Microsoft::WRL::Details::VerifyInterfaceHelper<2,IClipboardBrokerInternal,0,0>;
class CTSmartObj<unsigned short *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> >;
struct _FILE_QUERY_STORAGE_RESERVE_ID_INFORMATION_EX;
class CItemMoniker;
struct tagINPUT_TRANSFORM;
struct wil::StagingControl;
struct wil::StagingControlVariant;
class Interceptor::TryCreateFromTypeInfo::__l2::<lambda_99f6cd62eb16379982dc9ba875c44251>;
class wil::details::lambda_call<<lambda_99f6cd62eb16379982dc9ba875c44251> >;
struct _SD_GLOBAL_CHANGE_OUTPUT;
class CAutoHandle_Policy<HPEN__ *>;
class wistd::__function::__func<<lambda_0c2afb377131ef1ab2244976d5fb45fc>,long __cdecl(unsigned short *,unsigned __int64,unsigned __int64 *)>;
struct wil::details::close_invoke_helper<1,void (__cdecl*)(void *),&wil::details::RevertImpersonateToken,void *>;
struct _MULTI_TIME;
class CTSmartObj<unsigned short * *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> >;
struct _ENCLAVE_CREATE_INFO_VBS;
struct _DSA;
struct _DPA;
struct wil::details_abi::UsageIndexProperty;
struct KNOWNFOLDER_DEFINITION;
class CAutoHandle_Policy<HDC__ *>;
struct std::_Invoker_pmf_pointer;
struct __vc_attributes::nonbrowsableAttribute;
class CRPCTimeout;
struct std::less<void>;
class CUnkownOnlyWrapper;
struct _MEMORY_IMAGE_INFORMATION;
class CWrapperBase<IUnknown>;
struct IShellItem;
struct wistd::function<bool __cdecl(void *,unsigned __int64,void *,unsigned __int64,unsigned int)>::__callable_imp<<lambda_b791f461fdcdf6803f8b1ec4cfa018be>,1>;
class CDragDataObject;
class wil::details::<lambda_7423537f294e7787dca37fdc0cb8c286>;
struct wistd::function<bool __cdecl(void *,unsigned __int64,void *,unsigned __int64,unsigned int)>::__callable<<lambda_b791f461fdcdf6803f8b1ec4cfa018be> >;
struct _CM_SERIAL_DEVICE_DATA;
class CCoTaskMemPtr<unsigned char>;
struct _EVENTSFORLOGFILE;
class CExtentList;
class CFileMoniker;
struct _AUTHENTICATION_INFO;
struct IShellLinkW;
struct _PO_SPR_ACTIVE_SESSION_DATA;
struct _SYSTEM_POOL_LIMIT_INFO;
struct _SYSTEM_AUDIT_OBJECT_ACE;
struct wistd::function<bool __cdecl(void *,unsigned __int64,void *,unsigned __int64,unsigned int)>::__callable_imp<<lambda_8db0ce862824541f40dfb767113f1e28>,1>;
struct wistd::function<bool __cdecl(void *,unsigned __int64,void *,unsigned __int64,unsigned int)>::__callable<<lambda_8db0ce862824541f40dfb767113f1e28> >;
struct wil::details_abi::RawUsageIndex::Header;
struct tagOLEVERB;
struct wistd::__function::__maybe_derive_from_unary_function<bool __cdecl(void *,unsigned __int64,void *,unsigned __int64,unsigned int)>;
class wil::com_ptr_t<IOleVerbIterator,wil::err_returncode_policy>;
struct wistd::__function::__maybe_derive_from_binary_function<bool __cdecl(void *,unsigned __int64,void *,unsigned __int64,unsigned int)>;
struct _KERNEL_CET_CONTEXT;
struct tagMDICREATESTRUCTA;
struct _OSVERSIONINFOEX3A;
struct wil::details_abi::SerializedFailure;
class wil::details::pointer_range<__WIL__WNF_STATE_NAME const *>;
struct _RTL_IMAGE_MITIGATION_USER_POINTER_AUTH_POLICY;
struct __vc_attributes::helpstringcontextAttribute;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IStream> const >;
struct IOleVerb;
class wil::details_abi::UsageIndex<enum wil_details_ServiceReportingKind,unsigned int,0>;
class wil::details_abi::UsageIndexBuffer<unsigned int,1>;
struct wil::details_abi::UsageIndexes;
struct _CRYPT_TIMESTAMP_PARA;
class ITrackingMoniker;
struct IElementBehavior;
class wistd::function<bool __cdecl(enum wil_details_ServiceReportingKind,unsigned int,unsigned int)>;
struct _RTL_BARRIER;
struct _UMS_CREATE_THREAD_ATTRIBUTES;
struct __vc_attributes::rangeAttribute;
class CAntiMoniker;
struct _ENUM_FLAG_SIZED_INTEGER<enum _FS_BPIO_INFLAGS>;
struct _RTL_UNLOAD_EVENT_TRACE64;
class wistd::function<bool __cdecl(unsigned int,void *,unsigned __int64,unsigned int)>;
class Microsoft::WRL::Details::ComPtrRefBase<Microsoft::WRL::ComPtr<IStream> >;
struct __vc_attributes::helpcontextAttribute;
class RegistryInsertableCandidate;
class CMapStringToPtr;
struct _devicemodeW;
class CLimitedWritableStream;
class CLimitedStreamBase::UnlockRegion::__l2::<lambda_f9b686faf07558546d2e0b9f147c5283>;
class ReferencedRegistryKey;
class wil::details_abi::heap_vector_iterator<wil::details_abi::SubscriptionList::Subscription>;
struct _SYSTEM_VERIFIER_ISSUE;
struct _SYSTEM_VERIFIER_CANCELLATION_INFORMATION;
struct IAsyncInfo;
struct _SERVICE_NOTIFY_2W;
struct _FILE_FULL_DIR_INFORMATION;
class CBindCtx;
union _RTL_TICK_LOCK;
class CBindCtx::CObjList;
struct _CALL_FRAME;
class wil::details_abi::FeatureStateData;
struct _MEMORY_WORKING_SET_BLOCK;
struct _CMSG_SIGNER_ENCODE_INFO;
struct IMrtResourceManager;
struct IForegroundTransfer;
struct _ENCLAVE_INIT_INFO_SGX;
struct _RTL_HASH_TABLE;
struct IComProgIdIterator;
class CWrapperBase<IStorage>;
struct _ASSEMBLY_STORAGE_MAP_RESOLUTION_CALLBACK_DATA_GET_ROOT;
class CRotHintTable;
struct _RTL_RETPOLINE_BINARY_INFO;
class OleClassInfoInsertableCandidate;
class RegistryConversionClass;
struct wistd::default_delete<wil::details::folder_change_reader_state>;
struct _SERVICE_PRESHUTDOWN_INFO;
class CTmpMkEqBuf;
class Microsoft::WRL::ComPtr<ComClassIterator>;
struct _SERVICE_STATUS;
struct _ENUM_SERVICE_STATUSA;
struct IEnumUnknown;
struct __vc_attributes::atl::support_error_infoAttribute;
class wil::details_abi::ProcessLocalStorageData<wil::details_abi::FeatureStateData>;
class MapEnumToSQMData<enum RpcssSQMFlags>;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IStorage> const >;
struct _FILE_BASIC_INFO;
class wil::details::<lambda_915176d23a9d56f8e3fb39ade8c83749>;
struct std::plus<void>;
struct _CSV_IS_OWNED_BY_CSVFS;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<ComClassIterator> >;
struct _CERT_POLICY_ID;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IStorage> >;
struct utl::hash<bool>;
struct tagWINDOWPLACEMENT;
struct wistd::__compressed_pair_elem<wil::details::folder_change_reader_state *,0,0>;
struct wil::details::resource_policy<void *,void (__cdecl*)(void *),&wil::details::UnregisterWilFeatureConfigurationChange,wistd::integral_constant<unsigned __int64,0>,void *,void *,0,std::nullptr_t>;
struct tagNEWTEXTMETRICA;
struct tagNEWTEXTMETRICEXA;
class Microsoft::WRL::ComPtr<IAsyncInfo>;
struct SAFEARRAY_INTERNAL;
class Microsoft::WRL::ComPtr<IEnumSTATSTG>;
struct __vc_attributes::readonlyAttribute;
struct _REFS_DEALLOCATE_RANGES_INPUT_BUFFER;
struct utl::integral_constant<bool,1>;
struct tagAXISINFOA;
struct tagAXESLISTA;
struct tagENUMTEXTMETRICA;
struct IViewObject2;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IAsyncInfo> const >;
class wistd::unique_ptr<wil::details_abi::ProcessLocalStorageData<wil::details_abi::FeatureStateData>,wil::process_heap_deleter>;
class utl::numeric_limits<bool>;
struct _CFG_CALL_TARGET_INFO;
class utl::_FloatLimits<float,24>;
class utl::numeric_limits<float>;
struct __vc_attributes::helper_attributes::process_earlyAttribute;
class utl::_FloatLimits<double,53>;
struct _RTL_TRACE_DATABASE;
struct _MEMORY_PARTITION_TRANSFER_INFORMATION;
class Microsoft::WRL::ComPtr<RegistryDataFormatIterator>;
struct _NDR_USER_MARSHAL_INFO_LEVEL1;
struct _NDR_USER_MARSHAL_INFO;
struct SSimpleWalker;
class RegistryDataFormatIterator;
struct HAS_INTERFACES;
class utl::_FloatLimits<long double,53>;
class utl::_NumLimitsBase;
struct _MAXVERSIONTESTED_INFO;
class wil::unique_any_t<wil::details::unique_storage<wil::details::resource_policy<FEATURE_STATE_CHANGE_SUBSCRIPTION__ *,void (__cdecl*)(FEATURE_STATE_CHANGE_SUBSCRIPTION__ *),&wil::details::WilApi_UnsubscribeFeatureStateChangeNotification,wistd::integral_constant<unsigned __int64,0>,FEATURE_STATE_CHANGE_SUBSCRIPTION__ *,FEATURE_STATE_CHANGE_SUBSCRIPTION__ *,0,std::nullptr_t> > >;
class utl::numeric_limits<long double>;
struct _ENCLAVE_CREATE_INFO_VBS_BASIC;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<RegistryDataFormatIterator> const >;
class Map<MAP_KEY_GUID,MD_INTERFACE *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>::Assoc;
class utl::vector<unsigned __int64,utl::allocator<unsigned __int64> >;
class CDwordBag;
struct wistd::__compressed_pair_elem<wil::details_abi::ProcessLocalStorageData<wil::details_abi::FeatureStateData> *,0,0>;
struct tagENUMLOGFONTA;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<RegistryDataFormatIterator> >;
class utl::allocator<unsigned __int64>;
struct tagSOUNDSENTRYA;
struct _MEM_ADDRESS_REQUIREMENTS;
struct utl::vector<unsigned __int64,utl::allocator<unsigned __int64> >::_TmpElTy;
struct _LDRP_LOAD_CONTEXT;
class utl::_ArrayIt<unsigned __int64>;
class utl::_ArrayConstIt<unsigned __int64>;
struct _RTL_PROCESS_MODULE_INFORMATION;
struct _RTL_PROCESS_MODULES;
class utl::reverse_iterator<utl::_ArrayConstIt<unsigned __int64> >;
class wil::details_abi::heap_vector<wil::details::EnabledStateManager::CachedFeaturePropertyData>;
class wil::details::EnabledStateManager;
struct _RTL_PROCESS_MODULE_INFORMATION_EX;
struct Microsoft::WRL::Details::RemoveReference<Microsoft::WRL::Wrappers::Mutex &>;
struct wil::details::EnabledStateManager::CachedUsageData;
class AdHocCallFrame<IOleInPlaceObject,<lambda_0d32688c0356eaf1376562cb0fa29181> >;
class CLimitedEnum<IEnumSTATSTG,tagSTATSTG>;
class RunSyncOnMTAThread::__l2::<lambda_fd5f26b17dc0b306889b51c5fa24ff59>;
class Microsoft::WRL::RuntimeClass<Windows::Foundation::IAsyncAction,Microsoft::WRL::AsyncBase<Windows::Foundation::IAsyncActionCompletedHandler,Microsoft::WRL::Details::Nil,1,Microsoft::WRL::AsyncCausalityOptions<&wil::details::SyncAsyncActionName,&GUID_CAUSALITY_WINDOWS_PLATFORM_ID,2> > >;
struct ITypeInfo2;
class CWrapperBase<IEnumSTATSTG>;
class Microsoft::WRL::ComPtr<TypeLibRegistrationEnumerator>;
struct _MANAGE_HOT_PATCH_QUERY_SINGLE_PATCH;
struct _WOW64_DESCRIPTOR_TABLE_ENTRY;
class Microsoft::WRL::ComPtr<ITypeLibRegistrationIterator>;
class TypeLibRegistrationEnumerator;
struct IHttpNegotiate2;
struct ITypeLibCatalogInternal;
class _RTL_CONSTANT_STRING_remove_const_template_class<2>;
struct ITypeLibRegistrationIterator;
struct SimpleQIHelper<CAggregatable<AdHocInterceptor<IPersistPropertyBag>,InterfaceList<AdHocInterceptorForwarders<IPersistPropertyBag,IPersistPropertyBag>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> >,InterfaceList<> >::CInner,InterfaceList<> >;
class CLimitedWritableStorage;
struct tagWINDOWINFO;
class utl::_ContainerBase<unsigned __int64,utl::allocator<unsigned __int64> >;
class utl::_AllocBase<utl::allocator<unsigned __int64>,1>;
struct _NTPSS_MEMORY_BULK_INFORMATION;
struct wil::details::resource_policy<FEATURE_STATE_CHANGE_SUBSCRIPTION__ *,void (__cdecl*)(FEATURE_STATE_CHANGE_SUBSCRIPTION__ *),&wil::details::WilApi_UnsubscribeFeatureStateChangeNotification,wistd::integral_constant<unsigned __int64,0>,FEATURE_STATE_CHANGE_SUBSCRIPTION__ *,FEATURE_STATE_CHANGE_SUBSCRIPTION__ *,0,std::nullptr_t>;
struct _JOURNAL_ABSOLUTE_INFORMATION;
struct _KEY_EVENT_RECORD;
struct _OSVERSIONINFOEX2W;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<TypeLibRegistrationEnumerator> >;
struct _CERT_REQUEST_INFO;
struct utl::allocator_traits<utl::allocator<unsigned __int64> >;
struct _KCONTINUE_ARGUMENT;
class CAutoHandle<void *>;
struct _FS_BPIO_RESULTS;
struct Windows::Foundation::IAsyncActionCompletedHandler;
struct _FSCTL_QUERY_FAT_BPB_BUFFER;
struct USN_RECORD_COMMON_HEADER;
struct USN_RECORD_V4;
struct FormatEntry;
class CTSmartObj<void *,CAutoHandle_Policy<void *> >;
struct SimpleQIHelper<CAggregatable<AdHocInterceptor<IOleInPlaceObject>,InterfaceList<AdHocInterceptorForwarders<IOleInPlaceObject,IOleInPlaceObject>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> >,InterfaceList<> >::CInner,InterfaceList<> >;
struct IXMLDOMComment;
class wil::details::FeatureFunctorHost;
struct _CONNECTDLGSTRUCTW;
struct _ENUM_FLAG_SIZED_INTEGER<enum tagREGCLS>;
class Microsoft::WRL::ComPtr<IEnumFORMATETC>;
union _userHENHMETAFILE::__MIDL_IWinTypes_0006;
struct IDataFilter;
struct _PREFETCH_ALTERNATE_PARAM_INFO;
struct ITypeLibRegistration;
struct tagEMRLINETO;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<ITypeLibRegistration> const >;
struct PPM_WMI_IDLE_STATE;
struct PPM_WMI_IDLE_STATES_EX;
class utl::vector<CROTItem *,utl::allocator<CROTItem *> >;
class CRunningObjectTable;
struct _FLAGGED_BYTE_BLOB;
struct CMPGUID;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IEnumFORMATETC> >;
struct _SYSTEM_ERROR_PORT_TIMEOUTS;
class AdHocInterceptorForwarders<IOleWindow,IOleWindow>;
struct _THREAD_NAME_INFORMATION;
struct Microsoft::WRL::ErrorPropagationPolicyTraits<-1>;
struct _CRYPT_OID_FUNC_ENTRY;
struct wil::details::resource_policy<wil_FeatureTestState *,void (__cdecl*)(wil_FeatureTestState *),&wil_FreeFeatureTestState,wistd::integral_constant<unsigned __int64,0>,wil_FeatureTestState *,wil_FeatureTestState *,0,std::nullptr_t>;
struct _RTL_IMAGE_MITIGATION_DEP_POLICY;
struct wil::details::close_invoke_helper<1,void (__cdecl*)(wil::details::FeatureUsageDurationData *) noexcept,&wil::details::FeatureUsageDurationData::Stop,wil::details::FeatureUsageDurationData *>;
struct _FXSAVE_FORMAT_WX86;
struct utl::vector<CROTItem *,utl::allocator<CROTItem *> >::_TmpElTy;
struct _FILE_ID_EXTD_DIR_INFO;
class utl::_ArrayIt<CROTItem *>;
class utl::_ArrayConstIt<CROTItem *>;
class utl::reverse_iterator<utl::_ArrayIt<CROTItem *> >;
class utl::reverse_iterator<utl::_ArrayConstIt<CROTItem *> >;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<ITypeLibCatalogInternal> const >;
struct _LDR_DDAG_NODE;
struct _TXFS_START_RM_INFORMATION;
struct wil::details::FeatureTraitsBase;
struct _CRT_FLOAT;
struct _ENUM_FLAG_SIZED_INTEGER<enum tagCOWAIT_FLAGS>;
struct _FILE_CASE_SENSITIVE_INFO;
class CWrapperBase<IEnumFORMATETC>;
struct SysInfo;
struct Microsoft::WRL::Details::Dummy;
struct _PS_MEMORY_RESERVE;
struct __WilFeatureTraits_Feature_NWMTest1;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<OleClassInfoConversionClass> const >;
struct _LPC_CLIENT_DIED_MSG;
struct __WilFeatureTraits_Feature_MTestUx13;
struct __WilFeatureTraits_Feature_UxTest12;
class utl::_ContainerBase<CROTItem *,utl::allocator<CROTItem *> >;
struct __WilFeatureTraits_Feature_CDPNearshareEnhancedAdvertisement;
class Microsoft::WRL::RuntimeClass<Microsoft::WRL::RuntimeClassFlags<2>,IEnumUnknown,Microsoft::WRL::FtmBase>;
class utl::_AllocBase<utl::allocator<CROTItem *>,1>;
struct __WilFeatureTraits_Feature_CDPNearShareUDPDiscoveryFixup;
union _ASSEMBLY_VERSION;
struct wil::details::RequiredFeatures<wil::Feature<__WilFeatureTraits_Feature_NWMTest1> >;
class Microsoft::WRL::RuntimeClass<Microsoft::WRL::RuntimeClassFlags<2>,IInsertableCandidateIterator>;
struct _TRANSACTION_NOTIFICATION_MARSHAL_ARGUMENT;
struct __WilFeatureTraits_Feature_CDPNearshareUDPRestriction;
class wil::details::<lambda_b5119c6713808ce967e206dec719b624>;
struct __vc_attributes::caseAttribute;
struct __WilFeatureTraits_Feature_ActivityFeedClientBackupAndRestore;
struct utl::allocator_traits<utl::allocator<CROTItem *> >;
struct _REQUEST_RAW_ENCRYPTED_DATA;
struct __WilFeatureTraits_Feature_CDPCloudClipboardMonitor;
class CMonikerBag;
struct __vc_attributes::length_isAttribute;
struct __WilFeatureTraits_Feature_ShowShareUIOnContainerOS;
struct tagEMRMASKBLT;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<ReferencedRegistryKey> const >;
class CMonikerPtrBuf;
struct _AMD64_CONTEXT;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<ReferencedRegistryKey> >;
class RunSyncOnMTAThread::__l2::<lambda_5d2c158ec0a9190eae11e19329324fcf>;
struct ClpboardOwnerState;
class CRotMonikerEnum;
struct __vc_attributes::varargAttribute;
class CSessionMoniker;
class CDragDropBroker::UnregisterDropTarget::__l5::<lambda_4927a812c17eeead1d983da7cbe73d5d>;
class RunSyncOnMTAThread::__l2::<lambda_9b16054ad48e172bb5548ecd4adf6ab4>;
struct IPackagedComProgIdIterator;
struct _ENCLAVE_LOAD_DATA_VBS_BASIC;
class RoVariant;
struct AggregatableDetails::DeriveIUnknownIfEmpty<InterfaceList<AdHocInterceptorForwarders<ISearchProtocol2,ISearchProtocol2>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> > >;
struct wil::ExpiredFeatureBase<wil::details::FeatureTraitsBase,enum wil::details::EmptyVariant,0>;
struct _ARM64_CONTEXT;
class Microsoft::WRL::ComPtr<ICallingProcessInfo>;
struct _CLUSTER_RANGE;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IPackagedComProgIdIterator> const >;
struct IUrlAccessor;
struct _ARM_CONTEXT;
struct IObjectActivator;
struct _IMAGE_DYNAMIC_RELOCATION64_V2;
struct ICacheRefresh;
class Microsoft::WRL::ComPtr<IRegistration>;
struct IXMLDOMNamedNodeMap;
struct IRegistration;
struct HPEN__;
class CPointerMoniker;
class CClipboardBroker::SetClipboard::__l49::<lambda_ceb8f1db0b0f2dc512542b4e425d8ca5>;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IRegistration> const >;
struct _PS_CPU_QUOTA_QUERY_ENTRY;
struct _PS_CPU_QUOTA_QUERY_INFORMATION;
class CObjrefMoniker;
struct _HEAP_OPTIMIZE_RESOURCES_INFORMATION;
struct _RPC_SECURITY_QOS_V2_A;
class AdHocCallFrame<ISearchProtocol2,<lambda_b7865aac57bfa228768998e2f76a980a> >;
struct _FILE_FULL_DIR_INFO;
struct _IMAGE_ARM64EC_REDIRECTION_ENTRY;
class RoVariant::OutRef;
class AdHocInterceptorForwarders<ISearchProtocol,ISearchProtocol2>::Init::__l2::<lambda_b4919db20cec154853a959297be03d11>;
struct RoVariant::USE_INSTEAD_ReleaseAndGetAddressOf;
class CClipboardBroker;
struct _PKCS12_PBES2_EXPORT_PARAMS;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<TypeLibRegistrationReader> const >;
struct _IMAGE_OPTIONAL_HEADER;
struct tagCWPRETSTRUCT;
class CClipboardBroker::CClipboardBrokerExternalReference;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<TypeLibRegistrationReader> >;
struct utl::input_iterator_tag;
struct utl::bidirectional_iterator_tag;
struct utl::construct<unsigned __int64>;
struct _SYSTEM_LEGACY_DRIVER_INFORMATION;
struct _CMC_RESPONSE_INFO;
class Microsoft::WRL::Details::RuntimeClassImpl<Microsoft::WRL::RuntimeClassFlags<2>,1,0,0,IClipboardBroker>;
class Microsoft::WRL::RuntimeClass<Microsoft::WRL::RuntimeClassFlags<2>,IConversionClass>;
struct _CMC_TAGGED_CONTENT_INFO;
struct _SYSTEM_KERNEL_DEBUGGER_INFORMATION;
struct _TRANSACTION_NOTIFICATION_RECOVERY_ARGUMENT;
struct _ASSEMBLY_STORAGE_MAP_RESOLUTION_CALLBACK_DATA_RESOLUTION_SUCCESSFUL;
struct tagMENUITEMINFOW;
struct _SYSTEM_VERIFIER_INFORMATION;
struct HMENU__;
struct tagALTTABINFO;
struct _SYSTEM_FLUSH_INFORMATION;
class Microsoft::WRL::ComPtr<OleClassInfoDataFormatIterator>;
struct _ENUM_SERVICE_STATUSW;
struct _SYSTEM_VERIFIER_COUNTERS_INFORMATION;
struct Microsoft::WRL::Details::ImplementsHelper<Microsoft::WRL::RuntimeClassFlags<2>,0,IClipboardBroker>;
struct _SHQUERYRBINFO;
struct _RTL_IMAGE_MITIGATION_PAYLOAD_RESTRICTION_POLICY;
struct tagIMECHARPOSITION;
struct _RTL_BUFFER;
struct _RTL_UNICODE_STRING_BUFFER;
struct IGetContextId;
struct _HARDWARE_COUNTER_DATA;
struct _PROCESS_HANDLE_INFORMATION;
struct IResourceReferenceHandler;
struct _STREAM_INFORMATION_ENTRY::_StreamInformation::_DesiredStorageClass;
struct _STREAM_INFORMATION_ENTRY::_StreamInformation::_Reparse;
union _STREAM_INFORMATION_ENTRY::_StreamInformation;
struct _STREAM_INFORMATION_ENTRY;
struct _OCSP_SIGNATURE_INFO;
class wil::com_ptr_t<Windows::Foundation::Collections::IIterable<Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,IInspectable *> *>,wil::err_returncode_policy>;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<OleClassInfoDataFormatIterator> >;
struct _SL_KMEM_CACHE_VALUE_DESCRIPTOR;
struct _SL_KMEM_CACHE;
struct ANON_OBJECT_HEADER_BIGOBJ;
struct _FSCTL_UNMAP_SPACE_OUTPUT;
class Microsoft::WRL::ComPtr<IResourceReferenceHandler>;
struct wil::details::handle_null_only_resource_policy<int (__cdecl*)(void *),&CloseHandle>;
struct tagEMRPOLYDRAW16;
struct tagHELPWININFOA;
struct _FILE_COMPRESSION_INFORMATION;
struct _DRAGINFOW;
struct tagPOINTER_PEN_INFO;
struct _CERT_POLICY_MAPPING;
struct _SYSTEM_BASIC_PERFORMANCE_INFORMATION;
class Microsoft::WRL::ComPtr<InsertableCandidateIterator>;
struct _CRYPT_PSOURCE_ALGORITHM;
struct _CRYPT_RSAES_OAEP_PARAMETERS;
class InsertableCandidateIterator;
struct tagEMRALPHABLEND;
struct _SET_CACHED_RUNS_STATE_INPUT_BUFFER;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<CClipboardBroker::CClipboardBrokerExternalReference> >;
struct _CERT_X942_DH_PARAMETERS;
struct _CRL_REVOCATION_INFO;
struct tagWCRANGE;
struct _FILE_PIPE_DELETE_SYMLINK_INPUT;
struct IRpcOptions;
class Microsoft::WRL::RuntimeClass<Microsoft::WRL::RuntimeClassFlags<2>,IClipboardBrokerInternal>;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<InsertableCandidateIterator> >;
struct _MEMORY_BASIC_INFORMATION;
struct _PROCESSOR_POWER_POLICY_INFO;
struct _PROCESSOR_POWER_POLICY;
struct _PROCESSOR_IDLE_STATES;
struct _PLUGPLAY_CONTROL_PROPERTY_DATA;
struct _ALPC_PORT_ATTRIBUTES;
struct _SE_SECURITY_DESCRIPTOR;
struct _DISPLAYCONFIG_SET_ADVANCED_COLOR_STATE;
struct _CSV_QUERY_VOLUME_ID;
struct tagMOUSEMOVEPOINT;
struct _KEY_WRITE_TIME_INFORMATION;
class wil::details::SyncAsyncActionOp;
struct _HSM_OPCODE;
struct _PLUGPLAY_CONTROL_INTERFACE_ALIAS_DATA;
class wil::details_abi::SerializedFailure::Serialize::__l2::<lambda_057488ec2a114cea6fb77af5c8c7453a>;
struct _ALPC_SERVER_INFORMATION;
class _RTL_CONSTANT_STRING_remove_const_template_class<1>;
struct _QUERY_STORAGE_RESERVE_INPUT;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<wil::details::SyncAsyncActionOp> >;
struct _CONSOLE_SCREEN_BUFFER_INFO;
struct _STORAGE_QUERY_DEPENDENT_VOLUME_LEV2_ENTRY;
struct _STORAGE_QUERY_DEPENDENT_VOLUME_RESPONSE;
struct tagDELETEITEMSTRUCT;
struct _ALPC_SERVER_SESSION_INFORMATION;
struct _Wx86ThreadState;
struct _FILE_CASE_SENSITIVE_INFORMATION;
struct wil::details::out_param_t<wil::unique_any_t<wil::details::unique_storage<wil::details::resource_policy<unsigned short *,void (__cdecl*)(void *),&CoTaskMemFree,wistd::integral_constant<unsigned __int64,0>,unsigned short *,unsigned short *,0,std::nullptr_t> > > >;
struct _FILE_PIPE_INFORMATION;
struct _VIRTUALIZATION_INSTANCE_INFO_INPUT;
struct tagMOUSEINPUT;
struct tagKEYBDINPUT;
struct tagHARDWAREINPUT;
struct tagINPUT;
struct NOTIFY_USER_POWER_SETTING;
class Microsoft::WRL::ComPtr<Windows::Foundation::IAsyncAction>;
struct _ENCLAVE_LOAD_INFO_VBS;
struct Windows::Foundation::IAsyncAction;
struct IPolicyAsync;
struct tagDESIGNVECTOR;
struct _NCRYPT_KEY_BLOB_HEADER;
struct _RTLP_PROCESS_REFLECTION_CONTEXT;
struct RESOURCE_QUALIFIER;
struct _CRYPT_SMIME_CAPABILITIES;
struct _MIDL_FORMAT_STRING;
struct IResourceCandidate;
struct IHttpNegotiate;
struct IInterfaceInfo;
struct _IMAGE_ENCLAVE_IMPORT;
struct IParseDisplayName;
struct _ACTIVATION_CONTEXT_COMPATIBILITY_INFORMATION;
struct _REFS_STREAM_SNAPSHOT_QUERY_DELTAS_INPUT_BUFFER;
struct _OBJECT_ATTRIBUTES;
struct _MEMORY_WORKING_SET_INFORMATION;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IImpersonateClipboardOwner> >;
struct _SYSTEM_PROCESSOR_INFORMATION;
class RegistryTypeLibRegistration;
struct tagTOUCH_HIT_TESTING_PROXIMITY_EVALUATION;
struct _FILE_COMPRESSION_INFO;
struct _SYSTEM_BOOT_GRAPHICS_INFORMATION;
struct FILE_ID_DESCRIPTOR;
struct _ENUM_FLAG_SIZED_INTEGER<enum ComTlsFlags>;
struct _RTL_TIME_ZONE_INFORMATION;
struct _RTL_DYNAMIC_TIME_ZONE_INFORMATION;
struct _FILE_PIPE_CREATE_SYMLINK_INPUT;
struct _PRIVKEYVER3;
class Microsoft::WRL::ComPtr<IClipboardBrokerInternal>;
struct _DEDUP_FILE_OPERATION;
class wil::details::<lambda_132f49eefa8249beb4394ff597c915e5>;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<RegistryTypeLibRegistration> >;
class wil::com_ptr_t<Windows::Foundation::Collections::IMapView<HSTRING__ *,IInspectable *>,wil::err_returncode_policy>;
struct _tagCODEBASEHOLD;
struct _SCRUB_PARITY_EXTENT_DATA;
struct _MUTANT_BASIC_INFORMATION;
struct _ENUM_SERVICE_STATUS_PROCESSW;
struct tagMENUBARINFO;
struct _KEY_NAME_INFORMATION;
class Microsoft::WRL::ComPtr<ITypeLibRegistrationReader>;
struct _SECURITY_CAPABILITIES;
struct _JOURNAL_TRANSACTION_BOUNDARY_INFORMATION;
struct _SYSTEM_CPU_SET_INFORMATION;
union _SE_SID;
struct _RTL_HEAP_MEMORY_LIMIT_DATA;
struct _RTL_HEAP_MEMORY_LIMIT_INFO;
struct _ENUM_FLAG_SIZED_INTEGER<enum JOB_OBJECT_IO_RATE_CONTROL_FLAGS>;
struct _REPAIR_COPIES_INPUT;
struct _FILE_REPARSE_POINT_INFORMATION;
struct _PROV_ENUMALGS;
struct _FSCTL_OFFLOAD_WRITE_OUTPUT;
struct _ENCRYPTION_BUFFER;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<ITypeLibRegistrationReader> const >;
struct IAddrExclusionControl;
struct _SYSTEM_PAGEFILE_INFORMATION;
struct _SYSTEM_PAGEFILE_INFORMATION_EX;
struct _CM_SCSI_DEVICE_DATA;
struct _SYSTEM_VERIFIER_TRIAGE_INFORMATION;
struct _DEFINE_STORAGE_RESERVE_INPUT;
struct _CERT_REGISTRY_STORE_CLIENT_GPT_PARA;
struct _JOBOBJECT_BASIC_LIMIT_INFORMATION;
struct _JOBOBJECT_EXTENDED_LIMIT_INFORMATION;
struct _ENLISTMENT_CRM_INFORMATION;
struct PROCESSOR_IDLE_TIMES;
struct _COVERAGE_UNLOADED_MODULE_ENTRY;
struct _FILE_VALID_DATA_LENGTH_INFORMATION;
class wil::com_ptr_t<IRegistration,wil::err_returncode_policy>;
struct _TOKEN_SECURITY_ATTRIBUTES_AND_OPERATION_INFORMATION;
struct _CMSG_MAIL_LIST_RECIPIENT_ENCODE_INFO;
struct _QUERY_CACHED_RUNS_BIN;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IClipboardBrokerInternal> >;
struct _PROCESS_DYNAMIC_ENFORCED_ADDRESS_RANGE;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<ITypeLibRegistration> >;
struct IInternetSession;
struct _RESOURCEMANAGER_COMPLETION_INFORMATION;
class CBrokerInstanceHolder;
struct _MUILANGLIST;
struct _GHOSTED_FILE_EXTENT;
struct _CRYPT_PROPERTY_REF;
struct _MUILANGUAGES;
struct tagSECURITYBINDING;
struct _MUISTRINGPOOL;
struct _CMSG_SIGNED_ENCODE_INFO;
struct _CMSG_ENVELOPED_ENCODE_INFO;
struct _CMSG_SIGNED_AND_ENVELOPED_ENCODE_INFO;
struct _MUILANGCFGLIST;
struct _CREATEFILE2_EXTENDED_PARAMETERS;
struct _MUILANGCFGNODE;
class Microsoft::WRL::ComPtr<Windows::ApplicationModel::Internal::DataTransfer::IClipboardBrokerProvider>;
struct _FILE_STAT_INFORMATION;
struct Windows::ApplicationModel::Internal::DataTransfer::IClipboardBrokerProvider;
struct _CERT_SIGNED_CONTENT_INFO;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<Windows::Foundation::IAsyncAction> >;
struct _DUPLICATE_EXTENTS_DATA;
struct _CSV_QUERY_VETO_FILE_DIRECT_IO_OUTPUT;
struct IPackagedComClassCatalogInternal;
struct _SYSTEM_FEATURE_CONFIGURATION_INFORMATION;
struct _CERT_SELECT_CHAIN_PARA;
struct _CERT_CHAIN_PARA;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<Windows::ApplicationModel::Internal::DataTransfer::IClipboardBrokerProvider> const >;
struct _NETINFOSTRUCT;
class Microsoft::WRL::Details::MakeAllocator<RegistryConversionClass>;
struct _JOBOBJECT_EXTENDED_LIMIT_INFORMATION_V2;
struct _CRYPT_ASYNC_RETRIEVAL_COMPLETION;
struct _ACTIVATION_CONTEXT_MSIX_INFO;
struct _CTL_FIND_SUBJECT_PARA;
struct _IMAGE_ARCHIVE_MEMBER_HEADER;
struct IOleContainer;
union _PROCESS_READWRITEVM_LOGGING_INFORMATION;
struct _RTL_HEAP_ENTRY;
struct _CRYPT_RETRIEVE_AUX_INFO;
struct tagRemHBITMAP;
struct IWinInetInfo;
struct _FILE_PIPE_EVENT_ENUM_OUTPUT_BUFFER;
struct _PACKEDEVENTINFO;
struct _CLAIM_SECURITY_ATTRIBUTE_RELATIVE_V1;
class Microsoft::WRL::Details::MakeAllocator<OleClassInfoVerbIterator>;
struct wistd::__and_<>;
struct Microsoft::WRL::Details::ArgTraits<long (__cdecl Windows::Foundation::IAsyncActionCompletedHandler::*)(Windows::Foundation::IAsyncAction *,enum ABI::Windows::Foundation::AsyncStatus)>;
struct wistd::__libcpp_is_integral<char16_t>;
struct _RPC_SECURITY_QOS_V4_W;
struct IOleLink;
struct _CRYPT_DEFAULT_CONTEXT_MULTI_OID_PARA;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<Windows::ApplicationModel::Internal::DataTransfer::IClipboardBrokerProvider> >;
struct Microsoft::WRL::Details::VerifyInterfaceHelper<2,IOleVerbIterator,0,0>;
struct _OSVERSIONINFOA;
struct _QUERY_BAD_RANGES_INPUT_RANGE;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IEnterpriseDropTarget> >;
struct _QUERY_SERVICE_LOCK_STATUSA;
struct PPM_PERFSTATE_DOMAIN_EVENT;
struct IObjectProvider;
struct _CM_PNP_BIOS_INSTALLATION_CHECK;
class Microsoft::WRL::Details::RuntimeClassImpl<Microsoft::WRL::RuntimeClassFlags<2>,1,0,0,IInsertableCandidate>;
struct _IMAGE_OS2_HEADER;
struct _QUERY_BAD_RANGES_INPUT;
struct _SYSTEM_MEMORY_CHANNEL_INFORMATION;
class Microsoft::WRL::Details::MakeAllocator<wil::details::SyncAsyncActionOp>;
struct IUserTokenInternal;
struct _CRYPT_PROVIDERS;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<ITypeLibRegistrationReader> >;
struct _KEY_OPEN_SUBKEYS_INFORMATION;
struct tagLOGCOLORSPACEW;
struct tagEMRCREATECOLORSPACEW;
struct _FP_IEEE_VALUE;
struct tagEMRFILLPATH;
struct _JOURNAL_RENAME_KEY_INFORMATION;
class Microsoft::WRL::Details::MakeAllocator<TypeLibRegistrationEnumerator>;
struct _CONSOLE_FONT_INFOEX;
class Microsoft::WRL::Details::MakeAllocator<OleClassInfoInsertableCandidate>;
struct Microsoft::WRL::Details::ErrorPropagationOptionsHelper<0,Microsoft::WRL::AsyncCausalityOptions<&wil::details::SyncAsyncActionName,&GUID_CAUSALITY_WINDOWS_PLATFORM_ID,2> >;
struct tagICONMETRICSW;
class wil::details::<lambda_4117f85562b7434ff2afe7e3fa60a98a>;
struct _SE_LEARNING_MODE_USER_OBJECT_DATA;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IObjectProvider> >;
struct _SHNAMEMAPPINGA;
class Microsoft::WRL::Details::MakeAllocator<OleClassInfoConversionClass>;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<CFormatOnlyDataObject> const >;
struct __NCRYPT_PCP_TPM_FW_VERSION_INFO;
struct _SYSDBG_KD_PULL_REMOTE_FILE;
struct _REDIRECTION_FUNCTION_DESCRIPTOR;
struct _FILE_PIPE_WAIT_FOR_BUFFER;
struct _ENUM_FLAG_SIZED_INTEGER<enum DIALOG_CONTROL_DPI_CHANGE_BEHAVIORS>;
struct _SHFILEINFOA;
class wil::details::<lambda_7703c0f932abdb0459b9a0a45ad60d47>;
struct _CERT_EXTENSIONS;
class ClipboardWatchdog;
struct _CRYPT_OBJECT_LOCATOR_PROVIDER_TABLE;
struct IClassActivator;
struct _ALPC_CONTEXT_ATTR;
struct USN_RECORD_V3;
class Microsoft::WRL::Details::MakeAllocator<CFormatOnlyDataObject>;
struct Windows::Foundation::Collections::IVector_impl<Windows::Storage::Streams::IBuffer *,1>;
struct IXMLDOMParseError;
struct _QUERY_SERVICE_CONFIGW;
struct _SCRUB_DATA_OUTPUT;
struct _EXCEPTION_RECORD32;
struct wistd::unique_ptr<_SYSTEM_PROCESS_INFORMATION,wil::function_deleter<void (__cdecl*)(void *),&CoTaskMemFree> >::__nat;
struct tagCUSTDATAITEM;
struct _PROCESS_WINDOW_INFORMATION;
class wistd::unique_ptr<_SYSTEM_PROCESS_INFORMATION,wil::function_deleter<void (__cdecl*)(void *),&CoTaskMemFree> >;
class Microsoft::WRL::Details::RuntimeClassImpl<Microsoft::WRL::RuntimeClassFlags<2>,1,0,0,IEnumUnknown,Microsoft::WRL::FtmBase>;
struct _OUTLINETEXTMETRICW;
struct _JOBOBJECT_NOTIFICATION_LIMIT_INFORMATION_V2;
struct _HEAP_SUMMARY;
struct _SYSTEM_CODEINTEGRITY_CERTIFICATE_INFORMATION;
class Microsoft::WRL::Details::RuntimeClassImpl<Microsoft::WRL::RuntimeClassFlags<2>,1,0,0,IConversionClassIterator>;
struct wil::details::close_invoke_helper<1,int (__cdecl*)(void *),&FindClose,void *>;
class Microsoft::WRL::ComPtr<ICancelMethodCalls>;
struct IXMLElement;
struct ICancelMethodCalls;
struct _SHELLEXECUTEINFOW;
struct wil::details::variable_size_mapping<enum ComTlsFlags>;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<ICancelMethodCalls> const >;
struct wistd::is_class<unsigned char>;
struct _BCRYPT_DH_PARAMETER_HEADER;
struct wistd::__make_signed<bool,1>;
struct tagPIXELFORMATDESCRIPTOR;
struct Windows::Foundation::Collections::IVector_impl<Windows::Foundation::Internal::AggregateType<Windows::Foundation::Uri *,Windows::Foundation::IUriRuntimeClass *>,1>;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<ICancelMethodCalls> >;
struct _MEMORY_PARTITION_NODE_PAGE_INFORMATION;
class Microsoft::WRL::Details::ComPtrRefBase<Microsoft::WRL::ComPtr<ICancelMethodCalls> >;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<ITypeLibCatalogInternal> >;
struct tagWNDCLASSEXW;
class wil::com_ptr_t<Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,IInspectable *>,wil::err_returncode_policy>;
struct _COMPRESSED_DATA_INFO;
struct _IMAGE_ALPHA_RUNTIME_FUNCTION_ENTRY;
class Microsoft::WRL::Details::ComPtrRefBase<Microsoft::WRL::ComPtr<IRegistration> >;
struct RPC_INTERFACE_TEMPLATEW;
struct _CRYPT_PROVIDER_REG;
struct _FILE_FS_DRIVER_PATH_INFORMATION;
struct _CRYPT_HASH_MESSAGE_PARA;
struct _REDIRECTION_DESCRIPTOR;
struct tagEXTLOGFONTA;
struct _CRYPT_URL_ARRAY;
struct Microsoft::WRL::Details::ImplementsHelper<Microsoft::WRL::RuntimeClassFlags<2>,0,IInsertableCandidate>;
class ClipboardBrokerFactory;
struct Windows::ApplicationModel::Background::IBackgroundTaskCompletedEventArgs;
class Microsoft::WRL::ComPtr<CClipboardBroker>;
struct _LDR_DATA_TABLE_ENTRY;
struct _IMAGE_DVRT_ARM64X_DELTA_FIXUP_RECORD;
class Microsoft::WRL::Details::MakeAllocator<OleClassInfoDataFormatIterator>;
struct tagSTYLEBUFA;
class Microsoft::WRL::Details::ComPtrRefBase<Microsoft::WRL::ComPtr<ITypeLibRegistrationIterator> >;
struct _DISPLAY_DEVICEA;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<CClipboardBroker> >;
struct _RPC_C_OPT_COOKIE_AUTH_DESCRIPTOR;
struct _MEMORY_PARTITION_DEDICATED_MEMORY_ATTRIBUTE;
struct _CMSG_CTRL_MAIL_LIST_DECRYPT_PARA;
struct _RTL_MODULE_BASIC_INFO;
struct _RTL_MODULE_EXTENDED_INFO;
struct Microsoft::WRL::Details::VerifyInterfaceHelper<2,IConversionClass,0,0>;
struct _GRADIENT_TRIANGLE;
struct IXMLDOMCDATASection;
struct _FILE_FS_OBJECTID_INFORMATION;
struct Microsoft::WRL::Details::VerifyInterfaceHelper<1,IAsyncInfo,1,0>;
struct IExtensionActivationContextProperties;
struct tagSTYLESTRUCT;
class Microsoft::WRL::Details::RuntimeClassImpl<Microsoft::WRL::RuntimeClassFlags<2>,1,0,0,ITypeLibRegistration,Microsoft::WRL::FtmBase>;
struct _SERVICE_PREFERRED_NODE_INFO;
struct _WIN32_FIND_STREAM_DATA;
struct _CERT_HASHED_URL;
struct tagEMREOF;
struct _CERT_LOGOTYPE_IMAGE_INFO;
struct tagEXTLOGPEN;
struct _CERT_LOGOTYPE_AUDIO;
struct _tagPROTOCOLFILTERDATA;
struct _CERT_LOGOTYPE_AUDIO_INFO;
struct IComCatalogInternal;
struct _CERT_LOGOTYPE_REFERENCE;
struct tagTouchPredictionParameters;
struct IInternetZoneManagerEx2;
struct _s__RTTIBaseClassDescriptor;
struct _OBJECT_TYPE_LIST;
struct ICatalogFileInfo;
struct wistd::__extract_key_first_tag;
class Microsoft::WRL::RuntimeClass<Microsoft::WRL::RuntimeClassFlags<2>,IDragDropBroker,Microsoft::WRL::FtmBase>;
struct MENUITEMTEMPLATE;
struct _SYSTEM_BOOT_ENVIRONMENT_INFORMATION_V1;
struct _SYSTEM_PROCESS_INFORMATION_EXTENSION;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IComClassIterator> const >;
struct wistd::is_class<bool>;
struct tagTITLEBARINFO;
struct wistd::__libcpp_is_floating_point<double>;
class Microsoft::WRL::Details::RuntimeClassImpl<Microsoft::WRL::RuntimeClassFlags<2>,1,0,0,IDragDropBroker,Microsoft::WRL::FtmBase>;
struct _FINDFIRSTACTIVATIONCONTEXTSECTION;
struct _PROCESS_PRIORITY_CLASS;
struct _ATOM_BASIC_INFORMATION;
struct _REFS_SET_VOLUME_COMPRESSION_INFO_INPUT_BUFFER;
struct wistd::__make_signed<long,1>;
union _MCI_STATS;
union _MCI_ADDR;
struct _MCA_EXCEPTION;
struct _IO_ERROR_LOG_PACKET;
struct _ASSEMBLY_FILE_DETAILED_INFORMATION;
struct tagMULTIKEYHELPA;
struct _BCryptBufferDesc;
struct Microsoft::WRL::Details::ImplementsHelper<Microsoft::WRL::RuntimeClassFlags<2>,0,IDragDropBroker,Microsoft::WRL::FtmBase>;
struct _GENERATE_NAME_CONTEXT;
struct Microsoft::WRL::Details::ImplementsHelper<Microsoft::WRL::RuntimeClassFlags<1>,0,Windows::Foundation::IAsyncAction,IWeakReferenceSource,Microsoft::WRL::AsyncBase<Windows::Foundation::IAsyncActionCompletedHandler,Microsoft::WRL::Details::Nil,1,Microsoft::WRL::AsyncCausalityOptions<&wil::details::SyncAsyncActionName,&GUID_CAUSALITY_WINDOWS_PLATFORM_ID,2> > >;
struct IMPORT_OBJECT_HEADER;
struct _SILOOBJECT_ROOT_DIRECTORY;
struct _FS_BPIO_INFO;
struct IDragDropBroker;
struct wistd::__libcpp_is_integral<__int64>;
struct _SECURITY_DESCRIPTOR;
struct _FILE_STREAM_INFORMATION;
struct _BCRYPT_PKCS1_PADDING_INFO;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IComClassCategoryInfo> >;
struct IIndirectCallTarget;
struct _SYSTEM_CODEINTEGRITY_UNLOCK_INFORMATION;
struct _LOOKUP_STREAM_FROM_CLUSTER_INPUT;
struct tagEMREXTFLOODFILL;
struct _KTMOBJECT_CURSOR;
struct _FILE_PREFETCH;
struct tagEMRSETVIEWPORTEXTEX;
struct _RTL_USER_PROCESS_INFORMATION64;
struct _TOKEN_ACCESS_INFORMATION;
class Microsoft::WRL::Details::ComPtrRefBase<Microsoft::WRL::ComPtr<IComClassCategoryInfo> >;
struct tagRemHENHMETAFILE;
struct _TRANSACTIONMANAGER_LOGPATH_INFORMATION;
class Microsoft::WRL::Details::ComPtrRefBase<Microsoft::WRL::ComPtr<ITypeLibCatalogInternal> >;
struct _HARDERROR_MSG;
struct _CONSOLE_CURSOR_INFO;
struct _FILE_SET_STORAGE_RESERVE_ID_INFORMATION_EX;
struct _SYSTEM_SESSION_PROCESS_INFORMATION;
struct _JOBOBJECT_END_OF_JOB_TIME_INFORMATION;
struct tagHW_PROFILE_INFOW;
struct __NCRYPT_PCP_RAW_POLICYDIGEST;
struct Microsoft::WRL::Details::ImplementsHelper<Microsoft::WRL::RuntimeClassFlags<1>,1,IWeakReferenceSource,Microsoft::WRL::AsyncBase<Windows::Foundation::IAsyncActionCompletedHandler,Microsoft::WRL::Details::Nil,1,Microsoft::WRL::AsyncCausalityOptions<&wil::details::SyncAsyncActionName,&GUID_CAUSALITY_WINDOWS_PLATFORM_ID,2> > >;
struct _FILE_FS_LABEL_INFORMATION;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IDropTarget> const >;
struct _CMSG_MAIL_LIST_RECIPIENT_INFO;
struct _RTL_HEAP_TAG;
class Microsoft::WRL::ComPtr<RegistryVerbIterator>;
struct _CERT_CHAIN_ENGINE_CONFIG;
struct tagRemFORMATETC;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IComClassCategoryInfo> const >;
struct _RTL_WORK_ON_BEHALF_TICKET_EX;
struct tagCLIENTCREATESTRUCT;
struct _CERT_RDN_ATTR;
struct _SYSTEM_SPECULATION_CONTROL_INFORMATION;
struct Microsoft::WRL::Details::ImplementsHelper<Microsoft::WRL::RuntimeClassFlags<2>,0,IConversionClassIterator>;
struct _SYSTEM_SINGLE_PROCESSOR_RELATIONSHIP_INFORMATION_REQUEST;
struct _PROCESS_REVOKE_FILE_HANDLES_INFORMATION;
struct _EVENT_BASIC_INFORMATION;
struct _DRAWPATRECT;
struct tagACTCTXA;
struct _IMAGE_ENCLAVE_CONFIG32;
struct _PLUGPLAY_NOTIFY_HDR;
struct _REMOTE_PORT_VIEW;
struct Microsoft::WRL::Details::ImplementsHelper<Microsoft::WRL::RuntimeClassFlags<2>,0,IEnumUnknown,Microsoft::WRL::FtmBase>;
struct tagStorageLayout;
struct _DISPATCHER_CONTEXT_ARM64;
struct _WIM_PROVIDER_ADD_OVERLAY_INPUT;
struct tagDIBSECTION;
class Microsoft::WRL::ComPtr<CDragDropBroker>;
struct tagHANDLETABLE;
struct _ACCESS_ALLOWED_OBJECT_ACE;
struct Microsoft::WRL::Details::ImplementsHelper<Microsoft::WRL::RuntimeClassFlags<2>,0,ITypeLibRegistrationReader,Microsoft::WRL::FtmBase>;
struct CM_Power_Data_s;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<CDragDropBroker> >;
struct _PROCESS_WS_WATCH_INFORMATION;
class Microsoft::WRL::Details::MakeAllocator<RegistryVerbIterator>;
struct tagENUMLOGFONTEXW;
class Microsoft::WRL::Details::RuntimeClassImpl<Microsoft::WRL::RuntimeClassFlags<2>,1,0,0,IConversionClass>;
struct _SYSTEM_POOL_LIMIT_INFORMATION;
class Microsoft::WRL::ComPtr<IOleDragDropBrokerHost>;
struct _RTL_TRACE_ENUMERATE;
struct ISoftDistExt;
class Microsoft::WRL::Details::MakeAllocator<RegistryTypeLibRegistration>;
struct tagEMRSETICMPROFILE;
struct _INVERTED_FUNCTION_TABLE_KERNEL_MODE;
struct IXMLDOMDocument;
struct IInternetBindInfoEx;
struct Microsoft::WRL::Details::VerifyInterfaceHelper<2,IConversionClassIterator,0,0>;
struct Microsoft::WRL::Details::Selector<Microsoft::WRL::Details::ImplementsHelper<Microsoft::WRL::RuntimeClassFlags<1>,1>,Microsoft::WRL::Details::ImplementsHelper<Microsoft::WRL::RuntimeClassFlags<1>,1,Microsoft::WRL::Details::ImplementsMarker<Microsoft::WRL::AsyncBase<Windows::Foundation::IAsyncActionCompletedHandler,Microsoft::WRL::Details::Nil,1,Microsoft::WRL::AsyncCausalityOptions<&wil::details::SyncAsyncActionName,&GUID_CAUSALITY_WINDOWS_PLATFORM_ID,2> > > > >;
class Microsoft::WRL::RuntimeClass<Microsoft::WRL::RuntimeClassFlags<2>,IOleVerbIterator>;
class RegistryVerb;
class Microsoft::WRL::Details::RuntimeClassImpl<Microsoft::WRL::RuntimeClassFlags<2>,1,0,0,IOleVerbIterator>;
struct _PROCESS_HEAP_ENTRY;
struct _BOOT_AREA_INFO;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IOleDragDropBrokerHost> >;
struct _FSCTL_QUERY_GHOSTED_FILE_EXTENTS_INPUT_RANGE;
class Microsoft::WRL::Details::MakeAllocator<OleClassInfoVerb>;
struct tagCURSORINFO;
struct ICreateTypeInfo2;
struct _CLAIM_SECURITY_ATTRIBUTE_FQBN_VALUE;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<RegistryVerb> >;
struct _CLAIM_SECURITY_ATTRIBUTE_OCTET_STRING_VALUE;
class Microsoft::WRL::ComPtr<IDragDropBroker>;
struct _UNIVERSAL_NAME_INFOA;
struct _QUERY_CACHED_RUNS_OUTPUT;
class CEnumCategoriesOfClass;
struct Microsoft::WRL::Details::AsyncOptionsHelper<Windows::Foundation::IAsyncActionCompletedHandler,Microsoft::WRL::AsyncCausalityOptions<&wil::details::SyncAsyncActionName,&GUID_CAUSALITY_WINDOWS_PLATFORM_ID,2> >;
struct _SYSTEM_FIRMWARE_TABLE_HANDLER;
struct _MEMORY_PARTITION_PAGE_COMBINE_INFORMATION;
struct _SYSTEM_FIRMWARE_TABLE_INFORMATION;
struct Microsoft::WRL::Details::AsyncOptionsBase;
struct _CRYPT_PRIVATE_KEY_INFO;
struct Microsoft::WRL::Details::AsyncCausalityOptionsHelper<1,Windows::Foundation::IAsyncActionCompletedHandler,Microsoft::WRL::AsyncCausalityOptions<&wil::details::SyncAsyncActionName,&GUID_CAUSALITY_WINDOWS_PLATFORM_ID,2> >;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IDragDropBroker> const >;
class CsCatInfo;
struct _CERT_CHAIN_POLICY_PARA;
struct _MEMORY_PARTITION_PAGEFILE_INFORMATION;
class Microsoft::WRL::ComPtr<ComProgIdIterator>;
struct _PROCESS_CHILD_PROCESS_INFORMATION;
struct Microsoft::WRL::Details::Selector<Microsoft::WRL::AsyncBase<Windows::Foundation::IAsyncActionCompletedHandler,Microsoft::WRL::Details::Nil,1,Microsoft::WRL::AsyncCausalityOptions<&wil::details::SyncAsyncActionName,&GUID_CAUSALITY_WINDOWS_PLATFORM_ID,2> >,Microsoft::WRL::Details::ImplementsHelper<Microsoft::WRL::RuntimeClassFlags<1>,1,Microsoft::WRL::Details::ImplementsMarker<Microsoft::WRL::AsyncBase<Windows::Foundation::IAsyncActionCompletedHandler,Microsoft::WRL::Details::Nil,1,Microsoft::WRL::AsyncCausalityOptions<&wil::details::SyncAsyncActionName,&GUID_CAUSALITY_WINDOWS_PLATFORM_ID,2> > > > >;
struct _CRYPT_DES_KEY_STATE;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IDragDropBroker> >;
struct _FILE_IO_PRIORITY_HINT_INFORMATION;
struct _COMMTIMEOUTS;
struct _QUERY_CACHED_RUNS_ENTRY;
class Microsoft::WRL::Details::ComPtrRefBase<Microsoft::WRL::ComPtr<IOleDragDropBrokerHost> >;
class CEnumCategories;
struct IEnumContextProps;
class wil::details::<lambda_a02f22db55fe6605d2c10792e4588a50>;
class Microsoft::WRL::Details::ComPtrRefBase<Microsoft::WRL::ComPtr<IDragDropBroker> >;
struct _TRANSACTIONMANAGER_LOG_INFORMATION;
class CBrokeredClipDataObject::{dtor}::__l8::<lambda_fde06876c4167ce29bb1eca24a889b37>;
class Microsoft::WRL::ComPtr<IClientSecurity>;
class Map<MAP_KEY_GUID,INTERFACE_HELPER_CLSID *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>::Assoc;
class wil::details::<lambda_b8e8d69d491182c5cec13c1d33e82913>;
class Microsoft::WRL::Details::ComPtrRefBase<Microsoft::WRL::ComPtr<ITypeLibRegistrationReader> >;
struct _MEMORY_PARTITION_MEMORY_THRESHOLDS_INFORMATION;
struct _FILE_ID_FULL_DIR_INFORMATION;
struct APP_LOCAL_DEVICE_ID;
struct _ENUM_FLAG_SIZED_INTEGER<enum tagAR_STATE>;
struct _SYSTEM_IOMMU_STATE_INFORMATION;
struct IWindowForBindingUI;
struct _CONTEXT_CHUNK;
struct _CONTEXT_EX;
struct Windows::Foundation::Collections::IVector_impl<Windows::Storage::Streams::IRandomAccessStream *,1>;
struct Microsoft::WRL::Details::ImplementsHelper<Microsoft::WRL::RuntimeClassFlags<1>,1,IAsyncInfo>;
struct _WIN32_FIND_DATAA;
struct _CERT_CHAIN_POLICY_STATUS;
struct _RC_CONFIG;
struct value_entW;
struct _JOURNAL_CLIENT_INFORMATION;
struct _MEMORY_PRIORITY_INFORMATION;
struct std::_Make_signed2<1>;
class std::_Init_locks;
class Microsoft::WRL::Details::RuntimeClassImpl<Microsoft::WRL::RuntimeClassFlags<2>,1,0,0,IComClassIterator>;
struct std::_Make_signed2<8>;
struct IMAGE_AUX_SYMBOL_TOKEN_DEF;
union _IMAGE_AUX_SYMBOL_EX;
struct std::_Make_unsigned2<8>;
struct std::_Invoker_pmd_object;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IPackagedComClassIdIterator> const >;
struct std::_Maximum<>;
struct _IMAGE_RESOURCE_DIRECTORY_STRING;
struct wistd::__compressed_pair_elem<_SYSTEM_PROCESS_INFORMATION *,0,0>;
struct std::greater<void>;
struct _SYSTEM_PROCESS_INFORMATION;
class DragDropTelemetry::Instance::__l2::<lambda_276c39db18535f17382b3e205d26374d>;
struct Windows::Foundation::Collections::IIterator_impl<Windows::Storage::Streams::IRandomAccessStream *,1>;
struct _TXFS_CREATE_MINIVERSION_INFO;
struct _SYSTEM_CODEINTEGRITY_INFORMATION;
struct wil::details::close_invoke_helper<1,int (__cdecl*)(void *),&CloseHandle,void *>;
struct _REPAIR_STORAGE_RESERVE_INPUT;
struct _ACTIVATION_CONTEXT_BASIC_INFORMATION;
struct Microsoft::WRL::Details::VerifyInterfaceHelper<2,ITypeLibRegistrationReader,0,0>;
struct _SYSTEM_POWER_STATUS;
struct Microsoft::WRL::Details::VerifyInterfaceHelper<2,IComClassIterator,0,0>;
class Microsoft::WRL::ComPtr<RegistryConversionClass>;
class Microsoft::WRL::Details::MakeAllocator<RegistryVerb>;
struct CPageHolderTemplate;
class CPageHolder;
struct _NOTIFYICONDATAA;
struct _ALPC_WORK_ON_BEHALF_ATTR;
class COlePropertySheet;
struct __NCRYPT_UI_POLICY;
struct tagFILTERKEYS;
struct Microsoft::WRL::Details::VerifyInterfaceHelper<2,IInsertableCandidateIterator,0,0>;
struct _FILE_REMOTE_PROTOCOL_INFORMATION;
struct IComCatalog;
struct Microsoft::WRL::Details::VerifyInterfaceHelper<2,IEnumUnknown,0,0>;
struct _LDR_SERVICE_TAG_RECORD;
class Microsoft::WRL::Details::RuntimeClassImpl<Microsoft::WRL::RuntimeClassFlags<2>,1,0,0,IOleDataFormatIterator>;
class wil::Feature<__WilFeatureTraits_Feature_NWMTest1>;
struct _ENUM_FLAG_INTEGER_FOR_SIZE<1>;
struct tagPOINTER_DEVICE_INFO;
struct wil::details::close_invoke_helper<1,void (__cdecl*)(wil_FeatureTestState *),&wil_FreeFeatureTestState,wil_FeatureTestState *>;
struct HWINEVENTHOOK__;
struct _KLDR_DATA_TABLE_ENTRY32;
struct wil::details::close_invoke_helper<1,void (__cdecl*)(FEATURE_STATE_CHANGE_SUBSCRIPTION__ *),&wil::details::UnsubscribeProcessWideUsageFlush,FEATURE_STATE_CHANGE_SUBSCRIPTION__ *>;
struct wil::details::close_invoke_helper<1,void (__cdecl*)(void *),&wil::details::UnregisterWilFeatureConfigurationChange,void *>;
struct Microsoft::WRL::Details::ImplementsHelper<Microsoft::WRL::RuntimeClassFlags<2>,0,IOleVerbIterator>;
struct _IMAGE_BDD_DYNAMIC_RELOCATION;
struct _SYSTEM_POWER_POLICY;
struct _REMSECURITY_ATTRIBUTES;
struct _tagRemBINDINFO;
struct IXMLElement2;
struct Microsoft::WRL::Details::VerifyInterfaceHelper<2,IOleVerb,0,0>;
struct _SYSDBG_TRIAGE_DUMP;
class Microsoft::WRL::Details::MakeAllocator<RegistryDataFormatIterator>;
struct HRSRC__;
struct Windows::Foundation::Collections::IVector_impl<Windows::Foundation::Internal::AggregateType<Windows::ApplicationModel::Internal::DataTransfer::ClipboardHistoryItemInternal *,Windows::ApplicationModel::Internal::DataTransfer::IClipboardHistoryItemInternal *>,1>;
struct _RTL_PROCESS_LOCKS;
struct Microsoft::WRL::Details::ImplementsHelper<Microsoft::WRL::RuntimeClassFlags<2>,0,IComProgIdIterator>;
class CArray<_GUID,_GUID &>;
struct Windows::Foundation::IAsyncOperation_impl<Windows::Foundation::IAsyncAction *>;
struct IClassClassicInfo2;
class Microsoft::WRL::Details::MakeAllocator<TypeLibRegistrationReader>;
struct IWinRTCatalogInternal;
struct _RTL_RELATIVE_NAME_U;
struct DLGTEMPLATEEX;
struct _CRYPT_OBJID_TABLE;
struct _RTL_VERIFIER_DLL_DESCRIPTOR;
struct tagEMRCREATECOLORSPACE;
struct _RTL_VERIFIER_THUNK_DESCRIPTOR;
struct _PROCESS_STACK_ALLOCATION_INFORMATION_EX;
struct _CMSG_CTRL_KEY_AGREE_DECRYPT_PARA;
struct _FILE_TYPE_NOTIFICATION_INPUT;
struct _tagStartParam;
struct wistd::__compressed_pair_elem<Microsoft::WRL::ComPtr<IUnknown> *,0,0>;
class Microsoft::WRL::Details::MakeAllocator<ComClassIterator>;
struct _FILE_REFERENCE_RANGE;
struct _IMAGE_SWITCHTABLE_BRANCH_DYNAMIC_RELOCATION;
struct _CERT_QC_STATEMENTS_EXT_INFO;
struct USN_JOURNAL_DATA_V0;
struct Microsoft::WRL::Details::VerifyInterfaceHelper<2,IComProgIdIterator,0,0>;
struct _SILOOBJECT_BASIC_INFORMATION;
struct tagMDINEXTMENU;
struct tagEXTLOGPEN32;
struct tagEMREXTCREATEPEN;
struct tagPOLYTEXTW;
struct _ASYNC_DUPLICATE_EXTENTS_STATUS;
struct _SYSTEM_FEATURE_CONFIGURATION_UPDATE;
struct _CERT_SUPPORTED_ALGORITHM_INFO;
struct _AVRF_CLIENT_ID_WOW64;
struct _AVRF_PROCESS_HANDLE_TRACING_ENTRY_WOW64;
struct _AVRF_PROCESS_HANDLE_TRACING_QUERY_WOW64;
struct _JOBOBJECT_NOTIFICATION_LIMIT_INFORMATION;
struct _DISPLAY_DEVICEW;
struct Microsoft::WRL::Details::VerifyInterfaceHelper<1,Windows::Foundation::IAsyncAction,0,0>;
struct Windows::Foundation::Collections::IVectorView_impl<Windows::Storage::IStorageFile *,1>;
struct _OFSTRUCT;
struct Microsoft::WRL::Details::VerifyInterfaceHelper<2,IOleDataFormatIterator,0,0>;
struct _CERT_BIOMETRIC_EXT_INFO;
class Microsoft::WRL::ComPtr<IPackagedComClassCatalogInternal>;
struct PPM_THERMALCHANGE_EVENT;
struct _CERT_SERVER_OCSP_RESPONSE_CONTEXT;
struct _BCRYPT_ECCFULLKEY_BLOB;
struct _OVERLAPPED_ENTRY;
struct RTL_ACE_DATA;
class Microsoft::WRL::Details::RuntimeClassImpl<Microsoft::WRL::RuntimeClassFlags<2>,1,0,0,IOleVerb>;
struct tagHELPWININFOW;
struct PPM_IDLESTATE_EVENT;
struct _QUERY_PERFORMANCE_COUNTER_FLAGS;
struct _SYSTEM_QUERY_PERFORMANCE_COUNTER_INFORMATION;
struct RPC_ENDPOINT_TEMPLATEA;
struct _NDR64_STRING_FLAGS;
union _ldouble_val;
struct _NDR64_SYSTEM_HANDLE_FORMAT;
class Microsoft::WRL::Details::MakeAllocator<ComProgIdIterator>;
struct _TOKEN_ORIGIN;
struct _IMAGE_FILE_MACHINES;
struct _SYSTEM_FEATURE_CONFIGURATION_SECTIONS_INFORMATION_ENTRY;
class Microsoft::WRL::Details::ComPtrRefBase<Microsoft::WRL::ComPtr<IPackagedComProgIdIterator> >;
class Windows::Foundation::Collections::Internal::NaiveSplitView<HSTRING__ *,IInspectable *,Windows::Foundation::Collections::Internal::DefaultEqualityPredicate<HSTRING__ *>,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<HSTRING__ *>,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<IInspectable *>,Windows::Foundation::Collections::Internal::DefaultHashMapOptions<HSTRING__ *,IInspectable *,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<HSTRING__ *> > >::HasKey::__l5::<lambda_b157e817e32bc316ac1016975a893c27>;
struct _IMAGE_FUNCTION_OVERRIDE_DYNAMIC_RELOCATION;
struct Microsoft::WRL::Details::VerifyInterfaceHelper<2,IInsertableCandidate,0,0>;
class RunSyncOnMTAThread::__l2::<lambda_3d6b690e680a9e04a9783c45d7617b8a>;
struct __midl_frag148_t;
struct Windows::Foundation::IAsyncOperationCompletedHandler_impl<Windows::Foundation::IAsyncAction *>;
struct _PEBS_DS_SAVE_AREA;
struct _PROCESSOR_PROFILE_CONTROL_AREA;
class Microsoft::WRL::RuntimeClass<Microsoft::WRL::RuntimeClassFlags<2>,ITypeLibRegistrationReader,Microsoft::WRL::FtmBase>;
struct NDR64_STRING_HEADER_FORMAT;
struct _NDR64_CONFORMANT_STRING_FORMAT;
struct _PROCESS_MEMORY_EXHAUSTION_INFO;
struct __midl_frag144_t;
struct tagMEASUREITEMSTRUCT;
class Microsoft::WRL::ComPtr<ConversionClassIterator>;
struct tagSOLE_AUTHENTICATION_SERVICE;
struct _SE_APPID_TAGGING_CLAIM_NODE;
struct _CRYPT_RC4_KEY_STATE;
struct _SYSTEM_TIMEOFDAY_INFORMATION;
struct _FSCTL_OFFLOAD_WRITE_INPUT;
struct _TP_TASK_CALLBACKS;
struct __midl_frag127_t;
union _IMAGE_AUX_SYMBOL;
struct _EV_EXTRA_CERT_CHAIN_POLICY_PARA;
struct _SYSTEM_SESSION_BIGPOOL_INFORMATION;
struct _KEY_SET_VIRTUALIZATION_INFORMATION;
struct Windows::Foundation::Collections::IVectorView_impl<Windows::Foundation::Internal::AggregateType<Windows::ApplicationModel::Internal::DataTransfer::ClipboardHistoryItemInternal *,Windows::ApplicationModel::Internal::DataTransfer::IClipboardHistoryItemInternal *>,1>;
struct __midl_frag29_t;
struct _RPC_SECURITY_QOS_V4_A;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<ConversionClassIterator> const >;
struct _FILE_RENAME_INFORMATION;
struct __midl_frag2_t;
struct _INVERTED_FUNCTION_TABLE_USER_MODE;
struct _xml_error;
struct _DYNAMIC_FUNCTION_TABLE;
struct _SYSTEM_NUMA_INFORMATION;
struct tagEMRROUNDRECT;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<OleClassInfoInsertableCandidate> const >;
struct _ais_MIDL_TYPE_FORMAT_STRING;
struct _SYSTEM_TPM_INFORMATION;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<OleClassInfoInsertableCandidate> >;
struct WIN32_MEMORY_REGION_INFORMATION;
struct Windows::Foundation::Collections::IIterator_impl<Windows::Foundation::Internal::AggregateType<Windows::ApplicationModel::Internal::DataTransfer::ClipboardHistoryItemInternal *,Windows::ApplicationModel::Internal::DataTransfer::IClipboardHistoryItemInternal *>,1>;
struct _TP_JOB;
struct _MARK_HANDLE_INFO32;
struct IInsertableCandidateIterator;
struct __midl_frag122_t;
struct _ENUM_FLAG_SIZED_INTEGER<enum CWMO_FLAGS>;
struct _PS_BNO_ISOLATION_PARAMETERS;
struct _CERT_POLICY_CONSTRAINTS_INFO;
struct USN_RANGE_TRACK_OUTPUT;
struct _REMOTE_LINK_TRACKING_INFORMATION_;
struct _NDR64_CONF_ARRAY_HEADER_FORMAT;
struct IXMLDOMNodeList;
struct HCOLORSPACE__;
struct IComCatalogSettings;
struct _PROCESS_LEAP_SECOND_INFORMATION;
class Microsoft::WRL::ComPtr<OleClassInfoVerbIterator>;
class wil::com_ptr_t<Windows::Foundation::Collections::IIterator<Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,IInspectable *> *>,wil::err_returncode_policy>;
class OleClassInfoVerbIterator;
struct IInternetSecurityManager;
struct _SUPPORTED_OS_INFO;
struct _SHSTOCKICONINFO;
struct __midl_frag193_t;
struct _SECURITY_DESCRIPTOR_RELATIVE;
struct _REPARSE_INDEX_KEY;
struct Windows::ApplicationModel::DataTransfer::IClipboardHistoryItem;
struct __midl_frag168_t;
struct _CMC_STATUS_INFO;
struct __midl_frag137_t;
struct __midl_frag133_t;
struct _SYSTEM_QUERY_TIME_ADJUST_INFORMATION;
struct __midl_frag110_t;
struct _SAFER_HASH_IDENTIFICATION;
struct __midl_frag43_t;
struct __midl_frag40_t;
struct __midl_frag20_t;
struct Windows::ApplicationModel::DataTransfer::IDataPackagePropertySetView;
struct _SAFER_HASH_IDENTIFICATION2;
struct __midl_frag62_t;
struct __midl_frag24_t;
struct __midl_frag145_t;
struct _wireVARIANT;
struct __midl_frag16_t;
struct _SERVERSILO_INIT_INFORMATION;
struct __midl_frag103_t;
struct _FILE_FS_ATTRIBUTE_INFORMATION;
struct tagLOGPEN;
struct tagEMRCREATEPEN;
struct _RPC_POLICY;
struct tagENUMLOGFONTW;
struct _ACTIVATION_CONTEXT_SECTION_KEYED_DATA_ASSEMBLY_METADATA;
struct IAdviseSink2;
struct _TRANSACTIONMANAGER_OLDEST_INFORMATION;
class ComProgIdIterator;
struct __midl_frag200_t;
struct tagMINMAXINFO;
struct _WINDOWS_OS_OPTIONS;
struct tagIMEMENUITEMINFOA;
struct _FSCTL_SET_INTEGRITY_INFORMATION_BUFFER_EX;
struct Windows::ApplicationModel::DataTransfer::IDataPackageView;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<ComProgIdIterator> const >;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<ComProgIdIterator> >;
class Microsoft::WRL::RuntimeClass<Microsoft::WRL::RuntimeClassFlags<2>,IOleDataFormatIterator>;
struct FR;
class CFont;
struct FONTFACEDATA;
class Microsoft::WRL::ComPtr<OleClassInfoVerb>;
class OleClassInfoVerb;
struct _FILE_FS_FULL_SIZE_INFORMATION;
struct RPC_IF_ID_VECTOR;
class CMemString<CMemString_PolicyCoTaskMem>;
struct _PROCESS_MITIGATION_DEP_POLICY;
struct IAuthenticate;
struct _THREAD_ENERGY_VALUES;
struct ICreateTypeLib;
struct _FILE_END_OF_FILE_INFORMATION_EX;
struct DISPLAYCONFIG_PATH_TARGET_INFO;
struct DISPLAYCONFIG_PATH_INFO;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<OleClassInfoVerb> const >;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<OleClassInfoVerb> >;
struct _VARIABLE_NAME_AND_VALUE;
struct wistd::function<long __cdecl(unsigned short *,unsigned __int64,unsigned __int64 *)>::__callable_imp<<lambda_e1bdf235c2021226f8c53f8fb7bf9230>,1>;
class CTSmartPtr<unsigned short,CTContainer_PolicyLocalMem>;
struct _FIBER;
class SafeCastHelper<unsigned long,int,1>;
struct _Wx86TIB;
class ARI::ProcessToken::AutoSysAppId;
struct _SYSTEM_DEVICE_INFORMATION;
class wistd::__function::__func<<lambda_e1bdf235c2021226f8c53f8fb7bf9230>,long __cdecl(unsigned short *,unsigned __int64,unsigned __int64 *)>;
struct _ENUM_FLAG_SIZED_INTEGER<enum _RTL_FEATURE_CONFIGURATION_OPERATION>;
struct _HEAP_BLOCK_SETTABLE_INFORMATION;
struct PACKAGE_ID;
struct RTLWOW64_CROSSPROCESS_WORK_ITEM;
struct _BLENDFUNCTION;
struct _KEY_FULL_INFORMATION;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<Windows::Foundation::IAsyncActionCompletedHandler> const >;
struct _DISPLAYCONFIG_SET_MONITOR_SPECIALIZATION;
struct _FSCTL_QUERY_VOLUME_NUMA_INFO_OUTPUT;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<Windows::Foundation::IAsyncActionCompletedHandler> >;
struct _cpinfoexW;
class wil::details::<lambda_3789e6dda788e7acf31c02345dd5139e>;
struct tagACTCTX_SECTION_KEYED_DATA_2600;
struct Windows::Storage::Streams::IInputStream;
struct IUserToken;
struct _RTL_DISK_SPACE_INFO;
struct tagMONITORINFOEXW;
struct _PROCESS_SESSION_INFORMATION;
class wil::details::<lambda_8cd2267e17c06890009b9a372798381a>;
struct _PROCESS_BASIC_INFORMATION;
struct _PROCESS_EXTENDED_BASIC_INFORMATION;
struct AsyncIMultiQI;
struct HKL__;
struct _TRANSACTION_BASIC_INFORMATION;
struct _MEMORY_PARTITION_CHARGE_SHARING_INFORMATION;
struct _DRAGINFOA;
struct _BCRYPT_RSAKEY_BLOB;
struct _MicrosoftTelemetryAssertArgs;
struct tagTRACKMOUSEEVENT;
struct GetTypeValueImpl<long,unsigned short const *,enum LoadOrFreeWhy,HINSTANCE__ *>;
struct _FILE_SFIO_VOLUME_INFORMATION;
struct GetTypeValueImpl<long,enum LoadOrFreeWhy,HINSTANCE__ *>;
struct __NCRYPT_SUPPORTED_LENGTHS;
struct IInternetProtocolEx;
struct _PROCESS_EXCEPTION_PORT;
struct tagRPC_CALL_ATTRIBUTES_V3_A;
struct Windows::Foundation::Collections::IVectorView_impl<Windows::Foundation::Internal::AggregateType<Windows::ApplicationModel::DataTransfer::ClipboardHistoryItem *,Windows::ApplicationModel::DataTransfer::IClipboardHistoryItem *>,1>;
struct WIN32_MEMORY_PARTITION_INFORMATION;
struct _REFS_STREAM_EXTENT;
struct _RTL_IMAGE_MITIGATION_ASLR_POLICY;
struct IPipeDouble;
struct _SYSTEM_PROCESSOR_FEATURES_INFORMATION;
struct Windows::Foundation::Collections::IIterator_impl<Windows::Foundation::Internal::AggregateType<Windows::ApplicationModel::DataTransfer::ClipboardHistoryItem *,Windows::ApplicationModel::DataTransfer::IClipboardHistoryItem *>,1>;
struct _REFS_STREAM_SNAPSHOT_QUERY_DELTAS_OUTPUT_BUFFER;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<RegistryConversionClass> const >;
struct _WIM_PROVIDER_OVERLAY_ENTRY;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<RegistryConversionClass> >;
struct PROCESSOR_IDLESTATE_INFO;
struct CMap<unsigned short *,unsigned short * &,unsigned long,unsigned long &>::CAssoc;
class CAggregatable<AdHocInterceptor<IPersist>,InterfaceList<AdHocInterceptorForwarders<IPersist,IPersist>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> >,InterfaceList<> >;
struct IWinRTServerInfo;
class AdHocCallFrame<IOleWindow,<lambda_600bd29f17b036b93b7550065426cbdf> >;
struct CO_DEVICE_CATALOG_COOKIE__;
struct _ENUM_FLAG_SIZED_INTEGER<enum _RTL_FEATURE_ENABLED_STATE_OPTIONS>;
struct _EXFAT_STATISTICS;
class Microsoft::WRL::ComPtr<RegistryInsertableCandidate>;
struct _IMAGE_LOAD_CONFIG_CODE_INTEGRITY;
struct _IMAGE_LOAD_CONFIG_DIRECTORY64;
struct _PREFIX_TABLE;
struct _MEMORY_COMBINE_INFORMATION_EX;
struct _OBJECT_NAME_INFORMATION;
struct _SYSTEM_CALL_TIME_INFORMATION;
struct ImplementationHelpersDetails::IsUuidOfAnyHelper<ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil>;
struct Windows::Foundation::Collections::IIterator_impl<Windows::Foundation::Internal::AggregateType<Windows::Storage::StorageLibrary *,Windows::Storage::IStorageLibrary *>,1>;
struct _CRYPT_ENCRYPTED_PRIVATE_KEY_INFO;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<RegistryInsertableCandidate> >;
struct _ENUM_FLAG_SIZED_INTEGER<enum PackageDependencyProcessorArchitectures>;
struct _JOBOBJECT_IO_ATTRIBUTION_STATS;
struct _JOBOBJECT_IO_ATTRIBUTION_INFORMATION;
struct SimpleQIHelper<CAggregatable<AdHocInterceptor<IElementBehavior>,InterfaceList<AdHocInterceptorForwarders<IElementBehavior,IElementBehavior>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> >,InterfaceList<> >,InterfaceList<Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> > >;
struct SimpleQIHelper<CAggregatable<AdHocInterceptor<IPersist>,InterfaceList<AdHocInterceptorForwarders<IPersist,IPersist>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> >,InterfaceList<> >,InterfaceList<> >;
struct _OSVERSIONINFOEX3W;
struct SimpleQIHelper<CAggregatable<AdHocInterceptor<IOleWindow>,InterfaceList<AdHocInterceptorForwarders<IOleWindow,IOleWindow>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> >,InterfaceList<> >,InterfaceList<> >;
struct Microsoft::WRL::AsyncCausalityOptions<&wil::details::SyncAsyncActionName,&GUID_CAUSALITY_WINDOWS_PLATFORM_ID,2>;
struct _PUBLIC_OBJECT_BASIC_INFORMATION;
struct Microsoft::WRL::ErrorPropagationPolicyTraits<1>;
struct _SYSTEM_POOL_INFORMATION;
class RegistryVerbIterator;
struct _KEY_TRUST_INFORMATION;
struct _CRYPT_CONTEXT_FUNCTIONS;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<RegistryVerbIterator> const >;
struct tagEVENTMSG;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<RegistryVerbIterator> >;
class wil::details::<lambda_f2e474783984c20cfae428dbee0cad6f>;
struct _RTL_VERIFIER_PROVIDER_HELPER_TABLE::_RTL_VERIFIER_PROVIDER_HELPER_TABLE_UNUSED_STRUCT;
struct _RTL_VERIFIER_PROVIDER_HELPER_TABLE;
struct tagANIMATIONINFO;
struct _RTL_RXACT_LOG;
struct tagEMRCREATEMONOBRUSH;
struct _ACTIVATION_CONTEXT_DETAILED_INFORMATION;
struct _SYSTEM_ALARM_ACE;
struct tagENUMLOGFONTEXDVW;
struct NCRYPT_ALLOC_PARA;
struct _ICONINFOEXW;
struct RPC_CLIENT_INFORMATION1;
struct _FILE_FS_PERSISTENT_VOLUME_INFORMATION;
struct tagAXISINFOW;
struct tagAXESLISTW;
struct tagENUMTEXTMETRICW;
struct HSAVEDUILANGUAGES__;
struct IBindHttpSecurity;
struct _CrtMemState;
struct _HV_MINROOT_NUMA_LPS;
struct _SYSTEM_HYPERVISOR_MINROOT_INFORMATION;
struct CM_EXTENDED_PARAMETER;
struct HLSURF__;
class Microsoft::WRL::ComPtr<RegistryVerb>;
struct ISystemActivator;
struct Windows::Storage::FileProperties::IMusicProperties;
struct IActivationContextInfo;
struct IAgileObject;
struct tagGESTURENOTIFYSTRUCT;
struct _FILE_LAYOUT_NAME_ENTRY;
struct _IMAGE_DVRT_ARM64X_FIXUP_RECORD;
struct Windows::Storage::FileProperties::IVideoProperties;
class ConversionClassIterator;
struct tagRPC_CALL_ATTRIBUTES_V3_W;
struct _RPC_CALL_LOCAL_ADDRESS_V1;
struct COPYFILE2_MESSAGE;
struct _RTL_QUERY_DEBUG_INFORMATION_INFO;
struct _NON_PAGED_DEBUG_INFO;
struct _RPC_HTTP_TRANSPORT_CREDENTIALS_V3_W;
struct tagNCCALCSIZE_PARAMS;
struct _CRYPT_ECC_CMS_SHARED_INFO;
struct tagWINDOWPOS;
struct IExternalConnection;
struct Windows::Storage::FileProperties::IImageProperties;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<ConversionClassIterator> >;
struct _SYSTEM_GDI_DRIVER_INFORMATION;
struct _POWER_PLATFORM_INFORMATION;
struct _RTL_IMAGE_MITIGATION_REDIRECTION_TRUST_POLICY;
struct _ALPC_PORT_CALLBACK_INFORMATION;
struct tagINPUT_MESSAGE_SOURCE;
struct Windows::Storage::FileProperties::IDocumentProperties;
struct _COVERAGE_SECTION_HEADER;
struct tagTOUCH_HIT_TESTING_INPUT;
struct Microsoft::WRL::ErrorPropagationPolicyTraits<2>;
struct tagTOGGLEKEYS;
struct Windows::Storage::FileProperties::IBasicProperties;
struct IComCatalog2Internal;
struct IInsertableCandidate;
struct _ALPC_PORT_COMPLETION_LIST_INFORMATION;
struct _TOKEN_PRIVILEGES;
struct Windows::Storage::Streams::IRandomAccessStreamWithContentType;
struct IAsyncManager;
struct IXMLDOMEntity;
struct MFT_ENUM_DATA_V1;
struct ICall;
struct Windows::Foundation::Collections::IVectorView_impl<Windows::Foundation::Internal::AggregateType<Windows::Storage::BulkAccess::FileInformation *,Windows::Storage::BulkAccess::IStorageItemInformation *>,1>;
struct tagDRAWITEMSTRUCT;
class CAggId;
struct wistd::unique_ptr<Microsoft::WRL::ComPtr<IUnknown> [0],wistd::default_delete<Microsoft::WRL::ComPtr<IUnknown> [0]> >::_CheckArrayPointerConversion<Microsoft::WRL::ComPtr<IUnknown> *>;
struct _CERT_REVOCATION_PARA;
struct IXMLElementCollection;
struct wistd::__compressed_pair_elem<wistd::default_delete<Microsoft::WRL::ComPtr<IUnknown> [0]>,1,1>;
struct IAddrTrackingControl;
struct IInternetSecurityManagerEx2;
struct _SYSTEM_DPC_WATCHDOG_CONFIGURATION_INFORMATION_V2;
struct IMarshal2;
struct Windows::Foundation::Collections::IVectorView_impl<Windows::Storage::BulkAccess::IStorageItemInformation *,1>;
struct _IMAGE_FUNCTION_OVERRIDE_HEADER;
struct _CSV_QUERY_REDIRECT_STATE;
struct MachineGlobalObjectTableRegistrationToken__;
struct wistd::default_delete<Microsoft::WRL::ComPtr<IUnknown> [0]>::_EnableIfConvertible<Microsoft::WRL::ComPtr<IUnknown> >;
struct _FILE_PREFETCH_EX;
struct tagOBJECTDESCRIPTOR;
struct IInternetProtocolSink;
struct _CERT_BASIC_CONSTRAINTS_INFO;
struct Windows::Foundation::Collections::IIterator_impl<Windows::Storage::BulkAccess::IStorageItemInformation *,1>;
struct _WIM_PROVIDER_START_INTEGRITY;
struct Windows::Foundation::Collections::IVector_impl<Windows::Foundation::Internal::AggregateType<Windows::Storage::StorageLibraryChange *,Windows::Storage::IStorageLibraryChange *>,1>;
struct _wireSAFEARRAY;
struct IClassClassicInfo;
struct IXMLDOMDocumentFragment;
struct _QUERY_CACHED_RUNS_INPUT;
struct wil::details::verify_single_flag_helper<1>;
struct _wireBRECORD;
struct _PSINJECTDATA;
struct _RTL_UMS_SCHEDULER_STARTUP_INFO;
struct _CRYPT_KEY_PROV_INFO;
class Windows::Foundation::Diagnostics::TracingStatusChangedEventArgs;
class AdHocInterceptorForwarders<IOleWindow,IOleWindow>::GetWindow::__l2::<lambda_600bd29f17b036b93b7550065426cbdf>;
struct _CRYPT_CONTEXT_FUNCTION_CONFIG;
struct Windows::Foundation::Internal::AggregateType<Windows::Foundation::Diagnostics::TracingStatusChangedEventArgs *,Windows::Foundation::Diagnostics::ITracingStatusChangedEventArgs *>;
struct Windows::Foundation::IEventHandler_impl<Windows::Foundation::Internal::AggregateType<Windows::Foundation::Diagnostics::TracingStatusChangedEventArgs *,Windows::Foundation::Diagnostics::ITracingStatusChangedEventArgs *> >;
class AdHocInterceptorForwarders<IOleInPlaceObject,IOleInPlaceObject>::SetObjectRects::__l2::<lambda_5f36165614e701fb976ba4b91ba80c82>;
struct Windows::Foundation::IEventHandler<Windows::Foundation::Diagnostics::TracingStatusChangedEventArgs *>;
struct ITypeChangeEvents;
struct Windows::Foundation::Diagnostics::IAsyncCausalityTracerStatics;
struct tagCANDIDATELIST;
struct _JOBOBJECT_LIMIT_VIOLATION_INFORMATION;
struct tagRID_DEVICE_INFO_MOUSE;
struct IMonikerProp;
struct tagEMRRESIZEPALETTE;
class AdHocInterceptorForwarders<IOleInPlaceObject,IOleInPlaceObjectWindowless>::UIDeactivate::__l2::<lambda_f9b153e28317f47b008789014cb39e3f>;
struct tagFontPropSetTable;
struct _PLUGPLAY_CONTROL_CLASS_ASSOCIATION_DATA;
struct _PROCESS_DEVICEMAP_INFORMATION;
struct IReplaceClassInfo;
struct tagMOUSEHOOKSTRUCT;
union _PROCESS_MEMORY_ALLOCATION_MODE;
struct _WNF_DELIVERY_DESCRIPTOR;
struct _IMAGE_FUNCTION_ENTRY64;
struct HSPRITE__;
struct _KCRM_PROTOCOL_BLOB;
struct HHOOK__;
struct _KCRM_TRANSACTION_BLOB;
struct Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::IAsyncAction *>;
class InitializeTracing::__l2::<lambda_0940cd69598ba54cee9560fa9ab83a43>;
struct _FSCTL_OFFLOAD_READ_INPUT;
struct _OCSP_SIGNED_REQUEST_INFO;
struct IOverrideTargetContext;
struct Windows::Foundation::Collections::IVectorView_impl<Windows::Storage::IStorageFolder *,1>;
struct IInternetZoneManager;
struct IConversionClassIterator;
struct NTFS_FILE_RECORD_OUTPUT_BUFFER;
struct Windows::Foundation::Collections::IIterator_impl<Windows::Storage::IStorageFolder *,1>;
struct _CERT_POLICY_QUALIFIER_INFO;
struct _GRADIENT_RECT;
struct tagENUMLOGFONTEXA;
struct tagENUMLOGFONTEXDVA;
struct tagSERIALKEYSA;
struct tagRPC_CALL_ATTRIBUTES_V1_W;
struct Windows::Foundation::Collections::IVector_impl<Windows::Storage::IStorageFile *,1>;
struct _EXTENDED_CREATE_INFORMATION;
struct _SC_NOTIFICATION_REGISTRATION;
struct _SL_APPX_CACHE_VALUE_DESCRIPTOR;
struct _SL_APPX_CACHE;
struct _DECRYPTION_STATUS_BUFFER;
struct Windows::Foundation::Collections::IIterator_impl<Windows::Storage::IStorageFile *,1>;
struct _REFS_SET_VOLUME_DEDUP_INFO_INPUT_BUFFER;
struct tagCBT_CREATEWNDW;
struct IOleWindow;
struct _LDR_DATA_TABLE_ENTRY32;
struct _RPC_SECURITY_QOS_V3_A;
struct Windows::Storage::IStorageItem;
struct tagContextProperty;
struct IInterceptorBase;
struct ICallIndirect;
struct _FILE_DISPOSITION_INFO;
struct _FILE_LAYOUT_ENTRY;
struct _SYSTEM_VHD_BOOT_INFORMATION;
struct _SYSTEM_SINGLE_MODULE_INFORMATION;
struct _RDR_CALLOUT_STATE;
struct _FILE_NUMA_NODE_INFORMATION;
struct _CERT_POLICY_QUALIFIER_USER_NOTICE;
struct _CM_MCA_POS_DATA;
struct _CRYPT_KEY_VERIFY_MESSAGE_PARA;
struct MAP_SHARED<MAP_KEY_GUID,INTERFACE_HELPER_CLSID *>;
struct DedicatedAllocator<DISPATCH_CLIENT_FRAME>;
struct _CRYPT_OID_INFO;
struct Windows::Foundation::Collections::IVectorView_impl<Windows::Storage::IStorageItem *,1>;
struct _ALPC_HANDLE_ATTR32;
struct tagORPCTHAT;
struct tagINPUT_INJECTION_VALUE;
struct _LMR_QUERY_SESSION_INFO;
struct _JOURNAL_SET_KEY_SECURITY_INFORMATION;
struct HDROP__;
struct _ASSEMBLY_STORAGE_MAP_RESOLUTION_CALLBACK_DATA_RESOLUTION_BEGINNING;
struct _FILESYSTEM_STATISTICS;
struct IEnumVARIANT;
struct _RTL_AVL_TABLE;
struct _FS_BPIO_OUTPUT;
struct _CMSG_CMS_SIGNER_INFO;
struct tagMOUSEHOOKSTRUCTEX;
struct _MESSAGE_RESOURCE_DATA;
struct tagSTAT_CHUNK;
class wil::details::<lambda_80f5f229d92db566bf1363a4b365356f>;
struct _COMPOUND_ACCESS_ALLOWED_ACE;
class AdHocInterceptor<IOleInPlaceObjectWindowless>;
class AdHocInterceptor<IPersist>;
struct _SILO_USER_SHARED_DATA;
struct _CM_PNP_BIOS_DEVICE_NODE;
struct _CERT_TEMPLATE_EXT;
struct _PROCESS_JOB_MEMORY_INFO;
struct _CROSS_CERT_DIST_POINTS_INFO;
struct _PROCESS_DYNAMIC_EH_CONTINUATION_TARGET;
struct _CSV_MGMT_LOCK;
struct _PLUGPLAY_CONTROL_DEVICE_RELATIONS_DATA;
struct _ACCESS_DENIED_OBJECT_ACE;
union _PROCESS_AFFINITY_UPDATE_MODE;
struct DeriveInterfaces<InterfaceList<AdHocInterceptorForwarders<IElementBehavior,IElementBehavior>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> > >;
struct _BCRYPT_ALGORITHM_IDENTIFIER;
struct _TOKEN_AUDIT_POLICY;
struct _PATHNAME_BUFFER;
struct IDebugStream;
struct _FILEMUIINFO;
struct wil::details::MapToSmartType<HSTRING__ *,void>;
struct _POWER_SESSION_CONNECT;
struct _CMSG_RC2_AUX_INFO;
class wil::details::MapToSmartType<HSTRING__ *,void>::HStringWithRelease;
struct Windows::Foundation::Collections::IIterator_impl<Windows::Foundation::Internal::AggregateType<Windows::Storage::StorageFolder *,Windows::Storage::IStorageFolder *>,1>;
struct _RTL_PERTHREAD_CURDIR;
struct _FILE_FS_CONTROL_INFORMATION;
struct FIND_BY_SID_OUTPUT;
struct _FILE_ID_BOTH_DIR_INFORMATION;
struct tagEMRSELECTCLIPPATH;
struct IMAGE_COR20_HEADER;
struct _FILE_PIPE_EVENT_ENUM_INPUT_BUFFER;
struct tagCOMPAREITEMSTRUCT;
struct _LEARNING_MODE_OBJECT_INFORMATION;
struct Windows::Foundation::Collections::IVector_impl<Windows::ApplicationModel::Background::IBackgroundTaskYieldable *,1>;
struct tagMENUITEMINFOA;
struct _FILE_ZERO_DATA_INFORMATION;
struct tagENUMUILANG;
struct _FILE_RENAME_INFO;
struct _PLUGPLAY_CONTROL_LEGACY_DEVGEN_DATA;
struct tagUSAGE_PROPERTIES;
struct _FILE_ALIGNMENT_INFO;
struct _JOBOBJECT_BASIC_UI_RESTRICTIONS;
class CStdIdentity;
struct _SERVICE_NOTIFY_2A;
struct Windows::Foundation::Collections::IVectorView_impl<Windows::ApplicationModel::Background::IBackgroundTaskYieldable *,1>;
struct tagSOLE_AUTHENTICATION_INFO;
struct _nlsversioninfoex;
struct _KAFFINITY_EX;
struct tagEMRSETMITERLIMIT;
struct _PS_STD_HANDLE_INFO;
struct IXMLDOMDocumentType;
struct _GLYPHMETRICS;
struct tagDEBUGHOOKINFO;
class Microsoft::WRL::ComPtr<IResourceContext>;
class Windows::Internal::NativeString<Windows::Internal::CoTaskMemPolicy<unsigned short> >::InitializeFormat::__l2::<lambda_dfa7955e9ecf8d08ec7c683e91935e9e>;
struct Windows::ApplicationModel::Background::IBackgroundTaskRegistrationGroup;
struct _TRANSACTION_NOTIFICATION_TM_ONLINE_ARGUMENT;
struct IContextMarshaler;
struct std::less_equal<void>;
class wil::com_ptr_t<IComClassInfo,wil::err_returncode_policy>;
struct std::_Floating_type_traits<long double>;
union _DISPATCHER_CONTEXT_NONVOLREG_ARM64;
struct _PROCESS_INSTRUMENTATION_CALLBACK_INFORMATION;
struct _PSFEATURE_OUTPUT;
struct Windows::ApplicationModel::Background::IBackgroundTaskRegistration;
class CALLFRAME_CACHE_ENTRY<INTERFACE_HELPER_CLSID>;
struct _RTL_STACK_TRACE_DATABASE_CREATE;
struct _RTL_PROCESS_BACKTRACES_CONTROL;
struct tagEMREXTSELECTCLIPRGN;
struct Windows::Foundation::Collections::IIterator_impl<Windows::Foundation::Collections::IKeyValuePair<_GUID,Windows::ApplicationModel::Background::IBackgroundTaskRegistration *> *,1>;
struct _ZONEATTRIBUTES;
struct _POWER_MONITOR_INVOCATION;
struct Windows::Foundation::Collections::IKeyValuePair_impl<_GUID,Windows::ApplicationModel::Background::IBackgroundTaskRegistration *>;
struct _CERT_KEY_CONTEXT;
struct DedicatedAllocator<CallFrame>;
struct _CRYPT_ENCODE_PARA;
struct Windows::ApplicationModel::Background::IBackgroundTaskProgressEventArgs;
struct _SYSTEM_VERIFIER_FAULTS_INFORMATION;
struct _ATOM_TABLE_INFORMATION;
class AdHocInterceptorForwarders<IOleWindow,IOleInPlaceObjectWindowless>;
class wil::com_ptr_t<IComClassCategoryInfo,wil::err_returncode_policy>;
struct tagKERNINGPAIR;
struct _SECTION_IMAGE_INFORMATION32;
struct _RPC_PROTSEQ_VECTORW;
struct ICodeInstall;
struct MENUITEMTEMPLATEHEADER;
struct _RPC_SEC_CONTEXT_KEY_INFO;
struct _TRANSACTIONMANAGER_RECOVERY_INFORMATION;
struct _SCOPE_TABLE_ARM64;
struct tagSTICKYKEYS;
struct _SSL_ECCKEY_BLOB;
struct Windows::Foundation::Collections::IIterator_impl<Windows::Foundation::Collections::IKeyValuePair<unsigned int,Windows::System::User *> *,1>;
struct tagKBDLLHOOKSTRUCT;
class AdHocCallFrame<IOleWindow,<lambda_524187a61b7f412a8ba870cd827a85c9> >;
struct _PO_WAKE_SOURCE_INTERNAL;
struct tagEMRCREATEDIBPATTERNBRUSHPT;
class AdHocCallFrame<IOleWindow,<lambda_3486a7fc69495c9349b1266d1aff572d> >;
class wil::details::<lambda_fa521078eed78ffe1c3cfda3117d3863>;
struct _RGNDATA;
struct ISynchronizeHandle;
struct _DISCDLGSTRUCTA;
struct _UNICODE_PREFIX_TABLE;
struct _HTTPSPolicyCallbackData;
struct Windows::System::IUser;
struct _NOTIFYICONDATAW;
class wil::details::<lambda_81879180566d4a5d3b0613440b5f29a5>;
struct ICallLocalityInfo;
struct _CTL_VERIFY_USAGE_STATUS;
class wil::details::<lambda_15ee1117c0f09c941ddf22843b3b6e42>;
struct Windows::Foundation::Collections::IVector_impl<enum Windows::System::UserWatcherUpdateKind,1>;
struct _CMSG_RECIPIENT_ENCRYPTED_KEY_INFO;
struct _heapinfo;
class AdHocInterceptorForwarders<ISearchProtocol2,ISearchProtocol2>::CreateAccessorEx::__l2::<lambda_b7865aac57bfa228768998e2f76a980a>;
struct SimpleQIHelper<CAggregatable<AdHocInterceptor<ISearchProtocol2>,InterfaceList<AdHocInterceptorForwarders<ISearchProtocol2,ISearchProtocol2>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> >,InterfaceList<> >,InterfaceList<AdHocInterceptorForwarders<ISearchProtocol2,ISearchProtocol2>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> > >;
struct _FILE_ID_BOTH_DIR_INFO;
class AdHocCallFrame<IPersist,<lambda_121ff239fc219aa2df927c67d0376548> >;
struct _IO_RESOURCE_REQUIREMENTS_LIST;
struct _TRANSACTION_BIND_INFORMATION;
struct IGetBindHandle;
struct IInternet;
struct Windows::Foundation::Collections::IVectorView_impl<enum Windows::System::UserWatcherUpdateKind,1>;
struct tagEMRPLGBLT;
struct SC_HANDLE__;
struct PPM_WMI_LEGACY_PERFSTATE;
struct _SYSTEM_LOOKASIDE_INFORMATION;
struct _JOURNAL_SET_KEY_USER_FLAGS_INFORMATION;
struct IReleaseMarshalBuffers;
struct _SYSTEM_DMA_GUARD_POLICY_INFORMATION;
struct _THREAD_PERFORMANCE_DATA;
struct _PROCESS_HANDLE_TRACING_ENABLE_EX;
struct Windows::Foundation::Collections::IIterator_impl<Windows::Foundation::Internal::AggregateType<Windows::System::User *,Windows::System::IUser *>,1>;
struct tagGESTUREINFO;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IEnterpriseDropTarget> const >;
struct _SAFER_PATHNAME_IDENTIFICATION;
struct _ACTIVATION_CONTEXT_SECTION_KEYED_DATA_2600;
struct _PERFORMANCE_DATA;
struct tagEMRGLSRECORD;
struct _KEY_TYPE_SUBTYPE;
struct _BCRYPT_DSA_PARAMETER_HEADER;
struct SHELLHOOKINFO;
struct _XSAVE_POLICY;
struct _SYSTEM_PROCESSOR_POLICY_INFORMATION;
struct DISPLAYCONFIG_SET_TARGET_PERSISTENCE;
struct SimpleQIHelper<CAggregatable<AdHocInterceptor<IOleWindow>,InterfaceList<AdHocInterceptorForwarders<IOleWindow,IOleWindow>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> >,InterfaceList<> >::CInner,InterfaceList<> >;
struct AggregatableDetails::DeriveIUnknownIfEmpty<InterfaceList<AdHocInterceptorForwarders<IOleInPlaceObjectWindowless,IOleInPlaceObjectWindowless>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> > >;
struct _CRYPT_RSA_SSA_PSS_PARAMETERS;
struct AggregatableDetails::DeriveIUnknownIfEmpty<InterfaceList<> >;
struct _ALPC_MESSAGE_ATTRIBUTES;
class CInterfaceFromWindowProp;
struct _COVERAGE_MODULE_REQUEST;
struct _COVERAGE_MODULES;
struct IInternetPriority;
class Microsoft::WRL::ComPtr<ICallFrameEvents>;
struct _PROCESS_MACHINE_INFORMATION;
struct _SHUFFLE_FILE_DATA;
struct IInterfaceFromWindowProp;
struct Windows::Foundation::IWwwFormUrlDecoderRuntimeClass;
struct IGetProcessInfoInternal;
struct _CRYPT_INTERFACE_REG;
struct IHTMLFiltersCollection;
struct SDDInfo;
struct _WORKER_FACTORY_DEFERRED_WORK;
struct _Combined_type<float,double>;
class CEndPointAtom;
struct Windows::Foundation::Collections::IIterator_impl<Windows::Foundation::Internal::AggregateType<Windows::Foundation::Uri *,Windows::Foundation::IUriRuntimeClass *>,1>;
struct IHTMLStyle;
struct _CSV_NAMESPACE_INFO;
class AdHocCallFrame<IElementBehavior,<lambda_b26c1a7a98add69a0d17b823be354735> >;
class Microsoft::WRL::ComPtr<CFormatOnlyDataObject>;
struct IExceptionNotification;
struct _GLYPHMETRICSFLOAT;
struct _NTFS_STATISTICS;
struct IInternetSecurityManagerEx;
struct tagEMRRESTOREDC;
struct Windows::Foundation::IWwwFormUrlDecoderEntry;
struct _ACCESS_DENIED_CALLBACK_OBJECT_ACE;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<CFormatOnlyDataObject> >;
struct _IO_COMPLETION_BASIC_INFORMATION;
struct _DMA_CONFIGURATION_BYTE0;
struct _EISA_DMA_CONFIGURATION;
struct _SYSTEM_FEATURE_USAGE_SUBSCRIPTION_UPDATE;
struct tagEMRSETCOLORSPACE;
struct _KEY_VALUE_ENTRY;
struct tagEMRGLSBOUNDEDRECORD;
class Microsoft::WRL::Details::ComPtrRefBase<Microsoft::WRL::ComPtr<IEnterpriseDropTarget> >;
struct _SERVICE_SID_INFO;
struct _CERT_LDAP_STORE_OPENED_PARA;
struct _SYSTEM_HANDLE_INFORMATION_EX;
struct _WIM_PROVIDER_UPDATE_OVERLAY_INPUT;
struct Windows::Foundation::Collections::IKeyValuePair_impl<HSTRING__ *,Windows::Foundation::Collections::IVectorView<Windows::Data::Text::TextSegment> *>;
struct _AUTHENTICODE_EXTRA_CERT_CHAIN_POLICY_STATUS;
struct _MUICCENTRY;
struct _FILE_LINK_ENTRY_INFORMATION;
struct tagRemHGLOBAL;
struct _IMAGE_BOUND_IMPORT_DESCRIPTOR;
struct _FILE_OBJECTID_BUFFER;
struct _SERVICE_TRIGGER;
struct GetTypeValueImpl<long,HWND__ *,unsigned int,unsigned long>;
class CAggregatable<AdHocInterceptor<ISearchProtocol>,InterfaceList<AdHocInterceptorForwarders<ISearchProtocol,ISearchProtocol>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> >,InterfaceList<> >::CInner;
class CAggregatable<AdHocInterceptor<ISearchProtocol>,InterfaceList<AdHocInterceptorForwarders<ISearchProtocol,ISearchProtocol>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> >,InterfaceList<> >;
struct _CMSG_MAIL_LIST_ENCRYPT_INFO;
struct Windows::Data::Text::TextSegment;
struct _SAFER_CODE_PROPERTIES_V2;
struct ISynchronizeContainer;
class AdHocCallFrame<ISearchProtocol,<lambda_b4919db20cec154853a959297be03d11> >;
class PMemoryAllocator;
struct _RTL_DEBUG_INFORMATION32;
struct _REFS_DEALLOCATE_RANGES_INPUT_BUFFER_EX;
struct Windows::Foundation::Collections::IIterator_impl<Windows::Storage::Streams::IBuffer *,1>;
struct _RTL_HASH_ENTRY;
struct _SYSTEM_PROCESS_TRUST_LABEL_ACE;
struct _ACCESS_REASONS;
struct _ABCFLOAT;
struct wil::details::close_invoke_helper<1,void (__cdecl*)(wil::details::folder_change_reader_state *),&wil::details::delete_folder_change_reader_state,wil::details::folder_change_reader_state *>;
struct wil::details::close_invoke_helper<1,void (__cdecl*)(wil::details::folder_watcher_state *),&wil::details::delete_folder_watcher_state,wil::details::folder_watcher_state *>;
struct _RPC_SECURITY_QOS_V5_A;
struct _WGLSWAP;
struct _RPC_HTTP_TRANSPORT_CREDENTIALS_A;
struct IWaitMultiple;
struct _SEC_WINNT_AUTH_IDENTITY_A;
struct wil::details::close_invoke_helper<1,int (__cdecl*)(void *),&FindCloseChangeNotification,void *>;
struct wil::details::resource_policy<void *,int (__cdecl*)(void *),&FindCloseChangeNotification,wistd::integral_constant<unsigned __int64,0>,void *,__int64,-1,void *>;
struct _RTL_IMAGE_MITIGATION_DYNAMIC_CODE_POLICY;
struct _COMSTAT;
struct tagORPC_EXTENT_ARRAY;
struct tagORPC_EXTENT;
struct _FILE_DIRECTORY_INFORMATION;
struct _SE_ACCESS_REPLY;
struct _REFS_SMR_VOLUME_INFO_OUTPUT;
class CEnumConnectionsImpl;
struct tagUSEROBJECTFLAGS;
struct tagPROPERTYIDOFFSET;
struct wil::details::FeatureStorage<__WilFeatureTraits_Feature_NWMTest1,1>;
class wil::details::FeatureImpl<__WilFeatureTraits_Feature_NWMTest1>;
struct _OBJECT_TYPES_INFORMATION;
class SafeIntCompare<unsigned long,unsigned __int64>;
union _DL_EUI48;
class wil::details::<lambda_d209876616f5b5ccf229bbf422abd156>;
struct _JOBOBJECT_JOBSET_INFORMATION;
class SafeIntCompare<unsigned long,int>;
struct DICTENTRYHEADER;
struct DICTENTRY;
struct _KEY_VALUE_PARTIAL_INFORMATION_ALIGN64;
struct tagHELPINFO;
struct _JOBOBJECT_MEMORY_USAGE_INFORMATION_V2;
struct _DISPLAYCONFIG_GET_MONITOR_SPECIALIZATION;
struct _WIM_PROVIDER_INTEGRITY_STATUS;
struct _tagAUTHENTICATEINFO;
struct DISPLAYCONFIG_SOURCE_DEVICE_NAME;
struct wistd::__unique_ptr_deleter_sfinae<wistd::default_delete<wil::details::folder_change_reader_state> >;
struct _FILE_FS_VOLUME_INFORMATION;
class wistd::__compressed_pair<wil::details::folder_change_reader_state *,wistd::default_delete<wil::details::folder_change_reader_state> >;
class wistd::unique_ptr<wil::details::folder_change_reader_state,wistd::default_delete<wil::details::folder_change_reader_state> >;
struct _CMS_KEY_INFO;
struct $_TypeDescriptor$_extraBytes_16;
class CTGlobalAllocPolicy;
struct _SYSTEM_POWER_STATE_DISABLE_REASON;
class CTSmartObj<unsigned short *,CTSmartPtr_PolicyComplete<CTContainer_PolicyLocalMem> >;
struct __vc_attributes::defaultAttribute;
struct __vc_attributes::defaultbindAttribute;
struct wistd::unique_ptr<wil::details::folder_watcher_state,wistd::default_delete<wil::details::folder_watcher_state> >::__nat;
struct wistd::__unique_ptr_deleter_sfinae<wistd::default_delete<wil::details::folder_watcher_state> >;
struct _PO_WAKE_SOURCE_DEVICE;
struct __vc_attributes::ptrAttribute;
struct __vc_attributes::cpp_quoteAttribute;
struct _SYSTEM_VA_LIST_INFORMATION;
struct _PROCESS_ACCESS_TOKEN;
struct __vc_attributes::coclassAttribute;
struct __vc_attributes::lcidAttribute;
struct ASSOCIATIONELEMENT;
class wil::details::<lambda_47f9ee6fb0b5755eb2ee16e9695dcbdb>;
struct __vc_attributes::ms_unionAttribute;
struct _CRYPT_AES_256_KEY_STATE;
struct wistd::__compressed_pair_elem<wil::details::folder_watcher_state *,0,0>;
class wil::unique_struct<_TOKEN_LINKED_TOKEN,void (__cdecl*)(_TOKEN_LINKED_TOKEN *) noexcept,&wil::details::CloseTokenLinkedToken,std::nullptr_t,0>;
struct wistd::__compressed_pair_elem<wistd::default_delete<wil::details::folder_watcher_state>,1,1>;
struct __lc_time_data;
struct __vc_attributes::uidefaultAttribute;
struct __vc_attributes::publicAttribute;
struct lconv;
struct __vc_attributes::helper_attributes::notify_atlprovAttribute;
struct _SYSTEM_PROCESS_ID_INFORMATION;
struct __vc_attributes::helper_attributes::help_stringAttribute;
struct __vc_attributes::helper_attributes::requires_valueAttribute;
struct ISynchronize;
struct _PSFEATURE_CUSTPAPER;
struct __vc_attributes::helper_attributes::as_stringAttribute;
struct __vc_attributes::helper_attributes::source_annotation_attributeAttribute;
struct _stat32i64;
struct __vc_attributes::helper_attributes::attributeAttribute;
struct _FILE_NOTIFY_INFORMATION;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<INotARealInterface> const >;
struct wil::next_entry_offset_iterator<_FILE_NOTIFY_INFORMATION>;
struct __vc_attributes::helper_attributes::v1_earlyAttribute;
struct INotARealInterface;
struct __vc_attributes::helper_attributes::v1_nameAttribute;
class AdHocInterceptorForwarders<IOleWindow,IOleInPlaceObjectWindowless>::GetWindow::__l2::<lambda_3486a7fc69495c9349b1266d1aff572d>;
struct __vc_attributes::idl_moduleAttribute;
struct __vc_attributes::last_isAttribute;
class wistd::function<long __cdecl(unsigned short *,unsigned __int64,unsigned __int64 *)>;
struct __vc_attributes::importlibAttribute;
struct __vc_attributes::inAttribute;
struct tagREGISTERWORDW;
struct __vc_attributes::switch_typeAttribute;
struct _numberfmtW;
struct IXMLError;
struct IMarshallingManager;
struct wistd::function<long __cdecl(unsigned short *,unsigned __int64,unsigned __int64 *)>::__callable<<lambda_0c2afb377131ef1ab2244976d5fb45fc> >;
struct __vc_attributes::includelibAttribute;
struct wistd::function<long __cdecl(unsigned short *,unsigned __int64,unsigned __int64 *)>::__callable_imp<<lambda_0c2afb377131ef1ab2244976d5fb45fc>,1>;
struct __vc_attributes::helpstringdllAttribute;
struct DeriveInterfaceDelegators<CAggregatable<AdHocInterceptor<IPersist>,InterfaceList<AdHocInterceptorForwarders<IPersist,IPersist>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> >,InterfaceList<> >::CInner,InterfaceList<> >;
struct __vc_attributes::hiddenAttribute;
struct wil::details::string_maker<wil::unique_any_t<wil::details::unique_storage<wil::details::resource_policy<unsigned short *,void * (__cdecl*)(void *),&LocalFree,wistd::integral_constant<unsigned __int64,0>,unsigned short *,unsigned short *,0,std::nullptr_t> > > >;
class AdHocInterceptorForwarders<IPersist,IPersist>;
struct __vc_attributes::includeAttribute;
struct SimpleQIHelper<CAggregatable<AdHocInterceptor<IOleWindow>,InterfaceList<AdHocInterceptorForwarders<IOleWindow,IOleWindow>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> >,InterfaceList<> >,InterfaceList<Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> > >;
struct SimpleQIHelper<CAggregatable<AdHocInterceptor<IPersist>,InterfaceList<AdHocInterceptorForwarders<IPersist,IPersist>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> >,InterfaceList<> >::CInner,InterfaceList<> >;
class Windows::Foundation::Collections::Internal::NaiveSplitView<HSTRING__ *,IInspectable *,Windows::Foundation::Collections::Internal::DefaultEqualityPredicate<HSTRING__ *>,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<HSTRING__ *>,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<IInspectable *>,Windows::Foundation::Collections::Internal::DefaultHashMapOptions<HSTRING__ *,IInspectable *,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<HSTRING__ *> > >::Lookup::__l5::<lambda_b9bc781cf4891e97cdc64fd226d3642a>;
struct __vc_attributes::wire_marshalAttribute;
class AdHocInterceptorForwarders<IPersist,IPersist>::GetClassID::__l2::<lambda_77a2b2d0129bbc926517a2760e67553c>;
struct _IMAGE_DYNAMIC_RELOCATION32;
struct __vc_attributes::emitidlAttribute;
class wistd::__function::__func<<lambda_b791f461fdcdf6803f8b1ec4cfa018be>,bool __cdecl(void *,unsigned __int64,void *,unsigned __int64,unsigned int)>;
struct _SYSTEM_SYSTEM_PARTITION_INFORMATION;
struct InterfaceWalkerFree;
struct __vc_attributes::first_isAttribute;
struct tagEMRSETARCDIRECTION;
struct _SYSTEM_REF_TRACE_INFORMATION;
class Microsoft::WRL::Details::MakeAllocator<CClipboardBroker::CClipboardBrokerExternalReference>;
struct __vc_attributes::oleautomationAttribute;
struct SimpleQIHelper<CAggregatable<AdHocInterceptor<ISearchProtocol>,InterfaceList<AdHocInterceptorForwarders<ISearchProtocol,ISearchProtocol>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> >,InterfaceList<> >,InterfaceList<Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> > >;
class Microsoft::WRL::Details::MakeAllocator<CClipboardBroker>;
struct __vc_attributes::defaultvalueAttribute;
class Microsoft::WRL::Details::MakeAllocator<CDragDropBroker>;
class wil::details::<lambda_430053700ae9b88d68da62d9ff0cf050>;
struct __vc_attributes::propgetAttribute;
class wil::details::<lambda_f725a7e1c10857753400300473ba37a8>;
struct Microsoft::WRL::Details::VerifyInterfaceHelper<2,IDragDropBroker,0,0>;
struct __vc_attributes::defaultvtableAttribute;
struct __vc_attributes::call_asAttribute;
struct __vc_attributes::dispinterfaceAttribute;
struct __vc_attributes::exportAttribute;
struct _KCRM_MARSHAL_HEADER;
struct __vc_attributes::hookAttribute;
struct _SQM_STREAM_ENTRY;
struct wistd::__invoke_void_return_wrapper<bool>;
class wil::details::unique_storage<wil::details::resource_policy<void *,void (__cdecl*)(void *),&wil::details::RevertImpersonateToken,wistd::integral_constant<unsigned __int64,2>,void *,__int64,-1,void *> >;
struct wistd::__invoke_void_return_wrapper<long>;
struct wil::details::resource_policy<void *,int (__cdecl*)(void *),&FindClose,wistd::integral_constant<unsigned __int64,0>,void *,__int64,-1,void *>;
struct __vc_attributes::atl::db_columnAttribute;
struct __vc_attributes::atl::soap_handlerAttribute;
class ImagePath;
class CTHeapAllocPolicy;
class wil::details::<lambda_a74ea9c4f4581fcfb226a1cd0bef07a8>;
struct __vc_attributes::atl::com_interface_entryAttribute;
class wil::details::<lambda_cb2b7e4968d7aedd052fd4c9f97fd424>;
struct __vc_attributes::atl::db_sourceAttribute;
struct __vc_attributes::atl::aggregatesAttribute;
struct __vc_attributes::atl::db_tableAttribute;
struct __vc_attributes::atl::soap_headerAttribute;
struct _SERVICE_REQUIRED_PRIVILEGES_INFOW;
struct __vc_attributes::atl::db_commandAttribute;
class Microsoft::WRL::Details::ComPtrRefBase<Microsoft::WRL::ComPtr<Windows::ApplicationModel::Internal::DataTransfer::IClipboardPolicyStatics> >;
struct __vc_attributes::atl::tag_nameAttribute;
struct _CONTAINER_ROOT_INFO_OUTPUT;
struct _FILE_PROVIDER_EXTERNAL_INFO_V1;
struct __vc_attributes::atl::rdxAttribute;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<Windows::ApplicationModel::Internal::DataTransfer::IClipboardPolicyStatics> >;
struct __vc_attributes::atl::perf_counterAttribute;
struct EnumVerbCache;
struct _NCRYPT_PLATFORM_ATTEST_PADDING_INFO;
class CEnumVerb;
struct VerbList;
struct __vc_attributes::atl::requires_categoryAttribute;
struct _FLAG_STGMEDIUM;
struct __vc_attributes::noncreatableAttribute;
class wil::details::<lambda_d5e0fb0d03f8da8c44bdcbf9a859e563>;
struct __vc_attributes::defaultcollelemAttribute;
struct __vc_attributes::odlAttribute;
struct __vc_attributes::switch_isAttribute;
struct IOleVerbIterator;
class Microsoft::WRL::ComPtr<IOleVerbIterator>;
struct tagHDIBFILEHDR;
struct __vc_attributes::helpstringAttribute;
struct __vc_attributes::unhookAttribute;
struct __vc_attributes::progidAttribute;
struct tagPROPHEADER;
struct __vc_attributes::versionAttribute;
struct _OCSP_BASIC_SIGNED_RESPONSE_INFO;
struct __vc_attributes::dualAttribute;
struct _RTL_IMAGE_MITIGATION_CONTROL_FLOW_GUARD_POLICY;
struct __vc_attributes::implementsAttribute;
struct __vc_attributes::localAttribute;
struct __vc_attributes::pointer_defaultAttribute;
struct wistd::unique_ptr<VerbList,wil::function_deleter<void (__cdecl*)(void *),&PrivMemFree> >::__nat;
struct __vc_attributes::requesteditAttribute;
struct _TRANSACTION_LIST_ENTRY;
struct _TRANSACTION_LIST_INFORMATION;
struct _RPC_SERVER_INTERFACE;
struct _RPC_PROTSEQ_ENDPOINT;
struct __vc_attributes::pragmaAttribute;
struct __vc_attributes::appobjectAttribute;
struct __vc_attributes::retvalAttribute;
struct __vc_attributes::uuidAttribute;
struct __vc_attributes::entryAttribute;
class std::_Compressed_pair<std::default_delete<tagOLEVERB [0]>,tagOLEVERB *,1>;
class std::unique_ptr<tagOLEVERB [0],std::default_delete<tagOLEVERB [0]> >;
struct __vc_attributes::helpfileAttribute;
struct std::default_delete<tagOLEVERB [0]>;
struct __vc_attributes::async_uuidAttribute;
struct IComServices;
struct __vc_attributes::uniqueAttribute;
struct _WOF_VERSION_INFO;
struct __vc_attributes::vi_progidAttribute;
struct __vc_attributes::providerAttribute;
struct __vc_attributes::refAttribute;
struct __vc_attributes::usesgetlasterrorAttribute;
struct _SYSTEM_DIF_VOLATILE_INFORMATION_V2;
struct __vc_attributes::importAttribute;
struct __vc_attributes::outAttribute;
struct _QUERY_FILE_LAYOUT_INPUT;
struct wistd::__compressed_pair_elem<wil::function_deleter<void (__cdecl*)(void *),&PrivMemFree>,1,1>;
class wil::details::<lambda_e7267742e4808ea59b03f0a98e0b174e>;
struct IComServices2;
struct _CRYPTPROTECT_PROMPTSTRUCT;
struct NTFS_EXTENDED_VOLUME_DATA;
struct _JOBOBJECT_INTERFERENCE_INFORMATION;
struct _SYSTEM_KERNEL_DEBUGGER_FLAGS;
class Microsoft::WRL::ComPtr<IDataObjectEx>;
struct _SYSTEM_FIRMWARE_PARTITION_INFORMATION;
struct _CRL_DIST_POINTS_INFO;
struct _FILE_NOTIFY_FULL_INFORMATION;
struct _CERT_ALT_NAME_ENTRY;
struct _CERT_OTHER_NAME;
struct _MEMORY_PHYSICAL_CONTIGUITY_INFORMATION;
struct RETRIEVAL_POINTERS_AND_REFCOUNT_BUFFER;
struct __NCRYPT_PCP_TPM_WEB_AUTHN_ATTESTATION_STATEMENT;
struct _MEMORY_PHYSICAL_CONTIGUITY_UNIT_INFORMATION;
struct _CRYPT_PKCS8_EXPORT_PARAMS;
struct tagMENUINFO;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IDataObjectEx> >;
struct _ICONINFOEXA;
struct _PROCESS_DEVICEMAP_INFORMATION_EX;
class CBrokeredClipDataObject::GetCanonicalFormatEtc::__l8::<lambda_081b6c7677eb82075ed79974a043e870>;
struct _SYSTEM_VSM_PROTECTION_INFORMATION;
struct tagAUDIODESCRIPTION;
struct _SERVICE_FAILURE_ACTIONSW;
struct _CMC_PEND_INFO;
struct _IMAGE_RESOURCE_DIR_STRING_U;
struct NCryptProviderName;
struct _PUBKEY;
struct tagBITMAPFILEHEADER;
struct _FILE_ATTRIBUTE_TAG_INFORMATION;
struct _SINGLE_LIST_ENTRY32;
class AdHocInterceptorForwarders<ISearchProtocol,ISearchProtocol2>::ShutDown::__l2::<lambda_b0bb8e7a2c8a87ed1d1ad81cb190fffe>;
struct _EVENTLOG_FULL_INFORMATION;
struct _SERVICE_REQUIRED_PRIVILEGES_INFOA;
class AdHocInterceptorForwarders<IOleInPlaceObject,IOleInPlaceObjectWindowless>::ReactivateAndUndo::__l2::<lambda_9f5ff7c0875bbd6db2722caf2496ccad>;
class Microsoft::WRL::Wrappers::HandleT<Microsoft::WRL::Wrappers::HandleTraits::FileHandleTraits>;
struct Microsoft::WRL::Details::RemoveReference<Microsoft::WRL::Wrappers::Event &>;
struct _DELETE_STORAGE_RESERVE_INPUT;
class AdHocInterceptorForwarders<IElementBehavior,IElementBehavior>::Detach::__l2::<lambda_d914c7f54183b33a257332a7d99c0d41>;
struct Microsoft::WRL::Details::RemoveReference<Microsoft::WRL::Wrappers::Semaphore &>;
struct _SYSTEM_CRASH_DUMP_STATE_INFORMATION;
struct _QUERY_FILE_LAYOUT_OUTPUT;
class AdHocInterceptorForwarders<ISearchProtocol,ISearchProtocol>::CloseAccessor::__l2::<lambda_c3d9c36ff6c5e276434071298f6b4b2c>;
struct _QUAD;
struct HIMCC__;
class AdHocInterceptorForwarders<ISearchProtocol,ISearchProtocol>::CreateAccessor::__l2::<lambda_c0fa3d92ef3684ffb99dddd895e07e56>;
struct _COUNTED_REASON_CONTEXT;
struct _SYSTEM_OBJECTTYPE_INFORMATION;
struct IXMLDOMNotation;
struct tagHARDWAREHOOKSTRUCT;
class AdHocInterceptorForwarders<ISearchProtocol,ISearchProtocol>::Init::__l2::<lambda_eb81b7dcb3076a64e0db4008f1f3b137>;
struct _CMSG_CTRL_DEL_SIGNER_UNAUTH_ATTR_PARA;
struct _FLOAT128;
struct _SYSTEM_AUDIT_CALLBACK_ACE;
struct _PROCESS_FREE_FIBER_SHADOW_STACK_ALLOCATION_INFORMATION;
struct _APPCATEGORYINFO;
struct _MOUSE_EVENT_RECORD;
struct _WINDOW_BUFFER_SIZE_RECORD;
struct _INPUT_RECORD;
struct _SE_SET_FILE_CACHE_ORIGIN_CLAIM_INFORMATION;
struct _SYSTEM_WORKINGSET_ENTRY;
struct _KAFFINITY_ENUMERATION_CONTEXT;
struct _OSVERSIONINFOEXW;
struct _OBJECTID;
union _userSTGMEDIUM::_STGMEDIUM_UNION::__MIDL_IAdviseSink_0003;
struct _userSTGMEDIUM::_STGMEDIUM_UNION;
union _userHMETAFILE::__MIDL_IWinTypes_0004;
struct _userHMETAFILE;
struct _BYTE_BLOB;
struct _userHENHMETAFILE;
struct tagEMROFFSETCLIPRGN;
struct IInitActivationPropertiesIn;
union _userHBITMAP::__MIDL_IWinTypes_0007;
struct _userHBITMAP;
struct _userBITMAP;
union _userHPALETTE::__MIDL_IWinTypes_0008;
struct _userHPALETTE;
struct _PLUGPLAY_CONTROL_INSTALL_DATA;
struct _RPC_HTTP_TRANSPORT_CREDENTIALS_V3_A;
struct _userHGLOBAL;
struct _CRYPT_CONTEXT_CONFIG;
struct _SYSTEM_POOLTAG;
struct _SYSTEM_POOLTAG_INFORMATION;
struct _OCSP_BASIC_REVOKED_INFO;
struct wistd::__lazy_and_impl<1>;
struct _PROCESS_COMBINE_SECURITY_DOMAINS_INFORMATION;
struct _AUTHENTICODE_EXTRA_CERT_CHAIN_POLICY_PARA;
struct wistd::__make_unsigned<long,1>;
struct _WOW64_CONTEXT;
struct _CMS_DH_KEY_INFO;
struct IStubManagerDisconnect;
struct _SYSTEM_MANDATORY_LABEL_ACE;
struct SYSTEM_POWER_CAPABILITIES;
struct AsyncIPipeLong;
struct _CM_PCCARD_DEVICE_DATA;
struct IMarshalSomeone;
struct _SYSTEM_ELAM_CERTIFICATE_INFORMATION;
struct _CM_DISK_GEOMETRY_DEVICE_DATA;
struct _RTL_QUERY_REGISTRY_TABLE;
struct IProxyServerIdentity;
struct ISyncAdvise;
struct DedicatedAllocator<DISPATCH_SERVER_FRAME>;
struct _CERT_AUTHORITY_KEY_ID2_INFO;
struct _CERT_POLICY_QUALIFIER_NOTICE_REFERENCE;
class CUnknown;
struct _IMAGE_CHPE_RANGE_ENTRY;
struct _THREAD_UMS_INFORMATION;
struct _KEY_LAYER_INFORMATION;
struct _REFS_STREAM_SNAPSHOT_MANAGEMENT_INPUT_BUFFER;
class MAP<XSLOCK,MAP_KEY_GUID,INTERFACE_HELPER_CLSID *>;
struct $_s__RTTIBaseClassArray$_extraBytes_24;
class CLimitedWritableStorage::SetElementTimes::__l2::<lambda_14b25aaf0db7771cb0bb6bcb1052a1a0>;
struct $_TypeDescriptor$_extraBytes_27;
class MAP<XSLOCK,MAP_KEY_GUID,NdrTypeInfo *>;
struct _FILE_REGION_INPUT;
class CLimitedStreamBase::Read::__l2::<lambda_1bddd38f1c2c61820f0511b0dcb5aeed>;
struct _OBJECT_BASIC_INFORMATION;
struct _CONTAINER_VOLUME_STATE;
struct _REMOTE_NAME_INFOA;
struct ImplementationHelpersDetails::IsUuidOfAnyHelper<>;
struct _ITEM_INFO;
struct std::_Atomic_integral_facade<long>;
struct _JOBOBJECT_CONTAINER_IDENTIFIER_V2;
struct _SCRUB_DATA_INPUT;
struct IActivationPropOutClean;
struct _RTL_HEAP_PARAMETERS;
struct _SSL_F12_EXTRA_CERT_CHAIN_POLICY_STATUS;
class AdHocInterceptor<ISearchProtocol>;
struct _RTL_SEGMENT_HEAP_VA_CALLBACKS;
class CAggregatable<AdHocInterceptor<IElementBehavior>,InterfaceList<AdHocInterceptorForwarders<IElementBehavior,IElementBehavior>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> >,InterfaceList<> >::CInner;
class CAggregatable<AdHocInterceptor<IElementBehavior>,InterfaceList<AdHocInterceptorForwarders<IElementBehavior,IElementBehavior>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> >,InterfaceList<> >;
struct IElementBehaviorSite;
struct AggregatableDetails::DeriveIUnknownIfEmpty<InterfaceList<AdHocInterceptorForwarders<IElementBehavior,IElementBehavior>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> > >;
struct IInterfaceRelated;
struct _SERVICE_FAILURE_ACTIONS_FLAG;
struct _FILE_ALLOCATION_INFORMATION;
struct _FILE_PIPE_CLIENT_PROCESS_BUFFER;
struct ICallFrame;
struct _CMSG_CNG_CONTENT_DECRYPT_INFO;
struct RPC_IMPORT_CONTEXT_P;
struct _MARK_HANDLE_INFO;
struct IInternetBindInfo;
struct _MEMORYSTATUS;
struct _RTL_BSD_ITEM;
struct _LEAP_SECOND_DATA_REGISTRY_ENTRY;
struct tagMONITORINFO;
struct _RTL_CRITICAL_SECTION_DEBUG32;
struct JOBOBJECT_NET_RATE_CONTROL_INFORMATION;
struct _POWER_USER_PRESENCE;
union IMAGE_ARM64_RUNTIME_FUNCTION_ENTRY_XDATA;
struct _OPERATION_START_PARAMETERS;
struct _tagBINDINFO;
struct _RTLP_HEAP_SERIALIZED_MAPPING;
struct _DEVICE_DATA_SET_RANGE;
struct _currencyfmtW;
struct _OBJECT_HANDLE_FLAG_INFORMATION;
struct IRpcHelper;
struct _SYSTEM_HYPERVISOR_QUERY_INFORMATION;
struct _SYSTEM_PLATFORM_BINARY_INFORMATION;
class CLimitedWritableStorage::CreateStorage::__l2::<lambda_301f3587bff926b4515b80b83f6cb3c1>;
class CLinkable;
struct _DEVICE_MANAGE_DATA_SET_ATTRIBUTES;
struct ANON_OBJECT_HEADER;
struct timespec;
struct _RTL_RESOURCE;
struct _AUTHENTICODE_TS_EXTRA_CERT_CHAIN_POLICY_PARA;
class Microsoft::WRL::ComPtr<IInterceptorBase>;
struct _IMAGE_ARM64EC_METADATA;
struct _SYSTEM_SECUREBOOT_PLATFORM_MANIFEST_INFORMATION;
class CLimitedStreamBase::LockRegion::__l2::<lambda_40922ab18465b876057f1185cc36db8e>;
struct tagLOGBRUSH;
class wil::details::<lambda_afb6b96a417bace253e89dfd48515382>;
struct tagMENUGETOBJECTINFO;
struct _ENUM_SERVICE_STATUS_PROCESSA;
struct AllocateThrow;
class CReadOnlyStorage::CopyTo::__l11::<lambda_43780e76f89b37287b17c05597560ff1>;
struct tagCOMBOBOXINFO;
struct __MIDL___MIDL_itf_wtypes_0000_0001_0001;
class HashWSTR;
struct _TOKEN_BNO_ISOLATION_INFORMATION;
class HashGUID;
struct _RPC_SECURITY_QOS_V3_W;
struct __MIDL_ICallFrame_0002;
struct MAP_SHARED<MAP_KEY_GUID,MD_INTERFACE *>;
struct _CERT_ECC_SIGNATURE;
struct _SHFILEOPSTRUCTA;
struct INTERPRETER_FLAGS;
struct MAP_HASHER<MAP_KEY_GUID>;
union _FOUR_PART_VERSION;
class OleDragDropTracing::Instance::__l2::<lambda_56826768d7de29d088611d7a51e75d86>;
struct _LUNICODE_STRING;
struct _LBLOB;
struct _MEMORY_BAD_IDENTITY_INFORMATION;
struct _RTL_UNLOAD_EVENT_TRACE;
struct _MEMORY_PARTITION_DEDICATED_MEMORY_OPEN_INFORMATION;
struct _CERT_SYSTEM_STORE_INFO;
struct _POWER_SESSION_TIMEOUTS;
struct _SYSTEM_INTERRUPT_STEERING_INFORMATION_OUTPUT;
class AdHocCallFrame<IOleInPlaceObjectWindowless,<lambda_de8aae3bf856bab3be50d4e660b6e6f6> >;
struct _CRYPT_CONTEXT_FUNCTION_PROVIDERS;
class CLimitedEnum<IEnumFORMATETC,tagFORMATETC>::Next::__l2::<lambda_67bd47486a8986df7d6cb4f09c809e77>;
class AdHocCallFrame<IOleInPlaceObject,<lambda_9f5ff7c0875bbd6db2722caf2496ccad> >;
struct _SYSTEM_MEMORY_USAGE_INFORMATION;
class AdHocCallFrame<IOleInPlaceObject,<lambda_4ca0b07237b8f95da55952ce2c79cfa1> >;
struct _PLUGPLAY_CONTROL_CONFLICT_DATA;
struct IOleInPlaceActiveObject;
struct PPM_WMI_PERF_STATES_EX;
struct _CM_FULL_RESOURCE_DESCRIPTOR;
struct _CM_RESOURCE_LIST;
struct _CRYPT_BLOB_ARRAY;
class CAggregatable<AdHocInterceptor<IPersistPropertyBag>,InterfaceList<AdHocInterceptorForwarders<IPersistPropertyBag,IPersistPropertyBag>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> >,InterfaceList<> >::CInner;
class CAggregatable<AdHocInterceptor<IPersistPropertyBag>,InterfaceList<AdHocInterceptorForwarders<IPersistPropertyBag,IPersistPropertyBag>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> >,InterfaceList<> >;
struct _EXTENT_READ_CACHE_INFO_BUFFER;
struct tagRemSTGMEDIUM;
class CLimitedWritableStorage::CopyTo::__l8::<lambda_715367da935c5581b17c1a3be965339d>;
class AdHocInterceptorForwarders<IPersistPropertyBag,IPersistPropertyBag>::Load::__l2::<lambda_202f74d2f2aaa89b3b4034f4f0d0d4a4>;
struct _SYSTEM_OBJECT_INFORMATION;
class CDragOperation::IsDropAllowed::__l2::<lambda_f16c171f4a25340757779972fb9deba3>;
class AdHocCallFrame<IPersistPropertyBag,<lambda_f62c6972a04c90594c2afef0651ebd10> >;
struct _FILE_IOSTATUSBLOCK_RANGE_INFORMATION;
struct _CERT_KEY_ATTRIBUTES_INFO;
struct _FILE_IO_COMPLETION_NOTIFICATION_INFORMATION;
struct _CERT_PRIVATE_KEY_VALIDITY;
union _ASSEMBLY_STORAGE_MAP_RESOLUTION_CALLBACK_DATA;
struct _NV_MEMORY_RANGE;
struct tagRAWINPUTDEVICE;
struct _XSTATE_CONTEXT;
struct _IMAGE_COFF_SYMBOLS_HEADER;
struct _XSAVE_AREA;
class AdHocInterceptorForwarders<IOleInPlaceObject,IOleInPlaceObject>;
struct _FILE_END_OF_FILE_INFO;
class AdHocCallFrame<IOleInPlaceObject,<lambda_8cabb7dbc03479911dce050d042462ba> >;
class CLimitedWritableStorage::Revert::__l2::<lambda_828ba3180f084769e3a35cd5c8d78af3>;
class AdHocInterceptorForwarders<IOleWindow,IOleInPlaceObject>;
struct _HV_DETAILS;
class CWrapperBase<IStream>::{dtor}::__l2::<lambda_857927a93fbdbf954257c5a12af5e448>;
class AdHocCallFrame<IOleInPlaceObject,<lambda_6c7999a0825145bb8114241691193a37> >;
struct _FILE_LINK_INFORMATION;
struct IComCatalogLocation;
struct _CRYPT_DECRYPT_MESSAGE_PARA;
struct pvalueW;
struct _SERVICE_DELAYED_AUTO_START_INFO;
struct _CERT_X942_DH_VALIDATION_PARAMS;
struct _CMSG_KEY_AGREE_ENCRYPT_INFO;
struct DeriveInterfaces<InterfaceList<AdHocInterceptorForwarders<IOleWindow,IOleWindow>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> > >;
struct _CMSG_KEY_AGREE_KEY_ENCRYPT_INFO;
class AdHocCallFrame<IOleWindow,<lambda_92c1c2c09ef3e1efce6163781ee57e61> >;
struct _SYSTEM_ACTIVITY_MODERATION_INFO;
struct _PROCESS_FOREGROUND_BACKGROUND;
struct AggregatableDetails::DeriveIUnknownIfEmpty<InterfaceList<AdHocInterceptorForwarders<IOleWindow,IOleWindow>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> > >;
struct _CERT_NAME_VALUE;
struct _CONTAINER_ROOT_INFO_INPUT;
struct _FILE_DISPOSITION_INFORMATION_EX;
class CWrapperBase<IEnumSTATSTG>::{dtor}::__l2::<lambda_8f13d703fe13c76f69ce08951bcc75b5>;
struct SimpleQIHelper<CAggregatable<AdHocInterceptor<IOleInPlaceObjectWindowless>,InterfaceList<AdHocInterceptorForwarders<IOleInPlaceObjectWindowless,IOleInPlaceObjectWindowless>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> >,InterfaceList<> >,InterfaceList<AdHocInterceptorForwarders<IOleInPlaceObjectWindowless,IOleInPlaceObjectWindowless>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> > >;
struct _ENLISTMENT_BASIC_INFORMATION;
struct _SYSTEM_HYPERVISOR_BOOT_PAGES_INFORMATION;
struct _MEMORY_PARTITION_ATTRIBUTE_INFORMATION;
struct _SYSDBG_IO_SPACE;
struct _ENUM_FLAG_SIZED_INTEGER<enum _FS_BPIO_OUTFLAGS>;
struct _SYSTEM_INFO;
struct _RTL_IMAGE_MITIGATION_SEHOP_POLICY;
struct _RTL_VERIFIER_ALL_INFORMATION;
struct _RTL_CRITICAL_SECTION_DEBUG64;
struct std::_Atomic_storage<unsigned long,4>;
struct tagDROPSTRUCT;
struct DeriveInterfaceDelegators<CAggregatable<AdHocInterceptor<IElementBehavior>,InterfaceList<AdHocInterceptorForwarders<IElementBehavior,IElementBehavior>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> >,InterfaceList<> >::CInner,InterfaceList<> >;
struct _XSAVE_CET_U_FORMAT;
class CLimitedWritableStorage::CreateStream::__l2::<lambda_9248f5e097f132b19a75522d4d896069>;
struct std::_Atomic_integral<unsigned long,4>;
struct ITimeAndNoticeControl;
class AdHocCallFrame<IElementBehavior,<lambda_d914c7f54183b33a257332a7d99c0d41> >;
struct std::_Atomic_integral_facade<unsigned long>;
struct _BCRYPT_MULTI_OBJECT_LENGTH_STRUCT;
struct _SYSTEM_WRITE_CONSTRAINT_INFORMATION;
struct tagRECONVERTSTRING;
struct SYSTEM_BATTERY_STATE;
struct _SHFILEOPSTRUCTW;
class CReadOnlyStorage::Stat::__l2::<lambda_9ee25847ed46d519a0f8b2a7b76ad1cb>;
struct _SPARSE_OVERALLOCATE_DATA;
struct tagEMRPOLYTEXTOUTA;
struct SimpleQIHelper<CAggregatable<AdHocInterceptor<IElementBehavior>,InterfaceList<AdHocInterceptorForwarders<IElementBehavior,IElementBehavior>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> >,InterfaceList<> >,InterfaceList<AdHocInterceptorForwarders<IElementBehavior,IElementBehavior>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> > >;
struct _SYSTEM_ALARM_CALLBACK_ACE;
struct _ENUM_FLAG_SIZED_INTEGER<enum FILE_WRITE_FLAGS>;
struct _CMSG_CTRL_DECRYPT_PARA;
struct _RTL_IMAGE_MITIGATION_CHILD_PROCESS_POLICY;
class AdHocInterceptorForwarders<ISearchProtocol2,ISearchProtocol2>;
struct DeriveInterfaces<InterfaceList<AdHocInterceptorForwarders<ISearchProtocol2,ISearchProtocol2>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> > >;
class CReadOnlyStorage::EnumElements::__l2::<lambda_c2debb2788f3ef9f8ec79bcf639a9eba>;
class AdHocInterceptorForwarders<ISearchProtocol,ISearchProtocol2>;
struct _SCHANNEL_ALG;
struct _TIME_DYNAMIC_ZONE_INFORMATION;
struct ISearchProtocol;
struct DISPLAYCONFIG_ADAPTER_NAME;
struct _ACL_REVISION_INFORMATION;
struct _NOTIFYICONIDENTIFIER;
struct _RPC_TRANSFER_SYNTAX;
struct _FILE_INFORMATION_DEFINITION;
class AdHocCallFrame<ISearchProtocol,<lambda_202ebde2c4736aa82d78f43a76d480cf> >;
struct _PROCESS_WORKING_SET_CONTROL;
struct _FILE_ALLOCATION_INFO;
struct _CRYPT_SMIME_CAPABILITY;
class CWrapperBase<IUnknown>::{dtor}::__l2::<lambda_c819397f95c37f5ccdbe095601a61b25>;
class CLimitedWritableStorage::OpenStream::__l2::<lambda_d171dd235d7ccf127f18467165bcf888>;
struct _FILE_PROVIDER_EXTERNAL_INFO_V0;
struct tagCHANGEFILTERSTRUCT;
class AdHocCallFrame<ISearchProtocol,<lambda_ab7661f9106dbe63888238c0c4789392> >;
struct _SERVICE_TABLE_ENTRYW;
class Map<MAP_KEY_GUID,NdrTypeInfo *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>::Assoc;
struct _SYSTEM_IMAGE_FILE_EXECUTION_OPTIONS_INFORMATION;
struct _PROCESS_SECURITY_DOMAIN_INFORMATION;
struct _UNIVERSAL_NAME_INFOW;
class Microsoft::WRL::ComPtr<ITypeInfo>;
struct _MEMORY_SHARED_COMMIT_INFORMATION;
struct SimpleQIHelper<CAggregatable<AdHocInterceptor<ISearchProtocol>,InterfaceList<AdHocInterceptorForwarders<ISearchProtocol,ISearchProtocol>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> >,InterfaceList<> >::CInner,InterfaceList<> >;
struct _CRYPT_DECODE_PARA;
class CBrokeredClipDataObject::QueryGetData::__l8::<lambda_e5c40cffaeebcd7486ba9b9e983680d3>;
struct _CONSOLE_SCREEN_BUFFER_INFOEX;
struct _CMC_TAGGED_ATTRIBUTE;
struct _MANAGE_HOT_PATCH_QUERY_ACTIVE_PATCHES;
class Microsoft::WRL::ComPtr<NdrTypeInfo>;
struct _WIN32_STREAM_ID;
struct _div_t;
struct _SYSTEM_KERNEL_VA_SHADOW_INFORMATION;
class CDragOperation::RuntimeClassInitialize::__l69::<lambda_702d43245a365bbf444b64ed9d04c906>;
struct _TRANSACTION_ENLISTMENTS_INFORMATION;
class IntRegion<unsigned long,unsigned __int64>;
class SafeCastHelper<unsigned long,unsigned int,0>;
struct _CRYPT_TIMESTAMP_INFO;
class MAP<XSLOCK,MAP_KEY_GUID,INTERFACE_HELPER_CLSID *>::iterator;
class CTSmartPtr_PolicyComplete<CTContainer_PolicyLocalMem>;
class CLocalMemPtr<unsigned short>;
struct _SCOPE_TABLE_AMD64;
struct _SYSTEM_CALL_COUNT_INFORMATION;
struct _ALPC_PORT_ASSOCIATE_COMPLETION_PORT;
struct threadlocaleinfostruct;
struct _FILE_STANDARD_INFORMATION_EX;
struct _ENCRYPTION_KEY_CTRL_INPUT;
struct _FSCTL_OFFLOAD_READ_OUTPUT;
struct IInternetHostSecurityManager;
class wil::details::<lambda_0fc8029a6791e39f2db3c508b91189aa>;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<INotARealInterface> >;
struct _CERT_GENERAL_SUBTREE;
struct _SYSTEM_HYPERVISOR_DETAIL_INFORMATION;
struct CDragOperation::IsDropAllowed::__l2::PolicyArguments;
struct tagTTPOLYGONHEADER;
struct _CMSG_CTRL_ADD_SIGNER_UNAUTH_ATTR_PARA;
union _JOBOBJECT_ENERGY_TRACKING_STATE;
struct _WIM_PROVIDER_CONTROL_INTEGRITY;
struct _CRYPT_SIGN_MESSAGE_PARA;
struct _MUTANT_OWNER_INFORMATION;
struct SimpleQIHelper<CAggregatable<AdHocInterceptor<IPersist>,InterfaceList<AdHocInterceptorForwarders<IPersist,IPersist>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> >,InterfaceList<> >,InterfaceList<AdHocInterceptorForwarders<IPersist,IPersist>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> > >;
struct SimpleQIHelper<CAggregatable<AdHocInterceptor<ISearchProtocol>,InterfaceList<AdHocInterceptorForwarders<ISearchProtocol,ISearchProtocol>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> >,InterfaceList<> >,InterfaceList<> >;
class wil::details::FeatureStateManager::EnsureSubscribedToProcessWideUsageFlushUnderLock::__l5::<lambda_152aa9d2a3a0648fa2fa7fcef514b376>;
struct _CRL_FIND_ISSUED_FOR_PARA;
struct SimpleQIHelper<CAggregatable<AdHocInterceptor<IOleInPlaceObjectWindowless>,InterfaceList<AdHocInterceptorForwarders<IOleInPlaceObjectWindowless,IOleInPlaceObjectWindowless>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> >,InterfaceList<> >,InterfaceList<> >;
struct _TXFS_GET_TRANSACTED_VERSION;
struct _SQM_STREAM_ENTRY_EX;
struct _CERT_BIOMETRIC_DATA;
struct _SYSTEM_WORKLOAD_ALLOWED_CPU_SET_INFORMATION;
struct _RTL_CRITICAL_SECTION32;
struct tagEMRFRAMERGN;
struct _CRYPT_VERIFY_MESSAGE_PARA;
struct _NTFS_STATISTICS_EX;
struct Windows::ApplicationModel::Internal::DataTransfer::IClipboardPolicyStatics;
struct _SYSTEM_PROCESSOR_PERFORMANCE_STATE_DISTRIBUTION;
struct _SYSTEM_DPC_BEHAVIOR_INFORMATION;
struct _FILE_DISPOSITION_INFO_EX;
struct _ENUM_FLAG_SIZED_INTEGER<enum AddPackageDependencyOptions>;
struct _BCRYPT_OID_LIST;
class CDefClassFactory;
struct _SID_AND_ATTRIBUTES_HASH;
struct tagOLEPRESSTMHDR;
struct _BCRYPT_OAEP_PADDING_INFO;
struct MEM_EXTENDED_PARAMETER;
struct _WIM_PROVIDER_SUSPEND_OVERLAY_INPUT;
struct _SYSTEM_KERNEL_DEBUGGER_INFORMATION_EX;
struct _X86_NT5_CONTEXT;
struct _exception;
struct tagSCROLLBARINFO;
struct HRGN__;
struct _SYSTEM_LOW_PRIORITY_IO_INFORMATION;
struct _FILESYSTEM_STATISTICS_EX;
struct _CMC_TAGGED_OTHER_MSG;
union _PROCESS_LOGGING_INFORMATION;
struct _SYSTEM_SESSION_MAPPED_VIEW_INFORMATION;
struct _BCRYPT_KEY_BLOB;
struct tagEMRANGLEARC;
struct _RESUME_PERFORMANCE;
struct _RTL_DEBUG_INFORMATION;
struct _PROCESS_BASIC_INFORMATION64;
struct _PROCESS_EXTENDED_BASIC_INFORMATION64;
class ScheduleClipboardWorkWithPLM::__l2::<lambda_0400965d427fb7c7c2a6231862b780df>;
struct _POWER_THROTTLING_THREAD_STATE;
struct _RTL_SPARSE_BITMAP_RANGE;
struct _KERNEL_USER_TIMES;
struct _CTL_USAGE_MATCH;
struct _ENUM_FLAG_SIZED_INTEGER<enum CreatePackageDependencyOptions>;
struct IXMLDOMProcessingInstruction;
struct AsyncIAdviseSink;
struct _SYSTEM_ORIGINAL_IMAGE_FEATURE_INFORMATION_OUTPUT;
class Windows::Foundation::Collections::Internal::NaiveSplitView<HSTRING__ *,IInspectable *,Windows::Foundation::Collections::Internal::DefaultEqualityPredicate<HSTRING__ *>,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<HSTRING__ *>,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<IInspectable *>,Windows::Foundation::Collections::Internal::DefaultHashMapOptions<HSTRING__ *,IInspectable *,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<HSTRING__ *> > >::Lookup::__l5::<lambda_e2e96e51e42edcad6b3668af4a803eaf>;
struct _CMC_ADD_ATTRIBUTES_INFO;
struct _REARRANGE_FILE_DATA;
struct _SEMAPHORE_BASIC_INFORMATION;
struct XLOCK_LEAF;
struct LEGACY_INTERCEPTOR;
struct tagMSGBOXPARAMSW;
class GenericInstantiator<DISPATCH_INTERCEPTOR>;
struct _PLUGPLAY_CONTROL_RELATED_DEVICE_DATA;
struct _REFS_STREAM_SNAPSHOT_LIST_OUTPUT_BUFFER;
struct _RTL_IMAGE_POLICY_METADATA;
struct _MEMORY_BASIC_INFORMATION32;
struct _CSV_QUERY_FILE_REVISION;
struct _CSV_QUERY_MDS_PATH_V2;
struct ImplementationHelpersDetails::IsUuidOfAnyInterfaceInListHelper<InterfaceList<> >;
struct _INCREMENTAL_ACCESS_INFO;
struct _SHARED_VIRTUAL_DISK_SUPPORT;
class AdHocInterceptor<ISearchProtocol2>;
struct _FILE_FS_FULL_SIZE_INFORMATION_EX;
struct _RTL_VERIFIER_FAULT_INJECTIONS_INFORMATION;
struct _SYSTEM_PROCESSOR_IDLE_CYCLE_TIME_INFORMATION;
struct _BCryptBuffer;
struct tagEMRSETVIEWPORTORGEX;
struct _CRYPT_ENCRYPT_MESSAGE_PARA;
struct _MAT2;
struct _RPC_SECURITY_QOS_V5_W;
struct tagEMRCREATEPALETTE;
struct wil::details::variable_size<1>;
struct _ALPC_BASIC_INFORMATION;
struct _FILE_SFIO_RESERVE_INFORMATION;
struct _ENUM_FLAG_SIZED_INTEGER<enum _MACHINE_ATTRIBUTES>;
struct _RTL_PHYSICAL_MEMORY_INFO;
struct _MEMORY_PARTITION_INITIAL_ADD_INFORMATION;
struct _CRL_ISSUING_DIST_POINT;
struct tagPOINTER_TYPE_INFO;
struct ITypeMarshal;
struct IUriContainer;
struct _CRYPT_HASH_INFO;
struct _FILE_LEVEL_TRIM_OUTPUT;
struct _FSCTL_QUERY_REGION_INFO_INPUT;
struct PACKAGE_INFO;
struct _RTL_FEATURE_USAGE_SUBSCRIPTION_TABLE;
struct _FILE_ID_INFO;
struct _TEB_ACTIVE_FRAME_EX;
struct _NCRYPT_VSM_KEY_ATTESTATION_CLAIM_RESTRICTIONS;
struct _SYSTEM_POOL_ZEROING_INFORMATION;
struct _IMAGE_DEBUG_DIRECTORY;
struct _currencyfmtA;
struct tagRPC_CALL_ATTRIBUTES_V1_A;
class CALLFRAME_CACHE_ENTRY<NdrTypeInfo>;
struct _DUPLICATE_CLUSTER_DATA;
struct _MEMORY_PARTITION_NODE_INFORMATION;
struct _REMOTE_NAME_INFOW;
struct _RTL_HEAP_TAG_INFO;
struct SERVICE_STATUS_HANDLE__;
struct _CMC_ADD_EXTENSIONS_INFO;
struct _DISPATCHER_CONTEXT;
struct IAbandonmentNotification;
struct _BCRYPT_DSA_PARAMETER_HEADER_V2;
struct _SE_SET_FILE_CACHE_INFORMATION;
struct _LDR_DATA_TABLE_ENTRY64;
struct DeriveInterfaceDelegators<CAggregatable<AdHocInterceptor<IPersistPropertyBag>,InterfaceList<AdHocInterceptorForwarders<IPersistPropertyBag,IPersistPropertyBag>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> >,InterfaceList<> >::CInner,InterfaceList<> >;
struct _VIRTUAL_STORAGE_SET_BEHAVIOR_INPUT;
struct _tagPROTOCOLDATA;
struct _SYSTEM_THREAD_CID_PRIORITY_INFORMATION;
struct DeriveInterfaceDelegators<CAggregatable<AdHocInterceptor<IOleInPlaceObject>,InterfaceList<AdHocInterceptorForwarders<IOleInPlaceObject,IOleInPlaceObject>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> >,InterfaceList<> >::CInner,InterfaceList<> >;
struct wistd::__libcpp_is_integral<signed char>;
struct wistd::__libcpp_is_integral<unsigned short>;
struct wistd::__make_signed<int,1>;
struct wistd::__type_list<unsigned char,wistd::__type_list<unsigned short,wistd::__type_list<unsigned int,wistd::__type_list<unsigned long,wistd::__type_list<unsigned __int64,wistd::__nat> > > > >;
struct wistd::__make_unsigned<unsigned int,1>;
struct wistd::__make_unsigned<short,1>;
struct wistd::__is_nullptr_t_impl<std::nullptr_t>;
class AdHocInterceptorForwarders<IOleWindow,IOleInPlaceObject>::GetWindow::__l2::<lambda_a07c95792dcef3326839cb72fdfd78fd>;
struct wistd::__libcpp_is_floating_point<long double>;
struct wistd::__type_list<signed char,wistd::__type_list<short,wistd::__type_list<int,wistd::__type_list<long,wistd::__type_list<__int64,wistd::__nat> > > > >;
struct wistd::is_scalar<std::nullptr_t>;
struct wistd::__make_signed<unsigned short,1>;
struct wistd::__libcpp_is_void<void>;
struct wistd::is_class<int>;
struct wistd::__two;
struct wistd::__make_signed<__int64,1>;
struct wistd::__libcpp_is_integral<unsigned __int64>;
struct DeriveInterfaceDelegators<CAggregatable<AdHocInterceptor<IOleInPlaceObjectWindowless>,InterfaceList<AdHocInterceptorForwarders<IOleInPlaceObjectWindowless,IOleInPlaceObjectWindowless>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> >,InterfaceList<> >::CInner,InterfaceList<> >;
struct wistd::__make_signed<unsigned __int64,1>;
struct wistd::__libcpp_is_integral<unsigned char>;
struct wistd::__extract_key_fail_tag;
struct wistd::__make_unsigned<__int64,1>;
struct wistd::__numeric_type<void>;
struct wistd::__extract_key_self_tag;
struct wistd::__libcpp_is_integral<char>;
struct wistd::__libcpp_is_integral<short>;
struct _MIDL_WINRT_TYPE_SERIALIZATION_INFO;
struct _CM_EISA_FUNCTION_INFORMATION;
struct SimpleQIHelper<CAggregatable<AdHocInterceptor<IElementBehavior>,InterfaceList<AdHocInterceptorForwarders<IElementBehavior,IElementBehavior>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> >,InterfaceList<> >::CInner,InterfaceList<> >;
struct _RTL_RVA_LIST_ITERATOR;
struct IHTMLElement;
struct tagIMEMENUITEMINFOW;
struct tagACCESSTIMEOUT;
struct _SYSTEM_HOT_PATCH_REGISTRY_VALUE;
struct _RTL_SPARSE_BITMAP_RUN;
struct _CFG_CALL_TARGET_LIST_INFORMATION;
struct value_entA;
struct _GDI_NONREMOTE;
struct _DWORD_BLOB;
struct _FILE_PATH;
struct _SL_HWID_DEVICE_INFO;
struct _VOLUME_REFS_INFO_BUFFER;
struct AggregatableDetails::DeriveIUnknownIfEmpty<InterfaceList<AdHocInterceptorForwarders<ISearchProtocol,ISearchProtocol>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> > >;
struct _SYSTEM_EXCEPTION_INFORMATION;
struct pvalueA;
class AdHocCallFrame<ISearchProtocol,<lambda_c3d9c36ff6c5e276434071298f6b4b2c> >;
struct _FILE_ID_EXTD_BOTH_DIR_INFORMATION;
struct _PROCESS_TLS_INFORMATION;
struct _RTL_BITMAP_RUN;
struct _RTL_CIRCULAR_LIST_HEAD;
class AdHocCallFrame<ISearchProtocol,<lambda_c0fa3d92ef3684ffb99dddd895e07e56> >;
struct _KEY_CONTROL_FLAGS_INFORMATION;
struct _SYSTEM_ACPI_AUDIT_INFORMATION;
struct _RTL_ENCLAVE_LAUNCH_TOKEN;
struct _VARIABLE_NAME;
struct tagTOUCHINPUT;
struct _ALPC_DIRECT_ATTR;
struct tagSTRINGBINDING;
struct _CERT_NAME_CONSTRAINTS_INFO;
struct tagEMRNAMEDESCAPE;
struct _RTL_SEGMENT_HEAP_MEMORY_SOURCE;
struct _RTL_SEGMENT_HEAP_PARAMETERS;
struct _BCRYPT_KEY_DATA_BLOB_HEADER;
struct _KEY_NODE_INFORMATION;
struct _RSAPUBKEY;
struct _FP_IEEE_RECORD;
struct _SYSTEM_CONSOLE_INFORMATION;
struct _SYSTEM_POWER_INFORMATION;
struct _TP_ALPC;
struct _REFS_QUERY_VOLUME_DEDUP_INFO_OUTPUT_BUFFER;
struct _PO_WAKE_SOURCE_TIMER;
struct tagEMREXTESCAPE;
struct _MANAGEDAPPLICATION;
struct std::_Floating_type_traits<float>;
struct std::_Make_signed2<4>;
struct _OCSP_RESPONSE_INFO;
struct std::_Invoker_pmf_object;
struct std::_Invoker_pmd_pointer;
struct std::minus<void>;
struct _EXTENDED_CREATE_INFORMATION_32;
struct std::_Select<0>;
struct std::_Floating_type_traits<double>;
struct std::_Make_unsigned2<1>;
struct _THREAD_LAST_SYSCALL_INFORMATION;
struct _ENUM_FLAG_SIZED_INTEGER<enum JOB_OBJECT_NET_RATE_CONTROL_FLAGS>;
struct ICreateErrorInfo;
struct __NCRYPT_PCP_HMAC_AUTH_SIGNATURE_INFO;
struct _PLUGPLAY_CUSTOM_NOTIFICATION;
struct _DPC_WATCHDOG_GLOBAL_TRIAGE_BLOCK;
struct _SYSTEM_PROCESSOR_PERFORMANCE_INFORMATION;
struct PROCESSOR_IDLESTATE_POLICY;
struct _JOBOBJECT_BASIC_PROCESS_ID_LIST;
struct _CRYPT_ENROLLMENT_NAME_VALUE_PAIR;
struct _USER_MARSHAL_CB;
struct _CTL_VERIFY_USAGE_PARA;
struct _SYSTEM_SESSION_POOLTAG_INFORMATION;
struct _FILE_MAILSLOT_QUERY_INFORMATION;
struct _numberfmtA;
struct _TRANSACTION_NOTIFICATION;
struct tagEMRSETPALETTEENTRIES;
struct _tagSOFTDISTINFO;
struct _DEDUP_QUERY_FILE_HASHES_INPUT_BUFFER;
struct tagMONITORINFOEXA;
struct _DOCINFOW;
struct tagMOUSEKEYS;
struct _POWER_SESSION_ALLOW_EXTERNAL_DMA_DEVICES;
struct _RTLP_HEAP_STACK_TRACE_SERIALIZATION_HEADER;
struct _TRANSACTION_PROPERTIES_INFORMATION;
struct _CMSG_KEY_TRANS_ENCRYPT_INFO;
struct _wfinddata64i32_t;
struct _FILE_STREAM_INFO;
struct _CM_VIDEO_DEVICE_DATA;
struct _INITIAL_TEB;
struct _MEMORY_ENCLAVE_IMAGE_INFORMATION;
struct _WOF_EXTERNAL_FILE_ID;
struct _FSCTL_QUERY_STORAGE_CLASSES_OUTPUT;
struct _REFS_VOLUME_COUNTER_INFO_INPUT_BUFFER;
struct _CRYPT_URL_INFO;
union _userCLIPFORMAT::__MIDL_IWinTypes_0001;
struct _userCLIPFORMAT;
struct tagMULTIKEYHELPW;
struct _BOOT_OPTIONS;
struct _SYSTEM_FEATURE_CONFIGURATION_SECTIONS_REQUEST;
struct _ENUM_FLAG_SIZED_INTEGER<enum _SE_SAFE_OPEN_PROMPT_EXPERIENCE_RESULTS>;
struct _MEMORY_COMBINE_INFORMATION;
struct _RTL_UMS_CONTEXT;
struct tagNMHDR;
struct _RTL_UMS_COMPLETION_LIST;
struct _SYSTEM_INTERRUPT_CPU_SET_INFORMATION;
struct _PLUGPLAY_CONTROL_STATUS_DATA;
struct tagWTSSESSION_NOTIFICATION;
struct _CRYPT_IMAGE_REG;
struct _CERT_DSS_PARAMETERS;
struct _LOOKUP_STREAM_FROM_CLUSTER_ENTRY;
struct _JOBOBJECT_PAGE_PRIORITY_LIMIT;
struct _TXFS_ROLLFORWARD_REDO_INFORMATION;
struct _FILE_QUOTA_INFORMATION;
struct _OCSP_REQUEST_INFO;
struct IStdMarshalInfo;
struct _CRYPT_TIMESTAMP_CONTEXT;
struct _OCSP_REQUEST_ENTRY;
struct _SYSTEM_SYSTEM_DISK_INFORMATION;
struct _PLUGPLAY_CONTROL_USER_RESPONSE_DATA;
struct _RTL_USER_PROCESS_EXTENDED_PARAMETERS;
struct _KEY_VALUE_LAYER_INFORMATION;
struct DISPLAYCONFIG_TARGET_BASE_TYPE;
struct _RTL_IMAGE_MITIGATION_USER_SHADOW_STACK_POLICY;
struct __PUBLIC_OBJECT_TYPE_INFORMATION;
struct _RTL_RETPOLINE_ROUTINES;
struct tagCWPSTRUCT;
struct _IMAGE_RESOURCE_DIRECTORY;
struct _FILE_QUERY_ON_DISK_VOL_INFO_BUFFER;
struct _ENUM_FLAG_SIZED_INTEGER<enum DIALOG_DPI_CHANGE_BEHAVIORS>;
struct _PROCESS_DYNAMIC_FUNCTION_TABLE_INFORMATION;
struct _IO_STATUS_BLOCK32;
struct _JOBOBJECT_EXTENDED_ACCOUNTING_INFORMATION;
struct _RTL_HANDLE_TABLE;
struct _NCRYPT_CIPHER_PADDING_INFO;
struct tagEMREXTTEXTOUTA;
struct _CMC_DATA_INFO;
struct _ACTIVATION_CONTEXT_SECTION_KEYED_DATA;
struct _ACTIVATION_CONTEXT_DATA_ASSEMBLY_INFORMATION;
struct NET_ADDRESS_INFO_;
struct wil::details::variable_size<2>;
struct tagNC_ADDRESS;
struct _CM_EISA_SLOT_INFORMATION;
struct _SYSTEM_ENCLAVE_LAUNCH_CONTROL_INFORMATION;
struct _FILE_REMOTE_PROTOCOL_INFO;
struct _MEMORYSTATUSEX;
struct _PACKAGE_INFO_REFERENCE;
struct _SYSTEM_FEATURE_CONFIGURATION_SECTIONS_INFORMATION;
struct BITMAPV4HEADER;
struct HMONITOR__;
struct _SYSTEM_MEMORY_INFORMATION;
struct _PLEX_READ_DATA_REQUEST;
struct _SYSTEM_MANUFACTURING_INFORMATION;
struct _FILE_STORAGE_RESERVE_ID_INFORMATION;
struct _SYSTEM_SUPPORTED_PROCESSOR_ARCHITECTURES_INFORMATION;
struct _IMAGE_HOT_PATCH_INFO;
struct IProgressNotify;
struct _SE_IMPERSONATION_STATE;
struct USN_TRACK_MODIFIED_RANGES;
struct _TRANSACTION_NOTIFICATION_SAVEPOINT_ARGUMENT;
struct USN_RECORD_V2;
union USN_RECORD_UNION;
struct tagRemSNB;
struct MOVE_FILE_RECORD_DATA;
struct READ_FILE_USN_DATA;
struct POWER_STATE_HANDLER;
struct _FILE_LAYOUT_INFO_ENTRY;
struct PPM_WMI_IDLE_STATES;
struct IFastRundown;
struct PPM_IDLE_ACCOUNTING_EX;
struct PPM_PERFSTATE_EVENT;
struct PPM_THERMAL_POLICY_EVENT;
struct REFS_VOLUME_DATA_BUFFER;
struct _CRT_DOUBLE;
struct BITMAPV5HEADER;
struct FLASHWINFO;
struct _REASON_BUFFER;
struct RPC_INTERFACE_TEMPLATEA;
struct READ_USN_JOURNAL_DATA_V0;
struct _SYSTEM_SET_TIME_ADJUST_INFORMATION;
struct _FILE_LINK_ENTRY_FULL_ID_INFORMATION;
struct _JOBOBJECT_CPU_RATE_CONTROL_INFORMATION;
struct _PARSE_MESSAGE_CONTEXT;
struct _CPS_URLS;
struct _FILE_IS_REMOTE_DEVICE_INFORMATION;
struct _PROCESS_KEEPALIVE_COUNT_INFORMATION;
struct _THREAD_PROFILING_INFORMATION;
struct BSMINFO;
struct _CMSG_CONTENT_ENCRYPT_INFO;
struct _CMSG_RECIPIENT_ENCODE_INFO;
struct _CMSG_KEY_AGREE_RECIPIENT_ENCODE_INFO;
struct _SYSTEM_DEVICE_DATA_INFORMATION;
struct _RTL_HEAP_STACK_CONTROL;
struct _PUBKEYVER3;
struct _MESSAGE_RESOURCE_ENTRY;
struct _CMSG_CMS_RECIPIENT_INFO;
struct _RPC_HTTP_TRANSPORT_CREDENTIALS_V2_W;
struct _IMAGE_RESOURCE_DATA_ENTRY;
struct _TOKEN_USER_CLAIMS;
struct _FILE_ALLOCATED_RANGE_BUFFER;
struct _IMAGE_CHPE_METADATA_X86;
struct _FILE_MEMORY_PARTITION_INFORMATION;
struct _T2_SET_PARAMETERS_V0;
struct tagMSGBOXPARAMSA;
struct _CRYPT_VERIFY_CERT_SIGN_STRONG_PROPERTIES_INFO;
struct _CTL_FIND_USAGE_PARA;
struct _CRYPTNET_URL_CACHE_RESPONSE_INFO;
struct _SYSTEM_FILECACHE_INFORMATION;
struct tagRemHPALETTE;
struct _SERVICE_DESCRIPTIONA;
struct _CERT_TPM_SPECIFICATION_INFO;
struct IWinInetHttpInfo;
struct _RTL_PROTECTED_ACCESS;
struct _IMAGE_NT_HEADERS;
struct JOBOBJECT_IO_RATE_CONTROL_INFORMATION;
struct _SYSDBG_CONTROL_SPACE;
struct _FILE_ID_INFORMATION;
struct _SHRINK_VOLUME_INFORMATION;
struct _MIDL_INTERCEPTION_INFO;
struct tagCOMPOSITIONFORM;
struct _CERT_AUTHORITY_KEY_ID_INFO;
struct _MEMORY_EXHAUSTION_INFORMATION;
struct _CRYPT_CONTENT_INFO;
struct _FILE_ATTRIBUTE_TAG_INFO;
struct _CMSG_STREAM_INFO;
struct tagPELARRAY;
struct _ALPC_TOKEN_ATTR;
struct _RTL_VERIFIER_RUNTIME_FLAGS_INFORMATION;
struct _ENUM_FLAG_SIZED_INTEGER<enum _RTL_RESOURCE_POLICY_FLAGS>;
struct _RTL_BACKOFF;
struct _SYSTEM_REGISTRY_QUOTA_INFORMATION;
struct _MEMORY_SCRUB_INFORMATION;
struct tagCOLORMATCHTOTARGET;
struct _BCRYPT_DSA_KEY_BLOB_V2;
struct _CRYPT_AES_128_KEY_STATE;
struct _IMAGE_HOT_PATCH_HASHES;
struct _PROCESS_FIBER_SHADOW_STACK_ALLOCATION_INFORMATION;
struct tagPOLYTEXTA;
struct _WIN32_MEMORY_RANGE_ENTRY;
struct _RTL_IMAGE_MITIGATION_FONT_DISABLE_POLICY;
struct tagEMRGRADIENTFILL;
struct tagEMRARC;
struct _FILE_ID_EXTD_DIR_INFORMATION;
struct _SYSTEM_XFG_FAILURE_INFORMATION;
struct _KEY_VALUE_PARTIAL_INFORMATION;
struct _CSV_SET_VOLUME_ID;
struct _PS_CPU_QUOTA_SET_INFORMATION;
struct _Real_widened<float,float>;
struct _SYSTEM_NET_RATE_CONTROL_SET_CONTEXT;
struct _SYSTEM_MEMORY_LIST_INFORMATION;
struct _FILE_DESIRED_STORAGE_CLASS_INFORMATION;
struct tagOIFI;
struct _CERT_NAME_INFO;
struct _MEMORY_WORKING_SET_EX_INFORMATION;
struct tagTITLEBARINFOEX;
struct _PAGE_PRIORITY_INFORMATION;
struct _IO_ERROR_LOG_MESSAGE;
struct NTFS_VOLUME_DATA_BUFFER;
struct _SYSTEM_PROCESSOR_PROFILE_CONTROL_AREA;
struct _SCONTEXT_QUEUE;
struct _CERT_ACCESS_DESCRIPTION;
struct _ENUM_FLAG_INTEGER_FOR_SIZE<2>;
struct _PROCESS_WAKE_INFORMATION;
struct _VM_COUNTERS;
struct _TOKEN_OWNER;
struct _APPLICATIONLAUNCH_SETTING_VALUE;
struct _SYSDBG_MSR;
struct _CERT_REGISTRY_STORE_ROAMING_PARA;
struct _TPP_THREAD_DATA_CALLBACK;
struct _PLUGPLAY_CONTROL_DEVICE_INTERFACE_ENABLED;
struct _RTL_DISK_WRITE_CONSTRAINT_INFO;
struct _SYSTEM_ROOT_SILO_INFORMATION;
struct IGetCatalogObject;
struct ISCMProcessControl;
struct _RPC_BINDING_HANDLE_TEMPLATE_V1_A;
struct _OSVERSIONINFOEXA;
struct _CERT_BASIC_CONSTRAINTS2_INFO;
struct tagOXID_INFO;
struct _POWER_IDLE_RESILIENCY;
struct _SERVICE_TRIGGER_INFO;
struct _CRYPT_ECC_PRIVATE_KEY_INFO;
struct _FILE_GET_QUOTA_INFORMATION;
struct _ALPC_HANDLE_ATTR;
struct _RPC_PROTSEQ_VECTORA;
struct PPM_WMI_PERF_STATES;
struct _GET_FILTER_FILE_IDENTIFIER_INPUT;
struct _TOKEN_SID_INFORMATION;
struct _ALPC_MESSAGE_HANDLE_INFORMATION;
struct _CRYPT_SMART_CARD_ROOT_INFO;
struct _IMAGE_ENCLAVE_CONFIG64;
struct tagCANDIDATEFORM;
struct _FILE_NETWORK_OPEN_INFORMATION;
struct _IMAGE_LOAD_CONFIG_DIRECTORY32;
struct _SYSTEM_ALARM_CALLBACK_OBJECT_ACE;
struct _CRYPT_PASSWORD_CREDENTIALSA;
struct _LDR_RESLOADER_RET;
struct tagWNDCLASSA;
struct _RTL_IMAGE_MITIGATION_SYSTEM_CALL_DISABLE_POLICY;
struct ISupportErrorInfo;
struct _CM_SONIC_DEVICE_DATA;
struct _SYSTEM_SECUREBOOT_INFORMATION;
struct tagEMRSELECTOBJECT;
struct _PROCESS_WS_WATCH_INFORMATION_EX;
struct _ImageArchitectureEntry;
struct _REG_NOTIFY_INFORMATION;
struct _FILE_MAILSLOT_PEEK_BUFFER;
struct _IO_SESSION_CONNECT_INFO;
struct _PROV_ENUMALGS_EX;
struct _PROCESS_MITIGATION_SEHOP_POLICY;
struct _RTL_USER_PROCESS_INFORMATION;
struct _FILE_SYSTEM_RECOGNITION_INFORMATION;
struct _FILE_MAKE_COMPATIBLE_BUFFER;
struct _APPCATEGORYINFOLIST;
struct _FILE_IO_COMPLETION_INFORMATION;
struct _SYSTEM_DIF_VOLATILE_INFORMATION;
struct tagEMRPIXELFORMAT;
struct _SYSTEM_PHYSICAL_MEMORY_INFORMATION;
struct _FILE_SET_DEFECT_MGMT_BUFFER;
struct _FILE_KNOWN_FOLDER_INFORMATION;
struct SChannelHookCallInfo;
struct _SYSTEM_PROCESSOR_MICROCODE_UPDATE_INFORMATION;
struct _NETWORK_APP_INSTANCE_EA;
union _float_val;
struct _JOB_SET_ARRAY;
struct tagSOAP_ACTIVATION_INFO;
struct CORRELATION_VECTOR;
struct _SYSTEM_FLAGS_INFORMATION;
struct _RTL_UNLOAD_EVENT_TRACE32;
struct _BOOT_ENTROPY_NT_RESULT;
struct _LCN_WEAK_REFERENCE_BUFFER;
struct tagRID_DEVICE_INFO_HID;
struct tagRID_DEVICE_INFO;
struct _WORKER_FACTORY_BASIC_INFORMATION;
struct HFONT__;
struct _SYSTEM_INTERRUPT_STEERING_INFORMATION_INPUT;
struct _ENCLAVE_INIT_INFO_VBS;
struct _JOBOBJECT_SECURITY_LIMIT_INFORMATION;
struct BREAK_ON_STATUS_BUFFER;
struct USN_JOURNAL_DATA_V2;
struct FIND_BY_SID_DATA;
struct JOBOBJECT_IO_RATE_CONTROL_INFORMATION_NATIVE;
struct _MEMORY_BASIC_INFORMATION64;
struct _THREAD_TEB_INFORMATION;
struct tagCLEANLOCALSTORAGE;
struct _X86_CALL_FRAME;
struct _SERVICE_CONTROL_STATUS_REASON_PARAMSA;
struct _SERVICE_START_REASON;
struct _UMS_SCHEDULER_STARTUP_INFO;
struct ANON_OBJECT_HEADER_V2;
struct _VIRTUALIZATION_INSTANCE_INFO_OUTPUT;
struct _MANAGE_WRITES_TO_EXECUTABLE_MEMORY;
struct _CRYPT_CREDENTIALS;
struct _FILE_FS_SECTOR_SIZE_INFORMATION;
struct _ARM64EC_NT_CONTEXT;
struct _WORD_BLOB;
struct tagEMRSETPIXELV;
struct _ACCESS_DENIED_CALLBACK_ACE;
struct _CONSOLE_READCONSOLE_CONTROL;
struct _QUERY_STORAGE_RESERVE_OUTPUT;
struct _ABC;
struct _DEDUP_CHUNK_INFORMATION_HASH32;
struct tagEMRSETWORLDTRANSFORM;
struct _tagPROTOCOL_ARGUMENT;
struct __crt_locale_data_public;
struct _CERT_CHAIN;
struct _BCRYPT_DSA_KEY_BLOB;
struct _DUPLICATE_EXTENTS_DATA_EX32;
struct tagEMRSTRETCHDIBITS;
struct _SYSTEM_SPECIAL_POOL_INFORMATION;
struct _TXFS_LIST_TRANSACTION_LOCKED_FILES;
struct HWINSTA__;
struct _FILE_LINKS_INFORMATION;
struct tagMINIMIZEDMETRICS;
struct tagHIGHCONTRASTA;
struct tagEMRELLIPSE;
union _PROCESS_SYSTEM_RESOURCE_MANAGEMENT;
struct _KEY_FLAGS_INFORMATION;
struct HSYNTHETICPOINTERDEVICE__;
struct _KNONVOLATILE_CONTEXT_POINTERS_ARM64;
struct _THREAD_CYCLE_TIME_INFORMATION;
struct __BCRYPT_KEY_LENGTHS_STRUCT;
struct _ACCESS_ALLOWED_CALLBACK_OBJECT_ACE;
struct _RESOURCEMANAGER_BASIC_INFORMATION;
struct _RTL_FEATURE_CONFIGURATION_TABLE;
struct tagGLYPHSET;
struct _ENUM_FLAG_INTEGER_FOR_SIZE<8>;
struct _QUERY_SERVICE_CONFIGA;
struct tagEMRFORMAT;
struct PROCESSOR_PERFSTATE_POLICY;
struct tagREGISTERWORDA;
struct _CM_INT13_DRIVE_PARAMETER;
struct _RPC_BINDING_HANDLE_SECURITY_V1_W;
struct _CERT_KEY_USAGE_RESTRICTION_INFO;
struct COPYFILE2_EXTENDED_PARAMETERS_V2;
struct _RTL_RETPOLINE_RELOCATION_INDEX;
struct IXMLDOMCharacterData;
struct tagGCP_RESULTSA;
struct _CERT_PHYSICAL_STORE_INFO;
struct _DUPLICATE_EXTENTS_DATA32;
struct COPYFILE2_EXTENDED_PARAMETERS;
struct _AVRF_MEMORY_RANGE;
struct _SYSTEM_PROCESSOR_PERFORMANCE_DISTRIBUTION;
struct CONFIRMSAFETY;
struct _LDOUBLE;
struct wil::details::variable_size<4>;
struct wil::details::variable_size<8>;
struct wil::variadic_logical_or<>;
struct _LCN_WEAK_REFERENCE_CREATE_INPUT_BUFFER;
struct _FILE_LINKS_FULL_ID_INFORMATION;
struct _CERT_OR_CRL_BUNDLE;
struct DISK_SPACE_INFORMATION;
struct _MEMORY_REGION_INFORMATION;
struct DPI_AWARENESS_CONTEXT__;
class HashVoidPtr;
struct __MIDL_ICallFrame_0004;
class MAP<XSLOCK,MAP_KEY_GUID,MD_INTERFACE *>::iterator;
struct NDR_PROC_HEADER_EXTS64;
struct _timespec64;
struct std::_Atomic_integral<long,4>;
struct _TIMEOUT_INFO;
struct SimpleQIHelper<CAggregatable<AdHocInterceptor<ISearchProtocol>,InterfaceList<AdHocInterceptorForwarders<ISearchProtocol,ISearchProtocol>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> >,InterfaceList<> >,InterfaceList<AdHocInterceptorForwarders<ISearchProtocol,ISearchProtocol>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> > >;
struct SimpleQIHelper<CAggregatable<AdHocInterceptor<IOleInPlaceObjectWindowless>,InterfaceList<AdHocInterceptorForwarders<IOleInPlaceObjectWindowless,IOleInPlaceObjectWindowless>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> >,InterfaceList<> >::CInner,InterfaceList<> >;
class AdHocInterceptorForwarders<IOleInPlaceObjectWindowless,IOleInPlaceObjectWindowless>::OnWindowMessage::__l2::<lambda_cebf49c479c4b51a7dc8538f3542eaf8>;
struct AggregatableDetails::DeriveIUnknownIfEmpty<InterfaceList<AdHocInterceptorForwarders<IPersistPropertyBag,IPersistPropertyBag>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> > >;
struct SimpleQIHelper<CAggregatable<AdHocInterceptor<IPersistPropertyBag>,InterfaceList<AdHocInterceptorForwarders<IPersistPropertyBag,IPersistPropertyBag>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> >,InterfaceList<> >,InterfaceList<AdHocInterceptorForwarders<IPersistPropertyBag,IPersistPropertyBag>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> > >;
class AdHocInterceptorForwarders<IPersist,IPersistPropertyBag>::GetClassID::__l2::<lambda_121ff239fc219aa2df927c67d0376548>;
struct DeriveInterfaceDelegators<CAggregatable<AdHocInterceptor<IOleWindow>,InterfaceList<AdHocInterceptorForwarders<IOleWindow,IOleWindow>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> >,InterfaceList<> >::CInner,InterfaceList<> >;
struct SimpleQIHelper<CAggregatable<AdHocInterceptor<IPersist>,InterfaceList<AdHocInterceptorForwarders<IPersist,IPersist>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> >,InterfaceList<> >,InterfaceList<Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> > >;
struct SimpleQIHelper<CAggregatable<AdHocInterceptor<ISearchProtocol2>,InterfaceList<AdHocInterceptorForwarders<ISearchProtocol2,ISearchProtocol2>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> >,InterfaceList<> >,InterfaceList<Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> > >;
struct SimpleQIHelper<CAggregatable<AdHocInterceptor<IElementBehavior>,InterfaceList<AdHocInterceptorForwarders<IElementBehavior,IElementBehavior>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> >,InterfaceList<> >,InterfaceList<> >;
struct SimpleQIHelper<CAggregatable<AdHocInterceptor<ISearchProtocol2>,InterfaceList<AdHocInterceptorForwarders<ISearchProtocol2,ISearchProtocol2>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> >,InterfaceList<> >,InterfaceList<> >;
class CStmBuf;
class CDAHolder;
class CFrameFilter;
struct tagWIN16METAFILEPICT;
class CProperty;
struct FCR;
class CPropertySet;
struct tagFORMATIDOFFSET;
class GetCastMethod<unsigned long,unsigned __int64>;
union __m128;
struct wil::details::close_invoke_helper<1,void (__cdecl*)(_TOKEN_LINKED_TOKEN *) noexcept,&wil::details::CloseTokenLinkedToken,_TOKEN_LINKED_TOKEN *>;
struct GetTypeValueImpl<long,enum LoadOrFreeWhy,unsigned long>;
struct CFont::Save::__l2::FONTDATA;

typedef struct _IMAGE_RESOURCE_DIRECTORY_ENTRY
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long NameOffset : 31; /* bit position: 0 */
      /* 0x0000 */ unsigned long NameIsString : 1; /* bit position: 31 */
    }; /* bitfield */
    /* 0x0000 */ unsigned long Name;
    /* 0x0000 */ unsigned short Id;
  }; /* size: 0x0004 */
  union
  {
    /* 0x0004 */ unsigned long OffsetToData;
    struct /* bitfield */
    {
      /* 0x0004 */ unsigned long OffsetToDirectory : 31; /* bit position: 0 */
      /* 0x0004 */ unsigned long DataIsDirectory : 1; /* bit position: 31 */
    }; /* bitfield */
  }; /* size: 0x0004 */
} IMAGE_RESOURCE_DIRECTORY_ENTRY, *PIMAGE_RESOURCE_DIRECTORY_ENTRY; /* size: 0x0008 */

typedef enum __scrt_module_type
{
  dll = 0,
  exe = 1,
} _scrt_module_type, *P_scrt_module_type;

struct IPicture2
{
}; /* size: 0x0008 */

class Microsoft::WRL::ComPtr<IApplicationAssociationRegistration>
{
  /* 0x0000 */ struct IApplicationAssociationRegistration* ptr_;
}; /* size: 0x0008 */

typedef enum _NT_PRODUCT_TYPE
{
  NtProductWinNt = 1,
  NtProductLanManNt = 2,
  NtProductServer = 3,
} NT_PRODUCT_TYPE, *PNT_PRODUCT_TYPE;

union std::_Align_type<double,72>
{
  union
  {
    /* 0x0000 */ double _Val;
    /* 0x0000 */ char _Pad[72];
  }; /* size: 0x0048 */
}; /* size: 0x0048 */

enum DISPLAYCONFIG_SCANLINE_ORDERING
{
  DISPLAYCONFIG_SCANLINE_ORDERING_UNSPECIFIED = 0,
  DISPLAYCONFIG_SCANLINE_ORDERING_PROGRESSIVE = 1,
  DISPLAYCONFIG_SCANLINE_ORDERING_INTERLACED = 2,
  DISPLAYCONFIG_SCANLINE_ORDERING_INTERLACED_UPPERFIELDFIRST = 2,
  DISPLAYCONFIG_SCANLINE_ORDERING_INTERLACED_LOWERFIELDFIRST = 3,
  DISPLAYCONFIG_SCANLINE_ORDERING_FORCE_UINT32 = -1,
};

class allocateExtra_t
{
}; /* size: 0x0001 */

typedef enum _PNP_QUERY_RELATION
{
  PnpQueryEjectRelations = 0,
  PnpQueryRemovalRelations = 1,
  PnpQueryPowerRelations = 2,
  PnpQueryBusRelations = 3,
  PnpQueryTransportRelations = 4,
  MaxPnpQueryRelations = 5,
} PNP_QUERY_RELATION, *PPNP_QUERY_RELATION;

class CLimitedWritableStorage::Stat::__l2::<lambda_c61124bf9311369ccd740ead4f8d81ee>
{
  /* 0x0000 */ class CLimitedWritableStorage* const __this;
  /* 0x0008 */ struct tagSTATSTG*& pstatstg;
  /* 0x0010 */ unsigned long& grfStatFlag;
}; /* size: 0x0018 */

class wil::details::StoredCallContextInfo
{
  /* 0x0000 */ long Padding_0[6];
  /* 0x0018 */ BOOL m_ownsMessage;
}; /* size: 0x0020 */

enum wil::FailureType
{
  Exception = 0,
  Return = 1,
  Log = 2,
  FailFast = 3,
};

enum wil::FailureFlags
{
  None = 0,
  RequestFailFast = 1,
  RequestSuppressTelemetry = 2,
  RequestDebugBreak = 4,
  NtStatus = 8,
};

struct wil::CallContextInfo
{
  /* 0x0000 */ long contextId;
  /* 0x0004 */ long Padding_1;
  /* 0x0008 */ const char* contextName;
  /* 0x0010 */ const wchar_t* contextMessage;
}; /* size: 0x0018 */

struct wil::FailureInfo
{
  /* 0x0000 */ enum wil::FailureType type;
  /* 0x0004 */ enum wil::FailureFlags flags;
  /* 0x0008 */ HRESULT hr;
  /* 0x000c */ long status;
  /* 0x0010 */ long failureId;
  /* 0x0014 */ long Padding_2;
  /* 0x0018 */ const wchar_t* pszMessage;
  /* 0x0020 */ unsigned long threadId;
  /* 0x0024 */ long Padding_3;
  /* 0x0028 */ const char* pszCode;
  /* 0x0030 */ const char* pszFunction;
  /* 0x0038 */ const char* pszFile;
  /* 0x0040 */ unsigned int uLineNumber;
  /* 0x0044 */ int cFailureCount;
  /* 0x0048 */ const char* pszCallContext;
  /* 0x0050 */ struct wil::CallContextInfo callContextOriginating;
  /* 0x0068 */ struct wil::CallContextInfo callContextCurrent;
  /* 0x0080 */ const char* pszModule;
  /* 0x0088 */ void* returnAddress;
  /* 0x0090 */ void* callerReturnAddress;
}; /* size: 0x0098 */

class wil::details::shared_buffer
{
  /* 0x0000 */ long* m_pCopy;
  /* 0x0008 */ unsigned __int64 m_size;
}; /* size: 0x0010 */

class wil::StoredFailureInfo
{
  /* 0x0000 */ struct wil::FailureInfo m_failureInfo;
  /* 0x0098 */ class wil::details::shared_buffer m_spStrings;
}; /* size: 0x00a8 */

typedef struct _RTL_SRWLOCK
{
  /* 0x0000 */ void* Ptr;
} RTL_SRWLOCK, *PRTL_SRWLOCK; /* size: 0x0008 */

class wil::srwlock
{
  /* 0x0000 */ struct _RTL_SRWLOCK m_lock;
}; /* size: 0x0008 */

class wil::ActivityBase<DragDropLogging,1,70368744177664,5,33554432,_TlgReflectorTag_Param0IsProviderType>::ActivityData<DragDropLogging,_TlgReflectorTag_Param0IsProviderType>
{
  /* 0x0000 */ long Padding_4[10];
  /* 0x0028 */ class wil::details::StoredCallContextInfo m_callContext;
  /* 0x0048 */ int m_stopCountExpected;
  /* 0x004c */ HRESULT m_result;
  /* 0x0050 */ class wil::StoredFailureInfo m_failure;
  /* 0x00f8 */ class wil::srwlock m_lock;
}; /* size: 0x0100 */

struct wil::details::shared_object<wil::ActivityBase<DragDropLogging,1,70368744177664,5,33554432,_TlgReflectorTag_Param0IsProviderType>::ActivityData<DragDropLogging,_TlgReflectorTag_Param0IsProviderType> >::RefAndObject
{
  /* 0x0000 */ long m_refCount;
  /* 0x0004 */ long Padding_5;
  /* 0x0008 */ class wil::ActivityBase<DragDropLogging,1,70368744177664,5,33554432,_TlgReflectorTag_Param0IsProviderType>::ActivityData<DragDropLogging,_TlgReflectorTag_Param0IsProviderType> m_object;
}; /* size: 0x0108 */

enum JOB_OBJECT_NET_RATE_CONTROL_FLAGS
{
  JOB_OBJECT_NET_RATE_CONTROL_ENABLE = 1,
  JOB_OBJECT_NET_RATE_CONTROL_MAX_BANDWIDTH = 2,
  JOB_OBJECT_NET_RATE_CONTROL_DSCP_TAG = 4,
  JOB_OBJECT_NET_RATE_CONTROL_VALID_FLAGS = 7,
};

typedef struct _RTL_RB_TREE
{
  /* 0x0000 */ struct _RTL_BALANCED_NODE* Root;
  union
  {
    /* 0x0008 */ unsigned char Encoded : 1; /* bit position: 0 */
    /* 0x0008 */ struct _RTL_BALANCED_NODE* Min;
  }; /* size: 0x0008 */
} RTL_RB_TREE, *PRTL_RB_TREE; /* size: 0x0010 */

struct tagCAUUID
{
  /* 0x0000 */ unsigned long cElems;
  /* 0x0004 */ long Padding_6;
  /* 0x0008 */ struct _GUID* pElems;
}; /* size: 0x0010 */

struct Windows::Foundation::Collections::IIterator_impl<Windows::UI::WindowId,0>
{
}; /* size: 0x0008 */

enum JOB_OBJECT_IO_RATE_CONTROL_FLAGS
{
  JOB_OBJECT_IO_RATE_CONTROL_ENABLE = 1,
  JOB_OBJECT_IO_RATE_CONTROL_STANDALONE_VOLUME = 2,
  JOB_OBJECT_IO_RATE_CONTROL_FORCE_UNIT_ACCESS_ALL = 4,
  JOB_OBJECT_IO_RATE_CONTROL_FORCE_UNIT_ACCESS_ON_SOFT_CAP = 8,
  JOB_OBJECT_IO_RATE_CONTROL_VALID_FLAGS = 15,
};

struct Windows::Foundation::Collections::IIterable_impl<__int64>
{
}; /* size: 0x0008 */

struct wistd::__libcpp_is_integral<long>
{
}; /* size: 0x0001 */

enum wil::details::PendingCallbackCancellationBehavior
{
  Cancel = 0,
  Wait = 1,
  NoWait = 2,
};

struct IXMLDOMImplementation
{
}; /* size: 0x0008 */

struct Windows::Foundation::Internal::AggregateType<bool,unsigned char>;

typedef enum _USER_ACTIVITY_PRESENCE
{
  PowerUserPresent = 0,
  PowerUserNotPresent = 1,
  PowerUserInactive = 2,
  PowerUserMaximum = 3,
  PowerUserInvalid = 3,
} USER_ACTIVITY_PRESENCE, *PUSER_ACTIVITY_PRESENCE;

class wil::details::unique_storage<wil::details::handle_invalid_resource_policy<int (__cdecl*)(void *),&FindCloseChangeNotification> >
{
  /* 0x0000 */ void* m_ptr;
}; /* size: 0x0008 */

class Microsoft::WRL::ComPtr<Windows::Foundation::Collections::IIterator<Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,IInspectable *> *> >
{
  /* 0x0000 */ struct Windows::Foundation::Collections::IIterator<Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,IInspectable *> *>* ptr_;
}; /* size: 0x0008 */

enum ReplacesCorHdrNumericDefines
{
  COMIMAGE_FLAGS_ILONLY = 1,
  COMIMAGE_FLAGS_32BITREQUIRED = 2,
  COMIMAGE_FLAGS_IL_LIBRARY = 4,
  COMIMAGE_FLAGS_STRONGNAMESIGNED = 8,
  COMIMAGE_FLAGS_NATIVE_ENTRYPOINT = 16,
  COMIMAGE_FLAGS_TRACKDEBUGDATA = 0x10000,
  COMIMAGE_FLAGS_32BITPREFERRED = 0x20000,
  COR_VERSION_MAJOR_V2 = 2,
  COR_VERSION_MAJOR = 2,
  COR_VERSION_MINOR = 5,
  COR_DELETED_NAME_LENGTH = 8,
  COR_VTABLEGAP_NAME_LENGTH = 8,
  NATIVE_TYPE_MAX_CB = 1,
  COR_ILMETHOD_SECT_SMALL_MAX_DATASIZE = 255,
  IMAGE_COR_MIH_METHODRVA = 1,
  IMAGE_COR_MIH_EHRVA = 2,
  IMAGE_COR_MIH_BASICBLOCK = 8,
  COR_VTABLE_32BIT = 1,
  COR_VTABLE_64BIT = 2,
  COR_VTABLE_FROM_UNMANAGED = 4,
  COR_VTABLE_FROM_UNMANAGED_RETAIN_APPDOMAIN = 8,
  COR_VTABLE_CALL_MOST_DERIVED = 16,
  IMAGE_COR_EATJ_THUNK_SIZE = 32,
  MAX_CLASS_NAME = 1024,
  MAX_PACKAGE_NAME = 1024,
};

struct Windows::Foundation::ITypedEventHandler<Windows::System::UserWatcher *,IInspectable *>
{
}; /* size: 0x0008 */

class CClassMonikerFactory
{
}; /* size: 0x0010 */

typedef enum _TAG_UNNAMED_1
{
  value = 1,
} TAG_UNNAMED_1, *PTAG_UNNAMED_1;

class Microsoft::WRL::ComPtr<IWeakReference>
{
  /* 0x0000 */ struct IWeakReference* ptr_;
}; /* size: 0x0008 */

class Windows::Foundation::Collections::Internal::NaiveSplitView<HSTRING__ *,IInspectable *,Windows::Foundation::Collections::Internal::DefaultEqualityPredicate<HSTRING__ *>,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<HSTRING__ *>,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<IInspectable *>,Windows::Foundation::Collections::Internal::DefaultHashMapOptions<HSTRING__ *,IInspectable *,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<HSTRING__ *> > >::Chunk
{
  /* 0x0000 */ const unsigned int sc_uChunkMax;
  /* 0x0004 */ long Padding_7;
  /* 0x0008 */ volatile long _uRefs;
  /* 0x000c */ unsigned int _uSize;
  /* 0x0010 */ struct Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,IInspectable *>* _apPairs[16];
}; /* size: 0x0090 */

typedef enum _TAG_UNNAMED_2
{
  _tlgLevelConst = 3,
} TAG_UNNAMED_2, *PTAG_UNNAMED_2;

struct std::once_flag
{
  /* 0x0000 */ void* _Opaque;
}; /* size: 0x0008 */

typedef struct _mpProp
{
  /* 0x0000 */ int dispid;
  /* 0x0004 */ long Padding_8;
  /* 0x0008 */ const wchar_t* szName;
} mpProp, *PmpProp; /* size: 0x0010 */

typedef enum _TP_CALLBACK_PRIORITY
{
  TP_CALLBACK_PRIORITY_HIGH = 0,
  TP_CALLBACK_PRIORITY_NORMAL = 1,
  TP_CALLBACK_PRIORITY_LOW = 2,
  TP_CALLBACK_PRIORITY_INVALID = 3,
  TP_CALLBACK_PRIORITY_COUNT = 3,
} TP_CALLBACK_PRIORITY, *PTP_CALLBACK_PRIORITY;

typedef union _LARGE_INTEGER
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned long LowPart;
      /* 0x0004 */ long HighPart;
    }; /* size: 0x0008 */
    struct
    {
      /* 0x0000 */ unsigned long LowPart;
      /* 0x0004 */ long HighPart;
    } /* size: 0x0008 */ u;
    /* 0x0000 */ __int64 QuadPart;
  }; /* size: 0x0008 */
} LARGE_INTEGER, *PLARGE_INTEGER; /* size: 0x0008 */

typedef struct _SECTIONBASICINFO
{
  /* 0x0000 */ void* BaseAddress;
  /* 0x0008 */ unsigned long AllocationAttributes;
  /* 0x000c */ long Padding_9;
  /* 0x0010 */ union _LARGE_INTEGER MaximumSize;
} SECTIONBASICINFO, *PSECTIONBASICINFO; /* size: 0x0018 */

struct IComProcessInfo2
{
}; /* size: 0x0008 */

class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IGlobalInterfaceTable> >
{
}; /* size: 0x0008 */

typedef enum __scrt_native_startup_state
{
  uninitialized = 0,
  initializing = 1,
  initialized = 2,
} _scrt_native_startup_state, *P_scrt_native_startup_state;

struct Windows::Foundation::Collections::IMap<unsigned int,IInspectable *>
{
}; /* size: 0x0008 */

typedef struct _WPP_TRACE_CONTROL_BLOCK
{
  /* 0x0000 */ struct _WPP_TRACE_CONTROL_BLOCK* Next;
  /* 0x0008 */ unsigned __int64 UmRegistrationHandle;
  union
  {
    /* 0x0010 */ unsigned __int64 Logger;
    /* 0x0010 */ struct _WPP_WIN2K_CONTROL_BLOCK* Win2kCb;
    /* 0x0010 */ void* Ptr;
    /* 0x0010 */ struct _WPP_TRACE_CONTROL_BLOCK* Cb;
  }; /* size: 0x0008 */
  /* 0x0018 */ unsigned char FlagsLen;
  /* 0x0019 */ unsigned char Level;
  /* 0x001a */ unsigned short Options;
  /* 0x001c */ unsigned long Flags[1];
  /* 0x0020 */ const struct _GUID* ControlGuid;
} WPP_TRACE_CONTROL_BLOCK, *PWPP_TRACE_CONTROL_BLOCK; /* size: 0x0028 */

struct Windows::Foundation::Collections::IIterator_impl<Windows::Foundation::Collections::IKeyValuePair<__int64,float> *,1>
{
}; /* size: 0x0008 */

enum ProcessToken::UserHiveOkState
{
  UserHiveOkStateNotDetermined = 0,
  UserHiveIsOk = 1,
  UserHiveIsNotOk = 2,
};

struct Windows::Foundation::Collections::IIterator_impl<Windows::Foundation::Point,1>
{
}; /* size: 0x0008 */

enum ISA_AVAILABILITY
{
  __ISA_AVAILABLE_X86 = 0,
  __ISA_AVAILABLE_SSE2 = 1,
  __ISA_AVAILABLE_SSE42 = 2,
  __ISA_AVAILABLE_AVX = 3,
  __ISA_AVAILABLE_ENFSTRG = 4,
  __ISA_AVAILABLE_AVX2 = 5,
  __ISA_AVAILABLE_AVX512 = 6,
  __ISA_AVAILABLE_ARMNT = 0,
  __ISA_AVAILABLE_NEON = 1,
  __ISA_AVAILABLE_NEON_ARM64 = 2,
};

struct Windows::Foundation::Collections::IIterable<Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,IInspectable *> *>
{
}; /* size: 0x0008 */

typedef enum _PSM_ACTIVATE_BACKGROUND_TYPE
{
  PsmActNotBackground = 0,
  PsmActMixedHost = 1,
  PsmActPureHost = 2,
  PsmActSystemHost = 3,
  PsmActInvalidType = 4,
} PSM_ACTIVATE_BACKGROUND_TYPE, *PPSM_ACTIVATE_BACKGROUND_TYPE;

typedef enum _TAG_UNNAMED_3
{
  _tlgLevelConst = 3,
} TAG_UNNAMED_3, *PTAG_UNNAMED_3;

class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,IInspectable *> > >
{
}; /* size: 0x0008 */

struct std::allocator_traits<std::allocator<unsigned short> >
{
}; /* size: 0x0001 */

struct Windows::Foundation::Internal::AggregateType<Windows::Storage::FileProperties::StorageItemThumbnail *,Windows::Storage::Streams::IRandomAccessStreamWithContentType *>;

typedef enum _crt_argv_mode
{
  _crt_argv_no_arguments = 0,
  _crt_argv_unexpanded_arguments = 1,
  _crt_argv_expanded_arguments = 2,
} crt_argv_mode, *Pcrt_argv_mode;

typedef struct _MODLOAD_DATA
{
  /* 0x0000 */ unsigned long ssize;
  /* 0x0004 */ unsigned long ssig;
  /* 0x0008 */ void* data;
  /* 0x0010 */ unsigned long size;
  /* 0x0014 */ unsigned long flags;
} MODLOAD_DATA, *PMODLOAD_DATA; /* size: 0x0018 */

typedef struct _FILE_MOVE_CLUSTER_INFORMATION
{
  /* 0x0000 */ unsigned long ClusterCount;
  /* 0x0004 */ long Padding_10;
  /* 0x0008 */ void* RootDirectory;
  /* 0x0010 */ unsigned long FileNameLength;
  /* 0x0014 */ wchar_t FileName[1];
  /* 0x0016 */ char __PADDING__[2];
} FILE_MOVE_CLUSTER_INFORMATION, *PFILE_MOVE_CLUSTER_INFORMATION; /* size: 0x0018 */

typedef enum _EXCEPTION_DISPOSITION
{
  ExceptionContinueExecution = 0,
  ExceptionContinueSearch = 1,
  ExceptionNestedException = 2,
  ExceptionCollidedUnwind = 3,
} EXCEPTION_DISPOSITION, *PEXCEPTION_DISPOSITION;

struct SimpleQIHelper<CAggregatable<AdHocInterceptor<IOleInPlaceObject>,InterfaceList<AdHocInterceptorForwarders<IOleInPlaceObject,IOleInPlaceObject>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> >,InterfaceList<> >,InterfaceList<AdHocInterceptorForwarders<IOleInPlaceObject,IOleInPlaceObject>,Microsoft::WRL::ChainInterfaces<ICallInterceptor,ICallIndirect,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil> > >
{
}; /* size: 0x0001 */

struct Windows::Foundation::Collections::IVector<unsigned int>
{
}; /* size: 0x0008 */

typedef enum _TAG_UNNAMED_4
{
  value = 1,
} TAG_UNNAMED_4, *PTAG_UNNAMED_4;

class COleCache::CCacheViewImpl
{
}; /* size: 0x0008 */

class XWinRT::XHashMap<HSTRING__ *,IInspectable *,Windows::Foundation::Collections::Internal::HashMap<HSTRING__ *,IInspectable *,Windows::Foundation::Collections::Internal::DefaultHash<HSTRING__ *>,Windows::Foundation::Collections::Internal::DefaultEqualityPredicate<HSTRING__ *>,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<HSTRING__ *>,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<IInspectable *>,Windows::Foundation::Collections::Internal::DefaultHashMapOptions<HSTRING__ *,IInspectable *,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<HSTRING__ *> > >::KeyTraits,XWinRT::CElementTraits<IInspectable *> >
{
  /* 0x0000 */ void* m_pOwner;
  /* 0x0008 */ class XWinRT::XHashMap<HSTRING__ *,IInspectable *,Windows::Foundation::Collections::Internal::HashMap<HSTRING__ *,IInspectable *,Windows::Foundation::Collections::Internal::DefaultHash<HSTRING__ *>,Windows::Foundation::Collections::Internal::DefaultEqualityPredicate<HSTRING__ *>,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<HSTRING__ *>,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<IInspectable *>,Windows::Foundation::Collections::Internal::DefaultHashMapOptions<HSTRING__ *,IInspectable *,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<HSTRING__ *> > >::KeyTraits,XWinRT::CElementTraits<IInspectable *> >::CNode** m_ppBins;
  /* 0x0010 */ unsigned __int64 m_nElements;
  /* 0x0018 */ unsigned int m_nBins;
  /* 0x001c */ float m_fOptimalLoad;
  /* 0x0020 */ float m_fLoThreshold;
  /* 0x0024 */ float m_fHiThreshold;
  /* 0x0028 */ unsigned __int64 m_nHiRehashThreshold;
  /* 0x0030 */ unsigned __int64 m_nLoRehashThreshold;
  /* 0x0038 */ unsigned long m_nLockCount;
  /* 0x003c */ unsigned int m_nBlockSize;
  /* 0x0040 */ struct XWinRT::XPlex* m_pBlocks;
  /* 0x0048 */ class XWinRT::XHashMap<HSTRING__ *,IInspectable *,Windows::Foundation::Collections::Internal::HashMap<HSTRING__ *,IInspectable *,Windows::Foundation::Collections::Internal::DefaultHash<HSTRING__ *>,Windows::Foundation::Collections::Internal::DefaultEqualityPredicate<HSTRING__ *>,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<HSTRING__ *>,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<IInspectable *>,Windows::Foundation::Collections::Internal::DefaultHashMapOptions<HSTRING__ *,IInspectable *,Windows::Foundation::Collections::Internal::DefaultLifetimeTraits<HSTRING__ *> > >::KeyTraits,XWinRT::CElementTraits<IInspectable *> >::CNode* m_pFree;
}; /* size: 0x0050 */

typedef enum _PS_ATTRIBUTE_NUM
{
  PsAttributeParentProcess = 0,
  PsAttributeDebugObject = 1,
  PsAttributeToken = 2,
  PsAttributeClientId = 3,
  PsAttributeTebAddress = 4,
  PsAttributeImageName = 5,
  PsAttributeImageInfo = 6,
  PsAttributeMemoryReserve = 7,
  PsAttributePriorityClass = 8,
  PsAttributeErrorMode = 9,
  PsAttributeStdHandleInfo = 10,
  PsAttributeHandleList = 11,
  PsAttributeGroupAffinity = 12,
  PsAttributePreferredNode = 13,
  PsAttributeIdealProcessor = 14,
  PsAttributeUmsThread = 15,
  PsAttributeMitigationOptions = 16,
  PsAttributeProtectionLevel = 17,
  PsAttributeSecureProcess = 18,
  PsAttributeJobList = 19,
  PsAttributeChildProcessPolicy = 20,
  PsAttributeAllApplicationPackagesPolicy = 21,
  PsAttributeWin32kFilter = 22,
  PsAttributeSafeOpenPromptOriginClaim = 23,
  PsAttributeBnoIsolation = 24,
  PsAttributeDesktopAppPolicy = 25,
  PsAttributeChpe = 26,
  PsAttributeMitigationAuditOptions = 27,
  PsAttributeMachineType = 28,
  PsAttributeComponentFilter = 29,
  PsAttributeEnableOptionalXStateFeatures = 30,
  PsAttributeMax = 31,
} PS_ATTRIBUTE_NUM, *PPS_ATTRIBUTE_NUM;

struct std::_Fake_allocator
{
}; /* size: 0x0001 */

class wil::details::<lambda_6dd96684479744ebc07fc6b2d83b999d>
{
}; /* size: 0x0001 */

typedef enum _RTL_FEATURE_CONFIGURATION_PRIORITY
{
  FeatureConfigurationPriorityImageDefault = 0,
  FeatureConfigurationPriorityEnrollment = 2,
  FeatureConfigurationPriorityService = 4,
  FeatureConfigurationPriorityUser = 8,
  FeatureConfigurationPriorityUserPolicy = 10,
  FeatureConfigurationPriorityTest = 12,
  FeatureConfigurationPriorityImageOverride = 15,
  FeatureConfigurationPriorityMax = 15,
} RTL_FEATURE_CONFIGURATION_PRIORITY, *PRTL_FEATURE_CONFIGURATION_PRIORITY;

struct std::_Container_base12
{
  /* 0x0000 */ struct std::_Container_proxy* _Myproxy;
}; /* size: 0x0008 */

typedef struct _FILE_ID_128
{
  /* 0x0000 */ unsigned char Identifier[16];
} FILE_ID_128, *PFILE_ID_128; /* size: 0x0010 */

typedef struct _CSV_QUERY_FILE_REVISION_FILE_ID_128
{
  /* 0x0000 */ struct _FILE_ID_128 FileId;
  /* 0x0010 */ __int64 FileRevision[3];
} CSV_QUERY_FILE_REVISION_FILE_ID_128, *PCSV_QUERY_FILE_REVISION_FILE_ID_128; /* size: 0x0028 */

class wil::last_error_context
{
  /* 0x0000 */ BOOL m_dismissed;
  /* 0x0001 */ char Padding_11[3];
  /* 0x0004 */ unsigned long m_error;
}; /* size: 0x0008 */

class CAptCallCtrl;

typedef enum _TAG_UNNAMED_5
{
  value = 0,
} TAG_UNNAMED_5, *PTAG_UNNAMED_5;

typedef enum _TAG_UNNAMED_6
{
  _tlgLevelConst = 3,
} TAG_UNNAMED_6, *PTAG_UNNAMED_6;

struct Windows::Foundation::IAsyncOperationCompletedHandler_impl<double>
{
}; /* size: 0x0008 */

struct wil::details::close_invoke_helper<1,void (__cdecl*)(_RTL_CRITICAL_SECTION *),&LeaveCriticalSection,_RTL_CRITICAL_SECTION *>
{
}; /* size: 0x0001 */

enum PS_CREATE_STATE
{
  PsCreateInitialState = 0,
  PsCreateFailOnFileOpen = 1,
  PsCreateFailOnSectionCreate = 2,
  PsCreateFailExeFormat = 3,
  PsCreateFailMachineMismatch = 4,
  PsCreateFailExeName = 5,
  PsCreateSuccess = 6,
  PsCreateMaximumStates = 7,
};

enum tagBINDSTATUS
{
  BINDSTATUS_FINDINGRESOURCE = 1,
  BINDSTATUS_CONNECTING = 2,
  BINDSTATUS_REDIRECTING = 3,
  BINDSTATUS_BEGINDOWNLOADDATA = 4,
  BINDSTATUS_DOWNLOADINGDATA = 5,
  BINDSTATUS_ENDDOWNLOADDATA = 6,
  BINDSTATUS_BEGINDOWNLOADCOMPONENTS = 7,
  BINDSTATUS_INSTALLINGCOMPONENTS = 8,
  BINDSTATUS_ENDDOWNLOADCOMPONENTS = 9,
  BINDSTATUS_USINGCACHEDCOPY = 10,
  BINDSTATUS_SENDINGREQUEST = 11,
  BINDSTATUS_CLASSIDAVAILABLE = 12,
  BINDSTATUS_MIMETYPEAVAILABLE = 13,
  BINDSTATUS_CACHEFILENAMEAVAILABLE = 14,
  BINDSTATUS_BEGINSYNCOPERATION = 15,
  BINDSTATUS_ENDSYNCOPERATION = 16,
  BINDSTATUS_BEGINUPLOADDATA = 17,
  BINDSTATUS_UPLOADINGDATA = 18,
  BINDSTATUS_ENDUPLOADDATA = 19,
  BINDSTATUS_PROTOCOLCLASSID = 20,
  BINDSTATUS_ENCODING = 21,
  BINDSTATUS_VERIFIEDMIMETYPEAVAILABLE = 22,
  BINDSTATUS_CLASSINSTALLLOCATION = 23,
  BINDSTATUS_DECODING = 24,
  BINDSTATUS_LOADINGMIMEHANDLER = 25,
  BINDSTATUS_CONTENTDISPOSITIONATTACH = 26,
  BINDSTATUS_FILTERREPORTMIMETYPE = 27,
  BINDSTATUS_CLSIDCANINSTANTIATE = 28,
  BINDSTATUS_IUNKNOWNAVAILABLE = 29,
  BINDSTATUS_DIRECTBIND = 30,
  BINDSTATUS_RAWMIMETYPE = 31,
  BINDSTATUS_PROXYDETECTING = 32,
  BINDSTATUS_ACCEPTRANGES = 33,
  BINDSTATUS_COOKIE_SENT = 34,
  BINDSTATUS_COMPACT_POLICY_RECEIVED = 35,
  BINDSTATUS_COOKIE_SUPPRESSED = 36,
  BINDSTATUS_COOKIE_STATE_UNKNOWN = 37,
  BINDSTATUS_COOKIE_STATE_ACCEPT = 38,
  BINDSTATUS_COOKIE_STATE_REJECT = 39,
  BINDSTATUS_COOKIE_STATE_PROMPT = 40,
  BINDSTATUS_COOKIE_STATE_LEASH = 41,
  BINDSTATUS_COOKIE_STATE_DOWNGRADE = 42,
  BINDSTATUS_POLICY_HREF = 43,
  BINDSTATUS_P3P_HEADER = 44,
  BINDSTATUS_SESSION_COOKIE_RECEIVED = 45,
  BINDSTATUS_PERSISTENT_COOKIE_RECEIVED = 46,
  BINDSTATUS_SESSION_COOKIES_ALLOWED = 47,
  BINDSTATUS_CACHECONTROL = 48,
  BINDSTATUS_CONTENTDISPOSITIONFILENAME = 49,
  BINDSTATUS_MIMETEXTPLAINMISMATCH = 50,
  BINDSTATUS_PUBLISHERAVAILABLE = 51,
  BINDSTATUS_DISPLAYNAMEAVAILABLE = 52,
  BINDSTATUS_SSLUX_NAVBLOCKED = 53,
  BINDSTATUS_SERVER_MIMETYPEAVAILABLE = 54,
  BINDSTATUS_SNIFFED_CLASSIDAVAILABLE = 55,
  BINDSTATUS_64BIT_PROGRESS = 56,
  BINDSTATUS_LAST = 56,
  BINDSTATUS_RESERVED_0 = 57,
  BINDSTATUS_RESERVED_1 = 58,
  BINDSTATUS_RESERVED_2 = 59,
  BINDSTATUS_RESERVED_3 = 60,
  BINDSTATUS_RESERVED_4 = 61,
  BINDSTATUS_RESERVED_5 = 62,
  BINDSTATUS_RESERVED_6 = 63,
  BINDSTATUS_RESERVED_7 = 64,
  BINDSTATUS_RESERVED_8 = 65,
  BINDSTATUS_RESERVED_9 = 66,
  BINDSTATUS_RESERVED_A = 67,
  BINDSTATUS_RESERVED_B = 68,
  BINDSTATUS_RESERVED_C = 69,
  BINDSTATUS_RESERVED_D = 70,
  BINDSTATUS_RESERVED_E = 71,
  BINDSTATUS_RESERVED_F = 72,
  BINDSTATUS_RESERVED_10 = 73,
  BINDSTATUS_RESERVED_11 = 74,
  BINDSTATUS_RESERVED_12 = 75,
  BINDSTATUS_RESERVED_13 = 76,
  BINDSTATUS_RESERVED_14 = 77,
  BINDSTATUS_LAST_PRIVATE = 77,
};

typedef struct __vc_attributes::no_injected_textAttribute
{
  /* 0x0000 */ BOOL value;
} _vc_attributes::no_injected_textAttribute, *P_vc_attributes::no_injected_textAttribute; /* size: 0x0001 */

struct Windows::Foundation::IAsyncOperation_impl<Windows::Foundation::Internal::AggregateType<Windows::Storage::FileProperties::BasicProperties *,Windows::Storage::FileProperties::IBasicProperties *> >
{
}; /* size: 0x0008 */

typedef enum _TAG_UNNAMED_7
{
  value = 0,
} TAG_UNNAMED_7, *PTAG_UNNAMED_7;

class COleCache::CAdviseSinkImpl
{
}; /* size: 0x0008 */

struct IViewObjectEx
{
}; /* size: 0x0008 */

typedef enum _PS_STD_HANDLE_STATE
{
  PsNeverDuplicate = 0,
  PsRequestDuplicate = 1,
  PsAlwaysDuplicate = 2,
  PsMaxStdHandleStates = 3,
} PS_STD_HANDLE_STATE, *PPS_STD_HANDLE_STATE;

class std::bad_typeid
{
}; /* size: 0x0010 */

class wil::rtlsrwlock
{
  /* 0x0000 */ struct _RTL_SRWLOCK m_lock;
}; /* size: 0x0008 */

typedef enum _PS_PROTECTED_SIGNER
{
  PsProtectedSignerNone = 0,
  PsProtectedSignerAuthenticode = 1,
  PsProtectedSignerCodeGen = 2,
  PsProtectedSignerAntimalware = 3,
  PsProtectedSignerLsa = 4,
  PsProtectedSignerWindows = 5,
  PsProtectedSignerWinTcb = 6,
  PsProtectedSignerWinSystem = 7,
  PsProtectedSignerApp = 8,
  PsProtectedSignerMax = 9,
} PS_PROTECTED_SIGNER, *PPS_PROTECTED_SIGNER;

enum ProcessToken::DesignModeState
{
  DesignModeNotDetermined = 0,
  InDesignMode = 1,
  InDesignModeV2 = 2,
  NotInDesignMode = 3,
};

typedef struct _tlgWrapSz<char16_t>
{
  union
  {
    /* 0x0000 */ const unsigned int DataDescCount;
    /* 0x0000 */ const char16_t* const Psz;
  }; /* size: 0x0008 */
} tlgWrapSz<char16_t>, *PtlgWrapSz<char16_t>; /* size: 0x0008 */

typedef enum _TAG_UNNAMED_8
{
  _tlgLevelConst = 3,
} TAG_UNNAMED_8, *PTAG_UNNAMED_8;

typedef struct _STREAM_INFORMATION_ENTRY::_StreamInformation::_Ea
{
  /* 0x0000 */ unsigned short Length;
  /* 0x0002 */ unsigned short Flags;
  /* 0x0004 */ unsigned long EaSize;
  /* 0x0008 */ unsigned long EaInformationOffset;
} STREAM_INFORMATION_ENTRY::_StreamInformation::_Ea, *PSTREAM_INFORMATION_ENTRY::_StreamInformation::_Ea; /* size: 0x000c */

typedef enum _PS_PROTECTED_TYPE
{
  PsProtectedTypeNone = 0,
  PsProtectedTypeProtectedLight = 1,
  PsProtectedTypeProtected = 2,
  PsProtectedTypeMax = 3,
} PS_PROTECTED_TYPE, *PPS_PROTECTED_TYPE;

typedef enum _PS_WAKE_REASON
{
  PsWakeReasonUser = 0,
  PsWakeReasonExecutionRequired = 1,
  PsWakeReasonKernel = 2,
  PsWakeReasonInstrumentation = 3,
  PsWakeReasonPreserveProcess = 4,
  PsWakeReasonActivityReference = 5,
  PsWakeReasonWorkOnBehalf = 6,
  PsMaxWakeReasons = 7,
} PS_WAKE_REASON, *PPS_WAKE_REASON;

enum FORMATTAG
{
  ftagNone = 0,
  ftagClipFormat = 1,
  ftagString = 2,
};

class CData
{
  /* 0x0000 */ unsigned long m_cbSize;
  /* 0x0004 */ long Padding_12;
  /* 0x0008 */ void* m_pv;
  /* 0x0010 */ void* m_h;
  /* 0x0018 */ int m_fNoFree;
}; /* size: 0x0020 */

class CFormat
{
  /* 0x0000 */ enum FORMATTAG m_ftag;
  /* 0x0004 */ long Padding_13;
  /* 0x0008 */ unsigned short m_cf;
  /* 0x000a */ char Padding_14[6];
  /* 0x0010 */ class CData m_dataFormatString;
}; /* size: 0x0030 */

union std::_String_val<std::_Simple_types<unsigned short> >::_Bxty
{
  union
  {
    /* 0x0000 */ wchar_t _Buf[8];
    /* 0x0000 */ wchar_t* _Ptr;
    /* 0x0000 */ char _Alias[8];
  }; /* size: 0x0010 */
}; /* size: 0x0010 */

class std::_String_val<std::_Simple_types<unsigned short> >
{
  union
  {
    /* 0x0000 */ const unsigned __int64 _BUF_SIZE;
    /* 0x0000 */ const unsigned __int64 _ALLOC_MASK;
    /* 0x0000 */ union std::_String_val<std::_Simple_types<unsigned short> >::_Bxty _Bx;
  }; /* size: 0x0010 */
  /* 0x0010 */ unsigned __int64 _Mysize;
  /* 0x0018 */ unsigned __int64 _Myres;
}; /* size: 0x0020 */

class std::_Compressed_pair<std::allocator<unsigned short>,std::_String_val<std::_Simple_types<unsigned short> >,1>
{
  /* 0x0000 */ class std::_String_val<std::_Simple_types<unsigned short> > _Myval2;
}; /* size: 0x0020 */

class std::basic_string<unsigned short,std::char_traits<unsigned short>,std::allocator<unsigned short> >
{
  union
  {
    /* 0x0000 */ const unsigned __int64 _BUF_SIZE;
    /* 0x0000 */ const unsigned __int64 _ALLOC_MASK;
    /* 0x0000 */ const BOOL _Can_memcpy_val;
    /* 0x0000 */ const unsigned __int64 _Memcpy_val_offset;
    /* 0x0000 */ const unsigned __int64 _Memcpy_val_size;
    /* 0x0000 */ const unsigned __int64 npos;
    /* 0x0000 */ class std::_Compressed_pair<std::allocator<unsigned short>,std::_String_val<std::_Simple_types<unsigned short> >,1> _Mypair;
  }; /* size: 0x0020 */
}; /* size: 0x0020 */

typedef enum _TAG_UNNAMED_9
{
  value = 1,
} TAG_UNNAMED_9, *PTAG_UNNAMED_9;

struct Windows::Foundation::Collections::IVectorView<Windows::System::User *>
{
}; /* size: 0x0008 */

struct GetTypeValueImpl<long,unsigned int,unsigned long>
{
}; /* size: 0x0001 */

struct Windows::Foundation::Collections::IIterable<Windows::Storage::StorageLibraryChange *>
{
}; /* size: 0x0008 */

typedef enum _JOBOBJECT_IO_PRIORITY_LIMIT_FLAGS
{
  JOBOBJECT_IO_PRIORITY_LIMIT_ENABLE = 1,
  JOBOBJECT_IO_PRIORITY_LIMIT_VALID_FLAGS = 1,
} JOBOBJECT_IO_PRIORITY_LIMIT_FLAGS, *PJOBOBJECT_IO_PRIORITY_LIMIT_FLAGS;

struct wistd::__unique_ptr_deleter_sfinae<wil::cotaskmem_secure_deleter>;

typedef struct _MEMORY_PARTITION_PAGE_RANGE
{
  /* 0x0000 */ unsigned __int64 StartPage;
  /* 0x0008 */ unsigned __int64 NumberOfPages;
} MEMORY_PARTITION_PAGE_RANGE, *PMEMORY_PARTITION_PAGE_RANGE; /* size: 0x0010 */

typedef enum _JOBOBJECT_PAGE_PRIORITY_LIMIT_FLAGS
{
  JOBOBJECT_PAGE_PRIORITY_LIMIT_ENABLE = 1,
  JOBOBJECT_PAGE_PRIORITY_LIMIT_VALID_FLAGS = 1,
} JOBOBJECT_PAGE_PRIORITY_LIMIT_FLAGS, *PJOBOBJECT_PAGE_PRIORITY_LIMIT_FLAGS;

struct HACCEL__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

enum ProcessToken::ProcessILState
{
  ProcessILUndetermined = 0,
  ProcessILIsLessThanMediumIL = 1,
  ProcessILIsMediumOrGreaterIL = 2,
};

union tagCY
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned long Lo;
      /* 0x0004 */ long Hi;
    }; /* size: 0x0008 */
    /* 0x0000 */ __int64 int64;
  }; /* size: 0x0008 */
}; /* size: 0x0008 */

struct tagFONTDESC
{
  /* 0x0000 */ unsigned int cbSizeofstruct;
  /* 0x0004 */ long Padding_15;
  /* 0x0008 */ wchar_t* lpstrName;
  /* 0x0010 */ union tagCY cySize;
  /* 0x0018 */ short sWeight;
  /* 0x001a */ short sCharset;
  /* 0x001c */ int fItalic;
  /* 0x0020 */ int fUnderline;
  /* 0x0024 */ int fStrikethrough;
}; /* size: 0x0028 */

struct wil::details::resource_policy<void *,void (__cdecl*)(void *) noexcept,&wil::details::ResetEvent,wistd::integral_constant<unsigned __int64,1>,void *,void *,0,std::nullptr_t>
{
}; /* size: 0x0001 */

struct stat
{
  /* 0x0000 */ unsigned int st_dev;
  /* 0x0004 */ unsigned short st_ino;
  /* 0x0006 */ unsigned short st_mode;
  /* 0x0008 */ short st_nlink;
  /* 0x000a */ short st_uid;
  /* 0x000c */ short st_gid;
  /* 0x000e */ char Padding_16[2];
  /* 0x0010 */ unsigned int st_rdev;
  /* 0x0014 */ long st_size;
  /* 0x0018 */ __int64 st_atime;
  /* 0x0020 */ __int64 st_mtime;
  /* 0x0028 */ __int64 st_ctime;
}; /* size: 0x0030 */

typedef struct _MEMORY_PARTITION_CREATE_LARGE_PAGES_INFORMATION
{
  /* 0x0000 */ unsigned long Flags;
  /* 0x0004 */ unsigned long NumaNode;
  /* 0x0008 */ unsigned __int64 LargePageSize;
  /* 0x0010 */ unsigned __int64 NumberOfLargePagesToCreate;
  /* 0x0018 */ unsigned __int64 NumberOfLargePagesCreated;
} MEMORY_PARTITION_CREATE_LARGE_PAGES_INFORMATION, *PMEMORY_PARTITION_CREATE_LARGE_PAGES_INFORMATION; /* size: 0x0020 */

typedef enum _TAG_UNNAMED_10
{
  _tlgLevelConst = 3,
} TAG_UNNAMED_10, *PTAG_UNNAMED_10;

typedef struct _CRYPT_SEQUENCE_OF_ANY
{
  /* 0x0000 */ unsigned long cValue;
  /* 0x0004 */ long Padding_17;
  /* 0x0008 */ struct _CRYPTOAPI_BLOB* rgValue;
} CRYPT_SEQUENCE_OF_ANY, *PCRYPT_SEQUENCE_OF_ANY; /* size: 0x0010 */

struct Microsoft::WRL::Details::FactoryCache
{
  /* 0x0000 */ struct IUnknown* factory;
  union
  {
    union
    {
      /* 0x0008 */ struct _RO_REGISTRATION_COOKIE* winrt;
      /* 0x0008 */ unsigned long com;
    }; /* size: 0x0008 */
  } /* size: 0x0008 */ cookie;
}; /* size: 0x0010 */

typedef enum __MIDL_ICodeInstall_0001
{
  CIP_DISK_FULL = 0,
  CIP_ACCESS_DENIED = 1,
  CIP_NEWER_VERSION_EXISTS = 2,
  CIP_OLDER_VERSION_EXISTS = 3,
  CIP_NAME_CONFLICT = 4,
  CIP_TRUST_VERIFICATION_COMPONENT_MISSING = 5,
  CIP_EXE_SELF_REGISTERATION_TIMEOUT = 6,
  CIP_UNSAFE_TO_ABORT = 7,
  CIP_NEED_REBOOT = 8,
  CIP_NEED_REBOOT_UI_PERMISSION = 9,
} _MIDL_ICodeInstall_0001, *P_MIDL_ICodeInstall_0001;

struct Windows::Foundation::Collections::IKeyValuePair<EventRegistrationToken,int>
{
}; /* size: 0x0008 */

class SafeIntInternal::SafeIntWin32Exception
{
}; /* size: 0x0001 */

struct PPM_IDLE_STATE_ACCOUNTING
{
  /* 0x0000 */ unsigned long IdleTransitions;
  /* 0x0004 */ unsigned long FailedTransitions;
  /* 0x0008 */ unsigned long InvalidBucketIndex;
  /* 0x000c */ long Padding_18;
  /* 0x0010 */ unsigned __int64 TotalTime;
  /* 0x0018 */ unsigned long IdleTimeBuckets[6];
}; /* size: 0x0030 */

struct PPM_IDLE_ACCOUNTING
{
  /* 0x0000 */ unsigned long StateCount;
  /* 0x0004 */ unsigned long TotalTransitions;
  /* 0x0008 */ unsigned long ResetCount;
  /* 0x000c */ long Padding_19;
  /* 0x0010 */ unsigned __int64 StartTime;
  /* 0x0018 */ struct PPM_IDLE_STATE_ACCOUNTING State[1];
}; /* size: 0x0048 */

typedef enum __MIDL_IUri_0001
{
  Uri_PROPERTY_ABSOLUTE_URI = 0,
  Uri_PROPERTY_STRING_START = 0,
  Uri_PROPERTY_AUTHORITY = 1,
  Uri_PROPERTY_DISPLAY_URI = 2,
  Uri_PROPERTY_DOMAIN = 3,
  Uri_PROPERTY_EXTENSION = 4,
  Uri_PROPERTY_FRAGMENT = 5,
  Uri_PROPERTY_HOST = 6,
  Uri_PROPERTY_PASSWORD = 7,
  Uri_PROPERTY_PATH = 8,
  Uri_PROPERTY_PATH_AND_QUERY = 9,
  Uri_PROPERTY_QUERY = 10,
  Uri_PROPERTY_RAW_URI = 11,
  Uri_PROPERTY_SCHEME_NAME = 12,
  Uri_PROPERTY_USER_INFO = 13,
  Uri_PROPERTY_USER_NAME = 14,
  Uri_PROPERTY_STRING_LAST = 14,
  Uri_PROPERTY_HOST_TYPE = 15,
  Uri_PROPERTY_DWORD_START = 15,
  Uri_PROPERTY_PORT = 16,
  Uri_PROPERTY_SCHEME = 17,
  Uri_PROPERTY_ZONE = 18,
  Uri_PROPERTY_DWORD_LAST = 18,
} _MIDL_IUri_0001, *P_MIDL_IUri_0001;

typedef struct _GUID
{
  /* 0x0000 */ unsigned long Data1;
  /* 0x0004 */ unsigned short Data2;
  /* 0x0006 */ unsigned short Data3;
  /* 0x0008 */ unsigned char Data4[8];
} GUID, *PGUID; /* size: 0x0010 */

typedef struct _TRANSACTION_ENLISTMENT_PAIR
{
  /* 0x0000 */ struct _GUID EnlistmentId;
  /* 0x0010 */ struct _GUID ResourceManagerId;
} TRANSACTION_ENLISTMENT_PAIR, *PTRANSACTION_ENLISTMENT_PAIR; /* size: 0x0020 */

typedef struct _TRANSACTION_SUPERIOR_ENLISTMENT_INFORMATION
{
  /* 0x0000 */ struct _TRANSACTION_ENLISTMENT_PAIR SuperiorEnlistmentPair;
} TRANSACTION_SUPERIOR_ENLISTMENT_INFORMATION, *PTRANSACTION_SUPERIOR_ENLISTMENT_INFORMATION; /* size: 0x0020 */

struct Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<HSTRING__ *> *>
{
}; /* size: 0x0008 */

class SafeCastHelper<unsigned short,unsigned short,0>
{
}; /* size: 0x0001 */

typedef enum _TAG_UNNAMED_11
{
  value = 0,
} TAG_UNNAMED_11, *PTAG_UNNAMED_11;

struct IImpersonateClipboardOwner
{
}; /* size: 0x0008 */

struct Windows::Foundation::Collections::IVector<short>
{
}; /* size: 0x0008 */

typedef enum __MIDL_IUri_0002
{
  Uri_HOST_UNKNOWN = 0,
  Uri_HOST_DNS = 1,
  Uri_HOST_IPV4 = 2,
  Uri_HOST_IPV6 = 3,
  Uri_HOST_IDN = 4,
} _MIDL_IUri_0002, *P_MIDL_IUri_0002;

struct Windows::Foundation::Collections::IIterator<Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,Windows::Foundation::Collections::IVector<HSTRING__ *> *> *>
{
}; /* size: 0x0008 */

typedef enum _VRF_TRIAGE_CONTEXT
{
  VRF_TRIAGE_CONTEXT_NONE = 0,
  VRF_TRIAGE_CONTEXT_DEFAULT = 1,
  VRF_TRIAGE_CONTEXT_DEVELOPMENT = 1,
  VRF_TRIAGE_CONTEXT_CERTIFICATION = 2,
  VRF_TRIAGE_CONTEXT_CERTIFICATION_STRICT = 3,
  VRF_TRIAGE_CONTEXT_FLIGHT_TARGETED = 4,
  VRF_TRIAGE_CONTEXT_FLIGHT_DIAGNOSTICS = 5,
  VRF_TRIAGE_CONTEXT_FLIGHT_MONITORING = 6,
  NUM_VRF_TRIAGE_CONTEXTS = 7,
} VRF_TRIAGE_CONTEXT, *PVRF_TRIAGE_CONTEXT;

struct Windows::Foundation::IAsyncOperation<int>
{
}; /* size: 0x0008 */

typedef struct __vc_attributes::satypeAttribute
{
  /* 0x0000 */ const char* type;
} _vc_attributes::satypeAttribute, *P_vc_attributes::satypeAttribute; /* size: 0x0008 */

struct Microsoft::WRL::Details::ImplementsHelper<Microsoft::WRL::RuntimeClassFlags<1>,1>
{
}; /* size: 0x0001 */

enum INPUT_DESTINATION_IDENTITY
{
  IDID_NONE = 0,
  IDID_LUID = 1,
  IDID_INPUTROUTINGINFO = 2,
  IDID_WINDOW = 4,
};

class wil::details::unique_storage<wil::details::resource_policy<void *,void (__cdecl*)(void *) noexcept,&wil::details::CloseHandle,wistd::integral_constant<unsigned __int64,0>,void *,void *,0,std::nullptr_t> >
{
  /* 0x0000 */ void* m_ptr;
}; /* size: 0x0008 */

enum wil::details::EmptyVariant
{
  None = 0,
};

class CreateNdrTypeInfoFromTypeInfo::__l2::<lambda_8a353063373b4ec3de8834c4042dce90>
{
  /* 0x0000 */ void*& typeGenCookie;
}; /* size: 0x0008 */

class wil::details::lambda_call<<lambda_8a353063373b4ec3de8834c4042dce90> >
{
  /* 0x0000 */ class CreateNdrTypeInfoFromTypeInfo::__l2::<lambda_8a353063373b4ec3de8834c4042dce90> m_lambda;
  /* 0x0008 */ BOOL m_call;
}; /* size: 0x0010 */

struct Windows::Foundation::IAsyncOperation<enum Windows::Security::EnterpriseData::ProtectionPolicyEvaluationResult>
{
}; /* size: 0x0008 */

typedef enum _SYSTEM_INFORMATION_CLASS
{
  SystemBasicInformation = 0,
  SystemProcessorInformation = 1,
  SystemPerformanceInformation = 2,
  SystemTimeOfDayInformation = 3,
  SystemPathInformation = 4,
  SystemProcessInformation = 5,
  SystemCallCountInformation = 6,
  SystemDeviceInformation = 7,
  SystemProcessorPerformanceInformation = 8,
  SystemFlagsInformation = 9,
  SystemCallTimeInformation = 10,
  SystemModuleInformation = 11,
  SystemLocksInformation = 12,
  SystemStackTraceInformation = 13,
  SystemPagedPoolInformation = 14,
  SystemNonPagedPoolInformation = 15,
  SystemHandleInformation = 16,
  SystemObjectInformation = 17,
  SystemPageFileInformation = 18,
  SystemVdmInstemulInformation = 19,
  SystemVdmBopInformation = 20,
  SystemFileCacheInformation = 21,
  SystemPoolTagInformation = 22,
  SystemInterruptInformation = 23,
  SystemDpcBehaviorInformation = 24,
  SystemFullMemoryInformation = 25,
  SystemLoadGdiDriverInformation = 26,
  SystemUnloadGdiDriverInformation = 27,
  SystemTimeAdjustmentInformation = 28,
  SystemSummaryMemoryInformation = 29,
  SystemMirrorMemoryInformation = 30,
  SystemPerformanceTraceInformation = 31,
  SystemObsolete0 = 32,
  SystemExceptionInformation = 33,
  SystemCrashDumpStateInformation = 34,
  SystemKernelDebuggerInformation = 35,
  SystemContextSwitchInformation = 36,
  SystemRegistryQuotaInformation = 37,
  SystemExtendServiceTableInformation = 38,
  SystemPrioritySeperation = 39,
  SystemVerifierAddDriverInformation = 40,
  SystemVerifierRemoveDriverInformation = 41,
  SystemProcessorIdleInformation = 42,
  SystemLegacyDriverInformation = 43,
  SystemCurrentTimeZoneInformation = 44,
  SystemLookasideInformation = 45,
  SystemTimeSlipNotification = 46,
  SystemSessionCreate = 47,
  SystemSessionDetach = 48,
  SystemSessionInformation = 49,
  SystemRangeStartInformation = 50,
  SystemVerifierInformation = 51,
  SystemVerifierThunkExtend = 52,
  SystemSessionProcessInformation = 53,
  SystemLoadGdiDriverInSystemSpace = 54,
  SystemNumaProcessorMap = 55,
  SystemPrefetcherInformation = 56,
  SystemExtendedProcessInformation = 57,
  SystemRecommendedSharedDataAlignment = 58,
  SystemComPlusPackage = 59,
  SystemNumaAvailableMemory = 60,
  SystemProcessorPowerInformation = 61,
  SystemEmulationBasicInformation = 62,
  SystemEmulationProcessorInformation = 63,
  SystemExtendedHandleInformation = 64,
  SystemLostDelayedWriteInformation = 65,
  SystemBigPoolInformation = 66,
  SystemSessionPoolTagInformation = 67,
  SystemSessionMappedViewInformation = 68,
  SystemHotpatchInformation = 69,
  SystemObjectSecurityMode = 70,
  SystemWatchdogTimerHandler = 71,
  SystemWatchdogTimerInformation = 72,
  SystemLogicalProcessorInformation = 73,
  SystemWow64SharedInformationObsolete = 74,
  SystemRegisterFirmwareTableInformationHandler = 75,
  SystemFirmwareTableInformation = 76,
  SystemModuleInformationEx = 77,
  SystemVerifierTriageInformation = 78,
  SystemSuperfetchInformation = 79,
  SystemMemoryListInformation = 80,
  SystemFileCacheInformationEx = 81,
  SystemThreadPriorityClientIdInformation = 82,
  SystemProcessorIdleCycleTimeInformation = 83,
  SystemVerifierCancellationInformation = 84,
  SystemProcessorPowerInformationEx = 85,
  SystemRefTraceInformation = 86,
  SystemSpecialPoolInformation = 87,
  SystemProcessIdInformation = 88,
  SystemErrorPortInformation = 89,
  SystemBootEnvironmentInformation = 90,
  SystemHypervisorInformation = 91,
  SystemVerifierInformationEx = 92,
  SystemTimeZoneInformation = 93,
  SystemImageFileExecutionOptionsInformation = 94,
  SystemCoverageInformation = 95,
  SystemPrefetchPatchInformation = 96,
  SystemVerifierFaultsInformation = 97,
  SystemSystemPartitionInformation = 98,
  SystemSystemDiskInformation = 99,
  SystemProcessorPerformanceDistribution = 100,
  SystemNumaProximityNodeInformation = 101,
  SystemDynamicTimeZoneInformation = 102,
  SystemCodeIntegrityInformation = 103,
  SystemProcessorMicrocodeUpdateInformation = 104,
  SystemProcessorBrandString = 105,
  SystemVirtualAddressInformation = 106,
  SystemLogicalProcessorAndGroupInformation = 107,
  SystemProcessorCycleTimeInformation = 108,
  SystemStoreInformation = 109,
  SystemRegistryAppendString = 110,
  SystemAitSamplingValue = 111,
  SystemVhdBootInformation = 112,
  SystemCpuQuotaInformation = 113,
  SystemNativeBasicInformation = 114,
  SystemErrorPortTimeouts = 115,
  SystemLowPriorityIoInformation = 116,
  SystemBootEntropyInformation = 117,
  SystemVerifierCountersInformation = 118,
  SystemPagedPoolInformationEx = 119,
  SystemSystemPtesInformationEx = 120,
  SystemNodeDistanceInformation = 121,
  SystemAcpiAuditInformation = 122,
  SystemBasicPerformanceInformation = 123,
  SystemQueryPerformanceCounterInformation = 124,
  SystemSessionBigPoolInformation = 125,
  SystemBootGraphicsInformation = 126,
  SystemScrubPhysicalMemoryInformation = 127,
  SystemBadPageInformation = 128,
  SystemProcessorProfileControlArea = 129,
  SystemCombinePhysicalMemoryInformation = 130,
  SystemEntropyInterruptTimingInformation = 131,
  SystemConsoleInformation = 132,
  SystemPlatformBinaryInformation = 133,
  SystemPolicyInformation = 134,
  SystemHypervisorProcessorCountInformation = 135,
  SystemDeviceDataInformation = 136,
  SystemDeviceDataEnumerationInformation = 137,
  SystemMemoryTopologyInformation = 138,
  SystemMemoryChannelInformation = 139,
  SystemBootLogoInformation = 140,
  SystemProcessorPerformanceInformationEx = 141,
  SystemCriticalProcessErrorLogInformation = 142,
  SystemSecureBootPolicyInformation = 143,
  SystemPageFileInformationEx = 144,
  SystemSecureBootInformation = 145,
  SystemEntropyInterruptTimingRawInformation = 146,
  SystemPortableWorkspaceEfiLauncherInformation = 147,
  SystemFullProcessInformation = 148,
  SystemKernelDebuggerInformationEx = 149,
  SystemBootMetadataInformation = 150,
  SystemSoftRebootInformation = 151,
  SystemElamCertificateInformation = 152,
  SystemOfflineDumpConfigInformation = 153,
  SystemProcessorFeaturesInformation = 154,
  SystemRegistryReconciliationInformation = 155,
  SystemEdidInformation = 156,
  SystemManufacturingInformation = 157,
  SystemEnergyEstimationConfigInformation = 158,
  SystemHypervisorDetailInformation = 159,
  SystemProcessorCycleStatsInformation = 160,
  SystemVmGenerationCountInformation = 161,
  SystemTrustedPlatformModuleInformation = 162,
  SystemKernelDebuggerFlags = 163,
  SystemCodeIntegrityPolicyInformation = 164,
  SystemIsolatedUserModeInformation = 165,
  SystemHardwareSecurityTestInterfaceResultsInformation = 166,
  SystemSingleModuleInformation = 167,
  SystemAllowedCpuSetsInformation = 168,
  SystemVsmProtectionInformation = 169,
  SystemInterruptCpuSetsInformation = 170,
  SystemSecureBootPolicyFullInformation = 171,
  SystemCodeIntegrityPolicyFullInformation = 172,
  SystemAffinitizedInterruptProcessorInformation = 173,
  SystemRootSiloInformation = 174,
  SystemCpuSetInformation = 175,
  SystemCpuSetTagInformation = 176,
  SystemWin32WerStartCallout = 177,
  SystemSecureKernelProfileInformation = 178,
  SystemCodeIntegrityPlatformManifestInformation = 179,
  SystemInterruptSteeringInformation = 180,
  SystemSupportedProcessorArchitectures = 181,
  SystemMemoryUsageInformation = 182,
  SystemCodeIntegrityCertificateInformation = 183,
  SystemPhysicalMemoryInformation = 184,
  SystemControlFlowTransition = 185,
  SystemKernelDebuggingAllowed = 186,
  SystemActivityModerationExeState = 187,
  SystemActivityModerationUserSettings = 188,
  SystemCodeIntegrityPoliciesFullInformation = 189,
  SystemCodeIntegrityUnlockInformation = 190,
  SystemIntegrityQuotaInformation = 191,
  SystemFlushInformation = 192,
  SystemProcessorIdleMaskInformation = 193,
  SystemSecureDumpEncryptionInformation = 194,
  SystemWriteConstraintInformation = 195,
  SystemKernelVaShadowInformation = 196,
  SystemHypervisorSharedPageInformation = 197,
  SystemFirmwareBootPerformanceInformation = 198,
  SystemCodeIntegrityVerificationInformation = 199,
  SystemFirmwarePartitionInformation = 200,
  SystemSpeculationControlInformation = 201,
  SystemDmaGuardPolicyInformation = 202,
  SystemEnclaveLaunchControlInformation = 203,
  SystemWorkloadAllowedCpuSetsInformation = 204,
  SystemCodeIntegrityUnlockModeInformation = 205,
  SystemLeapSecondInformation = 206,
  SystemFlags2Information = 207,
  SystemSecurityModelInformation = 208,
  SystemCodeIntegritySyntheticCacheInformation = 209,
  SystemFeatureConfigurationInformation = 210,
  SystemFeatureConfigurationSectionInformation = 211,
  SystemFeatureUsageSubscriptionInformation = 212,
  SystemSecureSpeculationControlInformation = 213,
  SystemSpacesBootInformation = 214,
  SystemFwRamdiskInformation = 215,
  SystemWheaIpmiHardwareInformation = 216,
  SystemDifSetRuleClassInformation = 217,
  SystemDifClearRuleClassInformation = 218,
  SystemDifApplyPluginVerificationOnDriver = 219,
  SystemDifRemovePluginVerificationOnDriver = 220,
  SystemShadowStackInformation = 221,
  SystemBuildVersionInformation = 222,
  SystemPoolLimitInformation = 223,
  SystemCodeIntegrityAddDynamicStore = 224,
  SystemCodeIntegrityClearDynamicStores = 225,
  SystemDifPoolTrackingInformation = 226,
  SystemPoolZeroingInformation = 227,
  SystemDpcWatchdogInformation = 228,
  SystemDpcWatchdogInformation2 = 229,
  SystemSupportedProcessorArchitectures2 = 230,
  SystemSingleProcessorRelationshipInformation = 231,
  SystemXfgCheckFailureInformation = 232,
  SystemIommuStateInformation = 233,
  SystemHypervisorMinrootInformation = 234,
  SystemHypervisorBootPagesInformation = 235,
  SystemPointerAuthInformation = 236,
  SystemSecureKernelDebuggerInformation = 237,
  SystemOriginalImageFeatureInformation = 238,
  MaxSystemInfoClass = 239,
} SYSTEM_INFORMATION_CLASS, *PSYSTEM_INFORMATION_CLASS;

struct Windows::Foundation::Collections::supports_cleanup<Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,IInspectable *> *>
{
}; /* size: 0x0001 */

struct IClipboardProtectionServices
{
}; /* size: 0x0008 */

struct Windows::Foundation::IAsyncOperationCompletedHandler_impl<Windows::Foundation::Collections::IVectorView<Windows::Storage::BulkAccess::IStorageItemInformation *> *>
{
}; /* size: 0x0008 */

typedef enum _KCONTINUE_TYPE
{
  KCONTINUE_UNWIND = 0,
  KCONTINUE_RESUME = 1,
  KCONTINUE_LONGJUMP = 2,
  KCONTINUE_SET = 3,
  KCONTINUE_LAST = 4,
  KCONTINUE_INVALID = 4,
} KCONTINUE_TYPE, *PKCONTINUE_TYPE;

typedef struct _tlgCharTraits<unsigned short>
{
} tlgCharTraits<unsigned short>, *PtlgCharTraits<unsigned short>; /* size: 0x0001 */

struct wistd::__any
{
}; /* size: 0x0001 */

enum ProcessToken::NoAllAppPackagesState
{
  NoAllAppPackagesNotDetermined = 0,
  NoAllAppPackagesPresent = 1,
  NoAllAppPackagesAbsent = 2,
};

typedef struct _SERVICE_STATUS_PROCESS
{
  /* 0x0000 */ unsigned long dwServiceType;
  /* 0x0004 */ unsigned long dwCurrentState;
  /* 0x0008 */ unsigned long dwControlsAccepted;
  /* 0x000c */ unsigned long dwWin32ExitCode;
  /* 0x0010 */ unsigned long dwServiceSpecificExitCode;
  /* 0x0014 */ unsigned long dwCheckPoint;
  /* 0x0018 */ unsigned long dwWaitHint;
  /* 0x001c */ unsigned long dwProcessId;
  /* 0x0020 */ unsigned long dwServiceFlags;
} SERVICE_STATUS_PROCESS, *PSERVICE_STATUS_PROCESS; /* size: 0x0024 */

typedef struct _SERVICE_NOTIFY_1
{
  /* 0x0000 */ unsigned long dwVersion;
  /* 0x0004 */ long Padding_20;
  /* 0x0008 */ void* pfnNotifyCallback /* function */;
  /* 0x0010 */ void* pContext;
  /* 0x0018 */ unsigned long dwNotificationStatus;
  /* 0x001c */ struct _SERVICE_STATUS_PROCESS ServiceStatus;
} SERVICE_NOTIFY_1, *PSERVICE_NOTIFY_1; /* size: 0x0040 */

struct HGLRC__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

typedef enum _SYSTEM_PROCESS_CLASSIFICATION
{
  SystemProcessClassificationNormal = 0,
  SystemProcessClassificationSystem = 1,
  SystemProcessClassificationSecureSystem = 2,
  SystemProcessClassificationMemCompression = 3,
  SystemProcessClassificationRegistry = 4,
  SystemProcessClassificationMaximum = 5,
} SYSTEM_PROCESS_CLASSIFICATION, *PSYSTEM_PROCESS_CLASSIFICATION;

typedef struct _SYMBOL_INFOW
{
  /* 0x0000 */ unsigned long SizeOfStruct;
  /* 0x0004 */ unsigned long TypeIndex;
  /* 0x0008 */ unsigned __int64 Reserved[2];
  /* 0x0018 */ unsigned long Index;
  /* 0x001c */ unsigned long Size;
  /* 0x0020 */ unsigned __int64 ModBase;
  /* 0x0028 */ unsigned long Flags;
  /* 0x002c */ long Padding_21;
  /* 0x0030 */ unsigned __int64 Value;
  /* 0x0038 */ unsigned __int64 Address;
  /* 0x0040 */ unsigned long Register;
  /* 0x0044 */ unsigned long Scope;
  /* 0x0048 */ unsigned long Tag;
  /* 0x004c */ unsigned long NameLen;
  /* 0x0050 */ unsigned long MaxNameLen;
  /* 0x0054 */ wchar_t Name[1];
  /* 0x0056 */ char __PADDING__[2];
} SYMBOL_INFOW, *PSYMBOL_INFOW; /* size: 0x0058 */

enum tagDOMNodeType
{
  NODE_INVALID = 0,
  NODE_ELEMENT = 1,
  NODE_ATTRIBUTE = 2,
  NODE_TEXT = 3,
  NODE_CDATA_SECTION = 4,
  NODE_ENTITY_REFERENCE = 5,
  NODE_ENTITY = 6,
  NODE_PROCESSING_INSTRUCTION = 7,
  NODE_COMMENT = 8,
  NODE_DOCUMENT = 9,
  NODE_DOCUMENT_TYPE = 10,
  NODE_DOCUMENT_FRAGMENT = 11,
  NODE_NOTATION = 12,
};

class wil::details::<lambda_1743b85cba782339a69c5aa862c27e7a>
{
}; /* size: 0x0001 */

struct Windows::Foundation::Collections::IIterable<Windows::Foundation::Collections::IKeyValuePair<__int64,__int64> *>
{
}; /* size: 0x0008 */

enum Windows::System::UserWatcherStatus
{
  UserWatcherStatus_Created = 0,
  UserWatcherStatus_Started = 1,
  UserWatcherStatus_EnumerationCompleted = 2,
  UserWatcherStatus_Stopping = 3,
  UserWatcherStatus_Stopped = 4,
  UserWatcherStatus_Aborted = 5,
};

struct Windows::Foundation::Collections::is_pointer<Windows::Foundation::Collections::IKeyValuePair<_GUID,HSTRING__ *> *>
{
}; /* size: 0x0001 */

typedef enum _TAG_UNNAMED_12
{
  _tlgLevelConst = 3,
} TAG_UNNAMED_12, *PTAG_UNNAMED_12;

struct Windows::Foundation::Collections::IIterable_impl<Windows::ApplicationModel::Background::IBackgroundTaskYieldable *>
{
}; /* size: 0x0008 */

enum tagXMLEMEM_TYPE
{
  XMLELEMTYPE_ELEMENT = 0,
  XMLELEMTYPE_TEXT = 1,
  XMLELEMTYPE_COMMENT = 2,
  XMLELEMTYPE_DOCUMENT = 3,
  XMLELEMTYPE_DTD = 4,
  XMLELEMTYPE_PI = 5,
  XMLELEMTYPE_OTHER = 6,
};

class TryGetNdrTypeInfo::__l2::<lambda_2e1c9c4fca2bd83b2812b8ab64129fec>
{
}; /* size: 0x0001 */

class wil::details::<lambda_0338d048c56f4199739644ebb113d12c>
{
}; /* size: 0x0001 */

enum tagBINDSTRING
{
  BINDSTRING_HEADERS = 1,
  BINDSTRING_ACCEPT_MIMES = 2,
  BINDSTRING_EXTRA_URL = 3,
  BINDSTRING_LANGUAGE = 4,
  BINDSTRING_USERNAME = 5,
  BINDSTRING_PASSWORD = 6,
  BINDSTRING_UA_PIXELS = 7,
  BINDSTRING_UA_COLOR = 8,
  BINDSTRING_OS = 9,
  BINDSTRING_USER_AGENT = 10,
  BINDSTRING_ACCEPT_ENCODINGS = 11,
  BINDSTRING_POST_COOKIE = 12,
  BINDSTRING_POST_DATA_MIME = 13,
  BINDSTRING_URL = 14,
  BINDSTRING_IID = 15,
  BINDSTRING_FLAG_BIND_TO_OBJECT = 16,
  BINDSTRING_PTR_BIND_CONTEXT = 17,
  BINDSTRING_XDR_ORIGIN = 18,
  BINDSTRING_DOWNLOADPATH = 19,
  BINDSTRING_ROOTDOC_URL = 20,
  BINDSTRING_INITIAL_FILENAME = 21,
  BINDSTRING_PROXY_USERNAME = 22,
  BINDSTRING_PROXY_PASSWORD = 23,
  BINDSTRING_ENTERPRISE_ID = 24,
  BINDSTRING_DOC_URL = 25,
  BINDSTRING_SAMESITE_COOKIE_LEVEL = 26,
};

typedef enum _FS_BPIO_INFLAGS
{
  FSBPIO_INFL_None = 0,
  FSBPIO_INFL_SKIP_STORAGE_STACK_QUERY = 1,
} FS_BPIO_INFLAGS, *PFS_BPIO_INFLAGS;

class wil::unique_any_t<wil::details::unique_storage<wil::details::resource_policy<HSTRING_BUFFER__ *,long (__cdecl*)(HSTRING_BUFFER__ *),&WindowsDeleteStringBuffer,wistd::integral_constant<unsigned __int64,0>,HSTRING_BUFFER__ *,HSTRING_BUFFER__ *,0,std::nullptr_t> > >
{
}; /* size: 0x0008 */

typedef struct _CRYPTOAPI_BLOB
{
  /* 0x0000 */ unsigned long cbData;
  /* 0x0004 */ long Padding_22;
  /* 0x0008 */ unsigned char* pbData;
} CRYPTOAPI_BLOB, *PCRYPTOAPI_BLOB; /* size: 0x0010 */

typedef struct _CRYPT_ALGORITHM_IDENTIFIER
{
  /* 0x0000 */ char* pszObjId;
  /* 0x0008 */ struct _CRYPTOAPI_BLOB Parameters;
} CRYPT_ALGORITHM_IDENTIFIER, *PCRYPT_ALGORITHM_IDENTIFIER; /* size: 0x0018 */

typedef struct _CRYPT_BIT_BLOB
{
  /* 0x0000 */ unsigned long cbData;
  /* 0x0004 */ long Padding_23;
  /* 0x0008 */ unsigned char* pbData;
  /* 0x0010 */ unsigned long cUnusedBits;
  /* 0x0014 */ long __PADDING__[1];
} CRYPT_BIT_BLOB, *PCRYPT_BIT_BLOB; /* size: 0x0018 */

typedef struct _CERT_ISSUER_SERIAL_NUMBER
{
  /* 0x0000 */ struct _CRYPTOAPI_BLOB Issuer;
  /* 0x0010 */ struct _CRYPTOAPI_BLOB SerialNumber;
} CERT_ISSUER_SERIAL_NUMBER, *PCERT_ISSUER_SERIAL_NUMBER; /* size: 0x0020 */

typedef struct _CERT_ID
{
  /* 0x0000 */ unsigned long dwIdChoice;
  /* 0x0004 */ long Padding_24;
  union
  {
    /* 0x0008 */ struct _CERT_ISSUER_SERIAL_NUMBER IssuerSerialNumber;
    /* 0x0008 */ struct _CRYPTOAPI_BLOB KeyId;
    struct
    {
      /* 0x0008 */ struct _CRYPTOAPI_BLOB HashId;
      /* 0x0018 */ long __PADDING__[4];
    }; /* size: 0x0020 */
  }; /* size: 0x0020 */
} CERT_ID, *PCERT_ID; /* size: 0x0028 */

typedef struct _CMSG_KEY_TRANS_RECIPIENT_ENCODE_INFO
{
  /* 0x0000 */ unsigned long cbSize;
  /* 0x0004 */ long Padding_25;
  /* 0x0008 */ struct _CRYPT_ALGORITHM_IDENTIFIER KeyEncryptionAlgorithm;
  /* 0x0020 */ void* pvKeyEncryptionAuxInfo;
  /* 0x0028 */ unsigned __int64 hCryptProv;
  /* 0x0030 */ struct _CRYPT_BIT_BLOB RecipientPublicKey;
  /* 0x0048 */ struct _CERT_ID RecipientId;
} CMSG_KEY_TRANS_RECIPIENT_ENCODE_INFO, *PCMSG_KEY_TRANS_RECIPIENT_ENCODE_INFO; /* size: 0x0070 */

enum tagApplicationType
{
  ServerApplication = 0,
  LibraryApplication = 1,
};

typedef struct _stat32
{
  /* 0x0000 */ unsigned int st_dev;
  /* 0x0004 */ unsigned short st_ino;
  /* 0x0006 */ unsigned short st_mode;
  /* 0x0008 */ short st_nlink;
  /* 0x000a */ short st_uid;
  /* 0x000c */ short st_gid;
  /* 0x000e */ char Padding_26[2];
  /* 0x0010 */ unsigned int st_rdev;
  /* 0x0014 */ long st_size;
  /* 0x0018 */ long st_atime;
  /* 0x001c */ long st_mtime;
  /* 0x0020 */ long st_ctime;
} stat32, *Pstat32; /* size: 0x0024 */

class wil::details::<lambda_bfd2741a28d6faa92e23b84d2819b7af>
{
}; /* size: 0x0001 */

struct IPolicy
{
}; /* size: 0x0008 */

enum tagShutdownType
{
  IdleShutdown = 0,
  ForcedShutdown = 1,
};

typedef enum _TAG_UNNAMED_13
{
  value = 0,
} TAG_UNNAMED_13, *PTAG_UNNAMED_13;

class wil::unique_any_t<wil::details::unique_storage<wil::details::resource_policy<void *,void (__cdecl*)(void *) noexcept,&wil::details::ReleaseMutex,wistd::integral_constant<unsigned __int64,2>,void *,void *,0,std::nullptr_t> > >
{
}; /* size: 0x0008 */

typedef struct _CMSG_HASHED_ENCODE_INFO
{
  /* 0x0000 */ unsigned long cbSize;
  /* 0x0004 */ long Padding_27;
  /* 0x0008 */ unsigned __int64 hCryptProv;
  /* 0x0010 */ struct _CRYPT_ALGORITHM_IDENTIFIER HashAlgorithm;
  /* 0x0028 */ void* pvHashAuxInfo;
} CMSG_HASHED_ENCODE_INFO, *PCMSG_HASHED_ENCODE_INFO; /* size: 0x0030 */

struct Windows::Foundation::IAsyncOperationWithProgressCompletedHandler<Windows::Storage::Streams::IBuffer *,unsigned __int64>
{
}; /* size: 0x0008 */

typedef struct _NDR_SCONTEXT
{
  /* 0x0000 */ void* pad[2];
  /* 0x0010 */ void* userContext;
} NDR_SCONTEXT, *PNDR_SCONTEXT; /* size: 0x0018 */

enum wil::FeaturePropertyGroupFlags
{
  None = 0,
  StaticProperties = 1,
  FeatureEnabledState = 2,
};

class LargeIntRegMultiply<unsigned int,unsigned __int64>
{
}; /* size: 0x0001 */

typedef enum _tagPARSEACTION
{
  PARSE_CANONICALIZE = 1,
  PARSE_FRIENDLY = 2,
  PARSE_SECURITY_URL = 3,
  PARSE_ROOTDOCUMENT = 4,
  PARSE_DOCUMENT = 5,
  PARSE_ANCHOR = 6,
  PARSE_ENCODE_IS_UNESCAPE = 7,
  PARSE_DECODE_IS_ESCAPE = 8,
  PARSE_PATH_FROM_URL = 9,
  PARSE_URL_FROM_PATH = 10,
  PARSE_MIME = 11,
  PARSE_SERVER = 12,
  PARSE_SCHEMA = 13,
  PARSE_SITE = 14,
  PARSE_DOMAIN = 15,
  PARSE_LOCATION = 16,
  PARSE_SECURITY_DOMAIN = 17,
  PARSE_ESCAPE = 18,
  PARSE_UNESCAPE = 19,
} tagPARSEACTION, *PtagPARSEACTION;

struct IActivationFactory
{
}; /* size: 0x0008 */

typedef struct _FILETIME
{
  /* 0x0000 */ unsigned long dwLowDateTime;
  /* 0x0004 */ unsigned long dwHighDateTime;
} FILETIME, *PFILETIME; /* size: 0x0008 */

typedef struct _OCSP_BASIC_RESPONSE_INFO
{
  /* 0x0000 */ unsigned long dwVersion;
  /* 0x0004 */ unsigned long dwResponderIdChoice;
  union
  {
    /* 0x0008 */ struct _CRYPTOAPI_BLOB ByNameResponderId;
    /* 0x0008 */ struct _CRYPTOAPI_BLOB ByKeyResponderId;
  }; /* size: 0x0010 */
  /* 0x0018 */ struct _FILETIME ProducedAt;
  /* 0x0020 */ unsigned long cResponseEntry;
  /* 0x0024 */ long Padding_28;
  /* 0x0028 */ struct _OCSP_BASIC_RESPONSE_ENTRY* rgResponseEntry;
  /* 0x0030 */ unsigned long cExtension;
  /* 0x0034 */ long Padding_29;
  /* 0x0038 */ struct _CERT_EXTENSION* rgExtension;
} OCSP_BASIC_RESPONSE_INFO, *POCSP_BASIC_RESPONSE_INFO; /* size: 0x0040 */

typedef struct _TAPE_CREATE_PARTITION
{
  /* 0x0000 */ unsigned long Method;
  /* 0x0004 */ unsigned long Count;
  /* 0x0008 */ unsigned long Size;
} TAPE_CREATE_PARTITION, *PTAPE_CREATE_PARTITION; /* size: 0x000c */

typedef enum _tagPSUACTION
{
  PSU_DEFAULT = 1,
  PSU_SECURITY_URL_ONLY = 2,
} tagPSUACTION, *PtagPSUACTION;

class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IComCatalogSCM> >
{
}; /* size: 0x0008 */

class wil::ActivityBase<DragDropLogging,1,0,5,0,_TlgReflectorTag_Param0IsProviderType>::ActivityData<DragDropLogging,_TlgReflectorTag_Param0IsProviderType>
{
  /* 0x0000 */ long Padding_30[10];
  /* 0x0028 */ class wil::details::StoredCallContextInfo m_callContext;
  /* 0x0048 */ int m_stopCountExpected;
  /* 0x004c */ HRESULT m_result;
  /* 0x0050 */ class wil::StoredFailureInfo m_failure;
  /* 0x00f8 */ class wil::srwlock m_lock;
}; /* size: 0x0100 */

typedef enum _TAG_UNNAMED_14
{
  value = 0,
} TAG_UNNAMED_14, *PTAG_UNNAMED_14;

struct AsyncIUnknown
{
}; /* size: 0x0008 */

typedef enum _tagQUERYOPTION
{
  QUERY_EXPIRATION_DATE = 1,
  QUERY_TIME_OF_LAST_CHANGE = 2,
  QUERY_CONTENT_ENCODING = 3,
  QUERY_CONTENT_TYPE = 4,
  QUERY_REFRESH = 5,
  QUERY_RECOMBINE = 6,
  QUERY_CAN_NAVIGATE = 7,
  QUERY_USES_NETWORK = 8,
  QUERY_IS_CACHED = 9,
  QUERY_IS_INSTALLEDENTRY = 10,
  QUERY_IS_CACHED_OR_MAPPED = 11,
  QUERY_USES_CACHE = 12,
  QUERY_IS_SECURE = 13,
  QUERY_IS_SAFE = 14,
  QUERY_USES_HISTORYFOLDER = 15,
  QUERY_IS_CACHED_AND_USABLE_OFFLINE = 16,
} tagQUERYOPTION, *PtagQUERYOPTION;

typedef struct _MINIDUMP_MEMORY_INFO
{
  /* 0x0000 */ unsigned __int64 BaseAddress;
  /* 0x0008 */ unsigned __int64 AllocationBase;
  /* 0x0010 */ unsigned int AllocationProtect;
  /* 0x0014 */ unsigned int __alignment1;
  /* 0x0018 */ unsigned __int64 RegionSize;
  /* 0x0020 */ unsigned int State;
  /* 0x0024 */ unsigned int Protect;
  /* 0x0028 */ unsigned int Type;
  /* 0x002c */ unsigned int __alignment2;
} MINIDUMP_MEMORY_INFO, *PMINIDUMP_MEMORY_INFO; /* size: 0x0030 */

typedef struct _MINIDUMP_CALLBACK_OUTPUT
{
  union
  {
    /* 0x0000 */ unsigned long ModuleWriteFlags;
    /* 0x0000 */ unsigned long ThreadWriteFlags;
    /* 0x0000 */ unsigned long SecondaryFlags;
    struct
    {
      /* 0x0000 */ unsigned __int64 MemoryBase;
      /* 0x0008 */ unsigned long MemorySize;
    }; /* size: 0x000c */
    struct
    {
      /* 0x0000 */ int CheckCancel;
      /* 0x0004 */ int Cancel;
    }; /* size: 0x0008 */
    /* 0x0000 */ void* Handle;
    struct
    {
      /* 0x0000 */ struct _MINIDUMP_MEMORY_INFO VmRegion;
      /* 0x0030 */ int Continue;
    }; /* size: 0x0034 */
    struct
    {
      /* 0x0000 */ HRESULT VmQueryStatus;
      /* 0x0004 */ struct _MINIDUMP_MEMORY_INFO VmQueryResult;
    }; /* size: 0x0034 */
    struct
    {
      /* 0x0000 */ HRESULT VmReadStatus;
      /* 0x0004 */ unsigned long VmReadBytesCompleted;
    }; /* size: 0x0008 */
    struct
    {
      /* 0x0000 */ HRESULT Status;
      /* 0x0004 */ long __PADDING__[12];
    }; /* size: 0x0034 */
  }; /* size: 0x0034 */
} MINIDUMP_CALLBACK_OUTPUT, *PMINIDUMP_CALLBACK_OUTPUT; /* size: 0x0034 */

class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IComClassIterator> >
{
}; /* size: 0x0008 */

typedef enum _tagINTERNETFEATURELIST
{
  FEATURE_OBJECT_CACHING = 0,
  FEATURE_ZONE_ELEVATION = 1,
  FEATURE_MIME_HANDLING = 2,
  FEATURE_MIME_SNIFFING = 3,
  FEATURE_WINDOW_RESTRICTIONS = 4,
  FEATURE_WEBOC_POPUPMANAGEMENT = 5,
  FEATURE_BEHAVIORS = 6,
  FEATURE_DISABLE_MK_PROTOCOL = 7,
  FEATURE_LOCALMACHINE_LOCKDOWN = 8,
  FEATURE_SECURITYBAND = 9,
  FEATURE_RESTRICT_ACTIVEXINSTALL = 10,
  FEATURE_VALIDATE_NAVIGATE_URL = 11,
  FEATURE_RESTRICT_FILEDOWNLOAD = 12,
  FEATURE_ADDON_MANAGEMENT = 13,
  FEATURE_PROTOCOL_LOCKDOWN = 14,
  FEATURE_HTTP_USERNAME_PASSWORD_DISABLE = 15,
  FEATURE_SAFE_BINDTOOBJECT = 16,
  FEATURE_UNC_SAVEDFILECHECK = 17,
  FEATURE_GET_URL_DOM_FILEPATH_UNENCODED = 18,
  FEATURE_TABBED_BROWSING = 19,
  FEATURE_SSLUX = 20,
  FEATURE_DISABLE_NAVIGATION_SOUNDS = 21,
  FEATURE_DISABLE_LEGACY_COMPRESSION = 22,
  FEATURE_FORCE_ADDR_AND_STATUS = 23,
  FEATURE_XMLHTTP = 24,
  FEATURE_DISABLE_TELNET_PROTOCOL = 25,
  FEATURE_FEEDS = 26,
  FEATURE_BLOCK_INPUT_PROMPTS = 27,
  FEATURE_ENTRY_COUNT = 28,
} tagINTERNETFEATURELIST, *PtagINTERNETFEATURELIST;

struct std::_Fake_proxy_ptr_impl
{
}; /* size: 0x0001 */

enum std::_Invoker_strategy
{
  _Functor = 0,
  _Pmf_object = 1,
  _Pmf_refwrap = 2,
  _Pmf_pointer = 3,
  _Pmd_object = 4,
  _Pmd_refwrap = 5,
  _Pmd_pointer = 6,
};

struct std::_Invoker_pmf_refwrap
{
  /* 0x0000 */ enum std::_Invoker_strategy _Strategy;
  /* 0x0004 */ char __PADDING__[4294967293];
}; /* size: 0x0001 */

typedef struct _SYSTEMTIME
{
  /* 0x0000 */ unsigned short wYear;
  /* 0x0002 */ unsigned short wMonth;
  /* 0x0004 */ unsigned short wDayOfWeek;
  /* 0x0006 */ unsigned short wDay;
  /* 0x0008 */ unsigned short wHour;
  /* 0x000a */ unsigned short wMinute;
  /* 0x000c */ unsigned short wSecond;
  /* 0x000e */ unsigned short wMilliseconds;
} SYSTEMTIME, *PSYSTEMTIME; /* size: 0x0010 */

typedef struct _TIME_ZONE_INFORMATION
{
  /* 0x0000 */ long Bias;
  /* 0x0004 */ wchar_t StandardName[32];
  /* 0x0044 */ struct _SYSTEMTIME StandardDate;
  /* 0x0054 */ long StandardBias;
  /* 0x0058 */ wchar_t DaylightName[32];
  /* 0x0098 */ struct _SYSTEMTIME DaylightDate;
  /* 0x00a8 */ long DaylightBias;
} TIME_ZONE_INFORMATION, *PTIME_ZONE_INFORMATION; /* size: 0x00ac */

struct tagSTATPROPSETSTG
{
  /* 0x0000 */ struct _GUID fmtid;
  /* 0x0010 */ struct _GUID clsid;
  /* 0x0020 */ unsigned long grfFlags;
  /* 0x0024 */ struct _FILETIME mtime;
  /* 0x002c */ struct _FILETIME ctime;
  /* 0x0034 */ struct _FILETIME atime;
  /* 0x003c */ unsigned long dwOSVersion;
}; /* size: 0x0040 */

class AdHocInterceptorForwarders<IOleWindow,IOleInPlaceObject>::ContextSensitiveHelp::__l2::<lambda_7f8f27448f522cea32614cee7579f563>
{
  /* 0x0000 */ int fEnterMode;
}; /* size: 0x0004 */

typedef enum _RTL_RESOURCE_POLICY_FLAGS
{
  RTL_RESOURCE_POLICY_FLAGS_NONE = 0,
} RTL_RESOURCE_POLICY_FLAGS, *PRTL_RESOURCE_POLICY_FLAGS;

class Microsoft::WRL::ComPtr<IMarshal>
{
  /* 0x0000 */ struct IMarshal* ptr_;
}; /* size: 0x0008 */

class Microsoft::WRL::FtmBase
{
  /* 0x0000 */ long Padding_31[6];
  /* 0x0018 */ class Microsoft::WRL::ComPtr<IMarshal> marshaller_;
}; /* size: 0x0020 */

class GetCastMethod<unsigned short,unsigned short>
{
}; /* size: 0x0001 */

enum Microsoft::WRL::Details::AsyncStatusInternal
{
  _Undefined = -2,
  _Created = -1,
  _Started = 0,
  _Completed = 1,
  _Canceled = 2,
  _Error = 3,
  _Closed = 4,
};

union std::_String_val<std::_Simple_types<char32_t> >::_Bxty
{
  union
  {
    /* 0x0000 */ char32_t _Buf[4];
    /* 0x0000 */ char32_t* _Ptr;
    /* 0x0000 */ char _Alias[4];
  }; /* size: 0x0010 */
}; /* size: 0x0010 */

class std::_String_val<std::_Simple_types<char32_t> >
{
  union
  {
    /* 0x0000 */ const unsigned __int64 _BUF_SIZE;
    /* 0x0000 */ const unsigned __int64 _ALLOC_MASK;
    /* 0x0000 */ union std::_String_val<std::_Simple_types<char32_t> >::_Bxty _Bx;
  }; /* size: 0x0010 */
  /* 0x0010 */ unsigned __int64 _Mysize;
  /* 0x0018 */ unsigned __int64 _Myres;
}; /* size: 0x0020 */

class std::_Compressed_pair<std::allocator<char32_t>,std::_String_val<std::_Simple_types<char32_t> >,1>
{
  /* 0x0000 */ class std::_String_val<std::_Simple_types<char32_t> > _Myval2;
}; /* size: 0x0020 */

class std::basic_string<char32_t,std::char_traits<char32_t>,std::allocator<char32_t> >
{
  union
  {
    /* 0x0000 */ const unsigned __int64 _BUF_SIZE;
    /* 0x0000 */ const unsigned __int64 _ALLOC_MASK;
    /* 0x0000 */ const BOOL _Can_memcpy_val;
    /* 0x0000 */ const unsigned __int64 _Memcpy_val_offset;
    /* 0x0000 */ const unsigned __int64 _Memcpy_val_size;
    /* 0x0000 */ const unsigned __int64 npos;
    /* 0x0000 */ class std::_Compressed_pair<std::allocator<char32_t>,std::_String_val<std::_Simple_types<char32_t> >,1> _Mypair;
  }; /* size: 0x0020 */
}; /* size: 0x0020 */

typedef enum _SYSTEM_FEATURE_CONFIGURATION_SECTION_TYPE
{
  SystemFeatureConfigurationSectionTypeBoot = 0,
  SystemFeatureConfigurationSectionTypeRuntime = 1,
  SystemFeatureConfigurationSectionTypeUsageTriggers = 2,
  SystemFeatureConfigurationSectionTypeCount = 3,
} SYSTEM_FEATURE_CONFIGURATION_SECTION_TYPE, *PSYSTEM_FEATURE_CONFIGURATION_SECTION_TYPE;

typedef enum _SYSTEM_POOL_LIMIT_MEM_TYPE
{
  SysPlMemPaged = 0,
  SysPlMemNonPaged = 1,
  SysPlMemTypeMax = 2,
} SYSTEM_POOL_LIMIT_MEM_TYPE, *PSYSTEM_POOL_LIMIT_MEM_TYPE;

struct Windows::Foundation::IAsyncOperation_impl<Windows::Foundation::Collections::IVectorView<Windows::Storage::BulkAccess::FolderInformation *> *>
{
}; /* size: 0x0008 */

struct ITypeInfo
{
}; /* size: 0x0008 */

class std::bad_weak_ptr
{
}; /* size: 0x0010 */

class wil::details::unique_storage<wil::details::resource_policy<_RTL_SRWLOCK *,void (__cdecl*)(_RTL_SRWLOCK *),&ReleaseSRWLockShared,wistd::integral_constant<unsigned __int64,1>,_RTL_SRWLOCK *,_RTL_SRWLOCK *,0,std::nullptr_t> >
{
  /* 0x0000 */ struct _RTL_SRWLOCK* m_ptr;
}; /* size: 0x0008 */

struct tagMETAHEADER
{
  /* 0x0000 */ unsigned short mtType;
  /* 0x0002 */ unsigned short mtHeaderSize;
  /* 0x0004 */ unsigned short mtVersion;
  /* 0x0006 */ unsigned long mtSize;
  /* 0x000a */ unsigned short mtNoObjects;
  /* 0x000c */ unsigned long mtMaxRecord;
  /* 0x0010 */ unsigned short mtNoParameters;
}; /* size: 0x0012 */

typedef enum _TAG_UNNAMED_15
{
  value = 1,
} TAG_UNNAMED_15, *PTAG_UNNAMED_15;

enum tagTYPEKIND
{
  TKIND_ENUM = 0,
  TKIND_RECORD = 1,
  TKIND_MODULE = 2,
  TKIND_INTERFACE = 3,
  TKIND_DISPATCH = 4,
  TKIND_COCLASS = 5,
  TKIND_ALIAS = 6,
  TKIND_UNION = 7,
  TKIND_MAX = 8,
};

typedef struct _MINIDUMP_UNLOADED_MODULE
{
  /* 0x0000 */ unsigned __int64 BaseOfImage;
  /* 0x0008 */ unsigned int SizeOfImage;
  /* 0x000c */ unsigned int CheckSum;
  /* 0x0010 */ unsigned int TimeDateStamp;
  /* 0x0014 */ unsigned long ModuleNameRva;
} MINIDUMP_UNLOADED_MODULE, *PMINIDUMP_UNLOADED_MODULE; /* size: 0x0018 */

struct Windows::Foundation::Collections::supports_cleanup<HSTRING__ *>
{
}; /* size: 0x0001 */

enum tagCALLCONV
{
  CC_FASTCALL = 0,
  CC_CDECL = 1,
  CC_MSCPASCAL = 2,
  CC_PASCAL = 2,
  CC_MACPASCAL = 3,
  CC_STDCALL = 4,
  CC_FPFASTCALL = 5,
  CC_SYSCALL = 6,
  CC_MPWCDECL = 7,
  CC_MPWPASCAL = 8,
  CC_MAX = 9,
};

struct Windows::Foundation::Collections::is_foundation_struct<Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,float> *>
{
}; /* size: 0x0001 */

enum SHELL_LINK_DATA_FLAGS
{
  SLDF_DEFAULT = 0,
  SLDF_HAS_ID_LIST = 1,
  SLDF_HAS_LINK_INFO = 2,
  SLDF_HAS_NAME = 4,
  SLDF_HAS_RELPATH = 8,
  SLDF_HAS_WORKINGDIR = 16,
  SLDF_HAS_ARGS = 32,
  SLDF_HAS_ICONLOCATION = 64,
  SLDF_UNICODE = 128,
  SLDF_FORCE_NO_LINKINFO = 256,
  SLDF_HAS_EXP_SZ = 512,
  SLDF_RUN_IN_SEPARATE = 1024,
  SLDF_HAS_DARWINID = 4096,
  SLDF_RUNAS_USER = 8192,
  SLDF_HAS_EXP_ICON_SZ = 16384,
  SLDF_NO_PIDL_ALIAS = 0xffff8000,
  SLDF_FORCE_UNCNAME = 0x10000,
  SLDF_RUN_WITH_SHIMLAYER = 0x20000,
  SLDF_FORCE_NO_LINKTRACK = 0x40000,
  SLDF_ENABLE_TARGET_METADATA = 0x80000,
  SLDF_DISABLE_LINK_PATH_TRACKING = 0x100000,
  SLDF_DISABLE_KNOWNFOLDER_RELATIVE_TRACKING = 0x200000,
  SLDF_NO_KF_ALIAS = 0x400000,
  SLDF_ALLOW_LINK_TO_LINK = 0x800000,
  SLDF_UNALIAS_ON_SAVE = 0x1000000,
  SLDF_PREFER_ENVIRONMENT_PATH = 0x2000000,
  SLDF_KEEP_LOCAL_IDLIST_FOR_UNC_TARGET = 0x4000000,
  SLDF_PERSIST_VOLUME_ID_RELATIVE = 0x8000000,
  SLDF_VALID = 0xffff7ff,
  SLDF_RESERVED = -2147483648,
};

struct Windows::Foundation::IEventHandler_impl<Windows::Foundation::Internal::AggregateType<bool,unsigned char> >
{
}; /* size: 0x0008 */

typedef enum _STORAGE_RESERVE_ID
{
  StorageReserveIdNone = 0,
  StorageReserveIdHard = 1,
  StorageReserveIdSoft = 2,
  StorageReserveIdUpdateScratch = 3,
  StorageReserveIdMax = 4,
} STORAGE_RESERVE_ID, *PSTORAGE_RESERVE_ID;

class wil::details::<lambda_18d5264b4415236c27080edcc8a953ea>
{
}; /* size: 0x0001 */

typedef struct _RTL_BITMAP
{
  /* 0x0000 */ unsigned long SizeOfBitMap;
  /* 0x0004 */ long Padding_32;
  /* 0x0008 */ unsigned long* Buffer;
} RTL_BITMAP, *PRTL_BITMAP; /* size: 0x0010 */

class Microsoft::WRL::RuntimeClass<Microsoft::WRL::RuntimeClassFlags<2>,IDragOperationInternal>
{
}; /* size: 0x0010 */

typedef struct _SE_ACCESS_REQUEST
{
  /* 0x0000 */ unsigned long Size;
  /* 0x0004 */ long Padding_33;
  /* 0x0008 */ struct _SE_SECURITY_DESCRIPTOR* SeSecurityDescriptor;
  /* 0x0010 */ unsigned long DesiredAccess;
  /* 0x0014 */ unsigned long PreviouslyGrantedAccess;
  /* 0x0018 */ void* PrincipalSelfSid;
  /* 0x0020 */ struct _GENERIC_MAPPING* GenericMapping;
  /* 0x0028 */ unsigned long ObjectTypeListCount;
  /* 0x002c */ long Padding_34;
  /* 0x0030 */ struct _OBJECT_TYPE_LIST* ObjectTypeList;
} SE_ACCESS_REQUEST, *PSE_ACCESS_REQUEST; /* size: 0x0038 */

enum tagCOINITBASE
{
  COINITBASE_MULTITHREADED = 0,
};

typedef enum __vc_attributes::event_sourceAttribute::type_e
{
  native = 0,
  com = 1,
  managed = 2,
} _vc_attributes::event_sourceAttribute::type_e, *P_vc_attributes::event_sourceAttribute::type_e;

typedef enum __vc_attributes::event_sourceAttribute::optimize_e
{
  speed = 0,
  size = 1,
} _vc_attributes::event_sourceAttribute::optimize_e, *P_vc_attributes::event_sourceAttribute::optimize_e;

typedef struct __vc_attributes::event_sourceAttribute
{
  /* 0x0000 */ enum __vc_attributes::event_sourceAttribute::type_e type;
  /* 0x0004 */ enum __vc_attributes::event_sourceAttribute::optimize_e optimize;
  /* 0x0008 */ BOOL decorate;
  /* 0x0009 */ char __PADDING__[3];
} _vc_attributes::event_sourceAttribute, *P_vc_attributes::event_sourceAttribute; /* size: 0x000c */

enum tagFUNCKIND
{
  FUNC_VIRTUAL = 0,
  FUNC_PUREVIRTUAL = 1,
  FUNC_NONVIRTUAL = 2,
  FUNC_STATIC = 3,
  FUNC_DISPATCH = 4,
};

class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IClipboardProtectionServices> const >;

class wil::unique_any_t<wil::details::unique_storage<wil::details::resource_policy<HSTRING__ *,long (__cdecl*)(HSTRING__ *),&WindowsDeleteString,wistd::integral_constant<unsigned __int64,0>,HSTRING__ *,HSTRING__ *,0,std::nullptr_t> > >
{
}; /* size: 0x0008 */

struct Windows::Foundation::Collections::IIterable<Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,short> *>
{
}; /* size: 0x0008 */

typedef enum _TAG_UNNAMED_16
{
  value = 1,
} TAG_UNNAMED_16, *PTAG_UNNAMED_16;

typedef struct _SINGLE_LIST_ENTRY
{
  /* 0x0000 */ struct _SINGLE_LIST_ENTRY* Next;
} SINGLE_LIST_ENTRY, *PSINGLE_LIST_ENTRY; /* size: 0x0008 */

struct wistd::__compressed_pair_elem<_KEY_VALUE_FULL_INFORMATION *,0,0>
{
  /* 0x0000 */ struct _KEY_VALUE_FULL_INFORMATION* __value_;
}; /* size: 0x0008 */

class wistd::__compressed_pair<_TOKEN_DEFAULT_DACL *,wil::function_deleter<void * (__cdecl*)(void *),&LocalFree> >
{
}; /* size: 0x0008 */

enum tagVARKIND
{
  VAR_PERINSTANCE = 0,
  VAR_STATIC = 1,
  VAR_CONST = 2,
  VAR_DISPATCH = 3,
};

struct wistd::integral_constant<unsigned __int64,1>
{
  /* 0x0000 */ const unsigned __int64 value;
  /* 0x0008 */ char __PADDING__[4294967289];
}; /* size: 0x0001 */

typedef struct _OCSP_CERT_ID
{
  /* 0x0000 */ struct _CRYPT_ALGORITHM_IDENTIFIER HashAlgorithm;
  /* 0x0018 */ struct _CRYPTOAPI_BLOB IssuerNameHash;
  /* 0x0028 */ struct _CRYPTOAPI_BLOB IssuerKeyHash;
  /* 0x0038 */ struct _CRYPTOAPI_BLOB SerialNumber;
} OCSP_CERT_ID, *POCSP_CERT_ID; /* size: 0x0048 */

typedef struct _OCSP_BASIC_RESPONSE_ENTRY
{
  /* 0x0000 */ struct _OCSP_CERT_ID CertId;
  /* 0x0048 */ unsigned long dwCertStatus;
  /* 0x004c */ long Padding_35;
  /* 0x0050 */ struct _OCSP_BASIC_REVOKED_INFO* pRevokedInfo;
  /* 0x0058 */ struct _FILETIME ThisUpdate;
  /* 0x0060 */ struct _FILETIME NextUpdate;
  /* 0x0068 */ unsigned long cExtension;
  /* 0x006c */ long Padding_36;
  /* 0x0070 */ struct _CERT_EXTENSION* rgExtension;
} OCSP_BASIC_RESPONSE_ENTRY, *POCSP_BASIC_RESPONSE_ENTRY; /* size: 0x0078 */

struct Windows::Foundation::ITypedEventHandler_impl<Windows::Storage::Search::IStorageQueryResultBase *,IInspectable *>
{
}; /* size: 0x0008 */

enum tagURLZONE
{
  URLZONE_INVALID = -1,
  URLZONE_PREDEFINED_MIN = 0,
  URLZONE_LOCAL_MACHINE = 0,
  URLZONE_INTRANET = 1,
  URLZONE_TRUSTED = 2,
  URLZONE_INTERNET = 3,
  URLZONE_UNTRUSTED = 4,
  URLZONE_PREDEFINED_MAX = 999,
  URLZONE_USER_MIN = 1000,
  URLZONE_USER_MAX = 10000,
};

struct std::_Basic_container_proxy_ptr12
{
  /* 0x0000 */ struct std::_Container_proxy* _Ptr;
}; /* size: 0x0008 */

class CDefObject::CPrivUnknown
{
}; /* size: 0x0008 */

struct Windows::Foundation::Collections::IIterator_impl<Windows::Data::Text::TextSegment,0>
{
}; /* size: 0x0008 */

enum FreeResourcesFlags
{
  RESET_AND_FREE = 1,
  JUST_RESET = 2,
};

typedef struct _RPC_IF_ID
{
  /* 0x0000 */ struct _GUID Uuid;
  /* 0x0010 */ unsigned short VersMajor;
  /* 0x0012 */ unsigned short VersMinor;
} RPC_IF_ID, *PRPC_IF_ID; /* size: 0x0014 */

enum RESOURCE_LAYOUT_DIRECTION
{
  LTR = 0,
  RTL = 1,
  TTBLTR = 2,
  TTBRTL = 3,
};

typedef struct _FILE_PIPE_PEEK_BUFFER
{
  /* 0x0000 */ unsigned long NamedPipeState;
  /* 0x0004 */ unsigned long ReadDataAvailable;
  /* 0x0008 */ unsigned long NumberOfMessages;
  /* 0x000c */ unsigned long MessageLength;
  /* 0x0010 */ char Data[1];
  /* 0x0011 */ char __PADDING__[3];
} FILE_PIPE_PEEK_BUFFER, *PFILE_PIPE_PEEK_BUFFER; /* size: 0x0014 */

class wil::com_ptr_t<ITypeLib,wil::err_returncode_policy>
{
  /* 0x0000 */ struct ITypeLib* m_ptr;
}; /* size: 0x0008 */

struct IConnectionPointContainer
{
}; /* size: 0x0008 */

class wil::details::unique_storage<wil::details::resource_policy<void *,void (__cdecl*)(void *) noexcept,&wil::details::ReleaseSemaphore,wistd::integral_constant<unsigned __int64,2>,void *,void *,0,std::nullptr_t> >
{
  /* 0x0000 */ void* m_ptr;
}; /* size: 0x0008 */

enum tagCLSCTX
{
  CLSCTX_INPROC_SERVER = 1,
  CLSCTX_INPROC_HANDLER = 2,
  CLSCTX_LOCAL_SERVER = 4,
  CLSCTX_INPROC_SERVER16 = 8,
  CLSCTX_REMOTE_SERVER = 16,
  CLSCTX_INPROC_HANDLER16 = 32,
  CLSCTX_RESERVED1 = 64,
  CLSCTX_RESERVED2 = 128,
  CLSCTX_RESERVED3 = 256,
  CLSCTX_RESERVED4 = 512,
  CLSCTX_NO_CODE_DOWNLOAD = 1024,
  CLSCTX_RESERVED5 = 2048,
  CLSCTX_NO_CUSTOM_MARSHAL = 4096,
  CLSCTX_ENABLE_CODE_DOWNLOAD = 8192,
  CLSCTX_NO_FAILURE_LOG = 16384,
  CLSCTX_DISABLE_AAA = 0xffff8000,
  CLSCTX_ENABLE_AAA = 0x10000,
  CLSCTX_FROM_DEFAULT_CONTEXT = 0x20000,
  CLSCTX_ACTIVATE_X86_SERVER = 0x40000,
  CLSCTX_ACTIVATE_32_BIT_SERVER = 0x40000,
  CLSCTX_ACTIVATE_64_BIT_SERVER = 0x80000,
  CLSCTX_ENABLE_CLOAKING = 0x100000,
  CLSCTX_APPCONTAINER = 0x400000,
  CLSCTX_ACTIVATE_AAA_AS_IU = 0x800000,
  CLSCTX_RESERVED6 = 0x1000000,
  CLSCTX_ACTIVATE_ARM32_SERVER = 0x2000000,
  CLSCTX_ALLOW_LOWER_TRUST_REGISTRATION = 0x4000000,
  CLSCTX_PS_DLL = -2147483648,
};

typedef struct _LDBL12
{
  /* 0x0000 */ unsigned char ld12[12];
} LDBL12, *PLDBL12; /* size: 0x000c */

typedef struct _CAT_NAMEVALUE
{
  /* 0x0000 */ wchar_t* pwszTag;
  /* 0x0008 */ unsigned long fdwFlags;
  /* 0x000c */ long Padding_37;
  /* 0x0010 */ struct _CRYPTOAPI_BLOB Value;
} CAT_NAMEVALUE, *PCAT_NAMEVALUE; /* size: 0x0020 */

class wil::details::<lambda_2f9d2ffb810523de44311142fa7a8c90>
{
}; /* size: 0x0001 */

typedef enum _URLZONEREG
{
  URLZONEREG_DEFAULT = 0,
  URLZONEREG_HKLM = 1,
  URLZONEREG_HKCU = 2,
} URLZONEREG, *PURLZONEREG;

struct Windows::Foundation::Collections::IVector<Windows::Storage::StorageFile *>
{
}; /* size: 0x0008 */

enum Windows::Foundation::Diagnostics::RoErrorReportingFlags
{
  None = 0,
  SuppressExceptions = 1,
  ForceExceptions = 2,
  UseSetErrorInfo = 4,
  SuppressSetErrorInfo = 8,
};

typedef struct _PS_MITIGATION_OPTIONS_MAP
{
  /* 0x0000 */ unsigned __int64 Map[3];
} PS_MITIGATION_OPTIONS_MAP, *PPS_MITIGATION_OPTIONS_MAP; /* size: 0x0018 */

enum SE_WS_APPX_SIGNATURE_ORIGIN
{
  SE_WS_APPX_SIGNATURE_ORIGIN_NOT_VALIDATED = 0,
  SE_WS_APPX_SIGNATURE_ORIGIN_UNKNOWN = 1,
  SE_WS_APPX_SIGNATURE_ORIGIN_APPSTORE = 2,
  SE_WS_APPX_SIGNATURE_ORIGIN_WINDOWS = 3,
  SE_WS_APPX_SIGNATURE_ORIGIN_ENTERPRISE = 4,
};

struct Windows::Foundation::IAsyncOperation_impl<Windows::Storage::Streams::IRandomAccessStreamReference *>
{
}; /* size: 0x0008 */

class wistd::__compressed_pair<_TOKEN_GROUPS_AND_PRIVILEGES *,wil::function_deleter<void * (__cdecl*)(void *),&LocalFree> >
{
}; /* size: 0x0008 */

class wistd::unique_ptr<_TOKEN_GROUPS_AND_PRIVILEGES,wil::function_deleter<void * (__cdecl*)(void *),&LocalFree> >
{
  /* 0x0000 */ class wistd::__compressed_pair<_TOKEN_GROUPS_AND_PRIVILEGES *,wil::function_deleter<void * (__cdecl*)(void *),&LocalFree> > __ptr_;
}; /* size: 0x0008 */

struct IOleInPlaceSiteEx
{
}; /* size: 0x0008 */

struct Windows::Foundation::IAsyncOperation_impl<Windows::Foundation::Collections::IVectorView<Windows::Storage::StorageFolder *> *>
{
}; /* size: 0x0008 */

struct Windows::Foundation::Collections::supports_cleanup<Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,float> *>
{
}; /* size: 0x0001 */

struct Windows::Foundation::Collections::IIterable_impl<Windows::Foundation::Internal::AggregateType<bool,unsigned char> >
{
}; /* size: 0x0008 */

typedef enum _MEM_DEDICATED_ATTRIBUTE_TYPE
{
  MemDedicatedAttributeReadBandwidth = 0,
  MemDedicatedAttributeReadLatency = 1,
  MemDedicatedAttributeWriteBandwidth = 2,
  MemDedicatedAttributeWriteLatency = 3,
  MemDedicatedAttributeMax = 4,
} MEM_DEDICATED_ATTRIBUTE_TYPE, *PMEM_DEDICATED_ATTRIBUTE_TYPE;

struct Windows::Foundation::Collections::IIterable<Windows::Foundation::Rect>
{
}; /* size: 0x0008 */

typedef struct _MALLOC_FREE_STRUCT
{
  /* 0x0000 */ void* pfnAllocate /* function */;
  /* 0x0008 */ void* pfnFree /* function */;
} MALLOC_FREE_STRUCT, *PMALLOC_FREE_STRUCT; /* size: 0x0010 */

typedef enum _KHETERO_CPU_POLICY
{
  KHeteroCpuPolicyAll = 0,
  KHeteroCpuPolicyLarge = 1,
  KHeteroCpuPolicyLargeOrIdle = 2,
  KHeteroCpuPolicySmall = 3,
  KHeteroCpuPolicySmallOrIdle = 4,
  KHeteroCpuPolicyDynamic = 5,
  KHeteroCpuPolicyStaticMax = 5,
  KHeteroCpuPolicyBiasedSmall = 6,
  KHeteroCpuPolicyBiasedLarge = 7,
  KHeteroCpuPolicyDefault = 8,
  KHeteroCpuPolicyMax = 9,
} KHETERO_CPU_POLICY, *PKHETERO_CPU_POLICY;

class wistd::__function::__base<void __cdecl(unsigned short const *,unsigned short const *,char const *,unsigned int *,unsigned short)>
{
}; /* size: 0x0008 */

enum tagDESCKIND
{
  DESCKIND_NONE = 0,
  DESCKIND_FUNCDESC = 1,
  DESCKIND_VARDESC = 2,
  DESCKIND_TYPECOMP = 3,
  DESCKIND_IMPLICITAPPOBJ = 4,
  DESCKIND_MAX = 5,
};

typedef enum __MIDL_IGetBindHandle_0001
{
  BINDHANDLETYPES_APPCACHE = 0,
  BINDHANDLETYPES_DEPENDENCY = 1,
  BINDHANDLETYPES_COUNT = 2,
} _MIDL_IGetBindHandle_0001, *P_MIDL_IGetBindHandle_0001;

enum KNOWN_FOLDER_FLAG
{
  KF_FLAG_DEFAULT = 0,
  KF_FLAG_FORCE_APP_DATA_REDIRECTION = 0x80000,
  KF_FLAG_RETURN_FILTER_REDIRECTION_TARGET = 0x40000,
  KF_FLAG_FORCE_PACKAGE_REDIRECTION = 0x20000,
  KF_FLAG_NO_PACKAGE_REDIRECTION = 0x10000,
  KF_FLAG_FORCE_APPCONTAINER_REDIRECTION = 0x20000,
  KF_FLAG_NO_APPCONTAINER_REDIRECTION = 0x10000,
  KF_FLAG_CREATE = 0xffff8000,
  KF_FLAG_DONT_VERIFY = 16384,
  KF_FLAG_DONT_UNEXPAND = 8192,
  KF_FLAG_NO_ALIAS = 4096,
  KF_FLAG_INIT = 2048,
  KF_FLAG_DEFAULT_PATH = 1024,
  KF_FLAG_NOT_PARENT_RELATIVE = 512,
  KF_FLAG_SIMPLE_IDLIST = 256,
  KF_FLAG_ALIAS_ONLY = -2147483648,
};

struct Windows::Foundation::Collections::is_foundation_struct<Windows::System::IUser *>
{
}; /* size: 0x0001 */

typedef struct _FILE_STANDARD_INFO
{
  /* 0x0000 */ union _LARGE_INTEGER AllocationSize;
  /* 0x0008 */ union _LARGE_INTEGER EndOfFile;
  /* 0x0010 */ unsigned long NumberOfLinks;
  /* 0x0014 */ unsigned char DeletePending;
  /* 0x0015 */ unsigned char Directory;
  /* 0x0016 */ char __PADDING__[2];
} FILE_STANDARD_INFO, *PFILE_STANDARD_INFO; /* size: 0x0018 */

struct IPersistMemory
{
}; /* size: 0x0008 */

class LargeIntRegMultiply<__int64,unsigned int>
{
}; /* size: 0x0001 */

typedef enum _MEMORY_PHYSICAL_CONTIGUITY_UNIT_STATE
{
  MemoryNotContiguous = 0,
  MemoryAlignedAndContiguous = 1,
  MemoryNotResident = 2,
  MemoryNotEligibleToMakeContiguous = 3,
  MemoryContiguityStateMax = 4,
} MEMORY_PHYSICAL_CONTIGUITY_UNIT_STATE, *PMEMORY_PHYSICAL_CONTIGUITY_UNIT_STATE;

struct Windows::Foundation::Collections::is_pointer<unsigned int>
{
}; /* size: 0x0001 */

enum PIDMSI_STATUS_VALUE
{
  PIDMSI_STATUS_NORMAL = 0,
  PIDMSI_STATUS_NEW = 1,
  PIDMSI_STATUS_PRELIM = 2,
  PIDMSI_STATUS_DRAFT = 3,
  PIDMSI_STATUS_INPROGRESS = 4,
  PIDMSI_STATUS_EDIT = 5,
  PIDMSI_STATUS_REVIEW = 6,
  PIDMSI_STATUS_PROOF = 7,
  PIDMSI_STATUS_FINAL = 8,
  PIDMSI_STATUS_OTHER = 32767,
};

struct Windows::Foundation::IAsyncOperationCompletedHandler_impl<Windows::Foundation::Collections::IVectorView<HSTRING__ *> *>
{
}; /* size: 0x0008 */

enum tagDHFlags
{
  DH_SAME_AS_LOAD = 1,
  DH_CONTAINED_OBJECT = 2,
  DH_LOCKED_CONTAINER = 4,
  DH_FORCED_RUNNING = 8,
  DH_EMBEDDING = 16,
  DH_INIT_NEW = 32,
  DH_STATIC = 64,
  DH_INPROC_HANDLER = 128,
  DH_DELAY_CREATE = 256,
  DH_COM_OUTEROBJECT = 512,
  DH_UNMARSHALED = 1024,
  DH_CLEANEDUP = 2048,
  DH_OLE1SERVER = 4096,
  DH_APICREATE = 8192,
};

struct Windows::Foundation::Collections::IIterator<Windows::Storage::StorageLibrary *>
{
}; /* size: 0x0008 */

class wil::unique_any_t<wil::semaphore_t<wil::details::unique_storage<wil::details::resource_policy<void *,void (__cdecl*)(void *) noexcept,&wil::details::CloseHandle,wistd::integral_constant<unsigned __int64,0>,void *,void *,0,std::nullptr_t> >,wil::err_returncode_policy> >
{
}; /* size: 0x0008 */

struct IUnknown
{
}; /* size: 0x0008 */

struct Windows::Foundation::Collections::IVectorView_impl<HSTRING__ *,1>
{
}; /* size: 0x0008 */

typedef enum _FILE_ID_TYPE
{
  FileIdType = 0,
  ObjectIdType = 1,
  ExtendedFileIdType = 2,
  MaximumFileIdType = 3,
} FILE_ID_TYPE, *PFILE_ID_TYPE;

enum tagSYSKIND
{
  SYS_WIN16 = 0,
  SYS_WIN32 = 1,
  SYS_MAC = 2,
  SYS_WIN64 = 3,
};

class Microsoft::WRL::ComPtr<IComClassIterator>
{
  /* 0x0000 */ struct IComClassIterator* ptr_;
}; /* size: 0x0008 */

struct GetTypeValueImpl<long,unsigned short const *,unsigned long,long>
{
}; /* size: 0x0001 */

class IsInt<__int64>
{
}; /* size: 0x0001 */

struct tagCFEntry
{
  /* 0x0000 */ const struct _GUID* pclsid;
  /* 0x0008 */ void* pfnCI /* function */;
  /* 0x0010 */ unsigned long dwFlags;
  /* 0x0014 */ long __PADDING__[1];
}; /* size: 0x0018 */

enum tagGLOBALOPT_EH_VALUES
{
  COMGLB_EXCEPTION_HANDLE = 0,
  COMGLB_EXCEPTION_DONOT_HANDLE_FATAL = 1,
  COMGLB_EXCEPTION_DONOT_HANDLE = 1,
  COMGLB_EXCEPTION_DONOT_HANDLE_ANY = 2,
};

typedef enum _TAG_UNNAMED_17
{
  value = 1,
} TAG_UNNAMED_17, *PTAG_UNNAMED_17;

struct IOlePresObj
{
}; /* size: 0x0008 */

typedef struct _VCN_RANGE_INPUT_BUFFER
{
  /* 0x0000 */ union _LARGE_INTEGER StartingVcn;
  /* 0x0008 */ union _LARGE_INTEGER ClusterCount;
} VCN_RANGE_INPUT_BUFFER, *PVCN_RANGE_INPUT_BUFFER; /* size: 0x0010 */

class LargeIntRegMultiply<int,__int64>
{
}; /* size: 0x0001 */

typedef struct __vc_attributes::atl::perfmonAttribute
{
  /* 0x0000 */ const char* name;
  /* 0x0008 */ BOOL register;
  /* 0x0009 */ char __PADDING__[7];
} _vc_attributes::atl::perfmonAttribute, *P_vc_attributes::atl::perfmonAttribute; /* size: 0x0010 */

enum tagCHANGEKIND
{
  CHANGEKIND_ADDMEMBER = 0,
  CHANGEKIND_DELETEMEMBER = 1,
  CHANGEKIND_SETNAMES = 2,
  CHANGEKIND_SETDOCUMENTATION = 3,
  CHANGEKIND_GENERAL = 4,
  CHANGEKIND_INVALIDATE = 5,
  CHANGEKIND_CHANGEFAILED = 6,
  CHANGEKIND_MAX = 7,
};

class wil::details::ApiTelemetryLogger::FireEvent_::__l2::<lambda_35813abc48134a673502c50f3be72d9b>;

struct std::_Atomic_padded<long>
{
  /* 0x0000 */ long _Value;
}; /* size: 0x0004 */

struct std::_Atomic_storage<long,4>
{
  /* 0x0000 */ struct std::_Atomic_padded<long> _Storage;
}; /* size: 0x0004 */

typedef struct _FILE_INITIATE_REPAIR_OUTPUT_BUFFER
{
  /* 0x0000 */ unsigned __int64 Hint1;
  /* 0x0008 */ unsigned __int64 Hint2;
  /* 0x0010 */ unsigned __int64 Clsn;
  /* 0x0018 */ long Status;
  /* 0x001c */ long __PADDING__[1];
} FILE_INITIATE_REPAIR_OUTPUT_BUFFER, *PFILE_INITIATE_REPAIR_OUTPUT_BUFFER; /* size: 0x0020 */

typedef enum _REFS_STREAM_SNAPSHOT_OPERATION
{
  REFS_STREAM_SNAPSHOT_OPERATION_INVALID = 0,
  REFS_STREAM_SNAPSHOT_OPERATION_CREATE = 1,
  REFS_STREAM_SNAPSHOT_OPERATION_LIST = 2,
  REFS_STREAM_SNAPSHOT_OPERATION_QUERY_DELTAS = 3,
  REFS_STREAM_SNAPSHOT_OPERATION_REVERT = 4,
  REFS_STREAM_SNAPSHOT_OPERATION_SET_SHADOW_BTREE = 5,
  REFS_STREAM_SNAPSHOT_OPERATION_CLEAR_SHADOW_BTREE = 6,
  REFS_STREAM_SNAPSHOT_OPERATION_MAX = 6,
} REFS_STREAM_SNAPSHOT_OPERATION, *PREFS_STREAM_SNAPSHOT_OPERATION;

typedef struct _WIN_TRUST_ACTDATA_CONTEXT_WITH_SUBJECT
{
  /* 0x0000 */ void* hClientToken;
  /* 0x0008 */ struct _GUID* SubjectType;
  /* 0x0010 */ void* Subject;
} WIN_TRUST_ACTDATA_CONTEXT_WITH_SUBJECT, *PWIN_TRUST_ACTDATA_CONTEXT_WITH_SUBJECT; /* size: 0x0018 */

struct IPropertyNotifySink
{
}; /* size: 0x0008 */

struct DataObjectFormats::CLIPBOARDFORMATENTRY
{
  /* 0x0000 */ unsigned short format;
  /* 0x0002 */ char Padding_38[6];
  /* 0x0008 */ const wchar_t* name;
}; /* size: 0x0010 */

typedef enum _TAG_UNNAMED_18
{
  value = 0,
} TAG_UNNAMED_18, *PTAG_UNNAMED_18;

struct Windows::Foundation::Collections::IIterator<Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,short> *>
{
}; /* size: 0x0008 */

class AdHocInterceptorForwarders<IElementBehavior,IElementBehavior>::Notify::__l2::<lambda_c9f70ef396276824209f5bb13f61de84>
{
  /* 0x0000 */ long lEvent;
  /* 0x0004 */ long Padding_39;
  /* 0x0008 */ struct tagVARIANT* pVar;
}; /* size: 0x0010 */

typedef enum _FIRMWARE_TYPE
{
  FirmwareTypeUnknown = 0,
  FirmwareTypeBios = 1,
  FirmwareTypeUefi = 2,
  FirmwareTypeMax = 3,
} FIRMWARE_TYPE, *PFIRMWARE_TYPE;

struct RPC_STATS_VECTOR
{
  /* 0x0000 */ unsigned int Count;
  /* 0x0004 */ unsigned long Stats[1];
}; /* size: 0x0008 */

struct tagEMR
{
  /* 0x0000 */ unsigned long iType;
  /* 0x0004 */ unsigned long nSize;
}; /* size: 0x0008 */

typedef struct _RECTL
{
  /* 0x0000 */ long left;
  /* 0x0004 */ long top;
  /* 0x0008 */ long right;
  /* 0x000c */ long bottom;
} RECTL, *PRECTL; /* size: 0x0010 */

typedef struct _POINTL
{
  /* 0x0000 */ long x;
  /* 0x0004 */ long y;
} POINTL, *PPOINTL; /* size: 0x0008 */

struct tagEMRPOLYPOLYLINE
{
  /* 0x0000 */ struct tagEMR emr;
  /* 0x0008 */ struct _RECTL rclBounds;
  /* 0x0018 */ unsigned long nPolys;
  /* 0x001c */ unsigned long cptl;
  /* 0x0020 */ unsigned long aPolyCounts[1];
  /* 0x0024 */ struct _POINTL aptl[1];
}; /* size: 0x002c */

struct Windows::Foundation::IAsyncOperationCompletedHandler<unsigned int>
{
}; /* size: 0x0008 */

typedef struct _MINIDUMP_INCLUDE_MODULE_CALLBACK
{
  /* 0x0000 */ unsigned __int64 BaseOfImage;
} MINIDUMP_INCLUDE_MODULE_CALLBACK, *PMINIDUMP_INCLUDE_MODULE_CALLBACK; /* size: 0x0008 */

struct Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,Windows::Storage::Streams::RandomAccessStreamReference *>
{
}; /* size: 0x0008 */

typedef enum _REFS_SET_VOLUME_COMPRESSION_INFO_FLAGS
{
  REFS_SET_VOLUME_COMPRESSION_INFO_FLAG_COMPRESS_SYNC = 1,
  REFS_SET_VOLUME_COMPRESSION_INFO_FLAG_MAX = 1,
} REFS_SET_VOLUME_COMPRESSION_INFO_FLAGS, *PREFS_SET_VOLUME_COMPRESSION_INFO_FLAGS;

class Windows::Storage::FileProperties::VideoProperties;

class wil::details::unique_storage<wil::details::resource_policy<void *,void * (__cdecl*)(void *),&LocalFree,wistd::integral_constant<unsigned __int64,0>,void *,void *,0,std::nullptr_t> >
{
  /* 0x0000 */ void* m_ptr;
}; /* size: 0x0008 */

class Microsoft::WRL::Details::ComPtrRefBase<Microsoft::WRL::ComPtr<IClipboardBrokerInternal> >
{
  /* 0x0000 */ class Microsoft::WRL::ComPtr<IClipboardBrokerInternal>* ptr_;
}; /* size: 0x0008 */

typedef enum _JOBOBJECTINFOCLASS
{
  JobObjectBasicAccountingInformation = 1,
  JobObjectBasicLimitInformation = 2,
  JobObjectBasicProcessIdList = 3,
  JobObjectBasicUIRestrictions = 4,
  JobObjectSecurityLimitInformation = 5,
  JobObjectEndOfJobTimeInformation = 6,
  JobObjectAssociateCompletionPortInformation = 7,
  JobObjectBasicAndIoAccountingInformation = 8,
  JobObjectExtendedLimitInformation = 9,
  JobObjectJobSetInformation = 10,
  JobObjectGroupInformation = 11,
  JobObjectNotificationLimitInformation = 12,
  JobObjectLimitViolationInformation = 13,
  JobObjectGroupInformationEx = 14,
  JobObjectCpuRateControlInformation = 15,
  JobObjectCompletionFilter = 16,
  JobObjectCompletionCounter = 17,
  JobObjectFreezeInformation = 18,
  JobObjectExtendedAccountingInformation = 19,
  JobObjectWakeInformation = 20,
  JobObjectBackgroundInformation = 21,
  JobObjectSchedulingRankBiasInformation = 22,
  JobObjectTimerVirtualizationInformation = 23,
  JobObjectCycleTimeNotification = 24,
  JobObjectClearEvent = 25,
  JobObjectInterferenceInformation = 26,
  JobObjectClearPeakJobMemoryUsed = 27,
  JobObjectMemoryUsageInformation = 28,
  JobObjectSharedCommit = 29,
  JobObjectContainerId = 30,
  JobObjectIoRateControlInformation = 31,
  JobObjectSiloRootDirectory = 37,
  JobObjectServerSiloBasicInformation = 38,
  JobObjectServerSiloUserSharedData = 39,
  JobObjectServerSiloInitialize = 40,
  JobObjectServerSiloRunningState = 41,
  JobObjectIoAttribution = 42,
  JobObjectMemoryPartitionInformation = 43,
  JobObjectContainerTelemetryId = 44,
  JobObjectSiloSystemRoot = 45,
  JobObjectEnergyTrackingState = 46,
  JobObjectThreadImpersonationInformation = 47,
  JobObjectIoPriorityLimit = 48,
  JobObjectPagePriorityLimit = 49,
  JobObjectReserved1Information = 18,
  JobObjectReserved2Information = 19,
  JobObjectReserved3Information = 20,
  JobObjectReserved4Information = 21,
  JobObjectReserved5Information = 22,
  JobObjectReserved6Information = 23,
  JobObjectReserved7Information = 24,
  JobObjectReserved8Information = 25,
  JobObjectReserved9Information = 26,
  JobObjectReserved10Information = 27,
  JobObjectReserved11Information = 28,
  JobObjectReserved12Information = 29,
  JobObjectReserved13Information = 30,
  JobObjectReserved14Information = 31,
  JobObjectNetRateControlInformation = 32,
  JobObjectNotificationLimitInformation2 = 33,
  JobObjectLimitViolationInformation2 = 34,
  JobObjectCreateSilo = 35,
  JobObjectSiloBasicInformation = 36,
  JobObjectReserved15Information = 37,
  JobObjectReserved16Information = 38,
  JobObjectReserved17Information = 39,
  JobObjectReserved18Information = 40,
  JobObjectReserved19Information = 41,
  JobObjectReserved20Information = 42,
  JobObjectReserved21Information = 43,
  JobObjectReserved22Information = 44,
  JobObjectReserved23Information = 45,
  JobObjectReserved24Information = 46,
  JobObjectReserved25Information = 47,
  JobObjectReserved26Information = 48,
  JobObjectReserved27Information = 49,
  MaxJobObjectInfoClass = 50,
} JOBOBJECTINFOCLASS, *PJOBOBJECTINFOCLASS;

struct SHashChain
{
  /* 0x0000 */ struct SHashChain* pNext;
  /* 0x0008 */ struct SHashChain* pPrev;
}; /* size: 0x0010 */

struct SMultiGUIDKey
{
  /* 0x0000 */ int cGUID;
  /* 0x0004 */ long Padding_40;
  /* 0x0008 */ struct _GUID* aGUID;
}; /* size: 0x0010 */

struct SMultiGUIDHashNode
{
  /* 0x0000 */ struct SHashChain chain;
  /* 0x0010 */ struct SMultiGUIDKey key;
}; /* size: 0x0020 */

enum Windows::System::UserWatcherUpdateKind
{
  UserWatcherUpdateKind_Properties = 0,
  UserWatcherUpdateKind_Picture = 1,
};

class wil::details::<lambda_36b6383059ccf096d9b86cd05953661d>
{
}; /* size: 0x0001 */

struct ICallFactory
{
}; /* size: 0x0008 */

typedef struct _MEMORY_PARTITION_MEMORY_EVENTS_INFORMATION
{
  union
  {
    union
    {
      struct /* bitfield */
      {
        /* 0x0000 */ unsigned long CommitEvents : 1; /* bit position: 0 */
        /* 0x0000 */ unsigned long Spare : 31; /* bit position: 1 */
      }; /* bitfield */
      /* 0x0000 */ unsigned long AllFlags;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ Flags;
  /* 0x0004 */ unsigned long HandleAttributes;
  /* 0x0008 */ unsigned long DesiredAccess;
  /* 0x000c */ long Padding_41;
  /* 0x0010 */ void* LowCommitCondition;
  /* 0x0018 */ void* HighCommitCondition;
  /* 0x0020 */ void* MaximumCommitCondition;
} MEMORY_PARTITION_MEMORY_EVENTS_INFORMATION, *PMEMORY_PARTITION_MEMORY_EVENTS_INFORMATION; /* size: 0x0028 */

enum VARENUM
{
  VT_EMPTY = 0,
  VT_NULL = 1,
  VT_I2 = 2,
  VT_I4 = 3,
  VT_R4 = 4,
  VT_R8 = 5,
  VT_CY = 6,
  VT_DATE = 7,
  VT_BSTR = 8,
  VT_DISPATCH = 9,
  VT_ERROR = 10,
  VT_BOOL = 11,
  VT_VARIANT = 12,
  VT_UNKNOWN = 13,
  VT_DECIMAL = 14,
  VT_I1 = 16,
  VT_UI1 = 17,
