typedef union _SLIST_HEADER
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned __int64 Alignment;
      /* 0x0008 */ unsigned __int64 Region;
    }; /* size: 0x0010 */
    struct
    {
      struct /* bitfield */
      {
        /* 0x0000 */ unsigned __int64 Depth : 16; /* bit position: 0 */
        /* 0x0000 */ unsigned __int64 Sequence : 48; /* bit position: 16 */
      }; /* bitfield */
      struct /* bitfield */
      {
        /* 0x0008 */ unsigned __int64 Reserved : 4; /* bit position: 0 */
        /* 0x0008 */ unsigned __int64 NextEntry : 60; /* bit position: 4 */
      }; /* bitfield */
    } /* size: 0x0010 */ HeaderX64;
  }; /* size: 0x0010 */
} SLIST_HEADER, *PSLIST_HEADER; /* size: 0x0010 */

typedef struct _RTL_BITMAP
{
  /* 0x0000 */ unsigned long SizeOfBitMap;
  /* 0x0008 */ unsigned long* Buffer;
} RTL_BITMAP, *PRTL_BITMAP; /* size: 0x0010 */

typedef struct _MI_STANDBY_STATE
{
  /* 0x0000 */ unsigned __int64 FirstDecayPage;
  /* 0x0010 */ union _SLIST_HEADER PfnDecayFreeSList;
  /* 0x0020 */ volatile long DecayPfnLock;
  /* 0x0028 */ struct _RTL_BITMAP DecayPfnsToBeFreed;
  /* 0x0038 */ unsigned long DecayPfnsToBeFreedBuffer[64];
  /* 0x0140 */ union _SLIST_HEADER PageHeatListSlist;
  /* 0x0150 */ volatile long PageHeatListDisableAllocation;
  /* 0x0154 */ volatile unsigned long TransitionPagesMadeCold;
  /* 0x0158 */ long __PADDING__[2];
} MI_STANDBY_STATE, *PMI_STANDBY_STATE; /* size: 0x0160 */

