enum _DEVICE_RELATION_TYPE;
enum _HALP_EMERGENCY_LA_QUEUE_TYPE;
enum _POOL_TYPE;
struct _MI_COLOR;
enum _MMLISTS;
struct _LIST_ENTRY;
struct _RTL_BALANCED_NODE;
struct _MI_ACTIVE_PFN;
struct _MIPFNFLINK;
struct _MMPTE_HARDWARE;
struct _MMPTE_PROTOTYPE;
struct _MMPTE_SOFTWARE;
struct _MMPTE_TIMESTAMP;
struct _MMPTE_TRANSITION;
struct _MMPTE_SUBSECTION;
struct _MMPTE_LIST;
struct _MMPTE_ACTIVE_PAGE_TABLE_LINKS;
struct _MMPTE;
struct _MIPFNBLINK;
struct _MMPFNENTRY1;
struct _MMPFNENTRY3;
struct _MI_PFN_FLAGS;
struct _MI_PFN_FLAGS5;
struct _MI_PFN_FLAGS4;
struct _MMPFN;
struct _MMPFNLIST;
struct _UNICODE_STRING;
struct _MM_DRIVER_VERIFIER_DATA;
enum _EX_POOL_PRIORITY;
enum _EVENT_TYPE;
struct _KGROUP_MASK;
union _TIMELINE_BITMAP;
enum _MEMORY_CACHING_TYPE;
struct _LOADER_FEATURE_CONFIGURATION_DIAGNOSTIC_INFORMATION;
enum _FILE_INFORMATION_CLASS;
struct _EVENT_FILTER_LEVEL_KW;
struct _RTL_AVL_TREE;
enum _DIRECTORY_NOTIFY_INFORMATION_CLASS;
struct _FAULT_INFORMATION_X64_FLAGS;
enum _FAULT_INFORMATION_ARM64_TYPE;
struct _FAULT_INFORMATION_X64;
struct _MMSUPPORT_FLAGS;
struct _MMSUPPORT_INSTANCE;
struct _MMSUPPORT_SHARED;
struct _MMSUPPORT_FULL;
enum _FSINFOCLASS;
struct PROCESSOR_IDLESTATE_INFO;
struct _BOOT_FIRMWARE_RAMDISK_INFO;
enum BUS_QUERY_ID_TYPE;
enum DEVICE_TEXT_TYPE;
enum _DEVICE_USAGE_NOTIFICATION_TYPE;
struct _LOADER_FEATURE_CONFIGURATION_INFORMATION;
enum _SYSTEM_POWER_STATE;
struct _LOADER_MEMORY_RANGE;
enum _POWER_STATE_TYPE;
struct _DBGKD_READ_MEMORY32;

struct _TRIAGE_9F_PNP;
struct _TRIAGE_PNP_DEVICE_COMPLETION_QUEUE;
struct _TRIAGE_EX_WORK_QUEUE;
struct _OBJECT_SYMBOLIC_LINK;
struct _TRIAGE_DEVICE_NODE;
struct _TRIAGE_POP_IRP_DATA;
struct _PI_RESOURCE_ARBITER_ENTRY;
struct _POP_DEVICE_SYS_STATE;
struct _OBJECT_REF_INFO;
struct _FAST_ERESOURCE;
struct _EX_HEAP_SESSION_STATE;
struct _MEMORY_ALLOCATION_DESCRIPTOR;
struct _DELAY_ACK_FO;
struct HAL_PRIVATE_DISPATCH;
struct _MAP_REGISTER_ENTRY;
struct _HEADLESS_LOADER_BLOCK;
struct _NUMA_MEMORY_RANGE;
struct _COMPOSITEFS_LAYER_INFORMATION;
struct _LOADER_FEATURE_CONFIGURATION_INFORMATION2;
struct _HAL_DP_REPLACE_PARAMETERS;
struct _INPUT_MAPPING_ELEMENT;
struct _HAL_LBR_ENTRY;
struct _HAL_IOMMU_DISPATCH;
struct _IOMMU_DMA_LOGICAL_ALLOCATOR_CONFIG;
struct _IOMMU_DMA_DEVICE_INFORMATION;
struct _SECTION;
struct _MI_COMBINE_BLOCK;
struct _MI_DRIVER_VA;
struct _MI_SYSTEM_NODE_NONPAGED_POOL;
struct _MI_HUGE_PFN;
struct PROCESSOR_IDLESTATE_POLICY;
struct _EXCEPTION_POINTERS;
struct _ARBITER_ORDERING;
struct _ARBITER_ALTERNATIVE;
struct _VF_DRIVER_IO_CALLBACKS;
struct _PI_BUS_EXTENSION;
struct _RTL_ATOM_TABLE_ENTRY;
struct _TraceLoggingMetadata_t;
struct _EX_PARTITION;
struct _VERIFIER_SHARED_EXPORT_THUNK;
struct _VI_VERIFIER_POOL_HEADER;
struct _ETWP_NOTIFICATION_HEADER;
struct _ETW_PROVIDER_TRAITS;
struct _VI_TRACK_IRQL;
struct _IOV_FORCED_PENDING_TRACE;
struct _DIAGNOSTIC_BUFFER;
struct _DUMP_STACK_CONTEXT;
struct PO_MEMORY_IMAGE;
struct _ISR_THUNK;
struct _WAITING_IRP;
struct _EXP_PULLED_FILE_TABLE;
struct _TRIAGE_9F_POWER;
struct _PTE_TRACKER;
struct _POOL_TRACKER_BIG_PAGES;
struct PROCESSOR_PERFSTATE_POLICY;
struct _LDR_DDAG_NODE;
struct _POP_POWER_SETTING_VALUES;
struct _RTLP_RANGE_LIST_ENTRY;
struct _KWAIT_CHAIN_ENTRY;
struct _CALL_HASH_ENTRY;

typedef enum _DEVICE_RELATION_TYPE
{
  BusRelations = 0,
  EjectionRelations = 1,
  PowerRelations = 2,
  RemovalRelations = 3,
  TargetDeviceRelation = 4,
  SingleBusRelations = 5,
  TransportRelations = 6,
} DEVICE_RELATION_TYPE, *PDEVICE_RELATION_TYPE;

typedef enum _HALP_EMERGENCY_LA_QUEUE_TYPE
{
  HalpDmaLegacyLaQueueEntry = 0,
  HalpDmaThinLaQueueEntry = 1,
  HalpDmaLaQueueEntryMax = 2,
} HALP_EMERGENCY_LA_QUEUE_TYPE, *PHALP_EMERGENCY_LA_QUEUE_TYPE;

typedef enum _POOL_TYPE
{
  NonPagedPool = 0,
  NonPagedPoolExecute = 0,
  PagedPool = 1,
  NonPagedPoolMustSucceed = 2,
  DontUseThisType = 3,
  NonPagedPoolCacheAligned = 4,
  PagedPoolCacheAligned = 5,
  NonPagedPoolCacheAlignedMustS = 6,
  MaxPoolType = 7,
  NonPagedPoolBase = 0,
  NonPagedPoolBaseMustSucceed = 2,
  NonPagedPoolBaseCacheAligned = 4,
  NonPagedPoolBaseCacheAlignedMustS = 6,
  NonPagedPoolSession = 32,
  PagedPoolSession = 33,
  NonPagedPoolMustSucceedSession = 34,
  DontUseThisTypeSession = 35,
  NonPagedPoolCacheAlignedSession = 36,
  PagedPoolCacheAlignedSession = 37,
  NonPagedPoolCacheAlignedMustSSession = 38,
  NonPagedPoolNx = 512,
  NonPagedPoolNxCacheAligned = 516,
  NonPagedPoolSessionNx = 544,
} POOL_TYPE, *PPOOL_TYPE;

typedef struct _MI_COLOR
{
  union
  {
    /* 0x0000 */ unsigned long EntireField;
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long Cache : 8; /* bit position: 0 */
      /* 0x0000 */ unsigned long Channel : 1; /* bit position: 8 */
      /* 0x0000 */ unsigned long Node : 6; /* bit position: 9 */
      /* 0x0000 */ unsigned long HighLow : 1; /* bit position: 15 */
      /* 0x0000 */ unsigned long LargePageIndex : 2; /* bit position: 16 */
      /* 0x0000 */ unsigned long CacheAttribute : 2; /* bit position: 18 */
      /* 0x0000 */ unsigned long ListName : 1; /* bit position: 20 */
    }; /* bitfield */
  }; /* size: 0x0004 */
} MI_COLOR, *PMI_COLOR; /* size: 0x0004 */

typedef enum _MMLISTS
{
  ZeroedPageList = 0,
  FreePageList = 1,
  StandbyPageList = 2,
  ModifiedPageList = 3,
  ModifiedNoWritePageList = 4,
  BadPageList = 5,
  ActiveAndValid = 6,
  TransitionPage = 7,
} MMLISTS, *PMMLISTS;

typedef struct _LIST_ENTRY
{
  /* 0x0000 */ struct _LIST_ENTRY* Flink;
  /* 0x0008 */ struct _LIST_ENTRY* Blink;
} LIST_ENTRY, *PLIST_ENTRY; /* size: 0x0010 */

typedef struct _RTL_BALANCED_NODE
{
  union
  {
    /* 0x0000 */ struct _RTL_BALANCED_NODE* Children[2];
    struct
    {
      /* 0x0000 */ struct _RTL_BALANCED_NODE* Left;
      /* 0x0008 */ struct _RTL_BALANCED_NODE* Right;
    }; /* size: 0x0010 */
  }; /* size: 0x0010 */
  union
  {
    /* 0x0010 */ unsigned char Red : 1; /* bit position: 0 */
    /* 0x0010 */ unsigned char Balance : 2; /* bit position: 0 */
    /* 0x0010 */ unsigned __int64 ParentValue;
  }; /* size: 0x0008 */
} RTL_BALANCED_NODE, *PRTL_BALANCED_NODE; /* size: 0x0018 */

typedef struct _MI_ACTIVE_PFN
{
  union
  {
    struct
    {
      struct /* bitfield */
      {
        /* 0x0000 */ unsigned __int64 Tradable : 1; /* bit position: 0 */
        /* 0x0000 */ unsigned __int64 NonPagedBuddy : 43; /* bit position: 1 */
        /* 0x0000 */ unsigned __int64 Spare : 20; /* bit position: 44 */
      }; /* bitfield */
    } /* size: 0x0008 */ Leaf;
    struct
    {
      struct /* bitfield */
      {
        /* 0x0000 */ unsigned __int64 Tradable : 1; /* bit position: 0 */
        /* 0x0000 */ unsigned __int64 NonPagedBuddy : 31; /* bit position: 1 */
        /* 0x0000 */ unsigned __int64 UsedPageTableEntries : 10; /* bit position: 32 */
        /* 0x0000 */ unsigned __int64 WsleAge : 3; /* bit position: 42 */
        /* 0x0000 */ unsigned __int64 OldestWsleLeafEntries : 10; /* bit position: 45 */
        /* 0x0000 */ unsigned __int64 OldestWsleLeafAge : 3; /* bit position: 55 */
        /* 0x0000 */ unsigned __int64 Spare : 6; /* bit position: 58 */
      }; /* bitfield */
    } /* size: 0x0008 */ PageTable;
    /* 0x0000 */ unsigned __int64 EntireActiveField;
  }; /* size: 0x0008 */
} MI_ACTIVE_PFN, *PMI_ACTIVE_PFN; /* size: 0x0008 */

typedef struct _MIPFNFLINK
{
  union
  {
    /* 0x0000 */ struct _SLIST_ENTRY* NextSlistPfn;
    /* 0x0000 */ void* Next;
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned __int64 Flink : 40; /* bit position: 0 */
      /* 0x0000 */ unsigned __int64 NodeFlinkLow : 24; /* bit position: 40 */
    }; /* bitfield */
    /* 0x0000 */ unsigned __int64 EntireField;
    /* 0x0000 */ struct _MI_ACTIVE_PFN Active;
  }; /* size: 0x0008 */
} MIPFNFLINK, *PMIPFNFLINK; /* size: 0x0008 */

typedef struct _MMPTE_HARDWARE
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned __int64 Valid : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned __int64 Dirty1 : 1; /* bit position: 1 */
    /* 0x0000 */ unsigned __int64 Owner : 1; /* bit position: 2 */
    /* 0x0000 */ unsigned __int64 WriteThrough : 1; /* bit position: 3 */
    /* 0x0000 */ unsigned __int64 CacheDisable : 1; /* bit position: 4 */
    /* 0x0000 */ unsigned __int64 Accessed : 1; /* bit position: 5 */
    /* 0x0000 */ unsigned __int64 Dirty : 1; /* bit position: 6 */
    /* 0x0000 */ unsigned __int64 LargePage : 1; /* bit position: 7 */
    /* 0x0000 */ unsigned __int64 Global : 1; /* bit position: 8 */
    /* 0x0000 */ unsigned __int64 CopyOnWrite : 1; /* bit position: 9 */
    /* 0x0000 */ unsigned __int64 Unused : 1; /* bit position: 10 */
    /* 0x0000 */ unsigned __int64 Write : 1; /* bit position: 11 */
    /* 0x0000 */ unsigned __int64 PageFrameNumber : 40; /* bit position: 12 */
    /* 0x0000 */ unsigned __int64 ReservedForSoftware : 4; /* bit position: 52 */
    /* 0x0000 */ unsigned __int64 WsleAge : 4; /* bit position: 56 */
    /* 0x0000 */ unsigned __int64 WsleProtection : 3; /* bit position: 60 */
    /* 0x0000 */ unsigned __int64 NoExecute : 1; /* bit position: 63 */
  }; /* bitfield */
} MMPTE_HARDWARE, *PMMPTE_HARDWARE; /* size: 0x0008 */

typedef struct _MMPTE_PROTOTYPE
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned __int64 Valid : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned __int64 DemandFillProto : 1; /* bit position: 1 */
    /* 0x0000 */ unsigned __int64 HiberVerifyConverted : 1; /* bit position: 2 */
    /* 0x0000 */ unsigned __int64 ReadOnly : 1; /* bit position: 3 */
    /* 0x0000 */ unsigned __int64 SwizzleBit : 1; /* bit position: 4 */
    /* 0x0000 */ unsigned __int64 Protection : 5; /* bit position: 5 */
    /* 0x0000 */ unsigned __int64 Prototype : 1; /* bit position: 10 */
    /* 0x0000 */ unsigned __int64 Combined : 1; /* bit position: 11 */
    /* 0x0000 */ unsigned __int64 Unused1 : 4; /* bit position: 12 */
    /* 0x0000 */ __int64 ProtoAddress : 48; /* bit position: 16 */
  }; /* bitfield */
} MMPTE_PROTOTYPE, *PMMPTE_PROTOTYPE; /* size: 0x0008 */

typedef struct _MMPTE_SOFTWARE
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned __int64 Valid : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned __int64 PageFileReserved : 1; /* bit position: 1 */
    /* 0x0000 */ unsigned __int64 PageFileAllocated : 1; /* bit position: 2 */
    /* 0x0000 */ unsigned __int64 ColdPage : 1; /* bit position: 3 */
    /* 0x0000 */ unsigned __int64 SwizzleBit : 1; /* bit position: 4 */
    /* 0x0000 */ unsigned __int64 Protection : 5; /* bit position: 5 */
    /* 0x0000 */ unsigned __int64 Prototype : 1; /* bit position: 10 */
    /* 0x0000 */ unsigned __int64 Transition : 1; /* bit position: 11 */
    /* 0x0000 */ unsigned __int64 PageFileLow : 4; /* bit position: 12 */
    /* 0x0000 */ unsigned __int64 UsedPageTableEntries : 10; /* bit position: 16 */
    /* 0x0000 */ unsigned __int64 ShadowStack : 1; /* bit position: 26 */
    /* 0x0000 */ unsigned __int64 OnStandbyLookaside : 1; /* bit position: 27 */
    /* 0x0000 */ unsigned __int64 Unused : 4; /* bit position: 28 */
    /* 0x0000 */ unsigned __int64 PageFileHigh : 32; /* bit position: 32 */
  }; /* bitfield */
} MMPTE_SOFTWARE, *PMMPTE_SOFTWARE; /* size: 0x0008 */

typedef struct _MMPTE_TIMESTAMP
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned __int64 MustBeZero : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned __int64 Unused : 3; /* bit position: 1 */
    /* 0x0000 */ unsigned __int64 SwizzleBit : 1; /* bit position: 4 */
    /* 0x0000 */ unsigned __int64 Protection : 5; /* bit position: 5 */
    /* 0x0000 */ unsigned __int64 Prototype : 1; /* bit position: 10 */
    /* 0x0000 */ unsigned __int64 Transition : 1; /* bit position: 11 */
    /* 0x0000 */ unsigned __int64 PageFileLow : 4; /* bit position: 12 */
    /* 0x0000 */ unsigned __int64 Reserved : 16; /* bit position: 16 */
    /* 0x0000 */ unsigned __int64 GlobalTimeStamp : 32; /* bit position: 32 */
  }; /* bitfield */
} MMPTE_TIMESTAMP, *PMMPTE_TIMESTAMP; /* size: 0x0008 */

typedef struct _MMPTE_TRANSITION
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned __int64 Valid : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned __int64 Write : 1; /* bit position: 1 */
    /* 0x0000 */ unsigned __int64 OnStandbyLookaside : 1; /* bit position: 2 */
    /* 0x0000 */ unsigned __int64 IoTracker : 1; /* bit position: 3 */
    /* 0x0000 */ unsigned __int64 SwizzleBit : 1; /* bit position: 4 */
    /* 0x0000 */ unsigned __int64 Protection : 5; /* bit position: 5 */
    /* 0x0000 */ unsigned __int64 Prototype : 1; /* bit position: 10 */
    /* 0x0000 */ unsigned __int64 Transition : 1; /* bit position: 11 */
    /* 0x0000 */ unsigned __int64 PageFrameNumber : 40; /* bit position: 12 */
    /* 0x0000 */ unsigned __int64 Unused : 12; /* bit position: 52 */
  }; /* bitfield */
} MMPTE_TRANSITION, *PMMPTE_TRANSITION; /* size: 0x0008 */

typedef struct _MMPTE_SUBSECTION
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned __int64 Valid : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned __int64 Unused0 : 2; /* bit position: 1 */
    /* 0x0000 */ unsigned __int64 OnStandbyLookaside : 1; /* bit position: 3 */
    /* 0x0000 */ unsigned __int64 SwizzleBit : 1; /* bit position: 4 */
    /* 0x0000 */ unsigned __int64 Protection : 5; /* bit position: 5 */
    /* 0x0000 */ unsigned __int64 Prototype : 1; /* bit position: 10 */
    /* 0x0000 */ unsigned __int64 ColdPage : 1; /* bit position: 11 */
    /* 0x0000 */ unsigned __int64 Unused2 : 3; /* bit position: 12 */
    /* 0x0000 */ unsigned __int64 ExecutePrivilege : 1; /* bit position: 15 */
    /* 0x0000 */ __int64 SubsectionAddress : 48; /* bit position: 16 */
  }; /* bitfield */
} MMPTE_SUBSECTION, *PMMPTE_SUBSECTION; /* size: 0x0008 */

typedef struct _MMPTE_LIST
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned __int64 Valid : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned __int64 OneEntry : 1; /* bit position: 1 */
    /* 0x0000 */ unsigned __int64 filler0 : 2; /* bit position: 2 */
    /* 0x0000 */ unsigned __int64 SwizzleBit : 1; /* bit position: 4 */
    /* 0x0000 */ unsigned __int64 Protection : 5; /* bit position: 5 */
    /* 0x0000 */ unsigned __int64 Prototype : 1; /* bit position: 10 */
    /* 0x0000 */ unsigned __int64 Transition : 1; /* bit position: 11 */
    /* 0x0000 */ unsigned __int64 filler1 : 13; /* bit position: 12 */
    /* 0x0000 */ unsigned __int64 NextEntry : 39; /* bit position: 25 */
  }; /* bitfield */
} MMPTE_LIST, *PMMPTE_LIST; /* size: 0x0008 */

typedef struct _MMPTE_ACTIVE_PAGE_TABLE_LINKS
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned __int64 Flink : 40; /* bit position: 0 */
    /* 0x0000 */ unsigned __int64 BlinkHigh : 24; /* bit position: 40 */
  }; /* bitfield */
} MMPTE_ACTIVE_PAGE_TABLE_LINKS, *PMMPTE_ACTIVE_PAGE_TABLE_LINKS; /* size: 0x0008 */

typedef struct _MMPTE
{
  union
  {
    union
    {
      /* 0x0000 */ unsigned __int64 Long;
      /* 0x0000 */ struct _MMPTE_HARDWARE Hard;
      /* 0x0000 */ struct _MMPTE_PROTOTYPE Proto;
      /* 0x0000 */ struct _MMPTE_SOFTWARE Soft;
      /* 0x0000 */ struct _MMPTE_TIMESTAMP TimeStamp;
      /* 0x0000 */ struct _MMPTE_TRANSITION Trans;
      /* 0x0000 */ struct _MMPTE_SUBSECTION Subsect;
      /* 0x0000 */ struct _MMPTE_LIST List;
      /* 0x0000 */ struct _MMPTE_ACTIVE_PAGE_TABLE_LINKS PageTableLinks;
    }; /* size: 0x0008 */
  } /* size: 0x0008 */ u;
} MMPTE, *PMMPTE; /* size: 0x0008 */

typedef struct _MIPFNBLINK
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned __int64 Blink : 40; /* bit position: 0 */
      /* 0x0000 */ unsigned __int64 NodeBlinkLow : 19; /* bit position: 40 */
      /* 0x0000 */ unsigned __int64 TbFlushStamp : 3; /* bit position: 59 */
      /* 0x0000 */ unsigned __int64 PageBlinkDeleteBit : 1; /* bit position: 62 */
      /* 0x0000 */ unsigned __int64 PageBlinkLockBit : 1; /* bit position: 63 */
    }; /* bitfield */
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned __int64 ShareCount : 62; /* bit position: 0 */
      /* 0x0000 */ unsigned __int64 PageShareCountDeleteBit : 1; /* bit position: 62 */
      /* 0x0000 */ unsigned __int64 PageShareCountLockBit : 1; /* bit position: 63 */
    }; /* bitfield */
    /* 0x0000 */ __int64 EntireField;
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned __int64 LockNotUsed : 62; /* bit position: 0 */
      /* 0x0000 */ unsigned __int64 DeleteBit : 1; /* bit position: 62 */
      /* 0x0000 */ unsigned __int64 LockBit : 1; /* bit position: 63 */
    }; /* bitfield */
  }; /* size: 0x0008 */
} MIPFNBLINK, *PMIPFNBLINK; /* size: 0x0008 */

typedef struct _MMPFNENTRY1
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned char PageLocation : 3; /* bit position: 0 */
    /* 0x0000 */ unsigned char WriteInProgress : 1; /* bit position: 3 */
    /* 0x0000 */ unsigned char Modified : 1; /* bit position: 4 */
    /* 0x0000 */ unsigned char ReadInProgress : 1; /* bit position: 5 */
    /* 0x0000 */ unsigned char CacheAttribute : 2; /* bit position: 6 */
  }; /* bitfield */
} MMPFNENTRY1, *PMMPFNENTRY1; /* size: 0x0001 */

typedef struct _MMPFNENTRY3
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned char Priority : 3; /* bit position: 0 */
    /* 0x0000 */ unsigned char OnProtectedStandby : 1; /* bit position: 3 */
    /* 0x0000 */ unsigned char InPageError : 1; /* bit position: 4 */
    /* 0x0000 */ unsigned char SystemChargedPage : 1; /* bit position: 5 */
    /* 0x0000 */ unsigned char RemovalRequested : 1; /* bit position: 6 */
    /* 0x0000 */ unsigned char ParityError : 1; /* bit position: 7 */
  }; /* bitfield */
} MMPFNENTRY3, *PMMPFNENTRY3; /* size: 0x0001 */

typedef struct _MI_PFN_FLAGS
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned short ReferenceCount;
      struct /* bitfield */
      {
        /* 0x0002 */ unsigned char PageLocation : 3; /* bit position: 0 */
        /* 0x0002 */ unsigned char WriteInProgress : 1; /* bit position: 3 */
        /* 0x0002 */ unsigned char Modified : 1; /* bit position: 4 */
        /* 0x0002 */ unsigned char ReadInProgress : 1; /* bit position: 5 */
        /* 0x0002 */ unsigned char CacheAttribute : 2; /* bit position: 6 */
      }; /* bitfield */
      struct /* bitfield */
      {
        /* 0x0003 */ unsigned char Priority : 3; /* bit position: 0 */
        /* 0x0003 */ unsigned char OnProtectedStandby : 1; /* bit position: 3 */
        /* 0x0003 */ unsigned char InPageError : 1; /* bit position: 4 */
        /* 0x0003 */ unsigned char SystemChargedPage : 1; /* bit position: 5 */
        /* 0x0003 */ unsigned char RemovalRequested : 1; /* bit position: 6 */
        /* 0x0003 */ unsigned char ParityError : 1; /* bit position: 7 */
      }; /* bitfield */
    }; /* size: 0x0004 */
    /* 0x0000 */ unsigned long EntireField;
  }; /* size: 0x0004 */
} MI_PFN_FLAGS, *PMI_PFN_FLAGS; /* size: 0x0004 */

typedef struct _MI_PFN_FLAGS5
{
  union
  {
    /* 0x0000 */ unsigned long EntireField;
    struct
    {
      struct /* bitfield */
      {
        /* 0x0000 */ unsigned long NodeBlinkHigh : 21; /* bit position: 0 */
        /* 0x0000 */ unsigned long NodeFlinkMiddle : 11; /* bit position: 21 */
      }; /* bitfield */
    } /* size: 0x0004 */ StandbyList;
    struct
    {
      /* 0x0000 */ unsigned char ModifiedListBucketIndex : 4; /* bit position: 0 */
    } /* size: 0x0001 */ MappedPageList;
    struct
    {
      struct /* bitfield */
      {
        /* 0x0000 */ unsigned long PageTableBlinkLow : 16; /* bit position: 0 */
        /* 0x0000 */ unsigned long PageTableBuddyHigh : 10; /* bit position: 16 */
        /* 0x0000 */ unsigned long PageTableLinked : 1; /* bit position: 26 */
        /* 0x0000 */ unsigned long AnchorLargePageSize : 2; /* bit position: 27 */
        /* 0x0000 */ unsigned long Spare1 : 3; /* bit position: 29 */
      }; /* bitfield */
    } /* size: 0x0004 */ Active;
  }; /* size: 0x0004 */
} MI_PFN_FLAGS5, *PMI_PFN_FLAGS5; /* size: 0x0004 */

typedef struct _MI_PFN_FLAGS4
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned __int64 PteFrame : 40; /* bit position: 0 */
      /* 0x0000 */ unsigned __int64 ResidentPage : 1; /* bit position: 40 */
      /* 0x0000 */ unsigned __int64 ResidentPageContainsBadPages : 1; /* bit position: 41 */
      /* 0x0000 */ unsigned __int64 Unused1 : 1; /* bit position: 42 */
      /* 0x0000 */ unsigned __int64 Partition : 10; /* bit position: 43 */
      /* 0x0000 */ unsigned __int64 FileOnly : 1; /* bit position: 53 */
      /* 0x0000 */ unsigned __int64 PfnExists : 1; /* bit position: 54 */
      /* 0x0000 */ unsigned __int64 NodeFlinkHigh : 5; /* bit position: 55 */
      /* 0x0000 */ unsigned __int64 PageIdentity : 3; /* bit position: 60 */
      /* 0x0000 */ unsigned __int64 PrototypePte : 1; /* bit position: 63 */
    }; /* bitfield */
    /* 0x0000 */ unsigned __int64 EntireField;
  }; /* size: 0x0008 */
} MI_PFN_FLAGS4, *PMI_PFN_FLAGS4; /* size: 0x0008 */

typedef struct _MMPFN
{
  union
  {
    /* 0x0000 */ struct _LIST_ENTRY ListEntry;
    /* 0x0000 */ struct _RTL_BALANCED_NODE TreeNode;
    struct
    {
      /* 0x0000 */ struct _MIPFNFLINK u1;
      union
      {
        /* 0x0008 */ struct _MMPTE* PteAddress;
        /* 0x0008 */ unsigned __int64 PteLong;
      }; /* size: 0x0008 */
      /* 0x0010 */ struct _MMPTE OriginalPte;
    }; /* size: 0x0018 */
  }; /* size: 0x0018 */
  /* 0x0018 */ volatile struct _MIPFNBLINK u2;
  union
  {
    union
    {
      struct
      {
        /* 0x0020 */ unsigned short ReferenceCount;
        /* 0x0022 */ struct _MMPFNENTRY1 e1;
        /* 0x0023 */ struct _MMPFNENTRY3 e3;
      }; /* size: 0x0004 */
      struct
      {
        /* 0x0020 */ unsigned short ReferenceCount;
      } /* size: 0x0002 */ e2;
      /* 0x0020 */ volatile struct _MI_PFN_FLAGS e4;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ u3;
  /* 0x0024 */ struct _MI_PFN_FLAGS5 u5;
  /* 0x0028 */ struct _MI_PFN_FLAGS4 u4;
} MMPFN, *PMMPFN; /* size: 0x0030 */

typedef struct _MMPFNLIST
{
  /* 0x0000 */ volatile unsigned __int64 Total;
  /* 0x0008 */ struct _MI_COLOR Color;
  /* 0x000c */ enum _MMLISTS ListName;
  /* 0x0010 */ volatile unsigned __int64 Flink;
  /* 0x0018 */ volatile unsigned __int64 Blink;
  /* 0x0020 */ volatile long Lock;
  /* 0x0024 */ long Padding_0;
  /* 0x0028 */ struct _MMPFN EmbeddedPfn;
} MMPFNLIST, *PMMPFNLIST; /* size: 0x0058 */

typedef struct _UNICODE_STRING
{
  /* 0x0000 */ unsigned short Length;
  /* 0x0002 */ unsigned short MaximumLength;
  /* 0x0004 */ long Padding_1;
  /* 0x0008 */ wchar_t* Buffer;
} UNICODE_STRING, *PUNICODE_STRING; /* size: 0x0010 */

typedef struct _MM_DRIVER_VERIFIER_DATA
{
  /* 0x0000 */ unsigned long Level;
  /* 0x0004 */ volatile unsigned long RaiseIrqls;
  /* 0x0008 */ volatile unsigned long AcquireSpinLocks;
  /* 0x000c */ volatile unsigned long SynchronizeExecutions;
  /* 0x0010 */ volatile unsigned long AllocationsAttempted;
  /* 0x0014 */ volatile unsigned long AllocationsSucceeded;
  /* 0x0018 */ volatile unsigned long AllocationsSucceededSpecialPool;
  /* 0x001c */ unsigned long AllocationsWithNoTag;
  /* 0x0020 */ unsigned long TrimRequests;
  /* 0x0024 */ unsigned long Trims;
  /* 0x0028 */ unsigned long AllocationsFailed;
  /* 0x002c */ volatile unsigned long AllocationsFailedDeliberately;
  /* 0x0030 */ volatile unsigned long AllocationFreed;
  /* 0x0034 */ volatile unsigned long Loads;
  /* 0x0038 */ volatile unsigned long Unloads;
  /* 0x003c */ unsigned long UnTrackedPool;
  /* 0x0040 */ unsigned long UserTrims;
  /* 0x0044 */ volatile unsigned long CurrentPagedPoolAllocations;
  /* 0x0048 */ volatile unsigned long CurrentNonPagedPoolAllocations;
  /* 0x004c */ unsigned long PeakPagedPoolAllocations;
  /* 0x0050 */ unsigned long PeakNonPagedPoolAllocations;
  /* 0x0054 */ long Padding_2;
  /* 0x0058 */ volatile unsigned __int64 PagedBytes;
  /* 0x0060 */ volatile unsigned __int64 NonPagedBytes;
  /* 0x0068 */ unsigned __int64 PeakPagedBytes;
  /* 0x0070 */ unsigned __int64 PeakNonPagedBytes;
  /* 0x0078 */ volatile unsigned long BurstAllocationsFailedDeliberately;
  /* 0x007c */ unsigned long SessionTrims;
  /* 0x0080 */ volatile unsigned long OptionChanges;
  /* 0x0084 */ volatile unsigned long VerifyMode;
  /* 0x0088 */ struct _UNICODE_STRING PreviousBucketName;
} MM_DRIVER_VERIFIER_DATA, *PMM_DRIVER_VERIFIER_DATA; /* size: 0x0098 */

typedef enum _EX_POOL_PRIORITY
{
  LowPoolPriority = 0,
  LowPoolPrioritySpecialPoolOverrun = 8,
  LowPoolPrioritySpecialPoolUnderrun = 9,
  NormalPoolPriority = 16,
  NormalPoolPrioritySpecialPoolOverrun = 24,
  NormalPoolPrioritySpecialPoolUnderrun = 25,
  HighPoolPriority = 32,
  HighPoolPrioritySpecialPoolOverrun = 40,
  HighPoolPrioritySpecialPoolUnderrun = 41,
} EX_POOL_PRIORITY, *PEX_POOL_PRIORITY;

typedef enum _EVENT_TYPE
{
  NotificationEvent = 0,
  SynchronizationEvent = 1,
} EVENT_TYPE, *PEVENT_TYPE;

typedef struct _KGROUP_MASK
{
  /* 0x0000 */ unsigned __int64 Masks[2];
} KGROUP_MASK, *PKGROUP_MASK; /* size: 0x0010 */

typedef union _TIMELINE_BITMAP
{
  union
  {
    /* 0x0000 */ unsigned __int64 Value;
    struct
    {
      /* 0x0000 */ unsigned long EndTime;
      /* 0x0004 */ unsigned long Bitmap;
    }; /* size: 0x0008 */
  }; /* size: 0x0008 */
} TIMELINE_BITMAP, *PTIMELINE_BITMAP; /* size: 0x0008 */

typedef enum _MEMORY_CACHING_TYPE
{
  MmNonCached = 0,
  MmCached = 1,
  MmWriteCombined = 2,
  MmHardwareCoherentCached = 3,
  MmNonCachedUnordered = 4,
  MmUSWCCached = 5,
  MmMaximumCacheType = 6,
  MmNotMapped = -1,
} MEMORY_CACHING_TYPE, *PMEMORY_CACHING_TYPE;

typedef struct _LOADER_FEATURE_CONFIGURATION_DIAGNOSTIC_INFORMATION
{
  /* 0x0000 */ unsigned char OriginalBootStatus;
  /* 0x0001 */ unsigned char NewBootStatus;
  /* 0x0002 */ unsigned char ConfigurationLoaded;
  /* 0x0003 */ unsigned char Spare;
  union
  {
    union
    {
      /* 0x0004 */ unsigned long AllFlags;
      struct /* bitfield */
      {
        /* 0x0004 */ unsigned long LkgSupported : 1; /* bit position: 0 */
        /* 0x0004 */ unsigned long FinalBootBeforeRecovery : 1; /* bit position: 1 */
        /* 0x0004 */ unsigned long ConfigurationComparisonAttempted : 1; /* bit position: 2 */
        /* 0x0004 */ unsigned long CurrentConfigurationLoadAttempted : 1; /* bit position: 3 */
        /* 0x0004 */ unsigned long LkgConfigurationLoadAttempted : 1; /* bit position: 4 */
        /* 0x0004 */ unsigned long UsageSubscriptionLoadAttempted : 1; /* bit position: 5 */
        /* 0x0004 */ unsigned long Spare : 26; /* bit position: 6 */
      }; /* bitfield */
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ Flags;
  /* 0x0008 */ long ConfigurationComparisonStatus;
  /* 0x000c */ long CurrentConfigurationLoadStatus;
  /* 0x0010 */ long LkgConfigurationLoadStatus;
  /* 0x0014 */ long UsageSubscriptionLoadStatus;
} LOADER_FEATURE_CONFIGURATION_DIAGNOSTIC_INFORMATION, *PLOADER_FEATURE_CONFIGURATION_DIAGNOSTIC_INFORMATION; /* size: 0x0018 */

typedef enum _FILE_INFORMATION_CLASS
{
  FileDirectoryInformation = 1,
  FileFullDirectoryInformation = 2,
  FileBothDirectoryInformation = 3,
  FileBasicInformation = 4,
  FileStandardInformation = 5,
  FileInternalInformation = 6,
  FileEaInformation = 7,
  FileAccessInformation = 8,
  FileNameInformation = 9,
  FileRenameInformation = 10,
  FileLinkInformation = 11,
  FileNamesInformation = 12,
  FileDispositionInformation = 13,
  FilePositionInformation = 14,
  FileFullEaInformation = 15,
  FileModeInformation = 16,
  FileAlignmentInformation = 17,
  FileAllInformation = 18,
  FileAllocationInformation = 19,
  FileEndOfFileInformation = 20,
  FileAlternateNameInformation = 21,
  FileStreamInformation = 22,
  FilePipeInformation = 23,
  FilePipeLocalInformation = 24,
  FilePipeRemoteInformation = 25,
  FileMailslotQueryInformation = 26,
  FileMailslotSetInformation = 27,
  FileCompressionInformation = 28,
  FileObjectIdInformation = 29,
  FileCompletionInformation = 30,
  FileMoveClusterInformation = 31,
  FileQuotaInformation = 32,
  FileReparsePointInformation = 33,
  FileNetworkOpenInformation = 34,
  FileAttributeTagInformation = 35,
  FileTrackingInformation = 36,
  FileIdBothDirectoryInformation = 37,
  FileIdFullDirectoryInformation = 38,
  FileValidDataLengthInformation = 39,
  FileShortNameInformation = 40,
  FileIoCompletionNotificationInformation = 41,
  FileIoStatusBlockRangeInformation = 42,
  FileIoPriorityHintInformation = 43,
  FileSfioReserveInformation = 44,
  FileSfioVolumeInformation = 45,
  FileHardLinkInformation = 46,
  FileProcessIdsUsingFileInformation = 47,
  FileNormalizedNameInformation = 48,
  FileNetworkPhysicalNameInformation = 49,
  FileIdGlobalTxDirectoryInformation = 50,
  FileIsRemoteDeviceInformation = 51,
  FileUnusedInformation = 52,
  FileNumaNodeInformation = 53,
  FileStandardLinkInformation = 54,
  FileRemoteProtocolInformation = 55,
  FileRenameInformationBypassAccessCheck = 56,
  FileLinkInformationBypassAccessCheck = 57,
  FileVolumeNameInformation = 58,
  FileIdInformation = 59,
  FileIdExtdDirectoryInformation = 60,
  FileReplaceCompletionInformation = 61,
  FileHardLinkFullIdInformation = 62,
  FileIdExtdBothDirectoryInformation = 63,
  FileDispositionInformationEx = 64,
  FileRenameInformationEx = 65,
  FileRenameInformationExBypassAccessCheck = 66,
  FileDesiredStorageClassInformation = 67,
  FileStatInformation = 68,
  FileMemoryPartitionInformation = 69,
  FileStatLxInformation = 70,
  FileCaseSensitiveInformation = 71,
  FileLinkInformationEx = 72,
  FileLinkInformationExBypassAccessCheck = 73,
  FileStorageReserveIdInformation = 74,
  FileCaseSensitiveInformationForceAccessCheck = 75,
  FileKnownFolderInformation = 76,
  FileStatBasicInformation = 77,
  FileId64ExtdDirectoryInformation = 78,
  FileId64ExtdBothDirectoryInformation = 79,
  FileIdAllExtdDirectoryInformation = 80,
  FileIdAllExtdBothDirectoryInformation = 81,
  FileStreamReservationInformation = 82,
  FileMupProviderInfo = 83,
  FileMaximumInformation = 84,
} FILE_INFORMATION_CLASS, *PFILE_INFORMATION_CLASS;

typedef struct _EVENT_FILTER_LEVEL_KW
{
  /* 0x0000 */ unsigned __int64 MatchAnyKeyword;
  /* 0x0008 */ unsigned __int64 MatchAllKeyword;
  /* 0x0010 */ unsigned char Level;
  /* 0x0011 */ unsigned char FilterIn;
  /* 0x0012 */ char __PADDING__[6];
} EVENT_FILTER_LEVEL_KW, *PEVENT_FILTER_LEVEL_KW; /* size: 0x0018 */

typedef struct _RTL_AVL_TREE
{
  /* 0x0000 */ struct _RTL_BALANCED_NODE* Root;
} RTL_AVL_TREE, *PRTL_AVL_TREE; /* size: 0x0008 */

typedef enum _DIRECTORY_NOTIFY_INFORMATION_CLASS
{
  DirectoryNotifyInformation = 1,
  DirectoryNotifyExtendedInformation = 2,
  DirectoryNotifyFullInformation = 3,
  DirectoryNotifyMaximumInformation = 4,
} DIRECTORY_NOTIFY_INFORMATION_CLASS, *PDIRECTORY_NOTIFY_INFORMATION_CLASS;

typedef struct _FAULT_INFORMATION_X64_FLAGS
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned long FaultAddressValid : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned long Reserved : 31; /* bit position: 1 */
  }; /* bitfield */
} FAULT_INFORMATION_X64_FLAGS, *PFAULT_INFORMATION_X64_FLAGS; /* size: 0x0004 */

typedef enum _FAULT_INFORMATION_ARM64_TYPE
{
  UnsupportedUpstreamTransaction = 0,
  AddressSizeFault = 1,
  TlbMatchConflict = 2,
  ExternalFault = 3,
  PermissionFault = 4,
  AccessFlagFault = 5,
  TranslationFault = 6,
  MaxFaultType = 7,
} FAULT_INFORMATION_ARM64_TYPE, *PFAULT_INFORMATION_ARM64_TYPE;

typedef struct _FAULT_INFORMATION_X64
{
  /* 0x0000 */ void* DomainHandle;
  /* 0x0008 */ void* FaultAddress;
  /* 0x0010 */ struct _FAULT_INFORMATION_X64_FLAGS Flags;
  /* 0x0014 */ enum _FAULT_INFORMATION_ARM64_TYPE Type;
  /* 0x0018 */ unsigned __int64 IommuBaseAddress;
  /* 0x0020 */ unsigned long PciSegment;
  /* 0x0024 */ long __PADDING__[1];
} FAULT_INFORMATION_X64, *PFAULT_INFORMATION_X64; /* size: 0x0028 */

typedef struct _MMSUPPORT_FLAGS
{
  union
  {
    struct
    {
      struct /* bitfield */
      {
        /* 0x0000 */ unsigned char WorkingSetType : 4; /* bit position: 0 */
        /* 0x0000 */ unsigned char Reserved0 : 2; /* bit position: 4 */
        /* 0x0000 */ unsigned char MaximumWorkingSetHard : 1; /* bit position: 6 */
        /* 0x0000 */ unsigned char MinimumWorkingSetHard : 1; /* bit position: 7 */
      }; /* bitfield */
      struct /* bitfield */
      {
        /* 0x0001 */ unsigned char Reserved1 : 1; /* bit position: 0 */
        /* 0x0001 */ unsigned char TrimmerState : 2; /* bit position: 1 */
        /* 0x0001 */ unsigned char LinearAddressProtected : 1; /* bit position: 3 */
        /* 0x0001 */ unsigned char PageStealers : 4; /* bit position: 4 */
      }; /* bitfield */
    }; /* size: 0x0002 */
    struct
    {
      /* 0x0000 */ unsigned short u1;
      /* 0x0002 */ unsigned char MemoryPriority;
      union
      {
        struct /* bitfield */
        {
          /* 0x0003 */ unsigned char WsleDeleted : 1; /* bit position: 0 */
          /* 0x0003 */ unsigned char SvmEnabled : 1; /* bit position: 1 */
          /* 0x0003 */ unsigned char ForceAge : 1; /* bit position: 2 */
          /* 0x0003 */ unsigned char ForceTrim : 1; /* bit position: 3 */
          /* 0x0003 */ unsigned char CommitReleaseState : 2; /* bit position: 4 */
          /* 0x0003 */ unsigned char Reserved2 : 2; /* bit position: 6 */
        }; /* bitfield */
        /* 0x0003 */ unsigned char u2;
      }; /* size: 0x0001 */
    }; /* size: 0x0004 */
    /* 0x0000 */ unsigned long EntireFlags;
  }; /* size: 0x0004 */
} MMSUPPORT_FLAGS, *PMMSUPPORT_FLAGS; /* size: 0x0004 */

typedef struct _MMSUPPORT_INSTANCE
{
  /* 0x0000 */ unsigned long NextPageColor;
  /* 0x0004 */ volatile unsigned long PageFaultCount;
  /* 0x0008 */ unsigned __int64 TrimmedPageCount;
  /* 0x0010 */ struct _MMWSL_INSTANCE* VmWorkingSetList;
  /* 0x0018 */ struct _LIST_ENTRY WorkingSetExpansionLinks;
  /* 0x0028 */ volatile unsigned __int64 AgeDistribution[8];
  /* 0x0068 */ struct _KGATE* ExitOutswapGate;
  /* 0x0070 */ unsigned __int64 MinimumWorkingSetSize;
  /* 0x0078 */ unsigned __int64 MaximumWorkingSetSize;
  /* 0x0080 */ volatile unsigned __int64 WorkingSetLeafSize;
  /* 0x0088 */ volatile unsigned __int64 WorkingSetLeafPrivateSize;
  /* 0x0090 */ volatile unsigned __int64 WorkingSetSize;
  /* 0x0098 */ volatile unsigned __int64 WorkingSetPrivateSize;
  /* 0x00a0 */ volatile unsigned __int64 PeakWorkingSetSize;
  /* 0x00a8 */ unsigned long HardFaultCount;
  /* 0x00ac */ unsigned short LastTrimStamp;
  /* 0x00ae */ unsigned short PartitionId;
  /* 0x00b0 */ unsigned __int64 SelfmapLock;
  /* 0x00b8 */ volatile struct _MMSUPPORT_FLAGS Flags;
  /* 0x00bc */ volatile unsigned long InterlockedFlags;
} MMSUPPORT_INSTANCE, *PMMSUPPORT_INSTANCE; /* size: 0x00c0 */

typedef struct _MMSUPPORT_SHARED
{
  /* 0x0000 */ void* WorkingSetLockArray;
  /* 0x0008 */ unsigned __int64 ReleasedCommitDebt;
  /* 0x0010 */ unsigned __int64 ResetPagesRepurposedCount;
  /* 0x0018 */ void* WsSwapSupport;
  /* 0x0020 */ void* CommitReleaseContext;
  /* 0x0028 */ void* AccessLog;
  /* 0x0030 */ volatile unsigned __int64 ChargedWslePages;
  /* 0x0038 */ volatile unsigned __int64 ActualWslePages;
  /* 0x0040 */ volatile long WorkingSetCoreLock;
  /* 0x0044 */ long Padding_3;
  /* 0x0048 */ void* ShadowMapping;
  /* 0x0050 */ long __PADDING__[12];
} MMSUPPORT_SHARED, *PMMSUPPORT_SHARED; /* size: 0x0080 */

typedef struct _MMSUPPORT_FULL
{
  /* 0x0000 */ struct _MMSUPPORT_INSTANCE Instance;
  /* 0x00c0 */ struct _MMSUPPORT_SHARED Shared;
} MMSUPPORT_FULL, *PMMSUPPORT_FULL; /* size: 0x0140 */

typedef enum _FSINFOCLASS
{
  FileFsVolumeInformation = 1,
  FileFsLabelInformation = 2,
  FileFsSizeInformation = 3,
  FileFsDeviceInformation = 4,
  FileFsAttributeInformation = 5,
  FileFsControlInformation = 6,
  FileFsFullSizeInformation = 7,
  FileFsObjectIdInformation = 8,
  FileFsDriverPathInformation = 9,
  FileFsVolumeFlagsInformation = 10,
  FileFsSectorSizeInformation = 11,
  FileFsDataCopyInformation = 12,
  FileFsMetadataSizeInformation = 13,
  FileFsFullSizeInformationEx = 14,
  FileFsGuidInformation = 15,
  FileFsMaximumInformation = 16,
} FSINFOCLASS, *PFSINFOCLASS;

struct PROCESSOR_IDLESTATE_INFO
{
  /* 0x0000 */ unsigned long TimeCheck;
  /* 0x0004 */ unsigned char DemotePercent;
  /* 0x0005 */ unsigned char PromotePercent;
  /* 0x0006 */ unsigned char Spare[2];
}; /* size: 0x0008 */

typedef struct _BOOT_FIRMWARE_RAMDISK_INFO
{
  /* 0x0000 */ unsigned long Version;
  /* 0x0004 */ unsigned long BlockSize;
  /* 0x0008 */ unsigned __int64 BaseAddress;
  /* 0x0010 */ unsigned __int64 Size;
} BOOT_FIRMWARE_RAMDISK_INFO, *PBOOT_FIRMWARE_RAMDISK_INFO; /* size: 0x0018 */

enum BUS_QUERY_ID_TYPE
{
  BusQueryDeviceID = 0,
  BusQueryHardwareIDs = 1,
  BusQueryCompatibleIDs = 2,
  BusQueryInstanceID = 3,
  BusQueryDeviceSerialNumber = 4,
  BusQueryContainerID = 5,
};

enum DEVICE_TEXT_TYPE
{
  DeviceTextDescription = 0,
  DeviceTextLocationInformation = 1,
};

typedef enum _DEVICE_USAGE_NOTIFICATION_TYPE
{
  DeviceUsageTypeUndefined = 0,
  DeviceUsageTypePaging = 1,
  DeviceUsageTypeHibernation = 2,
  DeviceUsageTypeDumpFile = 3,
  DeviceUsageTypeBoot = 4,
  DeviceUsageTypePostDisplay = 5,
  DeviceUsageTypeGuestAssigned = 6,
} DEVICE_USAGE_NOTIFICATION_TYPE, *PDEVICE_USAGE_NOTIFICATION_TYPE;

typedef struct _LOADER_FEATURE_CONFIGURATION_INFORMATION
{
  /* 0x0000 */ void* FeatureConfigurationBuffer;
  /* 0x0008 */ unsigned __int64 FeatureConfigurationBufferSize;
  /* 0x0010 */ void* UsageSubscriptionBuffer;
  /* 0x0018 */ unsigned __int64 UsageSubscriptionBufferSize;
  /* 0x0020 */ void* DelayedUsageReportBuffer;
  /* 0x0028 */ unsigned __int64 DelayedUsageReportBufferSize;
  /* 0x0030 */ struct _LOADER_FEATURE_CONFIGURATION_DIAGNOSTIC_INFORMATION DiagnosticInformation;
} LOADER_FEATURE_CONFIGURATION_INFORMATION, *PLOADER_FEATURE_CONFIGURATION_INFORMATION; /* size: 0x0048 */

typedef enum _SYSTEM_POWER_STATE
{
  PowerSystemUnspecified = 0,
  PowerSystemWorking = 1,
  PowerSystemSleeping1 = 2,
  PowerSystemSleeping2 = 3,
  PowerSystemSleeping3 = 4,
  PowerSystemHibernate = 5,
  PowerSystemShutdown = 6,
  PowerSystemMaximum = 7,
} SYSTEM_POWER_STATE, *PSYSTEM_POWER_STATE;

typedef struct _LOADER_MEMORY_RANGE
{
  /* 0x0000 */ unsigned __int64 StartPage;
  /* 0x0008 */ unsigned __int64 NumberOfPages;
} LOADER_MEMORY_RANGE, *PLOADER_MEMORY_RANGE; /* size: 0x0010 */

typedef enum _POWER_STATE_TYPE
{
  SystemPowerState = 0,
  DevicePowerState = 1,
} POWER_STATE_TYPE, *PPOWER_STATE_TYPE;

typedef struct _DBGKD_READ_MEMORY32
{
  /* 0x0000 */ unsigned long TargetBaseAddress;
  /* 0x0004 */ unsigned long TransferCount;
  /* 0x0008 */ unsigned long ActualBytesRead;
} DBGKD_READ_MEMORY32, *PDBGKD_READ_MEMORY32; /* size: 0x000c */

enum POWER_ACTION
{
  PowerActionNone = 0,
  PowerActionReserved = 1,
  PowerActionSleep = 2,
  PowerActionHibernate = 3,
  PowerActionShutdown = 4,
  PowerActionShutdownReset = 5,
  PowerActionShutdownOff = 6,
  PowerActionWarmEject = 7,
  PowerActionDisplayOff = 8,
};

typedef union _CM_TRANS_PTR
{
  union
  {
    /* 0x0000 */ unsigned __int64 LightWeight : 1; /* bit position: 0 */
    /* 0x0000 */ void* TransPtr;
  }; /* size: 0x0008 */
} CM_TRANS_PTR, *PCM_TRANS_PTR; /* size: 0x0008 */

typedef struct _CM_KEY_BODY
{
  /* 0x0000 */ unsigned long Type;
  /* 0x0004 */ unsigned short AccessCheckedLayerHeight;
  /* 0x0006 */ char Padding_4[2];
  /* 0x0008 */ struct _CM_KEY_CONTROL_BLOCK* KeyControlBlock;
  /* 0x0010 */ struct _CM_NOTIFY_BLOCK* NotifyBlock;
  /* 0x0018 */ void* ProcessID;
  /* 0x0020 */ struct _LIST_ENTRY KeyBodyList;
  struct /* bitfield */
  {
    /* 0x0030 */ unsigned long Flags : 16; /* bit position: 0 */
    /* 0x0030 */ unsigned long HandleTags : 16; /* bit position: 16 */
  }; /* bitfield */
  /* 0x0034 */ long Padding_5;
  /* 0x0038 */ union _CM_TRANS_PTR Trans;
  /* 0x0040 */ struct _GUID* KtmUow;
  /* 0x0048 */ struct _LIST_ENTRY ContextListHead;
  /* 0x0058 */ void* EnumerationResumeContext;
  /* 0x0060 */ unsigned long RestrictedAccessMask;
  /* 0x0064 */ unsigned long LastSearchedIndex;
  /* 0x0068 */ void* LockedMemoryMdls;
} CM_KEY_BODY, *PCM_KEY_BODY; /* size: 0x0070 */

typedef union _LARGE_INTEGER
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned long LowPart;
      /* 0x0004 */ long HighPart;
    }; /* size: 0x0008 */
    struct
    {
      /* 0x0000 */ unsigned long LowPart;
      /* 0x0004 */ long HighPart;
    } /* size: 0x0008 */ u;
    /* 0x0000 */ __int64 QuadPart;
  }; /* size: 0x0008 */
} LARGE_INTEGER, *PLARGE_INTEGER; /* size: 0x0008 */

typedef enum _DEVICE_POWER_STATE
{
  PowerDeviceUnspecified = 0,
  PowerDeviceD0 = 1,
  PowerDeviceD1 = 2,
  PowerDeviceD2 = 3,
  PowerDeviceD3 = 4,
  PowerDeviceMaximum = 5,
} DEVICE_POWER_STATE, *PDEVICE_POWER_STATE;

typedef struct _ARBITER_ORDERING_LIST
{
  /* 0x0000 */ unsigned short Count;
  /* 0x0002 */ unsigned short Maximum;
  /* 0x0004 */ long Padding_6;
  /* 0x0008 */ struct _ARBITER_ORDERING* Orderings;
} ARBITER_ORDERING_LIST, *PARBITER_ORDERING_LIST; /* size: 0x0010 */

typedef struct _ARBITER_INSTANCE
{
  /* 0x0000 */ unsigned long Signature;
  /* 0x0004 */ long Padding_7;
  /* 0x0008 */ struct _KEVENT* MutexEvent;
  /* 0x0010 */ wchar_t* Name;
  /* 0x0018 */ wchar_t* OrderingName;
  /* 0x0020 */ int ResourceType;
  /* 0x0024 */ long Padding_8;
  /* 0x0028 */ struct _RTL_RANGE_LIST* Allocation;
  /* 0x0030 */ struct _RTL_RANGE_LIST* PossibleAllocation;
  /* 0x0038 */ struct _ARBITER_ORDERING_LIST OrderingList;
  /* 0x0048 */ struct _ARBITER_ORDERING_LIST ReservedList;
  /* 0x0058 */ long ReferenceCount;
  /* 0x005c */ long Padding_9;
  /* 0x0060 */ struct _ARBITER_INTERFACE* Interface;
  /* 0x0068 */ unsigned long AllocationStackMaxSize;
  /* 0x006c */ long Padding_10;
  /* 0x0070 */ struct _ARBITER_ALLOCATION_STATE* AllocationStack;
  /* 0x0078 */ void* UnpackRequirement /* function */;
  /* 0x0080 */ void* PackResource /* function */;
  /* 0x0088 */ void* UnpackResource /* function */;
  /* 0x0090 */ void* ScoreRequirement /* function */;
  /* 0x0098 */ void* TestAllocation /* function */;
  /* 0x00a0 */ void* RetestAllocation /* function */;
  /* 0x00a8 */ void* CommitAllocation /* function */;
  /* 0x00b0 */ void* RollbackAllocation /* function */;
  /* 0x00b8 */ void* BootAllocation /* function */;
  /* 0x00c0 */ void* QueryArbitrate /* function */;
  /* 0x00c8 */ void* QueryConflict /* function */;
  /* 0x00d0 */ void* AddReserved /* function */;
  /* 0x00d8 */ void* StartArbiter /* function */;
  /* 0x00e0 */ void* PreprocessEntry /* function */;
  /* 0x00e8 */ void* AllocateEntry /* function */;
  /* 0x00f0 */ void* GetNextAllocationRange /* function */;
  /* 0x00f8 */ void* FindSuitableRange /* function */;
  /* 0x0100 */ void* AddAllocation /* function */;
  /* 0x0108 */ void* BacktrackAllocation /* function */;
  /* 0x0110 */ void* OverrideConflict /* function */;
  /* 0x0118 */ void* InitializeRangeList /* function */;
  /* 0x0120 */ void* DeleteOwnerRanges /* function */;
  /* 0x0128 */ unsigned char TransactionInProgress;
  /* 0x0129 */ char Padding_11[7];
  /* 0x0130 */ struct _KEVENT* TransactionEvent;
  /* 0x0138 */ void* Extension;
  /* 0x0140 */ struct _DEVICE_OBJECT* BusDeviceObject;
  /* 0x0148 */ void* ConflictCallbackContext;
  /* 0x0150 */ void* ConflictCallback /* function */;
} ARBITER_INSTANCE, *PARBITER_INSTANCE; /* size: 0x0158 */

typedef struct _GUID
{
  /* 0x0000 */ unsigned long Data1;
  /* 0x0004 */ unsigned short Data2;
  /* 0x0006 */ unsigned short Data3;
  /* 0x0008 */ unsigned char Data4[8];
} GUID, *PGUID; /* size: 0x0010 */

typedef enum _DEVICE_WAKE_DEPTH
{
  DeviceWakeDepthNotWakeable = 0,
  DeviceWakeDepthD0 = 1,
  DeviceWakeDepthD1 = 2,
  DeviceWakeDepthD2 = 3,
  DeviceWakeDepthD3hot = 4,
  DeviceWakeDepthD3cold = 5,
  DeviceWakeDepthMaximum = 6,
} DEVICE_WAKE_DEPTH, *PDEVICE_WAKE_DEPTH;

typedef enum _WHEA_ERROR_SOURCE_TYPE
{
  WheaErrSrcTypeMCE = 0,
  WheaErrSrcTypeCMC = 1,
  WheaErrSrcTypeCPE = 2,
  WheaErrSrcTypeNMI = 3,
  WheaErrSrcTypePCIe = 4,
  WheaErrSrcTypeGeneric = 5,
  WheaErrSrcTypeINIT = 6,
  WheaErrSrcTypeBOOT = 7,
  WheaErrSrcTypeSCIGeneric = 8,
  WheaErrSrcTypeIPFMCA = 9,
  WheaErrSrcTypeIPFCMC = 10,
  WheaErrSrcTypeIPFCPE = 11,
  WheaErrSrcTypeGenericV2 = 12,
  WheaErrSrcTypeSCIGenericV2 = 13,
  WheaErrSrcTypeBMC = 14,
  WheaErrSrcTypePMEM = 15,
  WheaErrSrcTypeDeviceDriver = 16,
  WheaErrSrcTypeSea = 17,
  WheaErrSrcTypeSei = 18,
  WheaErrSrcTypeMax = 19,
} WHEA_ERROR_SOURCE_TYPE, *PWHEA_ERROR_SOURCE_TYPE;

typedef enum _WHEA_ERROR_SOURCE_STATE
{
  WheaErrSrcStateStopped = 1,
  WheaErrSrcStateStarted = 2,
  WheaErrSrcStateRemoved = 3,
  WheaErrSrcStateRemovePending = 4,
} WHEA_ERROR_SOURCE_STATE, *PWHEA_ERROR_SOURCE_STATE;

typedef enum _WHEA_EVENT_LOG_ENTRY_TYPE
{
  WheaEventLogEntryTypeInformational = 0,
  WheaEventLogEntryTypeWarning = 1,
  WheaEventLogEntryTypeError = 2,
} WHEA_EVENT_LOG_ENTRY_TYPE, *PWHEA_EVENT_LOG_ENTRY_TYPE;

typedef enum _WHEA_EVENT_LOG_ENTRY_ID
{
  WheaEventLogEntryIdCmcPollingTimeout = -2147483647,
  WheaEventLogEntryIdWheaInit = -2147483646,
  WheaEventLogEntryIdCmcSwitchToPolling = -2147483645,
  WheaEventLogEntryIdDroppedCorrectedError = -2147483644,
  WheaEventLogEntryIdStartedReportHwError = -2147483643,
  WheaEventLogEntryIdPFAMemoryOfflined = -2147483642,
  WheaEventLogEntryIdPFAMemoryRemoveMonitor = -2147483641,
  WheaEventLogEntryIdPFAMemoryPolicy = -2147483640,
  WheaEventLogEntryIdPshedInjectError = -2147483639,
  WheaEventLogEntryIdOscCapabilities = -2147483638,
  WheaEventLogEntryIdPshedPluginRegister = -2147483637,
  WheaEventLogEntryIdAddRemoveErrorSource = -2147483636,
  WheaEventLogEntryIdWorkQueueItem = -2147483635,
  WheaEventLogEntryIdAttemptErrorRecovery = -2147483634,
  WheaEventLogEntryIdMcaFoundErrorInBank = -2147483633,
  WheaEventLogEntryIdMcaStuckErrorCheck = -2147483632,
  WheaEventLogEntryIdMcaErrorCleared = -2147483631,
  WheaEventLogEntryIdClearedPoison = -2147483630,
  WheaEventLogEntryIdProcessEINJ = -2147483629,
  WheaEventLogEntryIdProcessHEST = -2147483628,
  WheaEventLogEntryIdCreateGenericRecord = -2147483627,
  WheaEventLogEntryIdErrorRecord = -2147483626,
  WheaEventLogEntryIdErrorRecordLimit = -2147483625,
  WheaEventLogEntryIdAerNotGrantedToOs = -2147483624,
  WheaEventLogEntryIdErrSrcArrayInvalid = -2147483623,
  WheaEventLogEntryIdAcpiTimeOut = -2147483622,
  WheaEventLogCmciRestart = -2147483621,
  WheaEventLogCmciFinalRestart = -2147483620,
  WheaEventLogEntryEtwOverFlow = -2147483619,
  WheaEventLogAzccRootBusSearchErr = -2147483618,
  WheaEventLogAzccRootBusList = -2147483617,
  WheaEventLogEntryIdErrSrcInvalid = -2147483616,
  WheaEventLogEntryIdGenericErrMemMap = -2147483615,
  WheaEventLogEntryIdPshedCallbackCollision = -2147483614,
  WheaEventLogEntryIdSELBugCheckProgress = -2147483613,
  WheaEventLogEntryIdPshedPluginLoad = -2147483612,
  WheaEventLogEntryIdPshedPluginUnload = -2147483611,
  WheaEventLogEntryIdPshedPluginSupported = -2147483610,
  WheaEventLogEntryIdDeviceDriver = -2147483609,
  WheaEventLogEntryIdCmciImplPresent = -2147483608,
  WheaEventLogEntryIdCmciInitError = -2147483607,
  WheaEventLogEntryIdSELBugCheckRecovery = -2147483606,
  WheaEventLogEntryIdDrvErrSrcInvalid = -2147483605,
  WheaEventLogEntryIdDrvHandleBusy = -2147483604,
  WheaEventLogEntryIdWheaHeartbeat = -2147483603,
  WheaEventLogAzccRootBusPoisonSet = -2147483602,
  WheaEventLogEntryIdSELBugCheckInfo = -2147483601,
  WheaEventLogEntryIdErrDimmInfoMismatch = -2147483600,
  WheaEventLogEntryIdeDpcEnabled = -2147483599,
  WheaEventLogEntryPageOfflineDone = -2147483598,
  WheaEventLogEntryPageOfflinePendMax = -2147483597,
  WheaEventLogEntryIdBadPageLimitReached = -2147483596,
  WheaEventLogEntrySrarDetail = -2147483595,
  WheaEventLogEntryEarlyError = -2147483594,
  WheaEventLogEntryIdPcieOverrideInfo = -2147483593,
  WheaEventLogEntryIdReadPcieOverridesErr = -2147483592,
  WheaEventLogEntryIdPcieConfigInfo = -2147483591,
  WheaEventLogEntryIdPcieSummaryFailed = -2147483584,
  WheaEventLogEntryIdThrottleRegCorrupt = -2147483583,
  WheaEventLogEntryIdThrottleAddErrSrcFailed = -2147483582,
  WheaEventLogEntryIdThrottleRegDataIgnored = -2147483581,
  WheaEventLogEntryIdEnableKeyNotifFailed = -2147483580,
  WheaEventLogEntryIdKeyNotificationFailed = -2147483579,
  WheaEventLogEntryIdPcieRemoveDevice = -2147483578,
  WheaEventLogEntryIdPcieAddDevice = -2147483577,
  WheaEventLogEntryIdPcieSpuriousErrSource = -2147483576,
  WheaEventLogEntryIdMemoryAddDevice = -2147483575,
  WheaEventLogEntryIdMemoryRemoveDevice = -2147483574,
  WheaEventLogEntryIdMemorySummaryFailed = -2147483573,
  WheaEventLogEntryIdPcieDpcError = -2147483572,
  WheaEventLogEntryIdCpuBusesInitFailed = -2147483571,
  WheaEventLogEntryIdPshedPluginInitFailed = -2147483570,
  WheaEventLogEntryIdFailedAddToDefectList = -2147483569,
  WheaEventLogEntryIdDefectListFull = -2147483568,
  WheaEventLogEntryIdDefectListUEFIVarFailed = -2147483567,
  WheaEventLogEntryIdDefectListCorrupt = -2147483566,
  WheaEventLogEntryIdBadHestNotifyData = -2147483565,
  WheaEventLogEntryIdRowFailure = -2147483564,
  WheaEventLogEntryIdSrasTableNotFound = -2147483563,
  WheaEventLogEntryIdSrasTableError = -2147483562,
  WheaEventLogEntryIdSrasTableEntries = -2147483561,
  WheaEventLogEntryIdPFANotifyCallbackAction = -2147483560,
  WheaEventLogEntryIdSELBugCheckCpusQuiesced = -2147483559,
  WheaEventLogEntryIdPshedPiCpuid = -2147483558,
  WheaEventLogEntryIdSrasTableBadData = -2147483557,
  WheaEventLogEntryIdDriFsStatus = -2147483556,
  WheaEventLogEntryIdCpusFrozen = -2147483552,
  WheaEventLogEntryIdCpusFrozenNoCrashDump = -2147483551,
  WheaEventLogEntryIdRegNotifyPolicyChange = -2147483550,
  WheaEventLogEntryIdRegError = -2147483549,
  WheaEventLogEntryIdRowOfflineEvent = -2147483548,
  WheaEventLogEntryIdBitOfflineEvent = -2147483547,
  WheaEventLogEntryIdBadGasFields = -2147483546,
  WheaEventLogEntryIdCrashDumpError = -2147483545,
  WheaEventLogEntryIdCrashDumpCheckpoint = -2147483544,
  WheaEventLogEntryIdCrashDumpProgressPercent = -2147483543,
  WheaEventLogEntryIdPreviousCrashBugCheckProgress = -2147483542,
  WheaEventLogEntryIdSELBugCheckStackDump = -2147483541,
  WheaEventLogEntryIdPciePromotedAerErr = -2147483540,
  WheaEventLogEntryIdPshedPiTraceLog = -2147221488,
} WHEA_EVENT_LOG_ENTRY_ID, *PWHEA_EVENT_LOG_ENTRY_ID;

typedef struct _SINGLE_LIST_ENTRY
{
  /* 0x0000 */ struct _SINGLE_LIST_ENTRY* Next;
} SINGLE_LIST_ENTRY, *PSINGLE_LIST_ENTRY; /* size: 0x0008 */

typedef struct _ETW_BUFFER_QUEUE
{
  /* 0x0000 */ struct _SINGLE_LIST_ENTRY* QueueTail;
  /* 0x0008 */ struct _SINGLE_LIST_ENTRY QueueEntry;
} ETW_BUFFER_QUEUE, *PETW_BUFFER_QUEUE; /* size: 0x0010 */

typedef enum _WHEA_ERROR_TYPE
{
  WheaErrTypeProcessor = 0,
  WheaErrTypeMemory = 1,
  WheaErrTypePCIExpress = 2,
  WheaErrTypeNMI = 3,
  WheaErrTypePCIXBus = 4,
  WheaErrTypePCIXDevice = 5,
  WheaErrTypeGeneric = 6,
  WheaErrTypePmem = 7,
} WHEA_ERROR_TYPE, *PWHEA_ERROR_TYPE;

typedef struct _EX_PUSH_LOCK
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned __int64 Locked : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned __int64 Waiting : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned __int64 Waking : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned __int64 MultipleShared : 1; /* bit position: 3 */
      /* 0x0000 */ unsigned __int64 Shared : 60; /* bit position: 4 */
    }; /* bitfield */
    /* 0x0000 */ unsigned __int64 Value;
    /* 0x0000 */ void* Ptr;
  }; /* size: 0x0008 */
} EX_PUSH_LOCK, *PEX_PUSH_LOCK; /* size: 0x0008 */

typedef struct _HANDLE_TABLE_FREE_LIST
{
  /* 0x0000 */ struct _EX_PUSH_LOCK FreeListLock;
  /* 0x0008 */ union _HANDLE_TABLE_ENTRY* FirstFreeHandleEntry;
  /* 0x0010 */ union _HANDLE_TABLE_ENTRY* LastFreeHandleEntry;
  /* 0x0018 */ long HandleCount;
  /* 0x001c */ unsigned long HighWaterMark;
  /* 0x0020 */ long __PADDING__[8];
} HANDLE_TABLE_FREE_LIST, *PHANDLE_TABLE_FREE_LIST; /* size: 0x0040 */

typedef enum _WHEA_ERROR_SEVERITY
{
  WheaErrSevRecoverable = 0,
  WheaErrSevFatal = 1,
  WheaErrSevCorrected = 2,
  WheaErrSevInformational = 3,
} WHEA_ERROR_SEVERITY, *PWHEA_ERROR_SEVERITY;

typedef enum _MEM_DEDICATED_ATTRIBUTE_TYPE
{
  MemDedicatedAttributeReadBandwidth = 0,
  MemDedicatedAttributeReadLatency = 1,
  MemDedicatedAttributeWriteBandwidth = 2,
  MemDedicatedAttributeWriteLatency = 3,
  MemDedicatedAttributeMax = 4,
} MEM_DEDICATED_ATTRIBUTE_TYPE, *PMEM_DEDICATED_ATTRIBUTE_TYPE;

typedef enum _TYPE_OF_MEMORY
{
  LoaderExceptionBlock = 0,
  LoaderSystemBlock = 1,
  LoaderFree = 2,
  LoaderBad = 3,
  LoaderLoadedProgram = 4,
  LoaderFirmwareTemporary = 5,
  LoaderFirmwarePermanent = 6,
  LoaderOsloaderHeap = 7,
  LoaderOsloaderStack = 8,
  LoaderSystemCode = 9,
  LoaderHalCode = 10,
  LoaderBootDriver = 11,
  LoaderConsoleInDriver = 12,
  LoaderConsoleOutDriver = 13,
  LoaderStartupDpcStack = 14,
  LoaderStartupKernelStack = 15,
  LoaderStartupPanicStack = 16,
  LoaderStartupPcrPage = 17,
  LoaderStartupPdrPage = 18,
  LoaderRegistryData = 19,
  LoaderMemoryData = 20,
  LoaderNlsData = 21,
  LoaderSpecialMemory = 22,
  LoaderBBTMemory = 23,
  LoaderZero = 24,
  LoaderXIPRom = 25,
  LoaderHALCachedMemory = 26,
  LoaderLargePageFiller = 27,
  LoaderErrorLogMemory = 28,
  LoaderVsmMemory = 29,
  LoaderFirmwareCode = 30,
  LoaderFirmwareData = 31,
  LoaderFirmwareReserved = 32,
  LoaderEnclaveMemory = 33,
  LoaderFirmwareKsr = 34,
  LoaderEnclaveKsr = 35,
  LoaderSkMemory = 36,
  LoaderSkFirmwareReserved = 37,
  LoaderIoSpaceMemoryZeroed = 38,
  LoaderIoSpaceMemoryFree = 39,
  LoaderIoSpaceMemoryKsr = 40,
  LoaderKernelShadowStack = 41,
  LoaderIsolatedHostVisible = 42,
  LoaderIsolatedKsr = 43,
  LoaderIoSpaceIsolatedKsr = 44,
  LoaderPersistentDatabase = 45,
  LoaderSyntheticFirmwareData = 46,
  LoaderMaximum = 47,
} TYPE_OF_MEMORY, *PTYPE_OF_MEMORY;

typedef struct _OSLOADER_PAGE_TABLE_LOG
{
  /* 0x0000 */ void* LegacyPte;
  /* 0x0008 */ unsigned __int64 Pfn;
  /* 0x0010 */ enum _TYPE_OF_MEMORY MemoryType;
  /* 0x0014 */ long Padding_12;
  /* 0x0018 */ unsigned __int64 BasePage;
  /* 0x0020 */ unsigned __int64 PageCount;
} OSLOADER_PAGE_TABLE_LOG, *POSLOADER_PAGE_TABLE_LOG; /* size: 0x0028 */

typedef enum _WHEA_ERROR_PACKET_DATA_FORMAT
{
  WheaDataFormatIPFSalRecord = 0,
  WheaDataFormatXPFMCA = 1,
  WheaDataFormatMemory = 2,
  WheaDataFormatPCIExpress = 3,
  WheaDataFormatNMIPort = 4,
  WheaDataFormatPCIXBus = 5,
  WheaDataFormatPCIXDevice = 6,
  WheaDataFormatGeneric = 7,
  WheaDataFormatMax = 8,
} WHEA_ERROR_PACKET_DATA_FORMAT, *PWHEA_ERROR_PACKET_DATA_FORMAT;

typedef enum _MCA_AMD_BLOCK_TYPE
{
  McaAMDBlockTypeLS = 0,
  McaAMDBlockTypeIF = 1,
  McaAMDBlockTypeL2 = 2,
  McaAMDBlockTypeDE = 3,
  McaAMDBlockTypeRAZ = 4,
  McaAMDBlockTypeEX = 5,
  McaAMDBlockTypeFP = 6,
  McaAMDBlockTypeL3 = 7,
  McaAMDBlockTypeUMC = 8,
  McaAMDBlockTypeSMU = 9,
  McaAMDBlockTypePSP = 10,
  McaAMDBlockTypePB = 11,
  McaAMDBlockTypeCS = 12,
  McaAMDBlockTypePIE = 13,
  McaAMDBlockTypeMP5 = 14,
  McaAMDBlockTypeNBIO = 15,
  McaAMDBlockTypePCIe = 16,
  McaAMDBlockTypeUnknown = 17,
} MCA_AMD_BLOCK_TYPE, *PMCA_AMD_BLOCK_TYPE;

enum LSA_FOREST_TRUST_RECORD_TYPE
{
  ForestTrustTopLevelName = 0,
  ForestTrustTopLevelNameEx = 1,
  ForestTrustDomainInfo = 2,
  ForestTrustBinaryInfo = 3,
  ForestTrustScannerInfo = 4,
  ForestTrustRecordTypeLast = 4,
};

enum IORING_OP_CODE
{
  IORING_OP_NOP = 0,
  IORING_OP_READ = 1,
  IORING_OP_REGISTER_FILES = 2,
  IORING_OP_REGISTER_BUFFERS = 3,
  IORING_OP_CANCEL = 4,
  IORING_OP_WRITE = 5,
  IORING_OP_FLUSH = 6,
  IORING_OP_READ_SCATTER = 7,
  IORING_OP_WRITE_GATHER = 8,
};

typedef enum _NT_IORING_SQE_FLAGS
{
  NT_IORING_SQE_FLAG_NONE = 0,
  NT_IORING_SQE_FLAG_DRAIN_PRECEDING_OPS = 1,
} NT_IORING_SQE_FLAGS, *PNT_IORING_SQE_FLAGS;

typedef enum _NT_IORING_OP_FLAGS
{
  NT_IORING_OP_FLAG_NONE = 0,
  NT_IORING_OP_FLAG_REGISTERED_FILE_0 = 1,
  NT_IORING_OP_FLAG_REGISTERED_FILE = 1,
  NT_IORING_OP_FLAG_REGISTERED_BUFFER_0 = 2,
  NT_IORING_OP_FLAG_REGISTERED_BUFFER = 2,
} NT_IORING_OP_FLAGS, *PNT_IORING_OP_FLAGS;

typedef union _NT_IORING_HANDLEREF
{
  union
  {
    /* 0x0000 */ void* Handle;
    /* 0x0000 */ unsigned int HandleIndex;
  }; /* size: 0x0008 */
} NT_IORING_HANDLEREF, *PNT_IORING_HANDLEREF; /* size: 0x0008 */

struct IORING_REGISTERED_BUFFER
{
  /* 0x0000 */ unsigned int BufferIndex;
  /* 0x0004 */ unsigned int Offset;
}; /* size: 0x0008 */

typedef union _NT_IORING_BUFFERREF
{
  union
  {
    /* 0x0000 */ void* Address;
    /* 0x0000 */ struct IORING_REGISTERED_BUFFER FixedBuffer;
  }; /* size: 0x0008 */
} NT_IORING_BUFFERREF, *PNT_IORING_BUFFERREF; /* size: 0x0008 */

typedef struct _NT_IORING_OP_READ
{
  /* 0x0000 */ enum _NT_IORING_OP_FLAGS CommonOpFlags;
  /* 0x0004 */ unsigned int Padding;
  /* 0x0008 */ union _NT_IORING_HANDLEREF File;
  /* 0x0010 */ union _NT_IORING_BUFFERREF Buffer;
  /* 0x0018 */ unsigned __int64 Offset;
  /* 0x0020 */ unsigned int Length;
  /* 0x0024 */ unsigned int Key;
} NT_IORING_OP_READ, *PNT_IORING_OP_READ; /* size: 0x0028 */

typedef enum _NT_IORING_REG_FILES_REQ_FLAGS
{
  NT_IORING_REG_FILES_REQ_FLAG_NONE = 0,
} NT_IORING_REG_FILES_REQ_FLAGS, *PNT_IORING_REG_FILES_REQ_FLAGS;

typedef enum _NT_IORING_REG_FILES_ADV_FLAGS
{
  NT_IORING_REG_FILES_ADV_FLAG_NONE = 0,
} NT_IORING_REG_FILES_ADV_FLAGS, *PNT_IORING_REG_FILES_ADV_FLAGS;

typedef struct _NT_IORING_REG_FILES_FLAGS
{
  /* 0x0000 */ enum _NT_IORING_REG_FILES_REQ_FLAGS Required;
  /* 0x0004 */ enum _NT_IORING_REG_FILES_ADV_FLAGS Advisory;
} NT_IORING_REG_FILES_FLAGS, *PNT_IORING_REG_FILES_FLAGS; /* size: 0x0008 */

typedef struct _NT_IORING_OP_REGISTER_FILES
{
  /* 0x0000 */ enum _NT_IORING_OP_FLAGS CommonOpFlags;
  /* 0x0004 */ struct _NT_IORING_REG_FILES_FLAGS Flags;
  /* 0x000c */ unsigned int Count;
  /* 0x0010 */ void** Handles;
} NT_IORING_OP_REGISTER_FILES, *PNT_IORING_OP_REGISTER_FILES; /* size: 0x0018 */

typedef enum _NT_IORING_REG_BUFFERS_REQ_FLAGS
{
  NT_IORING_REG_BUFFERS_REQ_FLAG_NONE = 0,
} NT_IORING_REG_BUFFERS_REQ_FLAGS, *PNT_IORING_REG_BUFFERS_REQ_FLAGS;

typedef enum _NT_IORING_REG_BUFFERS_ADV_FLAGS
{
  NT_IORING_REG_BUFFERS_ADV_FLAG_NONE = 0,
} NT_IORING_REG_BUFFERS_ADV_FLAGS, *PNT_IORING_REG_BUFFERS_ADV_FLAGS;

typedef struct _NT_IORING_REG_BUFFERS_FLAGS
{
  /* 0x0000 */ enum _NT_IORING_REG_BUFFERS_REQ_FLAGS Required;
  /* 0x0004 */ enum _NT_IORING_REG_BUFFERS_ADV_FLAGS Advisory;
} NT_IORING_REG_BUFFERS_FLAGS, *PNT_IORING_REG_BUFFERS_FLAGS; /* size: 0x0008 */

typedef struct _NT_IORING_OP_REGISTER_BUFFERS
{
  /* 0x0000 */ enum _NT_IORING_OP_FLAGS CommonOpFlags;
  /* 0x0004 */ struct _NT_IORING_REG_BUFFERS_FLAGS Flags;
  /* 0x000c */ unsigned int Count;
  /* 0x0010 */ struct IORING_BUFFER_INFO* Buffers;
} NT_IORING_OP_REGISTER_BUFFERS, *PNT_IORING_OP_REGISTER_BUFFERS; /* size: 0x0018 */

typedef struct _NT_IORING_OP_CANCEL
{
  /* 0x0000 */ enum _NT_IORING_OP_FLAGS CommonOpFlags;
  /* 0x0004 */ long Padding_13;
  /* 0x0008 */ union _NT_IORING_HANDLEREF File;
  /* 0x0010 */ unsigned __int64 CancelId;
} NT_IORING_OP_CANCEL, *PNT_IORING_OP_CANCEL; /* size: 0x0018 */

typedef enum _NT_WRITE_FLAGS
{
  NT_WRITE_FLAG_NONE = 0,
  NT_WRITE_FLAG_WRITE_THROUGH = 1,
} NT_WRITE_FLAGS, *PNT_WRITE_FLAGS;

typedef struct _NT_IORING_OP_WRITE
{
  /* 0x0000 */ enum _NT_IORING_OP_FLAGS CommonOpFlags;
  /* 0x0004 */ enum _NT_WRITE_FLAGS Flags;
  /* 0x0008 */ union _NT_IORING_HANDLEREF File;
  /* 0x0010 */ union _NT_IORING_BUFFERREF Buffer;
  /* 0x0018 */ unsigned __int64 Offset;
  /* 0x0020 */ unsigned int Length;
  /* 0x0024 */ unsigned int Key;
} NT_IORING_OP_WRITE, *PNT_IORING_OP_WRITE; /* size: 0x0028 */

typedef struct _NT_IORING_OP_FLUSH
{
  /* 0x0000 */ enum _NT_IORING_OP_FLAGS CommonOpFlags;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ union _NT_IORING_HANDLEREF File;
} NT_IORING_OP_FLUSH, *PNT_IORING_OP_FLUSH; /* size: 0x0010 */

typedef struct _NT_IORING_OP_READ_SCATTER
{
  /* 0x0000 */ enum _NT_IORING_OP_FLAGS CommonOpFlags;
  /* 0x0004 */ unsigned int Padding;
  /* 0x0008 */ union _NT_IORING_HANDLEREF File;
  /* 0x0010 */ unsigned int SegmentCount;
  /* 0x0014 */ long Padding_14;
  /* 0x0018 */ union _FILE_SEGMENT_ELEMENT* SegmentArray;
  /* 0x0020 */ unsigned __int64 Offset;
  /* 0x0028 */ unsigned int Length;
  /* 0x002c */ unsigned int Key;
} NT_IORING_OP_READ_SCATTER, *PNT_IORING_OP_READ_SCATTER; /* size: 0x0030 */

typedef struct _NT_IORING_OP_WRITE_GATHER
{
  /* 0x0000 */ enum _NT_IORING_OP_FLAGS CommonOpFlags;
  /* 0x0004 */ enum _NT_WRITE_FLAGS Flags;
  /* 0x0008 */ union _NT_IORING_HANDLEREF File;
  /* 0x0010 */ unsigned int SegmentCount;
  /* 0x0014 */ long Padding_15;
  /* 0x0018 */ union _FILE_SEGMENT_ELEMENT* SegmentArray;
  /* 0x0020 */ unsigned __int64 Offset;
  /* 0x0028 */ unsigned int Length;
  /* 0x002c */ unsigned int Key;
} NT_IORING_OP_WRITE_GATHER, *PNT_IORING_OP_WRITE_GATHER; /* size: 0x0030 */

typedef struct _NT_IORING_OP_RESERVED
{
  /* 0x0000 */ unsigned __int64 Argument1;
  /* 0x0008 */ unsigned __int64 Argument2;
  /* 0x0010 */ unsigned __int64 Argument3;
  /* 0x0018 */ unsigned __int64 Argument4;
  /* 0x0020 */ unsigned __int64 Argument5;
  /* 0x0028 */ unsigned __int64 Argument6;
} NT_IORING_OP_RESERVED, *PNT_IORING_OP_RESERVED; /* size: 0x0030 */

typedef struct _NT_IORING_SQE
{
  /* 0x0000 */ enum IORING_OP_CODE OpCode;
  /* 0x0004 */ enum _NT_IORING_SQE_FLAGS Flags;
  union
  {
    /* 0x0008 */ unsigned __int64 UserData;
    /* 0x0008 */ unsigned __int64 PaddingUserDataForWow;
  }; /* size: 0x0008 */
  union
  {
    /* 0x0010 */ struct _NT_IORING_OP_READ Read;
    /* 0x0010 */ struct _NT_IORING_OP_REGISTER_FILES RegisterFiles;
    /* 0x0010 */ struct _NT_IORING_OP_REGISTER_BUFFERS RegisterBuffers;
    /* 0x0010 */ struct _NT_IORING_OP_CANCEL Cancel;
    /* 0x0010 */ struct _NT_IORING_OP_WRITE Write;
    /* 0x0010 */ struct _NT_IORING_OP_FLUSH Flush;
    /* 0x0010 */ struct _NT_IORING_OP_READ_SCATTER ReadScatter;
    /* 0x0010 */ struct _NT_IORING_OP_WRITE_GATHER WriteGather;
    /* 0x0010 */ struct _NT_IORING_OP_RESERVED ReservedMaxSizePadding;
  }; /* size: 0x0030 */
} NT_IORING_SQE, *PNT_IORING_SQE; /* size: 0x0040 */

typedef enum _KINTERRUPT_POLARITY
{
  InterruptPolarityUnknown = 0,
  InterruptActiveHigh = 1,
  InterruptRisingEdge = 1,
  InterruptActiveLow = 2,
  InterruptFallingEdge = 2,
  InterruptActiveBoth = 3,
  InterruptActiveBothTriggerLow = 3,
  InterruptActiveBothTriggerHigh = 4,
} KINTERRUPT_POLARITY, *PKINTERRUPT_POLARITY;

typedef struct _WNF_STATE_NAME
{
  /* 0x0000 */ unsigned long Data[2];
} WNF_STATE_NAME, *PWNF_STATE_NAME; /* size: 0x0008 */

typedef struct _WNF_TYPE_ID
{
  /* 0x0000 */ struct _GUID TypeId;
} WNF_TYPE_ID, *PWNF_TYPE_ID; /* size: 0x0010 */

typedef struct _WNF_DELIVERY_DESCRIPTOR
{
  /* 0x0000 */ unsigned __int64 SubscriptionId;
  /* 0x0008 */ struct _WNF_STATE_NAME StateName;
  /* 0x0010 */ unsigned long ChangeStamp;
  /* 0x0014 */ unsigned long StateDataSize;
  /* 0x0018 */ unsigned long EventMask;
  /* 0x001c */ struct _WNF_TYPE_ID TypeId;
  /* 0x002c */ unsigned long StateDataOffset;
} WNF_DELIVERY_DESCRIPTOR, *PWNF_DELIVERY_DESCRIPTOR; /* size: 0x0030 */

typedef enum _KINTERRUPT_MODE
{
  LevelSensitive = 0,
  Latched = 1,
} KINTERRUPT_MODE, *PKINTERRUPT_MODE;

typedef enum _INBV_PIXEL_FORMAT
{
  PixelFormatUnknown = 0,
  PixelFormat4BitPlanar = 1,
  PixelFormatR8G8B8 = 2,
  PixelFormatR8G8B8X8 = 3,
  PixelFormatB8G8R8 = 4,
  PixelFormatB8G8R8X8 = 5,
} INBV_PIXEL_FORMAT, *PINBV_PIXEL_FORMAT;

typedef struct _INBV_GRAPHICS_RECTANGLE
{
  /* 0x0000 */ unsigned long Height;
  /* 0x0004 */ unsigned long Width;
  /* 0x0008 */ enum _INBV_PIXEL_FORMAT PixelFormat;
  /* 0x000c */ unsigned long Size;
  /* 0x0010 */ void* Data;
} INBV_GRAPHICS_RECTANGLE, *PINBV_GRAPHICS_RECTANGLE; /* size: 0x0018 */

typedef struct _RTL_RB_TREE
{
  /* 0x0000 */ struct _RTL_BALANCED_NODE* Root;
  union
  {
    /* 0x0008 */ unsigned char Encoded : 1; /* bit position: 0 */
    /* 0x0008 */ struct _RTL_BALANCED_NODE* Min;
  }; /* size: 0x0008 */
} RTL_RB_TREE, *PRTL_RB_TREE; /* size: 0x0010 */

typedef struct _KSCB
{
  /* 0x0000 */ unsigned __int64 GenerationCycles;
  /* 0x0008 */ unsigned __int64 MinQuotaCycleTarget;
  /* 0x0010 */ unsigned __int64 MaxQuotaCycleTarget;
  /* 0x0018 */ unsigned __int64 RankCycleTarget;
  /* 0x0020 */ unsigned __int64 LongTermCycles;
  /* 0x0028 */ unsigned __int64 LastReportedCycles;
  /* 0x0030 */ volatile unsigned __int64 OverQuotaHistory;
  /* 0x0038 */ unsigned __int64 ReadyTime;
  /* 0x0040 */ unsigned __int64 InsertTime;
  /* 0x0048 */ struct _LIST_ENTRY PerProcessorList;
  /* 0x0058 */ struct _RTL_BALANCED_NODE QueueNode;
  union
  {
    struct /* bitfield */
    {
      /* 0x0070 */ unsigned short Inserted : 1; /* bit position: 0 */
      /* 0x0070 */ unsigned short MaxOverQuota : 1; /* bit position: 1 */
      /* 0x0070 */ unsigned short MinOverQuota : 1; /* bit position: 2 */
      /* 0x0070 */ unsigned short RankBias : 1; /* bit position: 3 */
      /* 0x0070 */ unsigned short UnconstrainedMaxQuota : 1; /* bit position: 4 */
      /* 0x0070 */ unsigned short UnconstrainedMinQuota : 1; /* bit position: 5 */
      /* 0x0070 */ unsigned short ShareRankOwner : 1; /* bit position: 6 */
      /* 0x0070 */ unsigned short PerProcHardCap : 1; /* bit position: 7 */
      /* 0x0070 */ unsigned short Referenced : 1; /* bit position: 8 */
    }; /* bitfield */
    /* 0x0070 */ unsigned short PrcbLockFlags;
  }; /* size: 0x0002 */
  /* 0x0072 */ unsigned char Depth;
  /* 0x0073 */ unsigned char Pad1;
  /* 0x0074 */ unsigned long OwningProcessorIndex;
  /* 0x0078 */ unsigned short ReadySummary;
  /* 0x007a */ unsigned short Pad2;
  /* 0x007c */ unsigned long Rank;
  /* 0x0080 */ volatile unsigned long* ShareRank;
  /* 0x0088 */ volatile unsigned long OwnerShareRank;
  /* 0x008c */ long Padding_16;
  /* 0x0090 */ struct _LIST_ENTRY ReadyListHead[16];
  /* 0x0190 */ struct _RTL_RB_TREE ChildScbQueue;
  /* 0x01a0 */ struct _KSCB* Parent;
  /* 0x01a8 */ struct _KSCB* Root;
  /* 0x01b0 */ struct _SINGLE_LIST_ENTRY TracingListEntry;
} KSCB, *PKSCB; /* size: 0x01b8 */

typedef enum _REG_NOTIFY_CLASS
{
  RegNtDeleteKey = 0,
  RegNtPreDeleteKey = 0,
  RegNtSetValueKey = 1,
  RegNtPreSetValueKey = 1,
  RegNtDeleteValueKey = 2,
  RegNtPreDeleteValueKey = 2,
  RegNtSetInformationKey = 3,
  RegNtPreSetInformationKey = 3,
  RegNtRenameKey = 4,
  RegNtPreRenameKey = 4,
  RegNtEnumerateKey = 5,
  RegNtPreEnumerateKey = 5,
  RegNtEnumerateValueKey = 6,
  RegNtPreEnumerateValueKey = 6,
  RegNtQueryKey = 7,
  RegNtPreQueryKey = 7,
  RegNtQueryValueKey = 8,
  RegNtPreQueryValueKey = 8,
  RegNtQueryMultipleValueKey = 9,
  RegNtPreQueryMultipleValueKey = 9,
  RegNtPreCreateKey = 10,
  RegNtPostCreateKey = 11,
  RegNtPreOpenKey = 12,
  RegNtPostOpenKey = 13,
  RegNtKeyHandleClose = 14,
  RegNtPreKeyHandleClose = 14,
  RegNtPostDeleteKey = 15,
  RegNtPostSetValueKey = 16,
  RegNtPostDeleteValueKey = 17,
  RegNtPostSetInformationKey = 18,
  RegNtPostRenameKey = 19,
  RegNtPostEnumerateKey = 20,
  RegNtPostEnumerateValueKey = 21,
  RegNtPostQueryKey = 22,
  RegNtPostQueryValueKey = 23,
  RegNtPostQueryMultipleValueKey = 24,
  RegNtPostKeyHandleClose = 25,
  RegNtPreCreateKeyEx = 26,
  RegNtPostCreateKeyEx = 27,
  RegNtPreOpenKeyEx = 28,
  RegNtPostOpenKeyEx = 29,
  RegNtPreFlushKey = 30,
  RegNtPostFlushKey = 31,
  RegNtPreLoadKey = 32,
  RegNtPostLoadKey = 33,
  RegNtPreUnLoadKey = 34,
  RegNtPostUnLoadKey = 35,
  RegNtPreQueryKeySecurity = 36,
  RegNtPostQueryKeySecurity = 37,
  RegNtPreSetKeySecurity = 38,
  RegNtPostSetKeySecurity = 39,
  RegNtCallbackObjectContextCleanup = 40,
  RegNtPreRestoreKey = 41,
  RegNtPostRestoreKey = 42,
  RegNtPreSaveKey = 43,
  RegNtPostSaveKey = 44,
  RegNtPreReplaceKey = 45,
  RegNtPostReplaceKey = 46,
  RegNtPreQueryKeyName = 47,
  RegNtPostQueryKeyName = 48,
  RegNtPreSaveMergedKey = 49,
  RegNtPostSaveMergedKey = 50,
  MaxRegNtNotifyClass = 51,
} REG_NOTIFY_CLASS, *PREG_NOTIFY_CLASS;

typedef enum _HALP_DMA_MAP_BUFFER_TYPE
{
  HalpDmaContiguousMapBuffer = 0,
  HalpDmaNonContiguousMapBuffer = 1,
  HalpDmaMaximumMapBufferType = 2,
} HALP_DMA_MAP_BUFFER_TYPE, *PHALP_DMA_MAP_BUFFER_TYPE;

typedef struct _DBGKD_GET_CONTEXT
{
  /* 0x0000 */ unsigned long Unused;
} DBGKD_GET_CONTEXT, *PDBGKD_GET_CONTEXT; /* size: 0x0004 */

typedef struct _MI_SYSTEM_NODE_AFFINITY_INFORMATION
{
  /* 0x0000 */ struct _GROUP_AFFINITY* GroupAffinity;
  /* 0x0008 */ unsigned long NumberOfDomains;
  /* 0x000c */ unsigned long GlobalDomainIndex;
  /* 0x0010 */ unsigned short GroupAffinityCount;
  /* 0x0012 */ unsigned short ProcessorCount[3];
  /* 0x0018 */ unsigned short UsableProcessorCount[3];
  /* 0x001e */ char __PADDING__[2];
} MI_SYSTEM_NODE_AFFINITY_INFORMATION, *PMI_SYSTEM_NODE_AFFINITY_INFORMATION; /* size: 0x0020 */

typedef enum _KNOWN_CONTROLLER_TYPE
{
  InterruptControllerInvalid = 0,
  InterruptControllerPic = 1,
  InterruptControllerApic = 2,
  InterruptControllerGic = 3,
  InterruptControllerGicV3 = 4,
  InterruptControllerGicV4 = 5,
  InterruptControllerBcm = 6,
  InterruptControllerUnknown = 4096,
} KNOWN_CONTROLLER_TYPE, *PKNOWN_CONTROLLER_TYPE;

typedef struct _CLIENT_ID
{
  /* 0x0000 */ void* UniqueProcess;
  /* 0x0008 */ void* UniqueThread;
} CLIENT_ID, *PCLIENT_ID; /* size: 0x0010 */

typedef struct _HANDLE_TRACE_DB_ENTRY
{
  /* 0x0000 */ struct _CLIENT_ID ClientId;
  /* 0x0010 */ void* Handle;
  /* 0x0018 */ unsigned long Type;
  /* 0x001c */ long Padding_17;
  /* 0x0020 */ void* StackTrace[16];
} HANDLE_TRACE_DB_ENTRY, *PHANDLE_TRACE_DB_ENTRY; /* size: 0x00a0 */

typedef enum _INTERRUPT_PROBLEM
{
  InterruptProblemNone = 0,
  InterruptProblemMadtParsingFailure = 1,
  InterruptProblemNoControllersFound = 2,
  InterruptProblemFailedDiscovery = 3,
  InterruptProblemInitializeLocalUnitFailed = 4,
  InterruptProblemInitializeIoUnitFailed = 5,
  InterruptProblemSetLogicalIdFailed = 6,
  InterruptProblemSetLineStateFailed = 7,
  InterruptProblemGenerateMessageFailed = 8,
  InterruptProblemConvertIdFailed = 9,
  InterruptProblemCmciSetupFailed = 10,
  InterruptProblemQueryMaxProcessorsCalledTooEarly = 11,
  InterruptProblemProcessorReset = 12,
  InterruptProblemStartProcessorFailed = 13,
  InterruptProblemProcessorNotAlive = 14,
  InterruptProblemLowerIrqlViolation = 15,
  InterruptProblemInvalidIrql = 16,
  InterruptProblemNoSuchController = 17,
  InterruptProblemNoSuchLines = 18,
  InterruptProblemBadConnectionData = 19,
  InterruptProblemBadRoutingData = 20,
  InterruptProblemInvalidProcessor = 21,
  InterruptProblemFailedToAttainTarget = 22,
  InterruptProblemUnsupportedWiringConfiguration = 23,
  InterruptProblemSpareAlreadyStarted = 24,
  InterruptProblemClusterNotFullyReplaced = 25,
  InterruptProblemNewClusterAlreadyActive = 26,
  InterruptProblemNewClusterTooLarge = 27,
  InterruptProblemCannotHardwareQuiesce = 28,
  InterruptProblemIpiDestinationUpdateFailed = 29,
  InterruptProblemNoMemory = 30,
  InterruptProblemNoIrtEntries = 31,
  InterruptProblemConnectionDataBaitAndSwitch = 32,
  InterruptProblemInvalidLogicalFlatId = 33,
  InterruptProblemDeinitializeLocalUnitFailed = 34,
  InterruptProblemDeinitializeIoUnitFailed = 35,
  InterruptProblemMismatchedThermalLvtIsr = 36,
  InterruptProblemHvRetargetFailed = 37,
  InterruptProblemDeferredErrorSetupFailed = 38,
  InterruptProblemBadInterruptPartition = 39,
} INTERRUPT_PROBLEM, *PINTERRUPT_PROBLEM;

typedef enum _DUMP_EVENTS
{
  DUMP_EVENT_NONE = 0,
  DUMP_EVENT_HIBER_RESUME = 1,
  DUMP_EVENT_HIBER_RESUME_END = 2,
} DUMP_EVENTS, *PDUMP_EVENTS;

typedef enum _IO_ALLOCATION_ACTION
{
  KeepObject = 1,
  DeallocateObject = 2,
  DeallocateObjectKeepRegisters = 3,
} IO_ALLOCATION_ACTION, *PIO_ALLOCATION_ACTION;

typedef enum _MODE
{
  KernelMode = 0,
  UserMode = 1,
  MaximumMode = 2,
} MODE, *PMODE;

typedef enum _KTRANSACTION_STATE
{
  KTransactionUninitialized = 0,
  KTransactionActive = 1,
  KTransactionPreparing = 2,
  KTransactionPrepared = 3,
  KTransactionInDoubt = 4,
  KTransactionCommitted = 5,
  KTransactionAborted = 6,
  KTransactionDelegated = 7,
  KTransactionPrePreparing = 8,
  KTransactionForgotten = 9,
  KTransactionRecovering = 10,
  KTransactionPrePrepared = 11,
} KTRANSACTION_STATE, *PKTRANSACTION_STATE;

typedef struct _CM_KEY_REFERENCE
{
  /* 0x0000 */ unsigned long KeyCell;
  /* 0x0004 */ long Padding_18;
  /* 0x0008 */ struct _HHIVE* KeyHive;
} CM_KEY_REFERENCE, *PCM_KEY_REFERENCE; /* size: 0x0010 */

typedef union _SLIST_HEADER
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned __int64 Alignment;
      /* 0x0008 */ unsigned __int64 Region;
    }; /* size: 0x0010 */
    struct
    {
      struct /* bitfield */
      {
        /* 0x0000 */ unsigned __int64 Depth : 16; /* bit position: 0 */
        /* 0x0000 */ unsigned __int64 Sequence : 48; /* bit position: 16 */
      }; /* bitfield */
      struct /* bitfield */
      {
        /* 0x0008 */ unsigned __int64 Reserved : 4; /* bit position: 0 */
        /* 0x0008 */ unsigned __int64 NextEntry : 60; /* bit position: 4 */
      }; /* bitfield */
    } /* size: 0x0010 */ HeaderX64;
  }; /* size: 0x0010 */
} SLIST_HEADER, *PSLIST_HEADER; /* size: 0x0010 */

typedef struct _RTL_LOOKASIDE
{
  /* 0x0000 */ union _SLIST_HEADER ListHead;
  /* 0x0010 */ unsigned short Depth;
  /* 0x0012 */ unsigned short MaximumDepth;
  /* 0x0014 */ unsigned long TotalAllocates;
  /* 0x0018 */ unsigned long AllocateMisses;
  /* 0x001c */ unsigned long TotalFrees;
  /* 0x0020 */ unsigned long FreeMisses;
  /* 0x0024 */ unsigned long LastTotalAllocates;
  /* 0x0028 */ unsigned long LastAllocateMisses;
  /* 0x002c */ unsigned long LastTotalFrees;
  /* 0x0030 */ long __PADDING__[4];
} RTL_LOOKASIDE, *PRTL_LOOKASIDE; /* size: 0x0040 */

typedef struct _RTL_DYNAMIC_LOOKASIDE
{
  /* 0x0000 */ unsigned __int64 EnabledBucketBitmap;
  /* 0x0008 */ unsigned long BucketCount;
  /* 0x000c */ unsigned long ActiveBucketCount;
  /* 0x0010 */ long Padding_19[12];
  /* 0x0040 */ struct _RTL_LOOKASIDE Buckets[64];
} RTL_DYNAMIC_LOOKASIDE, *PRTL_DYNAMIC_LOOKASIDE; /* size: 0x1040 */

typedef struct _EX_HEAP_POOL_NODE
{
  /* 0x0000 */ struct _SEGMENT_HEAP* Heaps[4];
  /* 0x0020 */ long Padding_20[8];
  /* 0x0040 */ struct _RTL_DYNAMIC_LOOKASIDE Lookasides[2];
} EX_HEAP_POOL_NODE, *PEX_HEAP_POOL_NODE; /* size: 0x20c0 */

typedef enum _MEMORY_CACHING_TYPE_ORIG
{
  MmFrameBufferCached = 2,
} MEMORY_CACHING_TYPE_ORIG, *PMEMORY_CACHING_TYPE_ORIG;

typedef enum _INTERLOCKED_RESULT
{
  ResultNegative = 1,
  ResultZero = 0,
  ResultPositive = 2,
} INTERLOCKED_RESULT, *PINTERLOCKED_RESULT;

typedef enum _JOBOBJECT_IO_PRIORITY_LIMIT_FLAGS
{
  JOBOBJECT_IO_PRIORITY_LIMIT_ENABLE = 1,
  JOBOBJECT_IO_PRIORITY_LIMIT_VALID_FLAGS = 1,
} JOBOBJECT_IO_PRIORITY_LIMIT_FLAGS, *PJOBOBJECT_IO_PRIORITY_LIMIT_FLAGS;

typedef enum _WHEA_CPU_VENDOR
{
  WheaCpuVendorOther = 0,
  WheaCpuVendorIntel = 1,
  WheaCpuVendorAmd = 2,
} WHEA_CPU_VENDOR, *PWHEA_CPU_VENDOR;

typedef struct _EFI_FIRMWARE_INFORMATION
{
  /* 0x0000 */ unsigned long FirmwareVersion;
  /* 0x0004 */ long Padding_21;
  /* 0x0008 */ struct _VIRTUAL_EFI_RUNTIME_SERVICES* VirtualEfiRuntimeServices;
  /* 0x0010 */ long SetVirtualAddressMapStatus;
  /* 0x0014 */ unsigned long MissedMappingsCount;
  /* 0x0018 */ struct _LIST_ENTRY FirmwareResourceList;
  /* 0x0028 */ void* EfiMemoryMap;
  /* 0x0030 */ unsigned long EfiMemoryMapSize;
  /* 0x0034 */ unsigned long EfiMemoryMapDescriptorSize;
} EFI_FIRMWARE_INFORMATION, *PEFI_FIRMWARE_INFORMATION; /* size: 0x0038 */

typedef struct _PCAT_FIRMWARE_INFORMATION
{
  /* 0x0000 */ unsigned long PlaceHolder;
} PCAT_FIRMWARE_INFORMATION, *PPCAT_FIRMWARE_INFORMATION; /* size: 0x0004 */

typedef enum _HAL_INIT_PHASE
{
  HalInitPhaseBspProcEarly = 0,
  HalInitPhaseBspProcEarlyMmReady = 1,
  HalInitPhaseBspProcEarlyTimerReady = 2,
  HalInitPhaseBspProcEarlyEnd = 3,
  HalInitPhasePnProcEarly = 4,
  HalInitPhasePnProcEarlyInterruptsReady = 5,
  HalInitPhasePnProcEarlyEnd = 6,
  HalInitPhaseBspSystemEarly = 7,
  HalInitPhaseBspSystemEarlyAcpiReady = 8,
  HalInitPhaseBspSystemEarlyHalExtensionsReady = 9,
  HalInitPhaseBspSystemEarlyInterruptsAlmostReady = 10,
  HalInitPhaseBspSystemEarlyIommusReady = 11,
  HalInitPhaseBspSystemEarlyInterruptsReady = 12,
  HalInitPhaseBspSystemEarlyDmaReady = 12,
  HalInitPhaseBspSystemEarlyProcReady = 13,
  HalInitPhaseBspSystemEarlyHwPerfCntReady = 14,
  HalInitPhaseBspSystemEarlyAllocationDone = 15,
  HalInitPhaseBspSystemEarlyEnd = 16,
  HalInitPhaseBspSystemLate = 17,
  HalInitPhaseBspSystemLateEnd = 18,
  HalInitPhasePnSystemLate = 19,
  HalInitPhasePnSystemLateEnd = 20,
  HalInitPhaseAllProcStartComplete = 21,
  HalInitPhaseAllProcStartCompleteEnd = 22,
  HalInitPhaseExPhase1Ready = 23,
  HalInitPhaseExPhase1ReadyEnd = 24,
  HalInitPhaseAcpiPdoStarted = 25,
  HalInitPhaseAcpiPdoStartedEnd = 26,
  HalInitPhaseReportResources = 27,
  HalInitPhaseReportResourcesEnd = 28,
  HalInitPhaseReportCoreSystemResources = 29,
  HalInitPhaseReportCoreSystemResourcesEnd = 30,
  HalInitPhaseLateSystemActions = 31,
  HalInitPhaseLateSystemActionsTelemetryReady = 32,
  HalInitPhaseLateSystemActionsEnd = 33,
} HAL_INIT_PHASE, *PHAL_INIT_PHASE;

typedef struct _KREQUEST_PACKET
{
  /* 0x0000 */ void* CurrentPacket[3];
  /* 0x0018 */ void* WorkerRoutine /* function */;
} KREQUEST_PACKET, *PKREQUEST_PACKET; /* size: 0x0020 */

typedef struct _REQUEST_MAILBOX
{
  /* 0x0000 */ struct _REQUEST_MAILBOX* Next;
  /* 0x0008 */ unsigned __int64 RequestSummary;
  /* 0x0010 */ struct _KREQUEST_PACKET RequestPacket;
  /* 0x0030 */ volatile long* SubNodeTargetCountAddr;
  /* 0x0038 */ volatile long SubNodeTargetCount;
  /* 0x003c */ long __PADDING__[1];
} REQUEST_MAILBOX, *PREQUEST_MAILBOX; /* size: 0x0040 */

typedef enum _PLUGPLAY_EVENT_CATEGORY
{
  HardwareProfileChangeEvent = 0,
  TargetDeviceChangeEvent = 1,
  DeviceClassChangeEvent = 2,
  CustomDeviceEvent = 3,
  DeviceInstallEvent = 4,
  DeviceArrivalEvent = 5,
  VetoEvent = 6,
  BlockedDriverEvent = 7,
  InvalidIDEvent = 8,
  DevicePropertyChangeEvent = 9,
  DeviceInstanceRemovalEvent = 10,
  DeviceInstanceStartedEvent = 11,
  MaxPlugEventCategory = 12,
} PLUGPLAY_EVENT_CATEGORY, *PPLUGPLAY_EVENT_CATEGORY;

typedef struct _IOMMU_DEVICE_CREATION_CONFIGURATION_ACPI
{
  /* 0x0000 */ unsigned int InputMappingBase;
  /* 0x0004 */ unsigned int MappingsCount;
} IOMMU_DEVICE_CREATION_CONFIGURATION_ACPI, *PIOMMU_DEVICE_CREATION_CONFIGURATION_ACPI; /* size: 0x0008 */

typedef enum _NT_IORING_CREATE_REQUIRED_FLAGS
{
  NT_IORING_CREATE_REQUIRED_FLAG_NONE = 0,
} NT_IORING_CREATE_REQUIRED_FLAGS, *PNT_IORING_CREATE_REQUIRED_FLAGS;

typedef enum _NT_IORING_CREATE_ADVISORY_FLAGS
{
  NT_IORING_CREATE_ADVISORY_FLAG_NONE = 0,
  NT_IORING_CREATE_SKIP_BUILDER_PARAM_CHECKS = 1,
} NT_IORING_CREATE_ADVISORY_FLAGS, *PNT_IORING_CREATE_ADVISORY_FLAGS;

typedef struct _NT_IORING_CREATE_FLAGS
{
  /* 0x0000 */ enum _NT_IORING_CREATE_REQUIRED_FLAGS Required;
  /* 0x0004 */ enum _NT_IORING_CREATE_ADVISORY_FLAGS Advisory;
} NT_IORING_CREATE_FLAGS, *PNT_IORING_CREATE_FLAGS; /* size: 0x0008 */

typedef struct _EXT_IOMMU_FUNCTION_TABLE
{
  /* 0x0000 */ void* ConfigureSettings /* function */;
  /* 0x0008 */ void* Initialize /* function */;
  /* 0x0010 */ void* AllocateDomain /* function */;
  /* 0x0018 */ void* FreeDomain /* function */;
  /* 0x0020 */ void* CreateDevice /* function */;
  /* 0x0028 */ void* DeleteDevice /* function */;
  /* 0x0030 */ void* OwnDevice /* function */;
  /* 0x0038 */ void* ConfigureDeviceFaultReporting /* function */;
  /* 0x0040 */ void* AttachDeviceDomain /* function */;
  /* 0x0048 */ void* DetachDeviceDomain /* function */;
  /* 0x0050 */ void* FlushDomainTb /* function */;
  /* 0x0058 */ void* SyncFlush /* function */;
  /* 0x0060 */ void* CompleteFlush /* function */;
  /* 0x0068 */ void* AllocateRemappingTableEntry /* function */;
  /* 0x0070 */ void* FreeRemappingTableEntry /* function */;
  /* 0x0078 */ void* UpdateRemappingTableEntry /* function */;
  /* 0x0080 */ void* InvalidateRemappingTableEntry /* function */;
  /* 0x0088 */ void* UpdateRemappingDestination /* function */;
  /* 0x0090 */ void* CaptureGlobalCrashdumpState /* function */;
} EXT_IOMMU_FUNCTION_TABLE, *PEXT_IOMMU_FUNCTION_TABLE; /* size: 0x0098 */

typedef struct _EXT_IOMMU_FUNCTION_TABLE_EXTENDED
{
  /* 0x0000 */ void* FindDevice /* function */;
  /* 0x0008 */ void* SetDeviceSvmCapabilities /* function */;
  /* 0x0010 */ void* SetDevicePasidTable /* function */;
  /* 0x0018 */ void* GrowPasidTable /* function */;
  /* 0x0020 */ void* SetPasidAddressSpace /* function */;
  /* 0x0028 */ void* FlushTb /* function */;
  /* 0x0030 */ void* FlushDeviceTbOnly /* function */;
  /* 0x0038 */ void* DismissPageFault /* function */;
  /* 0x0040 */ void* GetPageFault /* function */;
  /* 0x0048 */ void* SetMessageInterruptRouting /* function */;
  /* 0x0050 */ void* EnableInterrupt /* function */;
  /* 0x0058 */ void* DisableInterrupt /* function */;
  /* 0x0060 */ void* HandleInterrupt /* function */;
  /* 0x0068 */ void* CheckForReservedRegion /* function */;
  /* 0x0070 */ void* MarkHiberRegions /* function */;
  /* 0x0078 */ void* DrainSvmPageRequests /* function */;
  /* 0x0080 */ void* CancelPageRequests /* function */;
  /* 0x0088 */ void* EnumerateReservedDevices /* function */;
  /* 0x0090 */ void* ProcessReservedDomains /* function */;
  /* 0x0098 */ void* QueryAcpiDeviceMapping /* function */;
  /* 0x00a0 */ void* GetRidAcpiMapCount /* function */;
  /* 0x00a8 */ void* ConfigureAts /* function */;
} EXT_IOMMU_FUNCTION_TABLE_EXTENDED, *PEXT_IOMMU_FUNCTION_TABLE_EXTENDED; /* size: 0x00b0 */

typedef struct _IOMMU_PAGE_HANDLING_DATA
{
  /* 0x0000 */ struct _EX_PUSH_LOCK ResetLock;
  /* 0x0008 */ unsigned __int64 Lock;
  /* 0x0010 */ unsigned long ValidGroupFaultSequenceNumber;
  /* 0x0014 */ long Padding_22;
  /* 0x0018 */ void* GetPageFault /* function */;
  /* 0x0020 */ void* DismissPageFault /* function */;
} IOMMU_PAGE_HANDLING_DATA, *PIOMMU_PAGE_HANDLING_DATA; /* size: 0x0028 */

typedef struct _RTL_BITMAP
{
  /* 0x0000 */ unsigned long SizeOfBitMap;
  /* 0x0004 */ long Padding_23;
  /* 0x0008 */ unsigned long* Buffer;
} RTL_BITMAP, *PRTL_BITMAP; /* size: 0x0010 */

typedef enum _EXT_IOMMU_KNOWN_IOMMU_TYPE
{
  ExtIommuInvalid = 0,
  ExtIommuAmd = 1,
  ExtIommuIntel = 2,
  ExtIommuSmmuv1 = 3,
  ExtIommuSmmuv2 = 4,
  ExtIommuSmmuv3 = 5,
  ExtIommuIts = 6,
  ExtIommuUnknown = 4096,
} EXT_IOMMU_KNOWN_IOMMU_TYPE, *PEXT_IOMMU_KNOWN_IOMMU_TYPE;

typedef struct _PCI_SLOT_NUMBER
{
  union
  {
    union
    {
      struct
      {
        struct /* bitfield */
        {
          /* 0x0000 */ unsigned long DeviceNumber : 5; /* bit position: 0 */
          /* 0x0000 */ unsigned long FunctionNumber : 3; /* bit position: 5 */
          /* 0x0000 */ unsigned long Reserved : 24; /* bit position: 8 */
        }; /* bitfield */
      } /* size: 0x0004 */ bits;
      /* 0x0000 */ unsigned long AsULONG;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ u;
} PCI_SLOT_NUMBER, *PPCI_SLOT_NUMBER; /* size: 0x0004 */

typedef struct _REGISTERED_IOMMU
{
  /* 0x0000 */ struct _LIST_ENTRY ListEntry;
  /* 0x0010 */ void* InternalData;
  /* 0x0018 */ unsigned long InternalDataSize;
  /* 0x001c */ long Padding_24;
  /* 0x0020 */ void* InterruptContext;
  /* 0x0028 */ unsigned char Irql;
  /* 0x0029 */ char Padding_25[3];
  /* 0x002c */ long Gsi;
  /* 0x0030 */ enum _KINTERRUPT_POLARITY InterruptPolarity;
  /* 0x0034 */ enum _KINTERRUPT_MODE InterruptMode;
  /* 0x0038 */ struct _EXT_IOMMU_FUNCTION_TABLE FunctionTable;
  /* 0x00d0 */ struct _EXT_IOMMU_FUNCTION_TABLE_EXTENDED FunctionTableExtended;
  /* 0x0180 */ unsigned long Flags;
  /* 0x0184 */ long Padding_26;
  /* 0x0188 */ struct _IOMMU_PAGE_HANDLING_DATA PageHandling;
  /* 0x01b0 */ unsigned long MaximumDomainIds;
  /* 0x01b4 */ long Padding_27;
  /* 0x01b8 */ unsigned __int64 DomainIdBitmapLock;
  /* 0x01c0 */ struct _RTL_BITMAP DomainIdBitmap;
  /* 0x01d0 */ unsigned long Capabilities;
  /* 0x01d4 */ enum _EXT_IOMMU_KNOWN_IOMMU_TYPE KnownType;
  /* 0x01d8 */ unsigned long PciSegment;
  /* 0x01dc */ unsigned long PciBus;
  /* 0x01e0 */ struct _PCI_SLOT_NUMBER PciSlot;
  /* 0x01e4 */ long Padding_28;
  /* 0x01e8 */ union _LARGE_INTEGER MsiAddress;
  /* 0x01f0 */ unsigned __int64 MsiData;
  /* 0x01f8 */ unsigned long MaximumAsids;
  /* 0x01fc */ unsigned long Identifier;
  /* 0x0200 */ struct _UNICODE_STRING ResourceId;
  /* 0x0210 */ struct _IOMMU_RESERVED_DEVICE_LIST* ReservedDevices;
} REGISTERED_IOMMU, *PREGISTERED_IOMMU; /* size: 0x0218 */

typedef enum _USER_ACTIVITY_PRESENCE
{
  PowerUserPresent = 0,
  PowerUserNotPresent = 1,
  PowerUserInactive = 2,
  PowerUserMaximum = 3,
  PowerUserInvalid = 3,
} USER_ACTIVITY_PRESENCE, *PUSER_ACTIVITY_PRESENCE;

typedef struct _ARBITER_TEST_ALLOCATION_PARAMETERS
{
  /* 0x0000 */ struct _LIST_ENTRY* ArbitrationList;
  /* 0x0008 */ unsigned long AllocateFromCount;
  /* 0x000c */ long Padding_29;
  /* 0x0010 */ struct _CM_PARTIAL_RESOURCE_DESCRIPTOR* AllocateFrom;
} ARBITER_TEST_ALLOCATION_PARAMETERS, *PARBITER_TEST_ALLOCATION_PARAMETERS; /* size: 0x0018 */

typedef struct _ARBITER_RETEST_ALLOCATION_PARAMETERS
{
  /* 0x0000 */ struct _LIST_ENTRY* ArbitrationList;
  /* 0x0008 */ unsigned long AllocateFromCount;
  /* 0x000c */ long Padding_30;
  /* 0x0010 */ struct _CM_PARTIAL_RESOURCE_DESCRIPTOR* AllocateFrom;
} ARBITER_RETEST_ALLOCATION_PARAMETERS, *PARBITER_RETEST_ALLOCATION_PARAMETERS; /* size: 0x0018 */

typedef struct _ARBITER_BOOT_ALLOCATION_PARAMETERS
{
  /* 0x0000 */ struct _LIST_ENTRY* ArbitrationList;
} ARBITER_BOOT_ALLOCATION_PARAMETERS, *PARBITER_BOOT_ALLOCATION_PARAMETERS; /* size: 0x0008 */

typedef struct _ARBITER_QUERY_ALLOCATED_RESOURCES_PARAMETERS
{
  /* 0x0000 */ struct _CM_PARTIAL_RESOURCE_LIST** AllocatedResources;
} ARBITER_QUERY_ALLOCATED_RESOURCES_PARAMETERS, *PARBITER_QUERY_ALLOCATED_RESOURCES_PARAMETERS; /* size: 0x0008 */

typedef struct _ARBITER_QUERY_CONFLICT_PARAMETERS
{
  /* 0x0000 */ struct _DEVICE_OBJECT* PhysicalDeviceObject;
  /* 0x0008 */ struct _IO_RESOURCE_DESCRIPTOR* ConflictingResource;
  /* 0x0010 */ unsigned long* ConflictCount;
  /* 0x0018 */ struct _ARBITER_CONFLICT_INFO** Conflicts;
} ARBITER_QUERY_CONFLICT_PARAMETERS, *PARBITER_QUERY_CONFLICT_PARAMETERS; /* size: 0x0020 */

typedef struct _ARBITER_QUERY_ARBITRATE_PARAMETERS
{
  /* 0x0000 */ struct _LIST_ENTRY* ArbitrationList;
} ARBITER_QUERY_ARBITRATE_PARAMETERS, *PARBITER_QUERY_ARBITRATE_PARAMETERS; /* size: 0x0008 */

typedef struct _ARBITER_ADD_RESERVED_PARAMETERS
{
  /* 0x0000 */ struct _DEVICE_OBJECT* ReserveDevice;
} ARBITER_ADD_RESERVED_PARAMETERS, *PARBITER_ADD_RESERVED_PARAMETERS; /* size: 0x0008 */

typedef struct _ARBITER_PARAMETERS
{
  union
  {
    union
    {
      /* 0x0000 */ struct _ARBITER_TEST_ALLOCATION_PARAMETERS TestAllocation;
      /* 0x0000 */ struct _ARBITER_RETEST_ALLOCATION_PARAMETERS RetestAllocation;
      /* 0x0000 */ struct _ARBITER_BOOT_ALLOCATION_PARAMETERS BootAllocation;
      /* 0x0000 */ struct _ARBITER_QUERY_ALLOCATED_RESOURCES_PARAMETERS QueryAllocatedResources;
      /* 0x0000 */ struct _ARBITER_QUERY_CONFLICT_PARAMETERS QueryConflict;
      /* 0x0000 */ struct _ARBITER_QUERY_ARBITRATE_PARAMETERS QueryArbitrate;
      /* 0x0000 */ struct _ARBITER_ADD_RESERVED_PARAMETERS AddReserved;
    }; /* size: 0x0020 */
  } /* size: 0x0020 */ Parameters;
} ARBITER_PARAMETERS, *PARBITER_PARAMETERS; /* size: 0x0020 */

typedef enum _INTERFACE_TYPE
{
  InterfaceTypeUndefined = -1,
  Internal = 0,
  Isa = 1,
  Eisa = 2,
  MicroChannel = 3,
  TurboChannel = 4,
  PCIBus = 5,
  VMEBus = 6,
  NuBus = 7,
  PCMCIABus = 8,
  CBus = 9,
  MPIBus = 10,
  MPSABus = 11,
  ProcessorInternal = 12,
  InternalPowerBus = 13,
  PNPISABus = 14,
  PNPBus = 15,
  Vmcs = 16,
  ACPIBus = 17,
  MaximumInterfaceType = 18,
} INTERFACE_TYPE, *PINTERFACE_TYPE;

typedef enum _EXCEPTION_DISPOSITION
{
  ExceptionContinueExecution = 0,
  ExceptionContinueSearch = 1,
  ExceptionNestedException = 2,
  ExceptionCollidedUnwind = 3,
} EXCEPTION_DISPOSITION, *PEXCEPTION_DISPOSITION;

typedef enum _SECURITY_IMPERSONATION_LEVEL
{
  SecurityAnonymous = 0,
  SecurityIdentification = 1,
  SecurityImpersonation = 2,
  SecurityDelegation = 3,
} SECURITY_IMPERSONATION_LEVEL, *PSECURITY_IMPERSONATION_LEVEL;

typedef enum _INTERRUPT_RESULT
{
  InterruptBeginFatalError = 0,
  InterruptBeginLine = 1,
  InterruptBeginSpurious = 2,
  InterruptBeginVector = 3,
  InterruptBeginNone = 4,
} INTERRUPT_RESULT, *PINTERRUPT_RESULT;

typedef enum _DMA_WIDTH
{
  Width8Bits = 0,
  Width16Bits = 1,
  Width32Bits = 2,
  Width64Bits = 3,
  WidthNoWrap = 4,
  MaximumDmaWidth = 5,
} DMA_WIDTH, *PDMA_WIDTH;

typedef struct _EXCEPTION_RECORD32
{
  /* 0x0000 */ long ExceptionCode;
  /* 0x0004 */ unsigned long ExceptionFlags;
  /* 0x0008 */ unsigned long ExceptionRecord;
  /* 0x000c */ unsigned long ExceptionAddress;
  /* 0x0010 */ unsigned long NumberParameters;
  /* 0x0014 */ unsigned long ExceptionInformation[15];
} EXCEPTION_RECORD32, *PEXCEPTION_RECORD32; /* size: 0x0050 */

typedef struct _DBGKM_EXCEPTION32
{
  /* 0x0000 */ struct _EXCEPTION_RECORD32 ExceptionRecord;
  /* 0x0050 */ unsigned long FirstChance;
} DBGKM_EXCEPTION32, *PDBGKM_EXCEPTION32; /* size: 0x0054 */

typedef enum _LDR_DDAG_STATE
{
  LdrModulesMerged = -5,
  LdrModulesInitError = -4,
  LdrModulesSnapError = -3,
  LdrModulesUnloaded = -2,
  LdrModulesUnloading = -1,
  LdrModulesPlaceHolder = 0,
  LdrModulesMapping = 1,
  LdrModulesMapped = 2,
  LdrModulesWaitingForDependencies = 3,
  LdrModulesSnapping = 4,
  LdrModulesSnapped = 5,
  LdrModulesCondensed = 6,
  LdrModulesReadyToInit = 7,
  LdrModulesInitializing = 8,
  LdrModulesReadyToRun = 9,
} LDR_DDAG_STATE, *PLDR_DDAG_STATE;

typedef struct _FIRMWARE_INFORMATION_LOADER_BLOCK
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned long FirmwareTypeUefi : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned long EfiRuntimeUseIum : 1; /* bit position: 1 */
    /* 0x0000 */ unsigned long EfiRuntimePageProtectionSupported : 1; /* bit position: 2 */
    /* 0x0000 */ unsigned long Reserved1 : 1; /* bit position: 3 */
    /* 0x0000 */ unsigned long SoftRebootMpwrResume : 1; /* bit position: 4 */
    /* 0x0000 */ unsigned long Reserved2 : 27; /* bit position: 5 */
  }; /* bitfield */
  /* 0x0004 */ long Padding_31;
  union
  {
    union
    {
      /* 0x0008 */ struct _EFI_FIRMWARE_INFORMATION EfiInformation;
      /* 0x0008 */ struct _PCAT_FIRMWARE_INFORMATION PcatInformation;
    }; /* size: 0x0038 */
  } /* size: 0x0038 */ u;
} FIRMWARE_INFORMATION_LOADER_BLOCK, *PFIRMWARE_INFORMATION_LOADER_BLOCK; /* size: 0x0040 */

typedef enum _HALP_DMA_TRANSLATION_TYPE
{
  DmaTranslationTypePassthrough = 0,
  DmaTranslationTypeSafePassthrough = 1,
  DmaTranslationTypeHybridPassthrough = 2,
  DmaTranslationTypeTranslate = 3,
  DmaTranslationTypeMax = 4,
} HALP_DMA_TRANSLATION_TYPE, *PHALP_DMA_TRANSLATION_TYPE;

typedef enum _HALP_DMA_ADAPTER_ALLOCATION_STATE
{
  HalpDmaAdapterAllocationStateNone = 0,
  HalpDmaAdapterAllocateChannel = 1,
  HalpDmaAdapterAllocateMapRegisters = 2,
  HalpDmaAdapterAllocateChannelRemapResources = 3,
  HalpDmaAdapterAllocationStateComplete = 4,
  HalpDmaAdapterAllocationStateMax = 5,
} HALP_DMA_ADAPTER_ALLOCATION_STATE, *PHALP_DMA_ADAPTER_ALLOCATION_STATE;

typedef union _KLOCK_ENTRY_LOCK_STATE
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned __int64 CrossThreadReleasable : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned __int64 Busy : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned __int64 Reserved : 61; /* bit position: 2 */
      /* 0x0000 */ unsigned __int64 InTree : 1; /* bit position: 63 */
    }; /* bitfield */
    /* 0x0000 */ void* LockState;
  }; /* size: 0x0008 */
} KLOCK_ENTRY_LOCK_STATE, *PKLOCK_ENTRY_LOCK_STATE; /* size: 0x0008 */

typedef union _KLOCK_ENTRY_BOOST_BITMAP
{
  union
  {
    /* 0x0000 */ unsigned __int64 AllFields;
    struct
    {
      /* 0x0000 */ unsigned long AllBoosts;
      /* 0x0004 */ unsigned long WaiterCounts;
    }; /* size: 0x0008 */
    struct
    {
      struct /* bitfield */
      {
        /* 0x0000 */ unsigned long CpuBoostsBitmap : 30; /* bit position: 0 */
        /* 0x0000 */ unsigned long IoBoost : 1; /* bit position: 30 */
        /* 0x0000 */ unsigned long IoQoSBoost : 1; /* bit position: 31 */
      }; /* bitfield */
      struct /* bitfield */
      {
        /* 0x0004 */ unsigned long IoNormalPriorityWaiterCount : 8; /* bit position: 0 */
        /* 0x0004 */ unsigned long IoQoSWaiterCount : 7; /* bit position: 8 */
      }; /* bitfield */
    }; /* size: 0x0008 */
  }; /* size: 0x0008 */
} KLOCK_ENTRY_BOOST_BITMAP, *PKLOCK_ENTRY_BOOST_BITMAP; /* size: 0x0008 */

typedef struct _KLOCK_ENTRY
{
  union
  {
    /* 0x0000 */ union _KLOCK_ENTRY_LOCK_STATE LockState;
    /* 0x0000 */ void* volatile LockUnsafe;
    struct
    {
      /* 0x0000 */ volatile unsigned char CrossThreadReleasableAndBusyByte;
      /* 0x0001 */ unsigned char Reserved[6];
      /* 0x0007 */ volatile unsigned char InTreeByte;
    }; /* size: 0x0008 */
  }; /* size: 0x0008 */
  union
  {
    /* 0x0008 */ unsigned long EntryFlags;
    /* 0x0008 */ unsigned char StaticByte;
    struct
    {
      struct /* bitfield */
      {
        /* 0x0008 */ unsigned char EntryIndex : 6; /* bit position: 0 */
        /* 0x0008 */ unsigned char PreWaiting : 1; /* bit position: 6 */
        /* 0x0008 */ unsigned char UserModeBit : 1; /* bit position: 7 */
      }; /* bitfield */
      /* 0x0009 */ unsigned char WaitingByte;
      /* 0x000a */ unsigned char AcquiredByte;
      union
      {
        /* 0x000b */ unsigned char CrossThreadFlags;
        struct /* bitfield */
        {
          /* 0x000b */ unsigned char HeadNodeBit : 1; /* bit position: 0 */
          /* 0x000b */ unsigned char IoPriorityBit : 1; /* bit position: 1 */
          /* 0x000b */ unsigned char IoQoSWaiter : 1; /* bit position: 2 */
          /* 0x000b */ unsigned char Spare1 : 5; /* bit position: 3 */
        }; /* bitfield */
      }; /* size: 0x0001 */
    }; /* size: 0x0004 */
    struct /* bitfield */
    {
      /* 0x0008 */ unsigned long StaticState : 8; /* bit position: 0 */
      /* 0x0008 */ unsigned long AllFlags : 24; /* bit position: 8 */
    }; /* bitfield */
  }; /* size: 0x0004 */
  /* 0x000c */ unsigned long SpareFlags;
  /* 0x0010 */ struct _RTL_BALANCED_NODE TreeNode;
  union
  {
    struct
    {
      /* 0x0028 */ struct _RTL_RB_TREE OwnerTree;
      /* 0x0038 */ struct _RTL_RB_TREE WaiterTree;
    }; /* size: 0x0020 */
    /* 0x0028 */ char CpuPriorityKey;
  }; /* size: 0x0020 */
  /* 0x0048 */ unsigned __int64 EntryLock;
  /* 0x0050 */ union _KLOCK_ENTRY_BOOST_BITMAP BoostBitmap;
} KLOCK_ENTRY, *PKLOCK_ENTRY; /* size: 0x0058 */

typedef struct _KLOCK_ENTRIES
{
  /* 0x0000 */ struct _KTHREAD* Thread;
  /* 0x0008 */ unsigned short AvailableEntryBitmap;
  /* 0x000a */ unsigned short OrphanedEntryBitmap;
  /* 0x000c */ unsigned char EntryCount;
  /* 0x000d */ unsigned char Padding0[3];
  /* 0x0010 */ struct _KLOCK_ENTRY Entries[1];
} KLOCK_ENTRIES, *PKLOCK_ENTRIES; /* size: 0x0068 */

typedef enum _TAG_UNNAMED_1
{
  KTMOH_CommitTransaction_Result = 1,
  KTMOH_RollbackTransaction_Result = 2,
} TAG_UNNAMED_1, *PTAG_UNNAMED_1;

typedef enum _HAL_DMA_CRASH_DUMP_REGISTER_TYPE
{
  HalDmaCrashDumpRegisterSet1 = 0,
  HalDmaCrashDumpRegisterSet2 = 1,
  HalDmaCrashDumpRegisterSetMax = 2,
} HAL_DMA_CRASH_DUMP_REGISTER_TYPE, *PHAL_DMA_CRASH_DUMP_REGISTER_TYPE;

typedef struct _CMSI_RW_LOCK
{
  /* 0x0000 */ void* Reserved;
} CMSI_RW_LOCK, *PCMSI_RW_LOCK; /* size: 0x0008 */

typedef enum _CMP_DEVICE_NOTIFICATION_STATE
{
  CmpDeviceUsageNotificationsNotSent = 0,
  CmpDeviceUsageNotificationsSent = 1,
  CmpDeviceUsageNotificationsPending = 2,
} CMP_DEVICE_NOTIFICATION_STATE, *PCMP_DEVICE_NOTIFICATION_STATE;

typedef struct _CMP_VOLUME_CONTEXT
{
  /* 0x0000 */ struct _LIST_ENTRY VolumeContextListEntry;
  /* 0x0010 */ struct _CMP_VOLUME_MANAGER* VolumeManager;
  /* 0x0018 */ __int64 RefCount;
  /* 0x0020 */ struct _GUID VolumeGuid;
  /* 0x0030 */ void* VolumeFileObject;
  /* 0x0038 */ struct _CMSI_RW_LOCK VolumeContextLock;
  /* 0x0040 */ enum _CMP_DEVICE_NOTIFICATION_STATE DeviceUsageNotificationState;
  /* 0x0044 */ long __PADDING__[1];
} CMP_VOLUME_CONTEXT, *PCMP_VOLUME_CONTEXT; /* size: 0x0048 */

typedef enum _IOMMU_DMA_DEVICE_CREATION_STATE
{
  DmaDeviceCreationStateRemapping = 0,
  DmaDeviceCreationStateSvm = 1,
  DmaDeviceCreationStateUnblocked = 2,
  DmaDeviceCreationStateAtsOnly = 3,
  DmaDeviceCreationStateMax = 4,
} IOMMU_DMA_DEVICE_CREATION_STATE, *PIOMMU_DMA_DEVICE_CREATION_STATE;

typedef struct _DISPATCHER_HEADER
{
  union
  {
    /* 0x0000 */ volatile long Lock;
    /* 0x0000 */ long LockNV;
    struct
    {
      /* 0x0000 */ unsigned char Type;
      /* 0x0001 */ unsigned char Signalling;
      /* 0x0002 */ unsigned char Size;
      /* 0x0003 */ unsigned char Reserved1;
    }; /* size: 0x0004 */
    struct
    {
      /* 0x0000 */ unsigned char TimerType;
      union
      {
        /* 0x0001 */ unsigned char TimerControlFlags;
        struct
        {
          struct /* bitfield */
          {
            /* 0x0001 */ unsigned char Absolute : 1; /* bit position: 0 */
            /* 0x0001 */ unsigned char Wake : 1; /* bit position: 1 */
            /* 0x0001 */ unsigned char EncodedTolerableDelay : 6; /* bit position: 2 */
          }; /* bitfield */
          /* 0x0002 */ unsigned char Hand;
          union
          {
            /* 0x0003 */ unsigned char TimerMiscFlags;
            struct /* bitfield */
            {
              /* 0x0003 */ unsigned char Index : 6; /* bit position: 0 */
              /* 0x0003 */ unsigned char Inserted : 1; /* bit position: 6 */
              /* 0x0003 */ volatile unsigned char Expired : 1; /* bit position: 7 */
            }; /* bitfield */
          }; /* size: 0x0001 */
        }; /* size: 0x0003 */
      }; /* size: 0x0003 */
    }; /* size: 0x0004 */
    struct
    {
      /* 0x0000 */ unsigned char Timer2Type;
      union
      {
        /* 0x0001 */ unsigned char Timer2Flags;
        struct
        {
          struct /* bitfield */
          {
            /* 0x0001 */ unsigned char Timer2Inserted : 1; /* bit position: 0 */
            /* 0x0001 */ unsigned char Timer2Expiring : 1; /* bit position: 1 */
            /* 0x0001 */ unsigned char Timer2CancelPending : 1; /* bit position: 2 */
            /* 0x0001 */ unsigned char Timer2SetPending : 1; /* bit position: 3 */
            /* 0x0001 */ unsigned char Timer2Running : 1; /* bit position: 4 */
            /* 0x0001 */ unsigned char Timer2Disabled : 1; /* bit position: 5 */
            /* 0x0001 */ unsigned char Timer2ReservedFlags : 2; /* bit position: 6 */
          }; /* bitfield */
          /* 0x0002 */ unsigned char Timer2ComponentId;
          /* 0x0003 */ unsigned char Timer2RelativeId;
        }; /* size: 0x0003 */
      }; /* size: 0x0003 */
    }; /* size: 0x0004 */
    struct
    {
      /* 0x0000 */ unsigned char QueueType;
      union
      {
        /* 0x0001 */ unsigned char QueueControlFlags;
        struct
        {
          struct /* bitfield */
          {
            /* 0x0001 */ unsigned char Abandoned : 1; /* bit position: 0 */
            /* 0x0001 */ unsigned char DisableIncrement : 1; /* bit position: 1 */
            /* 0x0001 */ unsigned char QueueReservedControlFlags : 6; /* bit position: 2 */
          }; /* bitfield */
          /* 0x0002 */ unsigned char QueueSize;
          /* 0x0003 */ unsigned char QueueReserved;
        }; /* size: 0x0003 */
      }; /* size: 0x0003 */
    }; /* size: 0x0004 */
    struct
    {
      /* 0x0000 */ unsigned char ThreadType;
      /* 0x0001 */ unsigned char ThreadReserved;
      union
      {
        /* 0x0002 */ unsigned char ThreadControlFlags;
        struct
        {
          struct /* bitfield */
          {
            /* 0x0002 */ unsigned char CycleProfiling : 1; /* bit position: 0 */
            /* 0x0002 */ unsigned char CounterProfiling : 1; /* bit position: 1 */
            /* 0x0002 */ unsigned char GroupScheduling : 1; /* bit position: 2 */
            /* 0x0002 */ unsigned char AffinitySet : 1; /* bit position: 3 */
            /* 0x0002 */ unsigned char Tagged : 1; /* bit position: 4 */
            /* 0x0002 */ unsigned char EnergyProfiling : 1; /* bit position: 5 */
            /* 0x0002 */ unsigned char SchedulerAssist : 1; /* bit position: 6 */
            /* 0x0002 */ unsigned char ThreadReservedControlFlags : 1; /* bit position: 7 */
          }; /* bitfield */
          union
          {
            /* 0x0003 */ unsigned char DebugActive;
            struct /* bitfield */
            {
              /* 0x0003 */ unsigned char ActiveDR7 : 1; /* bit position: 0 */
              /* 0x0003 */ unsigned char Instrumented : 1; /* bit position: 1 */
              /* 0x0003 */ unsigned char Minimal : 1; /* bit position: 2 */
              /* 0x0003 */ unsigned char Reserved4 : 2; /* bit position: 3 */
              /* 0x0003 */ unsigned char AltSyscall : 1; /* bit position: 5 */
              /* 0x0003 */ unsigned char Emulation : 1; /* bit position: 6 */
              /* 0x0003 */ unsigned char Reserved5 : 1; /* bit position: 7 */
            }; /* bitfield */
          }; /* size: 0x0001 */
        }; /* size: 0x0002 */
      }; /* size: 0x0002 */
    }; /* size: 0x0004 */
    struct
    {
      /* 0x0000 */ unsigned char MutantType;
      /* 0x0001 */ unsigned char MutantSize;
      /* 0x0002 */ unsigned char DpcActive;
      /* 0x0003 */ unsigned char MutantReserved;
    }; /* size: 0x0004 */
  }; /* size: 0x0004 */
  /* 0x0004 */ long SignalState;
  /* 0x0008 */ struct _LIST_ENTRY WaitListHead;
} DISPATCHER_HEADER, *PDISPATCHER_HEADER; /* size: 0x0018 */

typedef struct _KEVENT
{
  /* 0x0000 */ struct _DISPATCHER_HEADER Header;
} KEVENT, *PKEVENT; /* size: 0x0018 */

typedef enum _KRESOURCEMANAGER_STATE
{
  KResourceManagerUninitialized = 0,
  KResourceManagerOffline = 1,
  KResourceManagerOnline = 2,
} KRESOURCEMANAGER_STATE, *PKRESOURCEMANAGER_STATE;

typedef struct _KMUTANT
{
  /* 0x0000 */ struct _DISPATCHER_HEADER Header;
  /* 0x0018 */ struct _LIST_ENTRY MutantListEntry;
  /* 0x0028 */ struct _KTHREAD* OwnerThread;
  union
  {
    /* 0x0030 */ unsigned char MutantFlags;
    struct /* bitfield */
    {
      /* 0x0030 */ unsigned char Abandoned : 1; /* bit position: 0 */
      /* 0x0030 */ unsigned char Spare1 : 7; /* bit position: 1 */
    }; /* bitfield */
    struct /* bitfield */
    {
      /* 0x0030 */ unsigned char Abandoned2 : 1; /* bit position: 0 */
      /* 0x0030 */ unsigned char AbEnabled : 1; /* bit position: 1 */
      /* 0x0030 */ unsigned char Spare2 : 6; /* bit position: 2 */
    }; /* bitfield */
  }; /* size: 0x0001 */
  /* 0x0031 */ unsigned char ApcDisable;
  /* 0x0032 */ char __PADDING__[6];
} KMUTANT, *PKMUTANT; /* size: 0x0038 */

typedef struct _RTL_BALANCED_LINKS
{
  /* 0x0000 */ struct _RTL_BALANCED_LINKS* Parent;
  /* 0x0008 */ struct _RTL_BALANCED_LINKS* LeftChild;
  /* 0x0010 */ struct _RTL_BALANCED_LINKS* RightChild;
  /* 0x0018 */ char Balance;
  /* 0x0019 */ unsigned char Reserved[3];
  /* 0x001c */ long __PADDING__[1];
} RTL_BALANCED_LINKS, *PRTL_BALANCED_LINKS; /* size: 0x0020 */

typedef struct _KTMOBJECT_NAMESPACE_LINK
{
  /* 0x0000 */ struct _RTL_BALANCED_LINKS Links;
  /* 0x0020 */ unsigned char Expired;
  /* 0x0021 */ char __PADDING__[7];
} KTMOBJECT_NAMESPACE_LINK, *PKTMOBJECT_NAMESPACE_LINK; /* size: 0x0028 */

typedef struct _KQUEUE
{
  /* 0x0000 */ struct _DISPATCHER_HEADER Header;
  /* 0x0018 */ struct _LIST_ENTRY EntryListHead;
  /* 0x0028 */ volatile unsigned long CurrentCount;
  /* 0x002c */ unsigned long MaximumCount;
  /* 0x0030 */ struct _LIST_ENTRY ThreadListHead;
} KQUEUE, *PKQUEUE; /* size: 0x0040 */

typedef struct _RTL_AVL_TABLE
{
  /* 0x0000 */ struct _RTL_BALANCED_LINKS BalancedRoot;
  /* 0x0020 */ void* OrderedPointer;
  /* 0x0028 */ unsigned long WhichOrderedElement;
  /* 0x002c */ unsigned long NumberGenericTableElements;
  /* 0x0030 */ unsigned long DepthOfTree;
  /* 0x0034 */ long Padding_32;
  /* 0x0038 */ struct _RTL_BALANCED_LINKS* RestartKey;
  /* 0x0040 */ unsigned long DeleteCount;
  /* 0x0044 */ long Padding_33;
  /* 0x0048 */ void* CompareRoutine /* function */;
  /* 0x0050 */ void* AllocateRoutine /* function */;
  /* 0x0058 */ void* FreeRoutine /* function */;
  /* 0x0060 */ void* TableContext;
} RTL_AVL_TABLE, *PRTL_AVL_TABLE; /* size: 0x0068 */

typedef struct _KTMOBJECT_NAMESPACE
{
  /* 0x0000 */ struct _RTL_AVL_TABLE Table;
  /* 0x0068 */ struct _KMUTANT Mutex;
  /* 0x00a0 */ unsigned short LinksOffset;
  /* 0x00a2 */ unsigned short GuidOffset;
  /* 0x00a4 */ unsigned char Expired;
  /* 0x00a5 */ char __PADDING__[3];
} KTMOBJECT_NAMESPACE, *PKTMOBJECT_NAMESPACE; /* size: 0x00a8 */

typedef struct _KRESOURCEMANAGER_COMPLETION_BINDING
{
  /* 0x0000 */ struct _LIST_ENTRY NotificationListHead;
  /* 0x0010 */ void* Port;
  /* 0x0018 */ unsigned __int64 Key;
  /* 0x0020 */ struct _EPROCESS* BindingProcess;
} KRESOURCEMANAGER_COMPLETION_BINDING, *PKRESOURCEMANAGER_COMPLETION_BINDING; /* size: 0x0028 */

typedef struct _KRESOURCEMANAGER
{
  /* 0x0000 */ struct _KEVENT NotificationAvailable;
  /* 0x0018 */ unsigned long cookie;
  /* 0x001c */ enum _KRESOURCEMANAGER_STATE State;
  /* 0x0020 */ unsigned long Flags;
  /* 0x0024 */ long Padding_34;
  /* 0x0028 */ struct _KMUTANT Mutex;
  /* 0x0060 */ struct _KTMOBJECT_NAMESPACE_LINK NamespaceLink;
  /* 0x0088 */ struct _GUID RmId;
  /* 0x0098 */ struct _KQUEUE NotificationQueue;
  /* 0x00d8 */ struct _KMUTANT NotificationMutex;
  /* 0x0110 */ struct _LIST_ENTRY EnlistmentHead;
  /* 0x0120 */ unsigned long EnlistmentCount;
  /* 0x0124 */ long Padding_35;
  /* 0x0128 */ void* NotificationRoutine /* function */;
  /* 0x0130 */ void* Key;
  /* 0x0138 */ struct _LIST_ENTRY ProtocolListHead;
  /* 0x0148 */ struct _LIST_ENTRY PendingPropReqListHead;
  /* 0x0158 */ struct _LIST_ENTRY CRMListEntry;
  /* 0x0168 */ struct _KTM* Tm;
  /* 0x0170 */ struct _UNICODE_STRING Description;
  /* 0x0180 */ struct _KTMOBJECT_NAMESPACE Enlistments;
  /* 0x0228 */ struct _KRESOURCEMANAGER_COMPLETION_BINDING CompletionBinding;
} KRESOURCEMANAGER, *PKRESOURCEMANAGER; /* size: 0x0250 */

typedef enum _PO_EFFECTIVE_POWER_MODE
{
  PoEffectivePowerModeBatterySaver = 0,
  PoEffectivePowerModeEnergySaverHighSavings = 0,
  PoEffectivePowerModeBetterBattery = 1,
  PoEffectivePowerModeEnergySaverStandard = 1,
  PoEffectivePowerModeBalanced = 2,
  PoEffectivePowerModeHighPerformance = 3,
  PoEffectivePowerModeMaxPerformance = 4,
  PoEffectivePowerModeGameMode = 5,
  PoEffectivePowerModeMixedReality = 6,
} PO_EFFECTIVE_POWER_MODE, *PPO_EFFECTIVE_POWER_MODE;

typedef struct _MI_ZERO_COST_COUNTS
{
  /* 0x0000 */ unsigned __int64 NativeSum;
  /* 0x0008 */ unsigned __int64 AlternateSum;
} MI_ZERO_COST_COUNTS, *PMI_ZERO_COST_COUNTS; /* size: 0x0010 */

typedef enum _PO_FX_PERF_STATE_UNIT
{
  PoFxPerfStateUnitOther = 0,
  PoFxPerfStateUnitFrequency = 1,
  PoFxPerfStateUnitBandwidth = 2,
  PoFxPerfStateUnitMaximum = 3,
} PO_FX_PERF_STATE_UNIT, *PPO_FX_PERF_STATE_UNIT;

union wil_details_ReportedState
{
  union
  {
    /* 0x0000 */ unsigned int exchange;
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned int queuedForReporting : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned int reportedDeviceUsage : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned int reportedDevicePotential : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned int reportedDeviceOpportunity : 1; /* bit position: 3 */
      /* 0x0000 */ unsigned int reportedDevicePotentialOpportunity : 1; /* bit position: 4 */
      /* 0x0000 */ unsigned int usageCount : 9; /* bit position: 5 */
      /* 0x0000 */ unsigned int usageCountRepresentsPotential : 1; /* bit position: 14 */
      /* 0x0000 */ unsigned int opportunityCount : 7; /* bit position: 15 */
      /* 0x0000 */ unsigned int opportunityCountRepresentsPotential : 1; /* bit position: 22 */
      /* 0x0000 */ unsigned int unused : 9; /* bit position: 23 */
    }; /* bitfield */
  }; /* size: 0x0004 */
}; /* size: 0x0004 */

union wil_details_RecordedState
{
  union
  {
    /* 0x0000 */ unsigned int exchange;
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned int recordedDeviceUsage : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned int recordedDevicePotential : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned int recordedDeviceOpportunity : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned int recordedDevicePotentialOpportunity : 1; /* bit position: 3 */
      /* 0x0000 */ unsigned int recordedVariantDeviceUsage : 1; /* bit position: 4 */
      /* 0x0000 */ unsigned int recordedVariant : 6; /* bit position: 5 */
      /* 0x0000 */ unsigned int unused : 21; /* bit position: 11 */
    }; /* bitfield */
  }; /* size: 0x0004 */
}; /* size: 0x0004 */

struct wil_details_FeatureReportingCache
{
  /* 0x0000 */ union wil_details_ReportedState reported;
  /* 0x0004 */ union wil_details_RecordedState recorded;
}; /* size: 0x0008 */

enum DMA_COMPLETION_STATUS
{
  DmaComplete = 0,
  DmaAborted = 1,
  DmaError = 2,
  DmaCancelled = 3,
};

typedef enum _DMA_INTERRUPT_TYPE
{
  InterruptTypeCompletion = 0,
  InterruptTypeError = 1,
  InterruptTypeCancelled = 2,
} DMA_INTERRUPT_TYPE, *PDMA_INTERRUPT_TYPE;

typedef enum _CONFIGURATION_CLASS
{
  SystemClass = 0,
  ProcessorClass = 1,
  CacheClass = 2,
  AdapterClass = 3,
  ControllerClass = 4,
  PeripheralClass = 5,
  MemoryClass = 6,
  MaximumClass = 7,
} CONFIGURATION_CLASS, *PCONFIGURATION_CLASS;

typedef enum _FAULT_INFORMATION_ARCH
{
  FaultInformationInvalid = 0,
  FaultInformationArm64 = 1,
  FaultInformationX64 = 2,
} FAULT_INFORMATION_ARCH, *PFAULT_INFORMATION_ARCH;

typedef enum _INTERRUPT_TARGET_TYPE
{
  InterruptTargetInvalid = 0,
  InterruptTargetAllIncludingSelf = 1,
  InterruptTargetAllExcludingSelf = 2,
  InterruptTargetSelfOnly = 3,
  InterruptTargetPhysical = 4,
  InterruptTargetLogicalFlat = 5,
  InterruptTargetLogicalClustered = 6,
  InterruptTargetRemapIndex = 7,
  InterruptTargetHypervisor = 8,
} INTERRUPT_TARGET_TYPE, *PINTERRUPT_TARGET_TYPE;

typedef union _PS_CLIENT_SECURITY_CONTEXT
{
  union
  {
    /* 0x0000 */ unsigned __int64 ImpersonationData;
    /* 0x0000 */ void* ImpersonationToken;
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned __int64 ImpersonationLevel : 2; /* bit position: 0 */
      /* 0x0000 */ unsigned __int64 EffectiveOnly : 1; /* bit position: 2 */
    }; /* bitfield */
  }; /* size: 0x0008 */
} PS_CLIENT_SECURITY_CONTEXT, *PPS_CLIENT_SECURITY_CONTEXT; /* size: 0x0008 */

typedef enum _FS_FILTER_SECTION_SYNC_TYPE
{
  SyncTypeOther = 0,
  SyncTypeCreateSection = 1,
} FS_FILTER_SECTION_SYNC_TYPE, *PFS_FILTER_SECTION_SYNC_TYPE;

typedef enum _HV_SUBNODE_TYPE
{
  HvSubnodeAny = 0,
  HvSubnodeSocket = 1,
  HvSubnodeCluster = 2,
  HvSubnodeL3 = 3,
  HvSubnodeCount = 4,
  HvSubnodeInvalid = -1,
} HV_SUBNODE_TYPE, *PHV_SUBNODE_TYPE;

typedef struct _ETW_SYSTEM_LOGGER
{
  /* 0x0000 */ unsigned char LoggerId;
  /* 0x0001 */ unsigned char ClockType;
} ETW_SYSTEM_LOGGER, *PETW_SYSTEM_LOGGER; /* size: 0x0002 */

typedef enum _HAL_HV_DMA_DOMAIN_CONFIG_ARCH
{
  HalHvDmaDomainConfigArm64 = 0,
  HalHvDmaDomainConfigX64 = 1,
} HAL_HV_DMA_DOMAIN_CONFIG_ARCH, *PHAL_HV_DMA_DOMAIN_CONFIG_ARCH;

typedef struct _HAL_LOG_REGISTER_CONTEXT
{
  /* 0x0000 */ void* LogRoutine /* function */;
  /* 0x0008 */ unsigned long Flag;
  /* 0x000c */ long __PADDING__[1];
} HAL_LOG_REGISTER_CONTEXT, *PHAL_LOG_REGISTER_CONTEXT; /* size: 0x0010 */

typedef enum _EXT_IOMMU_ADDRESS_TRANSLATION_POLICY
{
  ExtIommuAddressTranslationPolicyDisable = 0,
  ExtIommuAddressTranslationPolicyEnableDefaultBypass = 1,
  ExtIommuAddressTranslationPolicyEnableDefaultBlock = 2,
  ExtIommuAddressTranslationPolicyEnableDefaultTranslate = 3,
} EXT_IOMMU_ADDRESS_TRANSLATION_POLICY, *PEXT_IOMMU_ADDRESS_TRANSLATION_POLICY;

typedef enum _EXT_IOMMU_INTERRUPT_REMAPPING_POLICY
{
  ExtIommuInterruptRemappingPolicyDisable = 0,
  ExtIommuInterruptRemappingPolicyEnableLoose = 1,
  ExtIommuInterruptRemappingPolicyEnableStrict = 2,
} EXT_IOMMU_INTERRUPT_REMAPPING_POLICY, *PEXT_IOMMU_INTERRUPT_REMAPPING_POLICY;

typedef struct _EXT_IOMMU_RESERVED_MEMORY_REGION
{
  /* 0x0000 */ union _LARGE_INTEGER Base;
  /* 0x0008 */ union _LARGE_INTEGER Limit;
  /* 0x0010 */ unsigned char Ignored;
  /* 0x0011 */ char __PADDING__[7];
} EXT_IOMMU_RESERVED_MEMORY_REGION, *PEXT_IOMMU_RESERVED_MEMORY_REGION; /* size: 0x0018 */

union FAST_ERESOURCE_LOCK_STATE
{
  union
  {
    /* 0x0000 */ __int64 Value;
    struct /* bitfield */
    {
      /* 0x0000 */ __int64 Exclusive : 1; /* bit position: 0 */
      /* 0x0000 */ __int64 Conflict : 1; /* bit position: 1 */
      /* 0x0000 */ __int64 ShareCount : 62; /* bit position: 2 */
    }; /* bitfield */
  }; /* size: 0x0008 */
}; /* size: 0x0008 */

typedef enum _INTERRUPT_LINE_TYPE
{
  InterruptLineInvalidType = 0,
  InterruptLineUnusable = 1,
  InterruptLineStandardPin = 2,
  InterruptLineProcessorLocal = 3,
  InterruptLineSoftwareOnly = 4,
  InterruptLineSoftwareOnlyProcessorLocal = 5,
  InterruptLineOutputPin = 6,
  InterruptLineMsi = 7,
} INTERRUPT_LINE_TYPE, *PINTERRUPT_LINE_TYPE;

typedef struct _VF_TARGET_ALL_SHARED_EXPORT_THUNKS
{
  /* 0x0000 */ struct _VERIFIER_SHARED_EXPORT_THUNK* SharedExportThunks;
  /* 0x0008 */ struct _VERIFIER_SHARED_EXPORT_THUNK* PoolSharedExportThunks;
  /* 0x0010 */ struct _VERIFIER_SHARED_EXPORT_THUNK* XdvSharedExportThunks;
} VF_TARGET_ALL_SHARED_EXPORT_THUNKS, *PVF_TARGET_ALL_SHARED_EXPORT_THUNKS; /* size: 0x0018 */

typedef enum _INTERRUPT_LINE_SUBTYPE
{
  InterruptLineSubTypeNone = 0,
  InterruptLineSubTypeV2m = 1,
  InterruptLineSubTypeLpi = 2,
} INTERRUPT_LINE_SUBTYPE, *PINTERRUPT_LINE_SUBTYPE;

typedef struct _DBGKD_SET_SPECIAL_CALL64
{
  /* 0x0000 */ unsigned __int64 SpecialCall;
} DBGKD_SET_SPECIAL_CALL64, *PDBGKD_SET_SPECIAL_CALL64; /* size: 0x0008 */

typedef enum _BOOT_ENTROPY_SOURCE_ID
{
  BootEntropySourceNone = 0,
  BootEntropySourceSeedfile = 1,
  BootEntropySourceExternal = 2,
  BootEntropySourceTpm = 3,
  BootEntropySourceRdrand = 4,
  BootEntropySourceTime = 5,
  BootEntropySourceAcpiOem0 = 6,
  BootEntropySourceUefi = 7,
  BootEntropySourceCng = 8,
  BootEntropySourceTcbTpm = 9,
  BootEntropySourceTcbRdrand = 10,
  BootMaxEntropySources = 10,
} BOOT_ENTROPY_SOURCE_ID, *PBOOT_ENTROPY_SOURCE_ID;

typedef enum _EXT_IOMMU_DOMAIN_TYPE
{
  ExtIommuDomainTypeS1 = 0,
  ExtIommuDomainTypeS2 = 1,
  ExtIommuDomainTypeInvalid = 2,
} EXT_IOMMU_DOMAIN_TYPE, *PEXT_IOMMU_DOMAIN_TYPE;

typedef struct _RTL_SPLAY_LINKS
{
  /* 0x0000 */ struct _RTL_SPLAY_LINKS* Parent;
  /* 0x0008 */ struct _RTL_SPLAY_LINKS* LeftChild;
  /* 0x0010 */ struct _RTL_SPLAY_LINKS* RightChild;
} RTL_SPLAY_LINKS, *PRTL_SPLAY_LINKS; /* size: 0x0018 */

typedef struct _EVENT_DESCRIPTOR
{
  /* 0x0000 */ unsigned short Id;
  /* 0x0002 */ unsigned char Version;
  /* 0x0003 */ unsigned char Channel;
  /* 0x0004 */ unsigned char Level;
  /* 0x0005 */ unsigned char Opcode;
  /* 0x0006 */ unsigned short Task;
  /* 0x0008 */ unsigned __int64 Keyword;
} EVENT_DESCRIPTOR, *PEVENT_DESCRIPTOR; /* size: 0x0010 */

typedef struct _EVENT_HEADER
{
  /* 0x0000 */ unsigned short Size;
  /* 0x0002 */ unsigned short HeaderType;
  /* 0x0004 */ unsigned short Flags;
  /* 0x0006 */ unsigned short EventProperty;
  /* 0x0008 */ unsigned long ThreadId;
  /* 0x000c */ unsigned long ProcessId;
  /* 0x0010 */ union _LARGE_INTEGER TimeStamp;
  /* 0x0018 */ struct _GUID ProviderId;
  /* 0x0028 */ struct _EVENT_DESCRIPTOR EventDescriptor;
  union
  {
    struct
    {
      /* 0x0038 */ unsigned long KernelTime;
      /* 0x003c */ unsigned long UserTime;
    }; /* size: 0x0008 */
    /* 0x0038 */ unsigned __int64 ProcessorTime;
  }; /* size: 0x0008 */
  /* 0x0040 */ struct _GUID ActivityId;
} EVENT_HEADER, *PEVENT_HEADER; /* size: 0x0050 */

typedef enum _EXT_IOMMU_TRANSLATION_TYPE
{
  ExtTranslationTypePassThrough = 0,
  ExtTranslationTypeBlocked = 1,
  ExtTranslationTypeTranslate = 2,
  ExtTranslationTypeInvalid = 3,
} EXT_IOMMU_TRANSLATION_TYPE, *PEXT_IOMMU_TRANSLATION_TYPE;

struct _JOB_ACCESS_STATE;

typedef enum _IRQ_PRIORITY
{
  IrqPriorityUndefined = 0,
  IrqPriorityLow = 1,
  IrqPriorityNormal = 2,
  IrqPriorityHigh = 3,
} IRQ_PRIORITY, *PIRQ_PRIORITY;

typedef enum _DMA_COMMON_BUFFER_EXTENDED_CONFIGURATION_TYPE
{
  CommonBufferConfigTypeLogicalAddressLimits = 0,
  CommonBufferConfigTypeSubSection = 1,
  CommonBufferConfigTypeHardwareAccessPermissions = 2,
  CommonBufferConfigTypeMax = 3,
} DMA_COMMON_BUFFER_EXTENDED_CONFIGURATION_TYPE, *PDMA_COMMON_BUFFER_EXTENDED_CONFIGURATION_TYPE;

typedef struct _ETW_REPLY_QUEUE
{
  /* 0x0000 */ struct _KQUEUE Queue;
  /* 0x0040 */ long EventsLost;
  /* 0x0044 */ long __PADDING__[1];
} ETW_REPLY_QUEUE, *PETW_REPLY_QUEUE; /* size: 0x0048 */

typedef enum _DMA_COMMON_BUFFER_EXTENDED_CONFIGURATION_ACCESS_TYPE
{
  CommonBufferHardwareAccessReadOnly = 0,
  CommonBufferHardwareAccessWriteOnly = 1,
  CommonBufferHardwareAccessReadWrite = 2,
  CommonBufferHardwareAccessMax = 3,
} DMA_COMMON_BUFFER_EXTENDED_CONFIGURATION_ACCESS_TYPE, *PDMA_COMMON_BUFFER_EXTENDED_CONFIGURATION_ACCESS_TYPE;

typedef struct _VI_POOL_PAGE_HEADER
{
  /* 0x0000 */ struct _SLIST_ENTRY* NextPage;
  /* 0x0008 */ void* VerifierEntry;
  /* 0x0010 */ unsigned __int64 Signature;
} VI_POOL_PAGE_HEADER, *PVI_POOL_PAGE_HEADER; /* size: 0x0018 */

typedef struct _VI_POOL_ENTRY_INUSE
{
  /* 0x0000 */ void* VirtualAddress;
  /* 0x0008 */ void* CallingAddress;
  /* 0x0010 */ unsigned __int64 NumberOfBytes;
  /* 0x0018 */ unsigned __int64 Tag;
} VI_POOL_ENTRY_INUSE, *PVI_POOL_ENTRY_INUSE; /* size: 0x0020 */

typedef struct _VI_POOL_ENTRY
{
  union
  {
    /* 0x0000 */ struct _VI_POOL_PAGE_HEADER PageHeader;
    /* 0x0000 */ struct _VI_POOL_ENTRY_INUSE InUse;
    struct
    {
      /* 0x0000 */ struct _SLIST_ENTRY* NextFree;
      /* 0x0008 */ long __PADDING__[6];
    }; /* size: 0x0020 */
  }; /* size: 0x0020 */
} VI_POOL_ENTRY, *PVI_POOL_ENTRY; /* size: 0x0020 */

typedef enum _WHEA_RECOVERY_CONTEXT_ERROR_TYPE
{
  WheaRecoveryContextErrorTypeMemory = 1,
  WheaRecoveryContextErrorTypePmem = 2,
  WheaRecoveryContextErrorTypeMax = 3,
} WHEA_RECOVERY_CONTEXT_ERROR_TYPE, *PWHEA_RECOVERY_CONTEXT_ERROR_TYPE;

typedef struct _MI_WORKING_SET_PAGE_TABLE_AGE_LINKS
{
  /* 0x0000 */ volatile long Lock;
  /* 0x0004 */ unsigned long EntryCount;
  /* 0x0008 */ struct _MMPFN* Flink;
  /* 0x0010 */ struct _MMPFN* Blink;
} MI_WORKING_SET_PAGE_TABLE_AGE_LINKS, *PMI_WORKING_SET_PAGE_TABLE_AGE_LINKS; /* size: 0x0018 */

typedef struct _MMWSL_INSTANCE
{
  /* 0x0000 */ struct _MMPTE* PteResumePoint[3];
  /* 0x0018 */ unsigned long LastAccessClearingRemainder;
  /* 0x001c */ unsigned long LastAgingRemainder;
  /* 0x0020 */ unsigned __int64 LockedEntries;
  /* 0x0028 */ long Padding_36[6];
  /* 0x0040 */ struct _MI_WORKING_SET_PAGE_TABLE_AGE_LINKS ActivePageTableLinks[8];
} MMWSL_INSTANCE, *PMMWSL_INSTANCE; /* size: 0x0100 */

typedef enum _IOMMU_PASID_SETTING
{
  PasidSettingPreserve = 0,
  PasidSettingEnableAll = 1,
  PasidSettingEnablePasidOnly = 2,
  PasidSettingEnableDefaultOnly = 3,
  PasidSettingDisable = 4,
  PasidSettingMax = 5,
} IOMMU_PASID_SETTING, *PIOMMU_PASID_SETTING;

typedef struct _MI_AWEINFO_FLAGS
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long ProcessDefault : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned long PagesLockInitialized : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned long ZeroPagesOptional : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned long IoSpace : 1; /* bit position: 3 */
      /* 0x0000 */ unsigned long LazyTbFlush : 1; /* bit position: 4 */
      /* 0x0000 */ unsigned long Unused : 27; /* bit position: 5 */
    }; /* bitfield */
    /* 0x0000 */ unsigned long AllBits;
  }; /* size: 0x0004 */
} MI_AWEINFO_FLAGS, *PMI_AWEINFO_FLAGS; /* size: 0x0004 */

typedef enum _IOMMU_ATS_SETTING
{
  AtsSettingPreserve = 0,
  AtsSettingEnable = 1,
  AtsSettingDisable = 2,
} IOMMU_ATS_SETTING, *PIOMMU_ATS_SETTING;

typedef enum _EXT_IOMMU_DEVICE_TYPE
{
  EXT_IOMMU_DEVICE_TYPE_INVALID = 0,
  EXT_IOMMU_DEVICE_TYPE_PCI = 1,
  EXT_IOMMU_DEVICE_TYPE_ACPI = 2,
  EXT_IOMMU_DEVICE_TYPE_IOAPIC = 3,
  EXT_IOMMU_DEVICE_TYPE_LOGICAL = 4,
  EXT_IOMMU_DEVICE_TYPE_TEST = 5,
  EXT_IOMMU_DEVICE_TYPE_MAX = 6,
} EXT_IOMMU_DEVICE_TYPE, *PEXT_IOMMU_DEVICE_TYPE;

typedef enum _IOMMU_DMA_DOMAIN_TYPE
{
  DomainTypeTranslate = 0,
  DomainTypePassThrough = 1,
  DomainTypeUnmanaged = 2,
  DomainTypeTranslateS1 = 3,
  DomainTypeMax = 4,
} IOMMU_DMA_DOMAIN_TYPE, *PIOMMU_DMA_DOMAIN_TYPE;

typedef enum _IOMMU_DMA_LOGICAL_ALLOCATOR_TYPE
{
  IommuDmaLogicalAllocatorNone = 0,
  IommuDmaLogicalAllocatorBuddy = 1,
  IommuDmaLogicalAllocatorMax = 2,
} IOMMU_DMA_LOGICAL_ALLOCATOR_TYPE, *PIOMMU_DMA_LOGICAL_ALLOCATOR_TYPE;

struct _PCW_INSTANCE;

typedef enum _IOMMU_DMA_LOGICAL_ALLOCATOR_CAPABILITY_EXPLICIT_ADDRESS
{
  LogicalAllocatorCapabilityExplicitNotSupported = 0,
  LogicalAllocatorCapabilityExplicitReservedOnly = 1,
  LogicalAllocatorCapabilityExplicitAnyAddress = 2,
} IOMMU_DMA_LOGICAL_ALLOCATOR_CAPABILITY_EXPLICIT_ADDRESS, *PIOMMU_DMA_LOGICAL_ALLOCATOR_CAPABILITY_EXPLICIT_ADDRESS;

typedef enum _WHEA_RECOVERY_CONTEXT_ACTION_TAKEN
{
  WheaRecoveryContextActionTakenNone = 0,
  WheaRecoveryContextActionTakenOfflineDemotion = 1,
  WheaRecoveryContextActionTakenPageNotReplaced = 2,
  WheaRecoveryContextActionTakenPageReplaced = 3,
  WheaRecoveryContextActionTakenMax = 4,
} WHEA_RECOVERY_CONTEXT_ACTION_TAKEN, *PWHEA_RECOVERY_CONTEXT_ACTION_TAKEN;

typedef enum _DMA_SPEED
{
  Compatible = 0,
  TypeA = 1,
  TypeB = 2,
  TypeC = 3,
  TypeF = 4,
  MaximumDmaSpeed = 5,
} DMA_SPEED, *PDMA_SPEED;

typedef struct _ARM64_DBGKD_CONTROL_SET
{
  /* 0x0000 */ unsigned long Continue;
  /* 0x0004 */ unsigned long TraceFlag;
  /* 0x0008 */ unsigned __int64 CurrentSymbolStart;
  /* 0x0010 */ unsigned __int64 CurrentSymbolEnd;
} ARM64_DBGKD_CONTROL_SET, *PARM64_DBGKD_CONTROL_SET; /* size: 0x0018 */

enum SE_WS_APPX_SIGNATURE_ORIGIN
{
  SE_WS_APPX_SIGNATURE_ORIGIN_NOT_VALIDATED = 0,
  SE_WS_APPX_SIGNATURE_ORIGIN_UNKNOWN = 1,
  SE_WS_APPX_SIGNATURE_ORIGIN_APPSTORE = 2,
  SE_WS_APPX_SIGNATURE_ORIGIN_WINDOWS = 3,
  SE_WS_APPX_SIGNATURE_ORIGIN_ENTERPRISE = 4,
};

typedef enum _PS_MITIGATION_OPTION
{
  PS_MITIGATION_OPTION_NX = 0,
  PS_MITIGATION_OPTION_SEHOP = 1,
  PS_MITIGATION_OPTION_FORCE_RELOCATE_IMAGES = 2,
  PS_MITIGATION_OPTION_HEAP_TERMINATE = 3,
  PS_MITIGATION_OPTION_BOTTOM_UP_ASLR = 4,
  PS_MITIGATION_OPTION_HIGH_ENTROPY_ASLR = 5,
  PS_MITIGATION_OPTION_STRICT_HANDLE_CHECKS = 6,
  PS_MITIGATION_OPTION_WIN32K_SYSTEM_CALL_DISABLE = 7,
  PS_MITIGATION_OPTION_EXTENSION_POINT_DISABLE = 8,
  PS_MITIGATION_OPTION_PROHIBIT_DYNAMIC_CODE = 9,
  PS_MITIGATION_OPTION_CONTROL_FLOW_GUARD = 10,
  PS_MITIGATION_OPTION_BLOCK_NON_MICROSOFT_BINARIES = 11,
  PS_MITIGATION_OPTION_FONT_DISABLE = 12,
  PS_MITIGATION_OPTION_IMAGE_LOAD_NO_REMOTE = 13,
  PS_MITIGATION_OPTION_IMAGE_LOAD_NO_LOW_LABEL = 14,
  PS_MITIGATION_OPTION_IMAGE_LOAD_PREFER_SYSTEM32 = 15,
  PS_MITIGATION_OPTION_RETURN_FLOW_GUARD = 16,
  PS_MITIGATION_OPTION_LOADER_INTEGRITY_CONTINUITY = 17,
  PS_MITIGATION_OPTION_STRICT_CONTROL_FLOW_GUARD = 18,
  PS_MITIGATION_OPTION_RESTRICT_SET_THREAD_CONTEXT = 19,
  PS_MITIGATION_OPTION_ROP_STACKPIVOT = 20,
  PS_MITIGATION_OPTION_ROP_CALLER_CHECK = 21,
  PS_MITIGATION_OPTION_ROP_SIMEXEC = 22,
  PS_MITIGATION_OPTION_EXPORT_ADDRESS_FILTER = 23,
  PS_MITIGATION_OPTION_EXPORT_ADDRESS_FILTER_PLUS = 24,
  PS_MITIGATION_OPTION_RESTRICT_CHILD_PROCESS_CREATION = 25,
  PS_MITIGATION_OPTION_IMPORT_ADDRESS_FILTER = 26,
  PS_MITIGATION_OPTION_MODULE_TAMPERING_PROTECTION = 27,
  PS_MITIGATION_OPTION_RESTRICT_INDIRECT_BRANCH_PREDICTION = 28,
  PS_MITIGATION_OPTION_SPECULATIVE_STORE_BYPASS_DISABLE = 29,
  PS_MITIGATION_OPTION_ALLOW_DOWNGRADE_DYNAMIC_CODE_POLICY = 30,
  PS_MITIGATION_OPTION_CET_USER_SHADOW_STACKS = 31,
  PS_MITIGATION_OPTION_USER_CET_SET_CONTEXT_IP_VALIDATION = 32,
  PS_MITIGATION_OPTION_BLOCK_NON_CET_BINARIES = 33,
  PS_MITIGATION_OPTION_RESERVED_WAS_XFG = 34,
  PS_MITIGATION_OPTION_POINTER_AUTH_USER_IP = 35,
  PS_MITIGATION_OPTION_CET_DYNAMIC_APIS_OUT_OF_PROC_ONLY = 36,
  PS_MITIGATION_OPTION_REDIRECTION_TRUST = 37,
  PS_MITIGATION_OPTION_RESTRICT_CORE_SHARING = 38,
  PS_MITIGATION_OPTION_FSCTL_SYSTEM_CALL_DISABLE = 39,
} PS_MITIGATION_OPTION, *PPS_MITIGATION_OPTION;

typedef enum _NT_PRODUCT_TYPE
{
  NtProductWinNt = 1,
  NtProductLanManNt = 2,
  NtProductServer = 3,
} NT_PRODUCT_TYPE, *PNT_PRODUCT_TYPE;

typedef enum _ALTERNATIVE_ARCHITECTURE_TYPE
{
  StandardDesign = 0,
  NEC98x86 = 1,
  EndAlternatives = 2,
} ALTERNATIVE_ARCHITECTURE_TYPE, *PALTERNATIVE_ARCHITECTURE_TYPE;

typedef union _CLS_LSN
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned int idxRecord;
      /* 0x0004 */ unsigned long cidContainer;
    } /* size: 0x0008 */ offset;
    /* 0x0000 */ unsigned __int64 ullOffset;
  }; /* size: 0x0008 */
} CLS_LSN, *PCLS_LSN; /* size: 0x0008 */

typedef struct _WORK_QUEUE_ITEM
{
  /* 0x0000 */ struct _LIST_ENTRY List;
  /* 0x0010 */ void* WorkerRoutine /* function */;
  /* 0x0018 */ void* Parameter;
} WORK_QUEUE_ITEM, *PWORK_QUEUE_ITEM; /* size: 0x0020 */

typedef struct _KDPC
{
  union
  {
    /* 0x0000 */ unsigned long TargetInfoAsUlong;
    struct
    {
      /* 0x0000 */ unsigned char Type;
      /* 0x0001 */ unsigned char Importance;
      /* 0x0002 */ volatile unsigned short Number;
    }; /* size: 0x0004 */
  }; /* size: 0x0004 */
  /* 0x0004 */ long Padding_37;
  /* 0x0008 */ struct _SINGLE_LIST_ENTRY DpcListEntry;
  /* 0x0010 */ unsigned __int64 ProcessorHistory;
  /* 0x0018 */ void* DeferredRoutine /* function */;
  /* 0x0020 */ void* DeferredContext;
  /* 0x0028 */ void* SystemArgument1;
  /* 0x0030 */ void* SystemArgument2;
  /* 0x0038 */ void* DpcData;
} KDPC, *PKDPC; /* size: 0x0040 */

typedef union _ULARGE_INTEGER
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned long LowPart;
      /* 0x0004 */ unsigned long HighPart;
    }; /* size: 0x0008 */
    struct
    {
      /* 0x0000 */ unsigned long LowPart;
      /* 0x0004 */ unsigned long HighPart;
    } /* size: 0x0008 */ u;
    /* 0x0000 */ unsigned __int64 QuadPart;
  }; /* size: 0x0008 */
} ULARGE_INTEGER, *PULARGE_INTEGER; /* size: 0x0008 */

typedef struct _KTIMER
{
  /* 0x0000 */ struct _DISPATCHER_HEADER Header;
  /* 0x0018 */ union _ULARGE_INTEGER DueTime;
  /* 0x0020 */ struct _LIST_ENTRY TimerListEntry;
  /* 0x0030 */ struct _KDPC* Dpc;
  /* 0x0038 */ unsigned short Processor;
  /* 0x003a */ unsigned short TimerType;
  /* 0x003c */ unsigned long Period;
} KTIMER, *PKTIMER; /* size: 0x0040 */

typedef enum _KTRANSACTION_OUTCOME
{
  KTxOutcomeUninitialized = 0,
  KTxOutcomeUndetermined = 1,
  KTxOutcomeCommitted = 2,
  KTxOutcomeAborted = 3,
  KTxOutcomeUnavailable = 4,
} KTRANSACTION_OUTCOME, *PKTRANSACTION_OUTCOME;

typedef struct _KTRANSACTION_HISTORY
{
  /* 0x0000 */ enum _TAG_UNNAMED_1 RecordType;
  /* 0x0004 */ unsigned long Payload;
} KTRANSACTION_HISTORY, *PKTRANSACTION_HISTORY; /* size: 0x0008 */

typedef struct _KTRANSACTION
{
  /* 0x0000 */ struct _KEVENT OutcomeEvent;
  /* 0x0018 */ unsigned long cookie;
  /* 0x001c */ long Padding_38;
  /* 0x0020 */ struct _KMUTANT Mutex;
  /* 0x0058 */ struct _KTRANSACTION* TreeTx;
  /* 0x0060 */ struct _KTMOBJECT_NAMESPACE_LINK GlobalNamespaceLink;
  /* 0x0088 */ struct _KTMOBJECT_NAMESPACE_LINK TmNamespaceLink;
  /* 0x00b0 */ struct _GUID UOW;
  /* 0x00c0 */ enum _KTRANSACTION_STATE State;
  /* 0x00c4 */ unsigned long Flags;
  /* 0x00c8 */ struct _LIST_ENTRY EnlistmentHead;
  /* 0x00d8 */ unsigned long EnlistmentCount;
  /* 0x00dc */ unsigned long RecoverableEnlistmentCount;
  /* 0x00e0 */ unsigned long PrePrepareRequiredEnlistmentCount;
  /* 0x00e4 */ unsigned long PrepareRequiredEnlistmentCount;
  /* 0x00e8 */ unsigned long OutcomeRequiredEnlistmentCount;
  /* 0x00ec */ unsigned long PendingResponses;
  /* 0x00f0 */ struct _KENLISTMENT* SuperiorEnlistment;
  /* 0x00f8 */ union _CLS_LSN LastLsn;
  /* 0x0100 */ struct _LIST_ENTRY PromotedEntry;
  /* 0x0110 */ struct _KTRANSACTION* PromoterTransaction;
  /* 0x0118 */ void* PromotePropagation;
  /* 0x0120 */ unsigned long IsolationLevel;
  /* 0x0124 */ unsigned long IsolationFlags;
  /* 0x0128 */ union _LARGE_INTEGER Timeout;
  /* 0x0130 */ struct _UNICODE_STRING Description;
  /* 0x0140 */ struct _KTHREAD* RollbackThread;
  /* 0x0148 */ struct _WORK_QUEUE_ITEM RollbackWorkItem;
  /* 0x0168 */ struct _KDPC RollbackDpc;
  /* 0x01a8 */ struct _KTIMER RollbackTimer;
  /* 0x01e8 */ struct _LIST_ENTRY LsnOrderedEntry;
  /* 0x01f8 */ enum _KTRANSACTION_OUTCOME Outcome;
  /* 0x01fc */ long Padding_39;
  /* 0x0200 */ struct _KTM* Tm;
  /* 0x0208 */ __int64 CommitReservation;
  /* 0x0210 */ struct _KTRANSACTION_HISTORY TransactionHistory[10];
  /* 0x0260 */ unsigned long TransactionHistoryCount;
  /* 0x0264 */ long Padding_40;
  /* 0x0268 */ void* DTCPrivateInformation;
  /* 0x0270 */ unsigned long DTCPrivateInformationLength;
  /* 0x0274 */ long Padding_41;
  /* 0x0278 */ struct _KMUTANT DTCPrivateInformationMutex;
  /* 0x02b0 */ void* PromotedTxSelfHandle;
  /* 0x02b8 */ unsigned long PendingPromotionCount;
  /* 0x02bc */ long Padding_42;
  /* 0x02c0 */ struct _KEVENT PromotionCompletedEvent;
} KTRANSACTION, *PKTRANSACTION; /* size: 0x02d8 */

typedef enum _TP_CALLBACK_PRIORITY
{
  TP_CALLBACK_PRIORITY_HIGH = 0,
  TP_CALLBACK_PRIORITY_NORMAL = 1,
  TP_CALLBACK_PRIORITY_LOW = 2,
  TP_CALLBACK_PRIORITY_INVALID = 3,
  TP_CALLBACK_PRIORITY_COUNT = 3,
} TP_CALLBACK_PRIORITY, *PTP_CALLBACK_PRIORITY;

typedef enum _PP_NPAGED_LOOKASIDE_NUMBER
{
  LookasideSmallIrpList = 0,
  LookasideMediumIrpList = 1,
  LookasideLargeIrpList = 2,
  LookasideMdlList = 3,
  LookasideCreateInfoList = 4,
  LookasideNameBufferList = 5,
  LookasideTwilightList = 6,
  LookasideCompletionList = 7,
  LookasideScratchBufferList = 8,
  LookasideXStateContextList = 9,
  LookasideCmCallbackList = 10,
  LookasideMaximumList = 11,
} PP_NPAGED_LOOKASIDE_NUMBER, *PPP_NPAGED_LOOKASIDE_NUMBER;

typedef enum _EX_GEN_RANDOM_DOMAIN
{
  ExGenRandomDomainKernel = 0,
  ExGenRandomDomainFirst = 0,
  ExGenRandomDomainUserVisible = 1,
  ExGenRandomDomainMax = 2,
} EX_GEN_RANDOM_DOMAIN, *PEX_GEN_RANDOM_DOMAIN;

typedef enum _SYSTEM_DLL_TYPE
{
  PsNativeSystemDll = 0,
  PsWowX86SystemDll = 1,
  PsWowChpeX86SystemDll = 2,
  PsChpeV2SystemDll = 3,
  PsVsmEnclaveRuntimeDll = 4,
  PsTrustedAppsRuntimeDll = 5,
  PsSystemDllTotalTypes = 6,
} SYSTEM_DLL_TYPE, *PSYSTEM_DLL_TYPE;

typedef struct _PERFINFO_GROUPMASK
{
  /* 0x0000 */ unsigned long Masks[8];
} PERFINFO_GROUPMASK, *PPERFINFO_GROUPMASK; /* size: 0x0020 */

typedef enum _IO_PRIORITY_HINT
{
  IoPriorityVeryLow = 0,
  IoPriorityLow = 1,
  IoPriorityNormal = 2,
  IoPriorityHigh = 3,
  IoPriorityCritical = 4,
  MaxIoPriorityTypes = 5,
} IO_PRIORITY_HINT, *PIO_PRIORITY_HINT;

typedef enum _PF_FILE_ACCESS_TYPE
{
  PfFileAccessTypeRead = 0,
  PfFileAccessTypeWrite = 1,
  PfFileAccessTypeMax = 2,
} PF_FILE_ACCESS_TYPE, *PPF_FILE_ACCESS_TYPE;

enum wil_FeatureVariantPayloadKind
{
  wil_FeatureVariantPayloadKind_None = 0,
  wil_FeatureVariantPayloadKind_Resident = 1,
  wil_FeatureVariantPayloadKind_External = 2,
};

typedef struct _INVERTED_FUNCTION_TABLE_ENTRY
{
  union
  {
    /* 0x0000 */ struct _IMAGE_RUNTIME_FUNCTION_ENTRY* FunctionTable;
    /* 0x0000 */ struct _DYNAMIC_FUNCTION_TABLE* DynamicTable;
  }; /* size: 0x0008 */
  /* 0x0008 */ void* ImageBase;
  /* 0x0010 */ unsigned long SizeOfImage;
  /* 0x0014 */ unsigned long SizeOfTable;
} INVERTED_FUNCTION_TABLE_ENTRY, *PINVERTED_FUNCTION_TABLE_ENTRY; /* size: 0x0018 */

enum wil_ReportingKind
{
  wil_ReportingKind_None = 0,
  wil_ReportingKind_UniqueUsage = 1,
  wil_ReportingKind_UniqueOpportunity = 2,
  wil_ReportingKind_DeviceUsage = 3,
  wil_ReportingKind_DeviceOpportunity = 4,
  wil_ReportingKind_TotalDuration = 5,
  wil_ReportingKind_PausedDuration = 6,
};

typedef struct _DMA_ADAPTER_INFO_V1
{
  /* 0x0000 */ unsigned long ReadDmaCounterAvailable;
  /* 0x0004 */ unsigned long ScatterGatherLimit;
  /* 0x0008 */ unsigned long DmaAddressWidth;
  /* 0x000c */ unsigned long Flags;
  /* 0x0010 */ unsigned long MinimumTransferUnit;
} DMA_ADAPTER_INFO_V1, *PDMA_ADAPTER_INFO_V1; /* size: 0x0014 */

typedef struct _DEVICE_DESCRIPTION
{
  /* 0x0000 */ unsigned long Version;
  /* 0x0004 */ unsigned char Master;
  /* 0x0005 */ unsigned char ScatterGather;
  /* 0x0006 */ unsigned char DemandMode;
  /* 0x0007 */ unsigned char AutoInitialize;
  /* 0x0008 */ unsigned char Dma32BitAddresses;
  /* 0x0009 */ unsigned char IgnoreCount;
  /* 0x000a */ unsigned char Reserved1;
  /* 0x000b */ unsigned char Dma64BitAddresses;
  /* 0x000c */ unsigned long BusNumber;
  /* 0x0010 */ unsigned long DmaChannel;
  /* 0x0014 */ enum _INTERFACE_TYPE InterfaceType;
  /* 0x0018 */ enum _DMA_WIDTH DmaWidth;
  /* 0x001c */ enum _DMA_SPEED DmaSpeed;
  /* 0x0020 */ unsigned long MaximumLength;
  /* 0x0024 */ unsigned long DmaPort;
  /* 0x0028 */ unsigned long DmaAddressWidth;
  /* 0x002c */ unsigned long DmaControllerInstance;
  /* 0x0030 */ unsigned long DmaRequestLine;
  /* 0x0034 */ long Padding_43;
  /* 0x0038 */ union _LARGE_INTEGER DeviceAddress;
} DEVICE_DESCRIPTION, *PDEVICE_DESCRIPTION; /* size: 0x0040 */

typedef struct _DMA_ADAPTER_INFO_CRASHDUMP
{
  /* 0x0000 */ struct _DEVICE_DESCRIPTION DeviceDescription;
  /* 0x0040 */ unsigned __int64 DeviceIdSize;
  /* 0x0048 */ void* DeviceId;
} DMA_ADAPTER_INFO_CRASHDUMP, *PDMA_ADAPTER_INFO_CRASHDUMP; /* size: 0x0050 */

typedef union _DMA_ADAPTER_INFO
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned long Version;
      /* 0x0004 */ struct _DMA_ADAPTER_INFO_V1 V1;
    }; /* size: 0x0018 */
    struct
    {
      /* 0x0000 */ unsigned __int64 Reserved;
      /* 0x0008 */ struct _DMA_ADAPTER_INFO_CRASHDUMP Crashdump;
    }; /* size: 0x0058 */
  }; /* size: 0x0058 */
} DMA_ADAPTER_INFO, *PDMA_ADAPTER_INFO; /* size: 0x0058 */

enum EmptyCVariant_ExpiredFeature
{
  CVariant_ExpiredFeature_Empty = 0,
};

typedef struct _CLIENT_ID32
{
  /* 0x0000 */ unsigned long UniqueProcess;
  /* 0x0004 */ unsigned long UniqueThread;
} CLIENT_ID32, *PCLIENT_ID32; /* size: 0x0008 */

enum wil_VariantReportingKind
{
  wil_VariantReportingKind_None = 0,
  wil_VariantReportingKind_UniqueUsage = 1,
  wil_VariantReportingKind_DeviceUsage = 2,
};

typedef struct _KFLOATING_SAVE
{
  /* 0x0000 */ unsigned long Dummy;
} KFLOATING_SAVE, *PKFLOATING_SAVE; /* size: 0x0004 */

typedef enum _PNP_DEVNODE_STATE
{
  DeviceNodeUnspecified = 768,
  DeviceNodeUninitialized = 769,
  DeviceNodeUninitializedPending = 770,
  DeviceNodeInitializedPending = 771,
  DeviceNodeInitialized = 772,
  DeviceNodeDriversAdded = 773,
  DeviceNodeResourcesAssigned = 774,
  DeviceNodeStartPending = 775,
  DeviceNodeStartCompletion = 776,
  DeviceNodeStartPostWork = 777,
  DeviceNodeStarted = 778,
  DeviceNodeQueryStopped = 779,
  DeviceNodeStopped = 780,
  DeviceNodeRestartCompletion = 781,
  DeviceNodeEnumeratePending = 782,
  DeviceNodeEnumerateCompletion = 783,
  DeviceNodeAwaitingQueuedDeletion = 784,
  DeviceNodeAwaitingQueuedRemoval = 785,
  DeviceNodeQueryRemoved = 786,
  DeviceNodeRemovePendingCloses = 787,
  DeviceNodeRemoved = 788,
  DeviceNodeDeletePendingCloses = 789,
  DeviceNodeDeleted = 790,
  MaxDeviceNodeState = 791,
} PNP_DEVNODE_STATE, *PPNP_DEVNODE_STATE;

typedef struct _PNP_DEVICE_COMPLETION_REQUEST
{
  /* 0x0000 */ struct _LIST_ENTRY ListEntry;
  /* 0x0010 */ struct _DEVICE_NODE* DeviceNode;
  /* 0x0018 */ void* Context;
  /* 0x0020 */ enum _PNP_DEVNODE_STATE CompletionState;
  /* 0x0024 */ unsigned long IrpPended;
  /* 0x0028 */ long Status;
  /* 0x002c */ long Padding_44;
  /* 0x0030 */ void* Information;
  /* 0x0038 */ long ReferenceCount;
  /* 0x003c */ long Padding_45;
  /* 0x0040 */ struct _PNP_WATCHDOG* Watchdog;
} PNP_DEVICE_COMPLETION_REQUEST, *PPNP_DEVICE_COMPLETION_REQUEST; /* size: 0x0048 */

enum wil_details_ServiceReportingKind
{
  wil_details_ServiceReportingKind_UniqueUsage = 0,
  wil_details_ServiceReportingKind_UniqueOpportunity = 1,
  wil_details_ServiceReportingKind_DeviceUsage = 2,
  wil_details_ServiceReportingKind_DeviceOpportunity = 3,
  wil_details_ServiceReportingKind_PotentialUniqueUsage = 4,
  wil_details_ServiceReportingKind_PotentialUniqueOpportunity = 5,
  wil_details_ServiceReportingKind_PotentialDeviceUsage = 6,
  wil_details_ServiceReportingKind_PotentialDeviceOpportunity = 7,
  wil_details_ServiceReportingKind_EnabledTotalDuration = 8,
  wil_details_ServiceReportingKind_EnabledPausedDuration = 9,
  wil_details_ServiceReportingKind_DisabledTotalDuration = 10,
  wil_details_ServiceReportingKind_DisabledPausedDuration = 11,
  wil_details_ServiceReportingKind_CustomEnabledBase = 100,
  wil_details_ServiceReportingKind_CustomDisabledBase = 150,
  wil_details_ServiceReportingKind_Store = 254,
  wil_details_ServiceReportingKind_None = 255,
  wil_details_ServiceReportingKind_VariantDevicePotentialBase = 256,
  wil_details_ServiceReportingKind_VariantDeviceUsageBase = 320,
  wil_details_ServiceReportingKind_VariantUniquePotentialBase = 384,
  wil_details_ServiceReportingKind_VariantUniqueUsageBase = 448,
};

typedef struct _KAPC
{
  /* 0x0000 */ unsigned char Type;
  union
  {
    /* 0x0001 */ unsigned char AllFlags;
    struct /* bitfield */
    {
      /* 0x0001 */ unsigned char CallbackDataContext : 1; /* bit position: 0 */
      /* 0x0001 */ unsigned char Unused : 7; /* bit position: 1 */
    }; /* bitfield */
  }; /* size: 0x0001 */
  /* 0x0002 */ unsigned char Size;
  /* 0x0003 */ unsigned char SpareByte1;
  /* 0x0004 */ unsigned long SpareLong0;
  /* 0x0008 */ struct _KTHREAD* Thread;
  /* 0x0010 */ struct _LIST_ENTRY ApcListEntry;
  union
  {
    struct
    {
      /* 0x0020 */ void* KernelRoutine /* function */;
      /* 0x0028 */ void* RundownRoutine /* function */;
      /* 0x0030 */ void* NormalRoutine /* function */;
    }; /* size: 0x0018 */
    /* 0x0020 */ void* Reserved[3];
  }; /* size: 0x0018 */
  /* 0x0038 */ void* NormalContext;
  /* 0x0040 */ void* SystemArgument1;
  /* 0x0048 */ void* SystemArgument2;
  /* 0x0050 */ char ApcStateIndex;
  /* 0x0051 */ char ApcMode;
  /* 0x0052 */ unsigned char Inserted;
  /* 0x0053 */ char __PADDING__[5];
} KAPC, *PKAPC; /* size: 0x0058 */

typedef struct _ETIMER
{
  /* 0x0000 */ struct _KTIMER KeTimer;
  /* 0x0040 */ unsigned __int64 Lock;
  /* 0x0048 */ struct _KAPC TimerApc;
  /* 0x00a0 */ struct _KDPC TimerDpc;
  /* 0x00e0 */ struct _LIST_ENTRY ActiveTimerListEntry;
  /* 0x00f0 */ unsigned long Period;
  union
  {
    /* 0x00f4 */ char TimerFlags;
    struct /* bitfield */
    {
      /* 0x00f4 */ unsigned char ApcAssociated : 1; /* bit position: 0 */
      /* 0x00f4 */ unsigned char FlushDpcs : 1; /* bit position: 1 */
      /* 0x00f4 */ unsigned char Paused : 1; /* bit position: 2 */
      /* 0x00f4 */ unsigned char Spare1 : 5; /* bit position: 3 */
    }; /* bitfield */
  }; /* size: 0x0001 */
  /* 0x00f5 */ unsigned char DueTimeType;
  /* 0x00f6 */ unsigned short Spare2;
  /* 0x00f8 */ struct _DIAGNOSTIC_CONTEXT* volatile WakeReason;
  /* 0x0100 */ struct _LIST_ENTRY WakeTimerListEntry;
  /* 0x0110 */ void* VirtualizedTimerCookie;
  /* 0x0118 */ struct _LIST_ENTRY VirtualizedTimerLinks;
  /* 0x0128 */ unsigned __int64 DueTime;
  /* 0x0130 */ unsigned long CoalescingWindow;
  /* 0x0134 */ long __PADDING__[1];
} ETIMER, *PETIMER; /* size: 0x0138 */

typedef enum _RTL_FEATURE_USAGE_PROVIDER_CALLBACK_TYPE
{
  FeatureUsageProviderCallbackDefault = 0,
  FeatureUsageProviderCallBackUsageFlushNotification = 1,
} RTL_FEATURE_USAGE_PROVIDER_CALLBACK_TYPE, *PRTL_FEATURE_USAGE_PROVIDER_CALLBACK_TYPE;

typedef struct _DBGKD_GET_VERSION32
{
  /* 0x0000 */ unsigned short MajorVersion;
  /* 0x0002 */ unsigned short MinorVersion;
  /* 0x0004 */ unsigned short ProtocolVersion;
  /* 0x0006 */ unsigned short Flags;
  /* 0x0008 */ unsigned long KernBase;
  /* 0x000c */ unsigned long PsLoadedModuleList;
  /* 0x0010 */ unsigned short MachineType;
  /* 0x0012 */ unsigned short ThCallbackStack;
  /* 0x0014 */ unsigned short NextCallback;
  /* 0x0016 */ unsigned short FramePointer;
  /* 0x0018 */ unsigned long KiCallUserMode;
  /* 0x001c */ unsigned long KeUserCallbackDispatcher;
  /* 0x0020 */ unsigned long BreakpointWithStatus;
  /* 0x0024 */ unsigned long DebuggerDataList;
} DBGKD_GET_VERSION32, *PDBGKD_GET_VERSION32; /* size: 0x0028 */

typedef struct _WNF_NODE_HEADER
{
  /* 0x0000 */ unsigned short NodeTypeCode;
  /* 0x0002 */ unsigned short NodeByteSize;
} WNF_NODE_HEADER, *PWNF_NODE_HEADER; /* size: 0x0004 */

typedef struct _EX_RUNDOWN_REF
{
  union
  {
    /* 0x0000 */ unsigned __int64 Count;
    /* 0x0000 */ void* Ptr;
  }; /* size: 0x0008 */
} EX_RUNDOWN_REF, *PEX_RUNDOWN_REF; /* size: 0x0008 */

typedef enum _WNF_DATA_SCOPE
{
  WnfDataScopeSystem = 0,
  WnfDataScopeSession = 1,
  WnfDataScopeUser = 2,
  WnfDataScopeProcess = 3,
  WnfDataScopeMachine = 4,
  WnfDataScopePhysicalMachine = 5,
} WNF_DATA_SCOPE, *PWNF_DATA_SCOPE;

typedef struct _WNF_LOCK
{
  /* 0x0000 */ struct _EX_PUSH_LOCK PushLock;
} WNF_LOCK, *PWNF_LOCK; /* size: 0x0008 */

typedef struct _WNF_SCOPE_INSTANCE
{
  /* 0x0000 */ struct _WNF_NODE_HEADER Header;
  /* 0x0004 */ long Padding_46;
  /* 0x0008 */ struct _EX_RUNDOWN_REF RunRef;
  /* 0x0010 */ enum _WNF_DATA_SCOPE DataScope;
  /* 0x0014 */ unsigned long InstanceIdSize;
  /* 0x0018 */ void* InstanceIdData;
  /* 0x0020 */ struct _LIST_ENTRY ResolverListEntry;
  /* 0x0030 */ struct _WNF_LOCK NameSetLock;
  /* 0x0038 */ struct _RTL_AVL_TREE NameSet;
  /* 0x0040 */ struct _WNF_PERMANENT_DATA_STORE* PermanentDataStore;
  /* 0x0048 */ struct _WNF_PERMANENT_DATA_STORE* VolatilePermanentDataStore;
} WNF_SCOPE_INSTANCE, *PWNF_SCOPE_INSTANCE; /* size: 0x0050 */

typedef enum _RTL_ARM_FEATURE_USAGE_PROVIDER_FLUSH_NOTIFICATION_FLAGS
{
  ArmFeatureUsageProviderFlushNotificationFlagsNone = 0,
  ArmFeatureUsageProviderFlushNotificationFlagsSetTimer = 1,
} RTL_ARM_FEATURE_USAGE_PROVIDER_FLUSH_NOTIFICATION_FLAGS, *PRTL_ARM_FEATURE_USAGE_PROVIDER_FLUSH_NOTIFICATION_FLAGS;

typedef struct _ETW_HASH_BUCKET
{
  /* 0x0000 */ struct _LIST_ENTRY ListHead[3];
  /* 0x0030 */ struct _EX_PUSH_LOCK BucketLock;
} ETW_HASH_BUCKET, *PETW_HASH_BUCKET; /* size: 0x0038 */

typedef union _PPM_POLICY_SETTINGS_MASK
{
  union
  {
    /* 0x0000 */ unsigned __int64 Buffer[2];
    struct
    {
      struct /* bitfield */
      {
        /* 0x0000 */ unsigned __int64 PerfDecreaseTime : 1; /* bit position: 0 */
        /* 0x0000 */ unsigned __int64 PerfIncreaseTime : 1; /* bit position: 1 */
        /* 0x0000 */ unsigned __int64 PerfDecreasePolicy : 1; /* bit position: 2 */
        /* 0x0000 */ unsigned __int64 PerfIncreasePolicy : 1; /* bit position: 3 */
        /* 0x0000 */ unsigned __int64 PerfDecreaseThreshold : 1; /* bit position: 4 */
        /* 0x0000 */ unsigned __int64 PerfIncreaseThreshold : 1; /* bit position: 5 */
        /* 0x0000 */ unsigned __int64 PerfMinPolicy : 1; /* bit position: 6 */
        /* 0x0000 */ unsigned __int64 PerfMaxPolicy : 1; /* bit position: 7 */
        /* 0x0000 */ unsigned __int64 PerfTimeCheck : 1; /* bit position: 8 */
        /* 0x0000 */ unsigned __int64 PerfBoostPolicy : 1; /* bit position: 9 */
        /* 0x0000 */ unsigned __int64 PerfBoostMode : 1; /* bit position: 10 */
        /* 0x0000 */ unsigned __int64 ThrottlingPolicy : 1; /* bit position: 11 */
        /* 0x0000 */ unsigned __int64 PerfHistoryCount : 1; /* bit position: 12 */
        /* 0x0000 */ unsigned __int64 ParkingPerfState : 1; /* bit position: 13 */
        /* 0x0000 */ unsigned __int64 LatencyHintPerf : 1; /* bit position: 14 */
        /* 0x0000 */ unsigned __int64 LatencyHintEpp : 1; /* bit position: 15 */
        /* 0x0000 */ unsigned __int64 LatencyHintUnpark : 1; /* bit position: 16 */
        /* 0x0000 */ unsigned __int64 CPMinCores : 1; /* bit position: 17 */
        /* 0x0000 */ unsigned __int64 CPMaxCores : 1; /* bit position: 18 */
        /* 0x0000 */ unsigned __int64 CPDecreasePolicy : 1; /* bit position: 19 */
        /* 0x0000 */ unsigned __int64 CPIncreasePolicy : 1; /* bit position: 20 */
        /* 0x0000 */ unsigned __int64 CPDecreaseTime : 1; /* bit position: 21 */
        /* 0x0000 */ unsigned __int64 CPIncreaseTime : 1; /* bit position: 22 */
        /* 0x0000 */ unsigned __int64 CPOverUtilizationThreshold : 1; /* bit position: 23 */
        /* 0x0000 */ unsigned __int64 CPDistributeUtility : 1; /* bit position: 24 */
        /* 0x0000 */ unsigned __int64 CPConcurrencyThreshold : 1; /* bit position: 25 */
        /* 0x0000 */ unsigned __int64 CPHeadroomThreshold : 1; /* bit position: 26 */
        /* 0x0000 */ unsigned __int64 CPDistributeThreshold : 1; /* bit position: 27 */
        /* 0x0000 */ unsigned __int64 IdleAllowScaling : 1; /* bit position: 28 */
        /* 0x0000 */ unsigned __int64 IdleDisabled : 1; /* bit position: 29 */
        /* 0x0000 */ unsigned __int64 IdleTimeCheck : 1; /* bit position: 30 */
        /* 0x0000 */ unsigned __int64 IdleDemoteThreshold : 1; /* bit position: 31 */
        /* 0x0000 */ unsigned __int64 IdlePromoteThreshold : 1; /* bit position: 32 */
        /* 0x0000 */ unsigned __int64 EnergyPerfPreference : 1; /* bit position: 33 */
        /* 0x0000 */ unsigned __int64 AutonomousActivityWindow : 1; /* bit position: 34 */
        /* 0x0000 */ unsigned __int64 AutonomousMode : 1; /* bit position: 35 */
        /* 0x0000 */ unsigned __int64 DutyCycling : 1; /* bit position: 36 */
        /* 0x0000 */ unsigned __int64 FrequencyCap : 1; /* bit position: 37 */
        /* 0x0000 */ unsigned __int64 IdleStateMax : 1; /* bit position: 38 */
        /* 0x0000 */ unsigned __int64 ResponsivenessDisableThreshold : 1; /* bit position: 39 */
        /* 0x0000 */ unsigned __int64 ResponsivenessEnableThreshold : 1; /* bit position: 40 */
        /* 0x0000 */ unsigned __int64 ResponsivenessDisableTime : 1; /* bit position: 41 */
        /* 0x0000 */ unsigned __int64 ResponsivenessEnableTime : 1; /* bit position: 42 */
        /* 0x0000 */ unsigned __int64 ResponsivenessEppCeiling : 1; /* bit position: 43 */
        /* 0x0000 */ unsigned __int64 ResponsivenessPerfFloor : 1; /* bit position: 44 */
        /* 0x0000 */ unsigned __int64 SoftParkLatency : 1; /* bit position: 45 */
        /* 0x0000 */ unsigned __int64 ModuleUnparkPolicy : 1; /* bit position: 46 */
        /* 0x0000 */ unsigned __int64 ComplexUnparkPolicy : 1; /* bit position: 47 */
        /* 0x0000 */ unsigned __int64 SmtUnparkPolicy : 1; /* bit position: 48 */
        /* 0x0000 */ unsigned __int64 RestrictionCount : 1; /* bit position: 49 */
        /* 0x0000 */ unsigned __int64 ResourcePriority : 1; /* bit position: 50 */
        /* 0x0000 */ unsigned __int64 HeteroDecreaseTime : 1; /* bit position: 51 */
        /* 0x0000 */ unsigned __int64 HeteroIncreaseTime : 1; /* bit position: 52 */
        /* 0x0000 */ unsigned __int64 HeteroDecreaseThreshold : 1; /* bit position: 53 */
        /* 0x0000 */ unsigned __int64 HeteroIncreaseThreshold : 1; /* bit position: 54 */
        /* 0x0000 */ unsigned __int64 Class0FloorPerformance : 1; /* bit position: 55 */
        /* 0x0000 */ unsigned __int64 Class1InitialPerformance : 1; /* bit position: 56 */
        /* 0x0000 */ unsigned __int64 SchedulingPolicy : 1; /* bit position: 57 */
        /* 0x0000 */ unsigned __int64 ShortSchedulingPolicy : 1; /* bit position: 58 */
        /* 0x0000 */ unsigned __int64 ShortThreadRuntimeThreshold : 1; /* bit position: 59 */
        /* 0x0000 */ unsigned __int64 ShortThreadArchClassUpperThreshold : 1; /* bit position: 60 */
        /* 0x0000 */ unsigned __int64 ShortThreadArchClassLowerThreshold : 1; /* bit position: 61 */
        /* 0x0000 */ unsigned __int64 LongThreadArchClassUpperThreshold : 1; /* bit position: 62 */
        /* 0x0000 */ unsigned __int64 LongThreadArchClassLowerThreshold : 1; /* bit position: 63 */
      }; /* bitfield */
      struct /* bitfield */
      {
        /* 0x0008 */ unsigned __int64 HeteroPolicy : 1; /* bit position: 0 */
        /* 0x0008 */ unsigned __int64 HeteroContainmentIncreaseTime : 1; /* bit position: 1 */
        /* 0x0008 */ unsigned __int64 HeteroContainmentDecreaseTime : 1; /* bit position: 2 */
        /* 0x0008 */ unsigned __int64 HeteroEfficiencyContainmentThreshold : 1; /* bit position: 3 */
        /* 0x0008 */ unsigned __int64 HeteroHybridContainmentThreshold : 1; /* bit position: 4 */
        /* 0x0008 */ unsigned __int64 HeteroContainmentPolicy : 1; /* bit position: 5 */
      }; /* bitfield */
    }; /* size: 0x0010 */
  }; /* size: 0x0010 */
} PPM_POLICY_SETTINGS_MASK, *PPPM_POLICY_SETTINGS_MASK; /* size: 0x0010 */

typedef struct _CM_UOW_KEY_STATE_MODIFICATION
{
  /* 0x0000 */ unsigned long RefCount;
  /* 0x0004 */ unsigned long SubKeyListCount[2];
  /* 0x000c */ unsigned long NewSubKeyList[2];
} CM_UOW_KEY_STATE_MODIFICATION, *PCM_UOW_KEY_STATE_MODIFICATION; /* size: 0x0014 */

enum wil_FeatureStore
{
  wil_FeatureStore_Machine = 0,
  wil_FeatureStore_User = 1,
  wil_FeatureStore_All = 2,
};

enum wil_FeatureEnabledState
{
  wil_FeatureEnabledState_Default = 0,
  wil_FeatureEnabledState_Disabled = 1,
  wil_FeatureEnabledState_Enabled = 2,
};

typedef struct _KTIMER2_COLLECTION
{
  /* 0x0000 */ struct _RTL_RB_TREE Tree;
  /* 0x0010 */ unsigned __int64 NextDueTime;
} KTIMER2_COLLECTION, *PKTIMER2_COLLECTION; /* size: 0x0018 */

typedef struct _CM_COMPONENT_HASH
{
  /* 0x0000 */ unsigned long Hash;
} CM_COMPONENT_HASH, *PCM_COMPONENT_HASH; /* size: 0x0004 */

typedef struct _CM_NAME_HASH
{
  /* 0x0000 */ struct _CM_COMPONENT_HASH ConvKey;
  /* 0x0004 */ long Padding_47;
  /* 0x0008 */ struct _CM_NAME_HASH* NextHash;
  /* 0x0010 */ unsigned short NameLength;
  /* 0x0012 */ wchar_t Name[1];
  /* 0x0014 */ long __PADDING__[1];
} CM_NAME_HASH, *PCM_NAME_HASH; /* size: 0x0018 */

typedef struct _EXT_IOMMU_FLUSH_CONTEXT
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned int Status;
      /* 0x0004 */ long Padding_48;
      /* 0x0008 */ unsigned __int64 PhysicalAddress;
    } /* size: 0x0010 */ Intel;
    struct
    {
      /* 0x0000 */ unsigned __int64* StatusAddr;
      /* 0x0008 */ unsigned __int64 OldStatus;
    } /* size: 0x0010 */ Amd;
  }; /* size: 0x0010 */
} EXT_IOMMU_FLUSH_CONTEXT, *PEXT_IOMMU_FLUSH_CONTEXT; /* size: 0x0010 */

typedef struct _tlgProvider_t
{
  /* 0x0000 */ unsigned int LevelPlus1;
  /* 0x0004 */ long Padding_49;
  /* 0x0008 */ const unsigned short* ProviderMetadataPtr;
  /* 0x0010 */ unsigned __int64 KeywordAny;
  /* 0x0018 */ unsigned __int64 KeywordAll;
  /* 0x0020 */ unsigned __int64 RegHandle;
  /* 0x0028 */ void* EnableCallback /* function */;
  /* 0x0030 */ void* CallbackContext;
} tlgProvider_t, *PtlgProvider_t; /* size: 0x0038 */

enum POWER_POLICY_DEVICE_TYPE
{
  PolicyDeviceSystemButton = 0,
  PolicyDeviceThermalZone = 1,
  PolicyDeviceBattery = 2,
  PolicyDeviceMemory = 3,
  PolicyInitiatePowerActionAPI = 4,
  PolicySetPowerStateAPI = 5,
  PolicyImmediateDozeS4 = 6,
  PolicySystemIdle = 7,
  PolicyDeviceWakeAlarm = 8,
  PolicyDeviceFan = 9,
  PolicyCsBatterySaver = 10,
  PolicyImmediateDozeS4Predicted = 11,
  PolicyImmediateDozeS4PredictedNoWake = 12,
  PolicyImmediateDozeS4AdaptiveBudget = 13,
  PolicyImmediateDozeS4AdaptiveReserveNoWake = 14,
  PolicySystemInitiatedShutdown = 15,
  PolicyDeviceMax = 16,
};

enum SYSTEM_POWER_CONDITION
{
  PoAc = 0,
  PoDc = 1,
  PoHot = 2,
  PoConditionMaximum = 3,
};

struct BATTERY_REPORTING_SCALE
{
  /* 0x0000 */ unsigned long Granularity;
  /* 0x0004 */ unsigned long Capacity;
}; /* size: 0x0008 */

struct SYSTEM_POWER_CAPABILITIES
{
  /* 0x0000 */ unsigned char PowerButtonPresent;
  /* 0x0001 */ unsigned char SleepButtonPresent;
  /* 0x0002 */ unsigned char LidPresent;
  /* 0x0003 */ unsigned char SystemS1;
  /* 0x0004 */ unsigned char SystemS2;
  /* 0x0005 */ unsigned char SystemS3;
  /* 0x0006 */ unsigned char SystemS4;
  /* 0x0007 */ unsigned char SystemS5;
  /* 0x0008 */ unsigned char HiberFilePresent;
  /* 0x0009 */ unsigned char FullWake;
  /* 0x000a */ unsigned char VideoDimPresent;
  /* 0x000b */ unsigned char ApmPresent;
  /* 0x000c */ unsigned char UpsPresent;
  /* 0x000d */ unsigned char ThermalControl;
  /* 0x000e */ unsigned char ProcessorThrottle;
  /* 0x000f */ unsigned char ProcessorMinThrottle;
  /* 0x0010 */ unsigned char ProcessorMaxThrottle;
  /* 0x0011 */ unsigned char FastSystemS4;
  /* 0x0012 */ unsigned char Hiberboot;
  /* 0x0013 */ unsigned char WakeAlarmPresent;
  /* 0x0014 */ unsigned char AoAc;
  /* 0x0015 */ unsigned char DiskSpinDown;
  /* 0x0016 */ unsigned char HiberFileType;
  /* 0x0017 */ unsigned char AoAcConnectivitySupported;
  /* 0x0018 */ unsigned char spare3[6];
  /* 0x001e */ unsigned char SystemBatteriesPresent;
  /* 0x001f */ unsigned char BatteriesAreShortTerm;
  /* 0x0020 */ struct BATTERY_REPORTING_SCALE BatteryScale[3];
  /* 0x0038 */ enum _SYSTEM_POWER_STATE AcOnLineWake;
  /* 0x003c */ enum _SYSTEM_POWER_STATE SoftLidWake;
  /* 0x0040 */ enum _SYSTEM_POWER_STATE RtcWake;
  /* 0x0044 */ enum _SYSTEM_POWER_STATE MinDeviceWakeState;
  /* 0x0048 */ enum _SYSTEM_POWER_STATE DefaultLowLatencyWake;
}; /* size: 0x004c */

typedef enum _POP_POWER_ACTION_WATCHDOG_STATE
{
  PopPowerActionWatchdogStateDisabled = 0,
  PopPowerActionWatchdogStateTransitioning = 1,
  PopPowerActionWatchdogStateResuming = 2,
  PopPowerActionWatchdogStateMax = 3,
} POP_POWER_ACTION_WATCHDOG_STATE, *PPOP_POWER_ACTION_WATCHDOG_STATE;

typedef struct _POP_POWER_ACTION
{
  /* 0x0000 */ unsigned char Updates;
  /* 0x0001 */ unsigned char State;
  /* 0x0002 */ unsigned char Shutdown;
  /* 0x0003 */ char Padding_50;
  /* 0x0004 */ enum POWER_ACTION Action;
  /* 0x0008 */ enum _SYSTEM_POWER_STATE LightestState;
  /* 0x000c */ unsigned long Flags;
  /* 0x0010 */ long Status;
  /* 0x0014 */ enum POWER_POLICY_DEVICE_TYPE DeviceType;
  /* 0x0018 */ unsigned long DeviceTypeFlags;
  /* 0x001c */ long Padding_51;
  /* 0x0020 */ struct _DIAGNOSTIC_BUFFER* RequestorInformation;
  /* 0x0028 */ unsigned char IrpMinor;
  /* 0x0029 */ unsigned char Waking;
  /* 0x002a */ char Padding_52[2];
  /* 0x002c */ enum _SYSTEM_POWER_STATE SystemState;
  /* 0x0030 */ enum _SYSTEM_POWER_STATE NextSystemState;
  /* 0x0034 */ enum _SYSTEM_POWER_STATE EffectiveSystemState;
  /* 0x0038 */ enum _SYSTEM_POWER_STATE CurrentSystemState;
  /* 0x003c */ long Padding_53;
  /* 0x0040 */ struct _POP_SHUTDOWN_BUG_CHECK* ShutdownBugCode;
  /* 0x0048 */ struct _POP_DEVICE_SYS_STATE* DevState;
  /* 0x0050 */ struct _POP_HIBER_CONTEXT* HiberContext;
  /* 0x0058 */ unsigned __int64 WakeTime;
  /* 0x0060 */ unsigned __int64 SleepTime;
  /* 0x0068 */ unsigned __int64 WakeFirstUnattendedTime;
  /* 0x0070 */ enum SYSTEM_POWER_CONDITION WakeAlarmSignaled;
  /* 0x0074 */ long Padding_54;
  /* 0x0078 */ struct
  {
    /* 0x0078 */ unsigned __int64 RequestedTime;
    /* 0x0080 */ unsigned __int64 ProgrammedTime;
    /* 0x0088 */ struct _DIAGNOSTIC_BUFFER* TimerInfo;
  } /* size: 0x0018 */ WakeAlarm[3];
  /* 0x00c0 */ unsigned char WakeAlarmPaused;
  /* 0x00c1 */ char Padding_55[7];
  /* 0x00c8 */ unsigned __int64 WakeAlarmLastTime;
  /* 0x00d0 */ unsigned __int64 DozeDeferralStartTime;
  /* 0x00d8 */ struct SYSTEM_POWER_CAPABILITIES FilteredCapabilities;
  /* 0x0124 */ long Padding_56;
  /* 0x0128 */ unsigned __int64 WatchdogLock;
  /* 0x0130 */ struct _KDPC WatchdogDpc;
  /* 0x0170 */ struct _KTIMER WatchdogTimer;
  /* 0x01b0 */ unsigned char WatchdogInitialized;
  /* 0x01b1 */ char Padding_57[3];
  /* 0x01b4 */ enum _POP_POWER_ACTION_WATCHDOG_STATE WatchdogState;
  /* 0x01b8 */ unsigned __int64 WatchdogStartTime;
  /* 0x01c0 */ unsigned long WatchdogTimeout;
  /* 0x01c4 */ long Padding_58;
  /* 0x01c8 */ struct _KTHREAD* ActionWorkerThread;
  /* 0x01d0 */ struct _KTHREAD* PromoteActionWorkerThread;
  /* 0x01d8 */ struct _KTHREAD* UnlockAfterSleepWorkerThread;
} POP_POWER_ACTION, *PPOP_POWER_ACTION; /* size: 0x01e0 */

enum wil_FeatureChangeTime
{
  wil_FeatureChangeTime_OnRead = 0,
  wil_FeatureChangeTime_OnReload = 1,
  wil_FeatureChangeTime_OnSession = 2,
  wil_FeatureChangeTime_OnReboot = 3,
};

typedef union _IOMMU_INTERFACE_STATE_CHANGE_FIELDS
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long AvailableDomainTypes : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned long Reserved : 31; /* bit position: 1 */
    }; /* bitfield */
    /* 0x0000 */ unsigned long AsULONG;
  }; /* size: 0x0004 */
} IOMMU_INTERFACE_STATE_CHANGE_FIELDS, *PIOMMU_INTERFACE_STATE_CHANGE_FIELDS; /* size: 0x0004 */

typedef struct _IOMMU_INTERFACE_STATE_CHANGE
{
  /* 0x0000 */ union _IOMMU_INTERFACE_STATE_CHANGE_FIELDS PresentFields;
  /* 0x0004 */ unsigned long AvailableDomainTypes;
} IOMMU_INTERFACE_STATE_CHANGE, *PIOMMU_INTERFACE_STATE_CHANGE; /* size: 0x0008 */

typedef union _PPM_COORDINATED_SYNCHRONIZATION
{
  union
  {
    /* 0x0000 */ long AsLong;
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long EnterProcessor : 12; /* bit position: 0 */
      /* 0x0000 */ unsigned long ExitProcessor : 12; /* bit position: 12 */
      /* 0x0000 */ unsigned long Transition : 2; /* bit position: 24 */
      /* 0x0000 */ unsigned long Entered : 1; /* bit position: 26 */
      /* 0x0000 */ unsigned long EntryPriority : 5; /* bit position: 27 */
    }; /* bitfield */
  }; /* size: 0x0004 */
} PPM_COORDINATED_SYNCHRONIZATION, *PPPM_COORDINATED_SYNCHRONIZATION; /* size: 0x0004 */

enum wil_UsageReportingMode
{
  wil_UsageReportingMode_Default = 0,
  wil_UsageReportingMode_SuppressPotential = 1,
  wil_UsageReportingMode_SuppressImplicit = 2,
};

typedef struct _FAST_MUTEX
{
  /* 0x0000 */ long Count;
  /* 0x0004 */ long Padding_59;
  /* 0x0008 */ void* Owner;
  /* 0x0010 */ unsigned long Contention;
  /* 0x0014 */ long Padding_60;
  /* 0x0018 */ struct _KEVENT Event;
  /* 0x0030 */ unsigned long OldIrql;
  /* 0x0034 */ long __PADDING__[1];
} FAST_MUTEX, *PFAST_MUTEX; /* size: 0x0038 */

typedef enum _RTL_FEATURE_CONFIGURATION_TYPE
{
  RtlFeatureConfigurationBoot = 0,
  RtlFeatureConfigurationRuntime = 1,
  RtlFeatureConfigurationCount = 2,
} RTL_FEATURE_CONFIGURATION_TYPE, *PRTL_FEATURE_CONFIGURATION_TYPE;

typedef enum _RTL_FEATURE_USAGE_PROVIDER_FLUSH_FLAGS
{
  FlushFeatureUsageFlagDefault = 0,
  FlushFeatureUsageFlagSyncGather = 1,
  FlushFeatureUsageFlagSyncPublish = 2,
} RTL_FEATURE_USAGE_PROVIDER_FLUSH_FLAGS, *PRTL_FEATURE_USAGE_PROVIDER_FLUSH_FLAGS;

typedef struct _EXT_DELETE_PARAMETERS
{
  /* 0x0000 */ unsigned long Version;
  /* 0x0004 */ unsigned long Reserved;
  /* 0x0008 */ void* DeleteCallback /* function */;
  /* 0x0010 */ void* DeleteContext;
} EXT_DELETE_PARAMETERS, *PEXT_DELETE_PARAMETERS; /* size: 0x0018 */

enum wil_details_FeatureTestStateKind
{
  wil_details_FeatureTestStateKind_EnabledState = 0,
  wil_details_FeatureTestStateKind_Variant = 1,
};

enum EmptyCVariant_FeatureStaging_Poncherello
{
  CVariant_FeatureStaging_Poncherello_Empty = 0,
};

typedef struct _GDI_TEB_BATCH64
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned long Offset : 30; /* bit position: 0 */
    /* 0x0000 */ unsigned long InProcessing : 1; /* bit position: 30 */
    /* 0x0000 */ unsigned long HasRenderingCommand : 1; /* bit position: 31 */
  }; /* bitfield */
  /* 0x0004 */ long Padding_61;
  /* 0x0008 */ unsigned __int64 HDC;
  /* 0x0010 */ unsigned long Buffer[310];
} GDI_TEB_BATCH64, *PGDI_TEB_BATCH64; /* size: 0x04e8 */

enum FsRtlAllowReservedContext
{
  FsRtlNoReservedContext = 0,
  FsRtlYesReservedContext = 1,
};

typedef enum _EVENT_INFO_CLASS
{
  EventProviderBinaryTrackInfo = 0,
  EventProviderSetReserved1 = 1,
  EventProviderSetTraits = 2,
  EventProviderUseDescriptorType = 3,
  MaxEventInfo = 4,
} EVENT_INFO_CLASS, *PEVENT_INFO_CLASS;

enum EmptyCVariant_FeatureStaging_MemoryManager
{
  CVariant_FeatureStaging_MemoryManager_Empty = 0,
};

enum EmptyCVariant_FeatureStaging_Boot
{
  CVariant_FeatureStaging_Boot_Empty = 0,
};

typedef struct _DMA_TRANSFER_INFO_V1
{
  /* 0x0000 */ unsigned long MapRegisterCount;
  /* 0x0004 */ unsigned long ScatterGatherElementCount;
  /* 0x0008 */ unsigned long ScatterGatherListSize;
} DMA_TRANSFER_INFO_V1, *PDMA_TRANSFER_INFO_V1; /* size: 0x000c */

typedef struct _SEP_SID_VALUES_BLOCK
{
  /* 0x0000 */ unsigned long BlockLength;
  /* 0x0004 */ long Padding_62;
  /* 0x0008 */ __int64 ReferenceCount;
  /* 0x0010 */ unsigned long SidCount;
  /* 0x0014 */ long Padding_63;
  /* 0x0018 */ unsigned __int64 SidValuesStart;
} SEP_SID_VALUES_BLOCK, *PSEP_SID_VALUES_BLOCK; /* size: 0x0020 */

typedef enum _MI_SLAB_ALLOCATOR_TYPE
{
  MiSlabAllocatorTypeSlatProtectedStart = 0,
  MiSlabAllocatorTypeExecuteProtected = 0,
  MiSlabAllocatorTypeReadOnlyProtected = 1,
  MiSlabAllocatorTypeNoAccessProtected = 2,
  MiSlabAllocatorTypeKernelShadowStackProtected = 3,
  MiSlabAllocatorTypePagingProtected = 4,
  MiSlabAllocatorTypeSlatProtectedLast = 4,
  MiSlabAllocatorTypeSlatUnprotectedStart = 5,
  MiSlabAllocatorTypeImageUnprotected = 5,
  MiSlabAllocatorTypeGenericUnprotected = 6,
  MiSlabAllocatorTypeNonPagedUnprotected = 7,
  MiSlabAllocatorTypeIdentityUnprotected = 8,
  MiSlabAllocatorTypeSlatUnprotectedLast = 8,
  MiSlabAllocatorTypeMax = 9,
} MI_SLAB_ALLOCATOR_TYPE, *PMI_SLAB_ALLOCATOR_TYPE;

struct tagSWITCH_CONTEXT_ATTRIBUTE
{
  /* 0x0000 */ unsigned __int64 ulContextUpdateCounter;
  /* 0x0008 */ int fAllowContextUpdate;
  /* 0x000c */ int fEnableTrace;
  /* 0x0010 */ unsigned __int64 EtwHandle;
}; /* size: 0x0018 */

struct tagSWITCH_CONTEXT_DATA
{
  /* 0x0000 */ unsigned __int64 ullOsMaxVersionTested;
  /* 0x0008 */ unsigned long ulTargetPlatform;
  /* 0x000c */ long Padding_64;
  /* 0x0010 */ unsigned __int64 ullContextMinimum;
  /* 0x0018 */ struct _GUID guPlatform;
  /* 0x0028 */ struct _GUID guMinPlatform;
  /* 0x0038 */ unsigned long ulContextSource;
  /* 0x003c */ unsigned long ulElementCount;
  /* 0x0040 */ struct _GUID guElements[48];
}; /* size: 0x0340 */

struct tagSWITCH_CONTEXT
{
  /* 0x0000 */ struct tagSWITCH_CONTEXT_ATTRIBUTE Attribute;
  /* 0x0018 */ struct tagSWITCH_CONTEXT_DATA Data;
}; /* size: 0x0358 */

typedef enum _MI_PFN_CACHE_ATTRIBUTE
{
  MiNonCached = 0,
  MiCached = 1,
  MiWriteCombined = 2,
  MiNotMapped = 3,
} MI_PFN_CACHE_ATTRIBUTE, *PMI_PFN_CACHE_ATTRIBUTE;

typedef enum _PCW_CALLBACK_TYPE
{
  PcwCallbackAddCounter = 0,
  PcwCallbackRemoveCounter = 1,
  PcwCallbackEnumerateInstances = 2,
  PcwCallbackCollectData = 3,
} PCW_CALLBACK_TYPE, *PPCW_CALLBACK_TYPE;

typedef enum _MI_SYSTEM_VA_TYPE
{
  MiVaUnused = 0,
  MiVaProcessSpace = 1,
  MiVaBootLoaded = 2,
  MiVaPfnDatabase = 3,
  MiVaNonPagedPool = 4,
  MiVaPagedPool = 5,
  MiVaNonCachedMappings = 6,
  MiVaSystemCache = 7,
  MiVaSystemPtes = 8,
  MiVaHal = 9,
  MiVaNonCachedMappingsLarge = 10,
  MiVaDriverImages = 11,
  MiVaSystemPtesLarge = 12,
  MiVaKernelStacks = 13,
  MiVaSecureNonPagedPool = 14,
  MiVaKernelShadowStacks = 15,
  MiVaSoftWsles = 16,
  MiVaSystemDataViews = 17,
  MiVaKernelControlFlowGuard = 18,
  MiVaKasan = 19,
  MiVaMaximumType = 20,
} MI_SYSTEM_VA_TYPE, *PMI_SYSTEM_VA_TYPE;

typedef enum _CMP_COPY_TYPE
{
  Copy = 0,
  Sync = 1,
  Merge = 2,
} CMP_COPY_TYPE, *PCMP_COPY_TYPE;

typedef struct _KAB_UM_PROCESS_CONTEXT
{
  /* 0x0000 */ struct _KAB_UM_PROCESS_TREE* Trees;
  /* 0x0008 */ unsigned long TreeCount;
  /* 0x000c */ long __PADDING__[1];
} KAB_UM_PROCESS_CONTEXT, *PKAB_UM_PROCESS_CONTEXT; /* size: 0x0010 */

typedef struct _RTL_BITMAP_EX
{
  /* 0x0000 */ unsigned __int64 SizeOfBitMap;
  /* 0x0008 */ unsigned __int64* Buffer;
} RTL_BITMAP_EX, *PRTL_BITMAP_EX; /* size: 0x0010 */

typedef struct _MI_NODE_FREE_PAGE_INFORMATION
{
  /* 0x0000 */ volatile unsigned long PageColorHand;
  /* 0x0004 */ long Padding_65;
  /* 0x0008 */ unsigned __int64 FreeCount[2];
  /* 0x0018 */ unsigned __int64 FreeZeroCountByAttribute[4][2];
  /* 0x0058 */ long Padding_66[10];
  /* 0x0080 */ struct _RTL_BITMAP_EX FreePageListHeadsBitmap[2][4][2];
  /* 0x0180 */ unsigned __int64 FreePageListHeadsBitmapBuffer[64];
  /* 0x0380 */ unsigned __int64 LargePageFreeCountHiLow[2][2];
  /* 0x03a0 */ unsigned __int64 LargePageCount[2][2][2];
  /* 0x03e0 */ struct _MMPFNLIST* LargePageEntries[4][2][2][2];
  /* 0x04e0 */ long __PADDING__[8];
} MI_NODE_FREE_PAGE_INFORMATION, *PMI_NODE_FREE_PAGE_INFORMATION; /* size: 0x0500 */

enum UoWActionType
{
  UoWAddThisKey = 0,
  UoWAddChildKey = 1,
  UoWDeleteThisKey = 2,
  UoWDeleteChildKey = 3,
  UoWSetValueNew = 4,
  UoWSetValueExisting = 5,
  UoWDeleteValue = 6,
  UoWSetKeyUserFlags = 7,
  UoWSetLastWriteTime = 8,
  UoWSetSecurityDescriptor = 9,
  UoWRenameSubKeyObsolete = 10,
  UoWRenameOldSubKeyObsolete = 11,
  UoWRenameNewSubKeyObsolete = 12,
  UoWIsolation = 13,
  UoWTestFail = 14,
  UoWRecreateKey = 15,
  UoWInvalid = 16,
};

enum HSTORAGE_TYPE
{
  Stable = 0,
  Volatile = 1,
  InvalidStorage = 2,
};

typedef union _KEXECUTE_OPTIONS
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned char ExecuteDisable : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned char ExecuteEnable : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned char DisableThunkEmulation : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned char Permanent : 1; /* bit position: 3 */
      /* 0x0000 */ unsigned char ExecuteDispatchEnable : 1; /* bit position: 4 */
      /* 0x0000 */ unsigned char ImageDispatchEnable : 1; /* bit position: 5 */
      /* 0x0000 */ unsigned char DisableExceptionChainValidation : 1; /* bit position: 6 */
      /* 0x0000 */ unsigned char Spare : 1; /* bit position: 7 */
    }; /* bitfield */
    /* 0x0000 */ volatile unsigned char ExecuteOptions;
    /* 0x0000 */ unsigned char ExecuteOptionsNV;
  }; /* size: 0x0001 */
} KEXECUTE_OPTIONS, *PKEXECUTE_OPTIONS; /* size: 0x0001 */

typedef union _KSTACK_COUNT
{
  union
  {
    /* 0x0000 */ long Value;
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long State : 3; /* bit position: 0 */
      /* 0x0000 */ unsigned long StackCount : 29; /* bit position: 3 */
    }; /* bitfield */
  }; /* size: 0x0004 */
} KSTACK_COUNT, *PKSTACK_COUNT; /* size: 0x0004 */

typedef struct _KPROCESS
{
  /* 0x0000 */ struct _DISPATCHER_HEADER Header;
  /* 0x0018 */ struct _LIST_ENTRY ProfileListHead;
  /* 0x0028 */ unsigned __int64 DirectoryTableBase;
  /* 0x0030 */ struct _LIST_ENTRY ThreadListHead;
  /* 0x0040 */ unsigned long ProcessLock;
  /* 0x0044 */ unsigned long ProcessTimerDelay;
  /* 0x0048 */ unsigned __int64 DeepFreezeStartTime;
  /* 0x0050 */ struct _KAFFINITY_EX* Affinity;
  /* 0x0058 */ struct _KAB_UM_PROCESS_CONTEXT AutoBoostState;
  /* 0x0068 */ struct _LIST_ENTRY ReadyListHead;
  /* 0x0078 */ struct _SINGLE_LIST_ENTRY SwapListEntry;
  /* 0x0080 */ volatile struct _KAFFINITY_EX* ActiveProcessors;
  union
  {
    struct /* bitfield */
    {
      /* 0x0088 */ unsigned long AutoAlignment : 1; /* bit position: 0 */
      /* 0x0088 */ unsigned long DisableBoost : 1; /* bit position: 1 */
      /* 0x0088 */ unsigned long DisableQuantum : 1; /* bit position: 2 */
      /* 0x0088 */ unsigned long DeepFreeze : 1; /* bit position: 3 */
      /* 0x0088 */ unsigned long TimerVirtualization : 1; /* bit position: 4 */
      /* 0x0088 */ unsigned long CheckStackExtents : 1; /* bit position: 5 */
      /* 0x0088 */ unsigned long CacheIsolationEnabled : 1; /* bit position: 6 */
      /* 0x0088 */ unsigned long PpmPolicy : 4; /* bit position: 7 */
      /* 0x0088 */ unsigned long VaSpaceDeleted : 1; /* bit position: 11 */
      /* 0x0088 */ unsigned long MultiGroup : 1; /* bit position: 12 */
      /* 0x0088 */ unsigned long ForegroundProcess : 1; /* bit position: 13 */
      /* 0x0088 */ unsigned long ReservedFlags : 18; /* bit position: 14 */
    }; /* bitfield */
    /* 0x0088 */ volatile long ProcessFlags;
  }; /* size: 0x0004 */
  /* 0x008c */ unsigned long Spare0c;
  /* 0x0090 */ char BasePriority;
  /* 0x0091 */ char QuantumReset;
  /* 0x0092 */ char Visited;
  /* 0x0093 */ union _KEXECUTE_OPTIONS Flags;
  /* 0x0094 */ long Padding_67;
  /* 0x0098 */ struct _KGROUP_MASK ActiveGroupsMask;
  /* 0x00a8 */ unsigned __int64 ActiveGroupPadding[2];
  /* 0x00b8 */ struct _KI_IDEAL_PROCESSOR_ASSIGNMENT_BLOCK* IdealProcessorAssignmentBlock;
  /* 0x00c0 */ unsigned __int64 Padding[8];
  /* 0x0100 */ unsigned long Spare0d;
  /* 0x0104 */ unsigned short IdealGlobalNode;
  /* 0x0106 */ unsigned short Spare1;
  /* 0x0108 */ volatile union _KSTACK_COUNT StackCount;
  /* 0x010c */ long Padding_68;
  /* 0x0110 */ struct _LIST_ENTRY ProcessListEntry;
  /* 0x0120 */ unsigned __int64 CycleTime;
  /* 0x0128 */ unsigned __int64 ContextSwitches;
  /* 0x0130 */ struct _KSCHEDULING_GROUP* SchedulingGroup;
  /* 0x0138 */ unsigned __int64 KernelTime;
  /* 0x0140 */ unsigned __int64 UserTime;
  /* 0x0148 */ unsigned __int64 ReadyTime;
  /* 0x0150 */ unsigned long FreezeCount;
  /* 0x0154 */ unsigned long Spare4;
  /* 0x0158 */ unsigned __int64 UserDirectoryTableBase;
  /* 0x0160 */ unsigned char AddressPolicy;
  /* 0x0161 */ unsigned char Spare2[7];
  /* 0x0168 */ void* InstrumentationCallback;
  union
  {
    union
    {
      /* 0x0170 */ unsigned __int64 SecureHandle;
      struct
      {
        struct /* bitfield */
        {
          /* 0x0170 */ unsigned __int64 SecureProcess : 1; /* bit position: 0 */
          /* 0x0170 */ unsigned __int64 TrustedApp : 1; /* bit position: 1 */
        }; /* bitfield */
      } /* size: 0x0008 */ Flags;
    }; /* size: 0x0008 */
  } /* size: 0x0008 */ SecureState;
  /* 0x0178 */ unsigned __int64 KernelWaitTime;
  /* 0x0180 */ unsigned __int64 UserWaitTime;
  /* 0x0188 */ unsigned __int64 LastRebalanceQpc;
  /* 0x0190 */ void* PerProcessorCycleTimes;
  /* 0x0198 */ unsigned __int64 ExtendedFeatureDisableMask;
  /* 0x01a0 */ unsigned short PrimaryGroup;
  /* 0x01a2 */ unsigned short Spare3[3];
  /* 0x01a8 */ void* UserCetLogging;
  /* 0x01b0 */ struct _LIST_ENTRY CpuPartitionList;
  /* 0x01c0 */ struct _KPROCESS_AVAILABLE_CPU_STATE* AvailableCpuState;
} KPROCESS, *PKPROCESS; /* size: 0x01c8 */

typedef struct _EX_FAST_REF
{
  union
  {
    /* 0x0000 */ void* Object;
    /* 0x0000 */ unsigned __int64 RefCnt : 4; /* bit position: 0 */
    /* 0x0000 */ unsigned __int64 Value;
  }; /* size: 0x0008 */
} EX_FAST_REF, *PEX_FAST_REF; /* size: 0x0008 */

typedef struct _SE_AUDIT_PROCESS_CREATION_INFO
{
  /* 0x0000 */ struct _OBJECT_NAME_INFORMATION* ImageFileName;
} SE_AUDIT_PROCESS_CREATION_INFO, *PSE_AUDIT_PROCESS_CREATION_INFO; /* size: 0x0008 */

typedef struct _ALPC_PROCESS_CONTEXT
{
  /* 0x0000 */ struct _EX_PUSH_LOCK Lock;
  /* 0x0008 */ struct _LIST_ENTRY ViewListHead;
  /* 0x0018 */ volatile unsigned __int64 PagedPoolQuotaCache;
} ALPC_PROCESS_CONTEXT, *PALPC_PROCESS_CONTEXT; /* size: 0x0020 */

typedef struct _PS_PROTECTION
{
  union
  {
    /* 0x0000 */ unsigned char Level;
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned char Type : 3; /* bit position: 0 */
      /* 0x0000 */ unsigned char Audit : 1; /* bit position: 3 */
      /* 0x0000 */ unsigned char Signer : 4; /* bit position: 4 */
    }; /* bitfield */
  }; /* size: 0x0001 */
} PS_PROTECTION, *PPS_PROTECTION; /* size: 0x0001 */

typedef union _PS_INTERLOCKED_TIMER_DELAY_VALUES
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned __int64 DelayMs : 30; /* bit position: 0 */
      /* 0x0000 */ unsigned __int64 CoalescingWindowMs : 30; /* bit position: 30 */
      /* 0x0000 */ unsigned __int64 Reserved : 1; /* bit position: 60 */
      /* 0x0000 */ unsigned __int64 NewTimerWheel : 1; /* bit position: 61 */
      /* 0x0000 */ unsigned __int64 Retry : 1; /* bit position: 62 */
      /* 0x0000 */ unsigned __int64 Locked : 1; /* bit position: 63 */
    }; /* bitfield */
    /* 0x0000 */ unsigned __int64 All;
  }; /* size: 0x0008 */
} PS_INTERLOCKED_TIMER_DELAY_VALUES, *PPS_INTERLOCKED_TIMER_DELAY_VALUES; /* size: 0x0008 */

typedef struct _JOBOBJECT_WAKE_FILTER
{
  /* 0x0000 */ unsigned long HighEdgeFilter;
  /* 0x0004 */ unsigned long LowEdgeFilter;
} JOBOBJECT_WAKE_FILTER, *PJOBOBJECT_WAKE_FILTER; /* size: 0x0008 */

typedef struct _PS_PROCESS_WAKE_INFORMATION
{
  /* 0x0000 */ unsigned __int64 NotificationChannel;
  /* 0x0008 */ unsigned long WakeCounters[7];
  /* 0x0024 */ struct _JOBOBJECT_WAKE_FILTER WakeFilter;
  /* 0x002c */ unsigned long NoWakeCounter;
} PS_PROCESS_WAKE_INFORMATION, *PPS_PROCESS_WAKE_INFORMATION; /* size: 0x0030 */

typedef struct _PS_DYNAMIC_ENFORCED_ADDRESS_RANGES
{
  /* 0x0000 */ struct _RTL_AVL_TREE Tree;
  /* 0x0008 */ struct _EX_PUSH_LOCK Lock;
} PS_DYNAMIC_ENFORCED_ADDRESS_RANGES, *PPS_DYNAMIC_ENFORCED_ADDRESS_RANGES; /* size: 0x0010 */

typedef struct _PSP_SYSCALL_PROVIDER_DISPATCH_CONTEXT
{
  /* 0x0000 */ unsigned long Level;
  /* 0x0004 */ unsigned long Slot;
} PSP_SYSCALL_PROVIDER_DISPATCH_CONTEXT, *PPSP_SYSCALL_PROVIDER_DISPATCH_CONTEXT; /* size: 0x0008 */

typedef union _PROCESS_EXECUTION_TRANSITION
{
  union
  {
    /* 0x0000 */ volatile short TransitionState;
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned short InProgress : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned short Reserved : 7; /* bit position: 1 */
    }; /* bitfield */
  }; /* size: 0x0002 */
} PROCESS_EXECUTION_TRANSITION, *PPROCESS_EXECUTION_TRANSITION; /* size: 0x0002 */

typedef union _PROCESS_EXECUTION_STATE
{
  union
  {
    /* 0x0000 */ char State;
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned char ProcessFrozen : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned char ProcessSwapped : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned char ProcessGraphicsFreezeOptimized : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned char Reserved : 5; /* bit position: 3 */
    }; /* bitfield */
  }; /* size: 0x0001 */
} PROCESS_EXECUTION_STATE, *PPROCESS_EXECUTION_STATE; /* size: 0x0001 */

typedef union _PROCESS_EXECUTION
{
  union
  {
    /* 0x0000 */ volatile long State;
    struct
    {
      /* 0x0000 */ volatile union _PROCESS_EXECUTION_TRANSITION Transition;
      /* 0x0002 */ union _PROCESS_EXECUTION_STATE Current;
      /* 0x0003 */ union _PROCESS_EXECUTION_STATE Requested;
    }; /* size: 0x0004 */
  }; /* size: 0x0004 */
} PROCESS_EXECUTION, *PPROCESS_EXECUTION; /* size: 0x0004 */

typedef struct _EPROCESS
{
  /* 0x0000 */ struct _KPROCESS Pcb;
  /* 0x01c8 */ struct _EX_PUSH_LOCK ProcessLock;
  /* 0x01d0 */ void* UniqueProcessId;
  /* 0x01d8 */ struct _LIST_ENTRY ActiveProcessLinks;
  /* 0x01e8 */ struct _EX_RUNDOWN_REF RundownProtect;
  union
  {
    /* 0x01f0 */ unsigned long Flags2;
    struct /* bitfield */
    {
      /* 0x01f0 */ unsigned long JobNotReallyActive : 1; /* bit position: 0 */
      /* 0x01f0 */ unsigned long AccountingFolded : 1; /* bit position: 1 */
      /* 0x01f0 */ unsigned long NewProcessReported : 1; /* bit position: 2 */
      /* 0x01f0 */ unsigned long ExitProcessReported : 1; /* bit position: 3 */
      /* 0x01f0 */ unsigned long ReportCommitChanges : 1; /* bit position: 4 */
      /* 0x01f0 */ unsigned long LastReportMemory : 1; /* bit position: 5 */
      /* 0x01f0 */ unsigned long ForceWakeCharge : 1; /* bit position: 6 */
      /* 0x01f0 */ unsigned long CrossSessionCreate : 1; /* bit position: 7 */
      /* 0x01f0 */ unsigned long NeedsHandleRundown : 1; /* bit position: 8 */
      /* 0x01f0 */ unsigned long RefTraceEnabled : 1; /* bit position: 9 */
      /* 0x01f0 */ unsigned long PicoCreated : 1; /* bit position: 10 */
      /* 0x01f0 */ unsigned long EmptyJobEvaluated : 1; /* bit position: 11 */
      /* 0x01f0 */ unsigned long DefaultPagePriority : 3; /* bit position: 12 */
      /* 0x01f0 */ unsigned long PrimaryTokenFrozen : 1; /* bit position: 15 */
      /* 0x01f0 */ unsigned long ProcessVerifierTarget : 1; /* bit position: 16 */
      /* 0x01f0 */ unsigned long RestrictSetThreadContext : 1; /* bit position: 17 */
      /* 0x01f0 */ unsigned long AffinityPermanent : 1; /* bit position: 18 */
      /* 0x01f0 */ unsigned long AffinityUpdateEnable : 1; /* bit position: 19 */
      /* 0x01f0 */ unsigned long PropagateNode : 1; /* bit position: 20 */
      /* 0x01f0 */ unsigned long ExplicitAffinity : 1; /* bit position: 21 */
      /* 0x01f0 */ unsigned long Flags2Available1 : 2; /* bit position: 22 */
      /* 0x01f0 */ unsigned long EnableReadVmLogging : 1; /* bit position: 24 */
      /* 0x01f0 */ unsigned long EnableWriteVmLogging : 1; /* bit position: 25 */
      /* 0x01f0 */ unsigned long FatalAccessTerminationRequested : 1; /* bit position: 26 */
      /* 0x01f0 */ unsigned long DisableSystemAllowedCpuSet : 1; /* bit position: 27 */
      /* 0x01f0 */ unsigned long Flags2Available2 : 3; /* bit position: 28 */
      /* 0x01f0 */ unsigned long InPrivate : 1; /* bit position: 31 */
    }; /* bitfield */
  }; /* size: 0x0004 */
  union
  {
    /* 0x01f4 */ unsigned long Flags;
    struct /* bitfield */
    {
      /* 0x01f4 */ unsigned long CreateReported : 1; /* bit position: 0 */
      /* 0x01f4 */ unsigned long NoDebugInherit : 1; /* bit position: 1 */
      /* 0x01f4 */ unsigned long ProcessExiting : 1; /* bit position: 2 */
      /* 0x01f4 */ unsigned long ProcessDelete : 1; /* bit position: 3 */
      /* 0x01f4 */ unsigned long ManageExecutableMemoryWrites : 1; /* bit position: 4 */
      /* 0x01f4 */ unsigned long VmDeleted : 1; /* bit position: 5 */
      /* 0x01f4 */ unsigned long OutswapEnabled : 1; /* bit position: 6 */
      /* 0x01f4 */ unsigned long Outswapped : 1; /* bit position: 7 */
      /* 0x01f4 */ unsigned long FailFastOnCommitFail : 1; /* bit position: 8 */
      /* 0x01f4 */ unsigned long Wow64VaSpace4Gb : 1; /* bit position: 9 */
      /* 0x01f4 */ unsigned long AddressSpaceInitialized : 2; /* bit position: 10 */
      /* 0x01f4 */ unsigned long SetTimerResolution : 1; /* bit position: 12 */
      /* 0x01f4 */ unsigned long BreakOnTermination : 1; /* bit position: 13 */
      /* 0x01f4 */ unsigned long DeprioritizeViews : 1; /* bit position: 14 */
      /* 0x01f4 */ unsigned long WriteWatch : 1; /* bit position: 15 */
      /* 0x01f4 */ unsigned long ProcessInSession : 1; /* bit position: 16 */
      /* 0x01f4 */ unsigned long OverrideAddressSpace : 1; /* bit position: 17 */
      /* 0x01f4 */ unsigned long HasAddressSpace : 1; /* bit position: 18 */
      /* 0x01f4 */ unsigned long LaunchPrefetched : 1; /* bit position: 19 */
      /* 0x01f4 */ unsigned long Reserved : 1; /* bit position: 20 */
      /* 0x01f4 */ unsigned long VmTopDown : 1; /* bit position: 21 */
      /* 0x01f4 */ unsigned long ImageNotifyDone : 1; /* bit position: 22 */
      /* 0x01f4 */ unsigned long PdeUpdateNeeded : 1; /* bit position: 23 */
      /* 0x01f4 */ unsigned long VdmAllowed : 1; /* bit position: 24 */
      /* 0x01f4 */ unsigned long ProcessRundown : 1; /* bit position: 25 */
      /* 0x01f4 */ unsigned long ProcessInserted : 1; /* bit position: 26 */
      /* 0x01f4 */ unsigned long DefaultIoPriority : 3; /* bit position: 27 */
      /* 0x01f4 */ unsigned long ProcessSelfDelete : 1; /* bit position: 30 */
      /* 0x01f4 */ unsigned long SetTimerResolutionLink : 1; /* bit position: 31 */
    }; /* bitfield */
  }; /* size: 0x0004 */
  /* 0x01f8 */ union _LARGE_INTEGER CreateTime;
  /* 0x0200 */ unsigned __int64 ProcessQuotaUsage[2];
  /* 0x0210 */ unsigned __int64 ProcessQuotaPeak[2];
  /* 0x0220 */ unsigned __int64 PeakVirtualSize;
  /* 0x0228 */ unsigned __int64 VirtualSize;
  /* 0x0230 */ struct _LIST_ENTRY SessionProcessLinks;
  union
  {
    /* 0x0240 */ void* ExceptionPortData;
    /* 0x0240 */ unsigned __int64 ExceptionPortValue;
    /* 0x0240 */ unsigned __int64 ExceptionPortState : 3; /* bit position: 0 */
  }; /* size: 0x0008 */
  /* 0x0248 */ struct _EX_FAST_REF Token;
  /* 0x0250 */ unsigned __int64 MmReserved;
  /* 0x0258 */ struct _EX_PUSH_LOCK AddressCreationLock;
  /* 0x0260 */ struct _EX_PUSH_LOCK PageTableCommitmentLock;
  /* 0x0268 */ struct _ETHREAD* RotateInProgress;
  /* 0x0270 */ struct _ETHREAD* ForkInProgress;
  /* 0x0278 */ struct _EJOB* volatile CommitChargeJob;
  /* 0x0280 */ struct _RTL_AVL_TREE CloneRoot;
  /* 0x0288 */ volatile unsigned __int64 NumberOfPrivatePages;
  /* 0x0290 */ volatile unsigned __int64 NumberOfLockedPages;
  /* 0x0298 */ void* Win32Process;
  /* 0x02a0 */ struct _EJOB* volatile Job;
  /* 0x02a8 */ void* SectionObject;
  /* 0x02b0 */ void* SectionBaseAddress;
  /* 0x02b8 */ unsigned long Cookie;
  /* 0x02bc */ long Padding_69;
  /* 0x02c0 */ struct _PAGEFAULT_HISTORY* WorkingSetWatch;
  /* 0x02c8 */ void* Win32WindowStation;
  /* 0x02d0 */ void* InheritedFromUniqueProcessId;
  /* 0x02d8 */ volatile unsigned __int64 OwnerProcessId;
  /* 0x02e0 */ struct _PEB* Peb;
  /* 0x02e8 */ struct _PSP_SESSION_SPACE* Session;
  /* 0x02f0 */ void* Spare1;
  /* 0x02f8 */ struct _EPROCESS_QUOTA_BLOCK* QuotaBlock;
  /* 0x0300 */ struct _HANDLE_TABLE* ObjectTable;
  /* 0x0308 */ void* DebugPort;
  /* 0x0310 */ struct _EWOW64PROCESS* WoW64Process;
  /* 0x0318 */ struct _EX_FAST_REF DeviceMap;
  /* 0x0320 */ void* EtwDataSource;
  /* 0x0328 */ unsigned __int64 PageDirectoryPte;
  /* 0x0330 */ struct _FILE_OBJECT* ImageFilePointer;
  /* 0x0338 */ unsigned char ImageFileName[15];
  /* 0x0347 */ unsigned char PriorityClass;
  /* 0x0348 */ void* SecurityPort;
  /* 0x0350 */ struct _SE_AUDIT_PROCESS_CREATION_INFO SeAuditProcessCreationInfo;
  /* 0x0358 */ struct _LIST_ENTRY JobLinks;
  /* 0x0368 */ void* HighestUserAddress;
  /* 0x0370 */ struct _LIST_ENTRY ThreadListHead;
  /* 0x0380 */ volatile unsigned long ActiveThreads;
  /* 0x0384 */ unsigned long ImagePathHash;
  /* 0x0388 */ unsigned long DefaultHardErrorProcessing;
  /* 0x038c */ long LastThreadExitStatus;
  /* 0x0390 */ struct _EX_FAST_REF PrefetchTrace;
  /* 0x0398 */ void* LockedPagesList;
  /* 0x03a0 */ union _LARGE_INTEGER ReadOperationCount;
  /* 0x03a8 */ union _LARGE_INTEGER WriteOperationCount;
  /* 0x03b0 */ union _LARGE_INTEGER OtherOperationCount;
  /* 0x03b8 */ union _LARGE_INTEGER ReadTransferCount;
  /* 0x03c0 */ union _LARGE_INTEGER WriteTransferCount;
  /* 0x03c8 */ union _LARGE_INTEGER OtherTransferCount;
  /* 0x03d0 */ unsigned __int64 CommitChargeLimit;
  /* 0x03d8 */ volatile unsigned __int64 CommitCharge;
  /* 0x03e0 */ volatile unsigned __int64 CommitChargePeak;
  /* 0x03e8 */ long Padding_70[6];
  /* 0x0400 */ struct _MMSUPPORT_FULL Vm;
  /* 0x0540 */ struct _LIST_ENTRY MmProcessLinks;
  /* 0x0550 */ volatile unsigned long ModifiedPageCount;
  /* 0x0554 */ long ExitStatus;
  /* 0x0558 */ struct _RTL_AVL_TREE VadRoot;
  /* 0x0560 */ void* VadHint;
  /* 0x0568 */ unsigned __int64 VadCount;
  /* 0x0570 */ volatile unsigned __int64 VadPhysicalPages;
  /* 0x0578 */ unsigned __int64 VadPhysicalPagesLimit;
  /* 0x0580 */ struct _ALPC_PROCESS_CONTEXT AlpcContext;
  /* 0x05a0 */ struct _LIST_ENTRY TimerResolutionLink;
  /* 0x05b0 */ struct _PO_DIAG_STACK_RECORD* TimerResolutionStackRecord;
  /* 0x05b8 */ unsigned long RequestedTimerResolution;
  /* 0x05bc */ unsigned long SmallestTimerResolution;
  /* 0x05c0 */ union _LARGE_INTEGER ExitTime;
  /* 0x05c8 */ struct _INVERTED_FUNCTION_TABLE_KERNEL_MODE* InvertedFunctionTable;
  /* 0x05d0 */ struct _EX_PUSH_LOCK InvertedFunctionTableLock;
  /* 0x05d8 */ unsigned long ActiveThreadsHighWatermark;
  /* 0x05dc */ unsigned long LargePrivateVadCount;
  /* 0x05e0 */ struct _EX_PUSH_LOCK ThreadListLock;
  /* 0x05e8 */ void* WnfContext;
  /* 0x05f0 */ struct _EJOB* ServerSilo;
  /* 0x05f8 */ unsigned char SignatureLevel;
  /* 0x05f9 */ unsigned char SectionSignatureLevel;
  /* 0x05fa */ struct _PS_PROTECTION Protection;
  struct /* bitfield */
  {
    /* 0x05fb */ unsigned char HangCount : 3; /* bit position: 0 */
    /* 0x05fb */ unsigned char GhostCount : 3; /* bit position: 3 */
    /* 0x05fb */ unsigned char PrefilterException : 1; /* bit position: 6 */
  }; /* bitfield */
  union
  {
    /* 0x05fc */ unsigned long Flags3;
    struct /* bitfield */
    {
      /* 0x05fc */ unsigned long Minimal : 1; /* bit position: 0 */
      /* 0x05fc */ unsigned long ReplacingPageRoot : 1; /* bit position: 1 */
      /* 0x05fc */ unsigned long Crashed : 1; /* bit position: 2 */
      /* 0x05fc */ unsigned long JobVadsAreTracked : 1; /* bit position: 3 */
      /* 0x05fc */ unsigned long VadTrackingDisabled : 1; /* bit position: 4 */
      /* 0x05fc */ unsigned long AuxiliaryProcess : 1; /* bit position: 5 */
      /* 0x05fc */ unsigned long SubsystemProcess : 1; /* bit position: 6 */
      /* 0x05fc */ unsigned long IndirectCpuSets : 1; /* bit position: 7 */
      /* 0x05fc */ unsigned long RelinquishedCommit : 1; /* bit position: 8 */
      /* 0x05fc */ unsigned long HighGraphicsPriority : 1; /* bit position: 9 */
      /* 0x05fc */ unsigned long CommitFailLogged : 1; /* bit position: 10 */
      /* 0x05fc */ unsigned long ReserveFailLogged : 1; /* bit position: 11 */
      /* 0x05fc */ unsigned long SystemProcess : 1; /* bit position: 12 */
      /* 0x05fc */ unsigned long AllImagesAtBasePristineBase : 1; /* bit position: 13 */
      /* 0x05fc */ unsigned long AddressPolicyFrozen : 1; /* bit position: 14 */
      /* 0x05fc */ unsigned long ProcessFirstResume : 1; /* bit position: 15 */
      /* 0x05fc */ unsigned long ForegroundExternal : 1; /* bit position: 16 */
      /* 0x05fc */ unsigned long ForegroundSystem : 1; /* bit position: 17 */
      /* 0x05fc */ unsigned long HighMemoryPriority : 1; /* bit position: 18 */
      /* 0x05fc */ unsigned long EnableProcessSuspendResumeLogging : 1; /* bit position: 19 */
      /* 0x05fc */ unsigned long EnableThreadSuspendResumeLogging : 1; /* bit position: 20 */
      /* 0x05fc */ unsigned long SecurityDomainChanged : 1; /* bit position: 21 */
      /* 0x05fc */ unsigned long SecurityFreezeComplete : 1; /* bit position: 22 */
      /* 0x05fc */ unsigned long VmProcessorHost : 1; /* bit position: 23 */
      /* 0x05fc */ unsigned long VmProcessorHostTransition : 1; /* bit position: 24 */
      /* 0x05fc */ unsigned long AltSyscall : 1; /* bit position: 25 */
      /* 0x05fc */ unsigned long TimerResolutionIgnore : 1; /* bit position: 26 */
      /* 0x05fc */ unsigned long DisallowUserTerminate : 1; /* bit position: 27 */
      /* 0x05fc */ unsigned long EnableProcessRemoteExecProtectVmLogging : 1; /* bit position: 28 */
      /* 0x05fc */ unsigned long EnableProcessLocalExecProtectVmLogging : 1; /* bit position: 29 */
      /* 0x05fc */ unsigned long MemoryCompressionProcess : 1; /* bit position: 30 */
      /* 0x05fc */ unsigned long EnableProcessImpersonationLogging : 1; /* bit position: 31 */
    }; /* bitfield */
  }; /* size: 0x0004 */
  /* 0x0600 */ long DeviceAsid;
  /* 0x0604 */ long Padding_71;
  /* 0x0608 */ void* SvmData;
  /* 0x0610 */ struct _EX_PUSH_LOCK SvmProcessLock;
  /* 0x0618 */ unsigned __int64 SvmLock;
  /* 0x0620 */ struct _LIST_ENTRY SvmProcessDeviceListHead;
  /* 0x0630 */ unsigned __int64 LastFreezeInterruptTime;
  /* 0x0638 */ struct _PROCESS_DISK_COUNTERS* DiskCounters;
  /* 0x0640 */ void* PicoContext;
  /* 0x0648 */ void* EnclaveTable;
  /* 0x0650 */ unsigned __int64 EnclaveNumber;
  /* 0x0658 */ struct _EX_PUSH_LOCK EnclaveLock;
  /* 0x0660 */ unsigned long HighPriorityFaultsAllowed;
  /* 0x0664 */ long Padding_72;
  /* 0x0668 */ struct _PO_PROCESS_ENERGY_CONTEXT* EnergyContext;
  /* 0x0670 */ void* VmContext;
  /* 0x0678 */ unsigned __int64 SequenceNumber;
  /* 0x0680 */ unsigned __int64 CreateInterruptTime;
  /* 0x0688 */ unsigned __int64 CreateUnbiasedInterruptTime;
  /* 0x0690 */ unsigned __int64 TotalUnbiasedFrozenTime;
  /* 0x0698 */ unsigned __int64 LastAppStateUpdateTime;
  struct /* bitfield */
  {
    /* 0x06a0 */ unsigned __int64 LastAppStateUptime : 61; /* bit position: 0 */
    /* 0x06a0 */ unsigned __int64 LastAppState : 3; /* bit position: 61 */
  }; /* bitfield */
  /* 0x06a8 */ volatile unsigned __int64 SharedCommitCharge;
  /* 0x06b0 */ struct _EX_PUSH_LOCK SharedCommitLock;
  /* 0x06b8 */ struct _LIST_ENTRY SharedCommitLinks;
  union
  {
    struct
    {
      /* 0x06c8 */ unsigned __int64 AllowedCpuSets;
      /* 0x06d0 */ unsigned __int64 DefaultCpuSets;
    }; /* size: 0x0010 */
    struct
    {
      /* 0x06c8 */ unsigned __int64* AllowedCpuSetsIndirect;
      /* 0x06d0 */ unsigned __int64* DefaultCpuSetsIndirect;
    }; /* size: 0x0010 */
  }; /* size: 0x0010 */
  /* 0x06d8 */ void* DiskIoAttribution;
  /* 0x06e0 */ void* DxgProcess;
  /* 0x06e8 */ unsigned long Win32KFilterSet;
  /* 0x06ec */ unsigned short Machine;
  /* 0x06ee */ unsigned char MmSlabIdentity;
  /* 0x06ef */ unsigned char Spare0;
  /* 0x06f0 */ volatile union _PS_INTERLOCKED_TIMER_DELAY_VALUES ProcessTimerDelay;
  /* 0x06f8 */ volatile unsigned long KTimerSets;
  /* 0x06fc */ volatile unsigned long KTimer2Sets;
  /* 0x0700 */ volatile unsigned long ThreadTimerSets;
  /* 0x0704 */ long Padding_73;
  /* 0x0708 */ unsigned __int64 VirtualTimerListLock;
  /* 0x0710 */ struct _LIST_ENTRY VirtualTimerListHead;
  union
  {
    /* 0x0720 */ struct _WNF_STATE_NAME WakeChannel;
    /* 0x0720 */ struct _PS_PROCESS_WAKE_INFORMATION WakeInfo;
  }; /* size: 0x0030 */
  union
  {
    /* 0x0750 */ unsigned long MitigationFlags;
    struct
    {
      struct /* bitfield */
      {
        /* 0x0750 */ unsigned long ControlFlowGuardEnabled : 1; /* bit position: 0 */
        /* 0x0750 */ unsigned long ControlFlowGuardExportSuppressionEnabled : 1; /* bit position: 1 */
        /* 0x0750 */ unsigned long ControlFlowGuardStrict : 1; /* bit position: 2 */
        /* 0x0750 */ unsigned long DisallowStrippedImages : 1; /* bit position: 3 */
        /* 0x0750 */ unsigned long ForceRelocateImages : 1; /* bit position: 4 */
        /* 0x0750 */ unsigned long HighEntropyASLREnabled : 1; /* bit position: 5 */
        /* 0x0750 */ unsigned long StackRandomizationDisabled : 1; /* bit position: 6 */
        /* 0x0750 */ unsigned long ExtensionPointDisable : 1; /* bit position: 7 */
        /* 0x0750 */ unsigned long DisableDynamicCode : 1; /* bit position: 8 */
        /* 0x0750 */ unsigned long DisableDynamicCodeAllowOptOut : 1; /* bit position: 9 */
        /* 0x0750 */ unsigned long DisableDynamicCodeAllowRemoteDowngrade : 1; /* bit position: 10 */
        /* 0x0750 */ unsigned long AuditDisableDynamicCode : 1; /* bit position: 11 */
        /* 0x0750 */ unsigned long DisallowWin32kSystemCalls : 1; /* bit position: 12 */
        /* 0x0750 */ unsigned long AuditDisallowWin32kSystemCalls : 1; /* bit position: 13 */
        /* 0x0750 */ unsigned long EnableFilteredWin32kAPIs : 1; /* bit position: 14 */
        /* 0x0750 */ unsigned long AuditFilteredWin32kAPIs : 1; /* bit position: 15 */
        /* 0x0750 */ unsigned long DisableNonSystemFonts : 1; /* bit position: 16 */
        /* 0x0750 */ unsigned long AuditNonSystemFontLoading : 1; /* bit position: 17 */
        /* 0x0750 */ unsigned long PreferSystem32Images : 1; /* bit position: 18 */
        /* 0x0750 */ unsigned long ProhibitRemoteImageMap : 1; /* bit position: 19 */
        /* 0x0750 */ unsigned long AuditProhibitRemoteImageMap : 1; /* bit position: 20 */
        /* 0x0750 */ unsigned long ProhibitLowILImageMap : 1; /* bit position: 21 */
        /* 0x0750 */ unsigned long AuditProhibitLowILImageMap : 1; /* bit position: 22 */
        /* 0x0750 */ unsigned long SignatureMitigationOptIn : 1; /* bit position: 23 */
        /* 0x0750 */ unsigned long AuditBlockNonMicrosoftBinaries : 1; /* bit position: 24 */
        /* 0x0750 */ unsigned long AuditBlockNonMicrosoftBinariesAllowStore : 1; /* bit position: 25 */
        /* 0x0750 */ unsigned long LoaderIntegrityContinuityEnabled : 1; /* bit position: 26 */
        /* 0x0750 */ unsigned long AuditLoaderIntegrityContinuity : 1; /* bit position: 27 */
        /* 0x0750 */ unsigned long EnableModuleTamperingProtection : 1; /* bit position: 28 */
        /* 0x0750 */ unsigned long EnableModuleTamperingProtectionNoInherit : 1; /* bit position: 29 */
        /* 0x0750 */ unsigned long RestrictIndirectBranchPrediction : 1; /* bit position: 30 */
        /* 0x0750 */ unsigned long IsolateSecurityDomain : 1; /* bit position: 31 */
      }; /* bitfield */
    } /* size: 0x0004 */ MitigationFlagsValues;
  }; /* size: 0x0004 */
  union
  {
    /* 0x0754 */ unsigned long MitigationFlags2;
    struct
    {
      struct /* bitfield */
      {
        /* 0x0754 */ unsigned long EnableExportAddressFilter : 1; /* bit position: 0 */
        /* 0x0754 */ unsigned long AuditExportAddressFilter : 1; /* bit position: 1 */
        /* 0x0754 */ unsigned long EnableExportAddressFilterPlus : 1; /* bit position: 2 */
        /* 0x0754 */ unsigned long AuditExportAddressFilterPlus : 1; /* bit position: 3 */
        /* 0x0754 */ unsigned long EnableRopStackPivot : 1; /* bit position: 4 */
        /* 0x0754 */ unsigned long AuditRopStackPivot : 1; /* bit position: 5 */
        /* 0x0754 */ unsigned long EnableRopCallerCheck : 1; /* bit position: 6 */
        /* 0x0754 */ unsigned long AuditRopCallerCheck : 1; /* bit position: 7 */
        /* 0x0754 */ unsigned long EnableRopSimExec : 1; /* bit position: 8 */
        /* 0x0754 */ unsigned long AuditRopSimExec : 1; /* bit position: 9 */
        /* 0x0754 */ unsigned long EnableImportAddressFilter : 1; /* bit position: 10 */
        /* 0x0754 */ unsigned long AuditImportAddressFilter : 1; /* bit position: 11 */
        /* 0x0754 */ unsigned long DisablePageCombine : 1; /* bit position: 12 */
        /* 0x0754 */ unsigned long SpeculativeStoreBypassDisable : 1; /* bit position: 13 */
        /* 0x0754 */ unsigned long CetUserShadowStacks : 1; /* bit position: 14 */
        /* 0x0754 */ unsigned long AuditCetUserShadowStacks : 1; /* bit position: 15 */
        /* 0x0754 */ unsigned long AuditCetUserShadowStacksLogged : 1; /* bit position: 16 */
        /* 0x0754 */ unsigned long UserCetSetContextIpValidation : 1; /* bit position: 17 */
        /* 0x0754 */ unsigned long AuditUserCetSetContextIpValidation : 1; /* bit position: 18 */
        /* 0x0754 */ unsigned long AuditUserCetSetContextIpValidationLogged : 1; /* bit position: 19 */
        /* 0x0754 */ unsigned long CetUserShadowStacksStrictMode : 1; /* bit position: 20 */
        /* 0x0754 */ unsigned long BlockNonCetBinaries : 1; /* bit position: 21 */
        /* 0x0754 */ unsigned long BlockNonCetBinariesNonEhcont : 1; /* bit position: 22 */
        /* 0x0754 */ unsigned long AuditBlockNonCetBinaries : 1; /* bit position: 23 */
        /* 0x0754 */ unsigned long AuditBlockNonCetBinariesLogged : 1; /* bit position: 24 */
        /* 0x0754 */ unsigned long XtendedControlFlowGuard_Deprecated : 1; /* bit position: 25 */
        /* 0x0754 */ unsigned long AuditXtendedControlFlowGuard_Deprecated : 1; /* bit position: 26 */
        /* 0x0754 */ unsigned long PointerAuthUserIp : 1; /* bit position: 27 */
        /* 0x0754 */ unsigned long AuditPointerAuthUserIp : 1; /* bit position: 28 */
        /* 0x0754 */ unsigned long AuditPointerAuthUserIpLogged : 1; /* bit position: 29 */
        /* 0x0754 */ unsigned long CetDynamicApisOutOfProcOnly : 1; /* bit position: 30 */
        /* 0x0754 */ unsigned long UserCetSetContextIpValidationRelaxedMode : 1; /* bit position: 31 */
      }; /* bitfield */
    } /* size: 0x0004 */ MitigationFlags2Values;
  }; /* size: 0x0004 */
  /* 0x0758 */ void* PartitionObject;
  /* 0x0760 */ unsigned __int64 SecurityDomain;
  /* 0x0768 */ unsigned __int64 ParentSecurityDomain;
  /* 0x0770 */ void* CoverageSamplerContext;
  /* 0x0778 */ void* MmHotPatchContext;
  /* 0x0780 */ struct _RTL_AVL_TREE DynamicEHContinuationTargetsTree;
  /* 0x0788 */ struct _EX_PUSH_LOCK DynamicEHContinuationTargetsLock;
  /* 0x0790 */ struct _PS_DYNAMIC_ENFORCED_ADDRESS_RANGES DynamicEnforcedCetCompatibleRanges;
  /* 0x07a0 */ unsigned long DisabledComponentFlags;
  /* 0x07a4 */ volatile long PageCombineSequence;
  /* 0x07a8 */ struct _EX_PUSH_LOCK EnableOptionalXStateFeaturesLock;
  /* 0x07b0 */ unsigned long* volatile PathRedirectionHashes;
  /* 0x07b8 */ struct _PS_SYSCALL_PROVIDER* SyscallProvider;
  /* 0x07c0 */ struct _LIST_ENTRY SyscallProviderProcessLinks;
  /* 0x07d0 */ struct _PSP_SYSCALL_PROVIDER_DISPATCH_CONTEXT SyscallProviderDispatchContext;
  union
  {
    /* 0x07d8 */ unsigned long MitigationFlags3;
    struct
    {
      struct /* bitfield */
      {
        /* 0x07d8 */ unsigned long RestrictCoreSharing : 1; /* bit position: 0 */
        /* 0x07d8 */ unsigned long DisallowFsctlSystemCalls : 1; /* bit position: 1 */
        /* 0x07d8 */ unsigned long AuditDisallowFsctlSystemCalls : 1; /* bit position: 2 */
        /* 0x07d8 */ unsigned long MitigationFlags3Spare : 29; /* bit position: 3 */
      }; /* bitfield */
    } /* size: 0x0004 */ MitigationFlags3Values;
  }; /* size: 0x0004 */
  union
  {
    /* 0x07dc */ unsigned long Flags4;
    struct /* bitfield */
    {
      /* 0x07dc */ unsigned long ThreadWasActive : 1; /* bit position: 0 */
      /* 0x07dc */ unsigned long MinimalTerminate : 1; /* bit position: 1 */
      /* 0x07dc */ unsigned long ImageExpansionDisable : 1; /* bit position: 2 */
      /* 0x07dc */ unsigned long SessionFirstProcess : 1; /* bit position: 3 */
    }; /* bitfield */
  }; /* size: 0x0004 */
  union
  {
    /* 0x07e0 */ unsigned long SyscallUsage;
    struct
    {
      struct /* bitfield */
      {
        /* 0x07e0 */ unsigned long SystemModuleInformation : 1; /* bit position: 0 */
        /* 0x07e0 */ unsigned long SystemModuleInformationEx : 1; /* bit position: 1 */
        /* 0x07e0 */ unsigned long SystemLocksInformation : 1; /* bit position: 2 */
        /* 0x07e0 */ unsigned long SystemStackTraceInformation : 1; /* bit position: 3 */
        /* 0x07e0 */ unsigned long SystemHandleInformation : 1; /* bit position: 4 */
        /* 0x07e0 */ unsigned long SystemExtendedHandleInformation : 1; /* bit position: 5 */
        /* 0x07e0 */ unsigned long SystemObjectInformation : 1; /* bit position: 6 */
        /* 0x07e0 */ unsigned long SystemBigPoolInformation : 1; /* bit position: 7 */
        /* 0x07e0 */ unsigned long SystemExtendedProcessInformation : 1; /* bit position: 8 */
        /* 0x07e0 */ unsigned long SystemSessionProcessInformation : 1; /* bit position: 9 */
        /* 0x07e0 */ unsigned long SystemMemoryTopologyInformation : 1; /* bit position: 10 */
        /* 0x07e0 */ unsigned long SystemMemoryChannelInformation : 1; /* bit position: 11 */
        /* 0x07e0 */ unsigned long SystemUnused : 1; /* bit position: 12 */
        /* 0x07e0 */ unsigned long SystemPlatformBinaryInformation : 1; /* bit position: 13 */
        /* 0x07e0 */ unsigned long SystemFirmwareTableInformation : 1; /* bit position: 14 */
        /* 0x07e0 */ unsigned long SystemBootMetadataInformation : 1; /* bit position: 15 */
        /* 0x07e0 */ unsigned long SystemWheaIpmiHardwareInformation : 1; /* bit position: 16 */
        /* 0x07e0 */ unsigned long SystemSuperfetchPrefetch : 1; /* bit position: 17 */
        /* 0x07e0 */ unsigned long SystemSuperfetchPfnQuery : 1; /* bit position: 18 */
        /* 0x07e0 */ unsigned long SystemSuperfetchPrivSourceQuery : 1; /* bit position: 19 */
        /* 0x07e0 */ unsigned long SystemSuperfetchMemoryListQuery : 1; /* bit position: 20 */
        /* 0x07e0 */ unsigned long SystemSuperfetchMemoryRangesQuery : 1; /* bit position: 21 */
        /* 0x07e0 */ unsigned long SystemSuperfetchPfnSetPriority : 1; /* bit position: 22 */
        /* 0x07e0 */ unsigned long SystemSuperfetchMovePages : 1; /* bit position: 23 */
        /* 0x07e0 */ unsigned long SystemSuperfetchPfnSetPageHeat : 1; /* bit position: 24 */
        /* 0x07e0 */ unsigned long SysDbgGetTriageDump : 1; /* bit position: 25 */
        /* 0x07e0 */ unsigned long SysDbgGetLiveKernelDump : 1; /* bit position: 26 */
        /* 0x07e0 */ unsigned long SyscallUsageValuesSpare : 5; /* bit position: 27 */
      }; /* bitfield */
    } /* size: 0x0004 */ SyscallUsageValues;
  }; /* size: 0x0004 */
  /* 0x07e4 */ long SupervisorDeviceAsid;
  /* 0x07e8 */ void* SupervisorSvmData;
  /* 0x07f0 */ struct _PROCESS_NETWORK_COUNTERS* NetworkCounters;
  /* 0x07f8 */ union _PROCESS_EXECUTION Execution;
  /* 0x07fc */ long Padding_74;
  /* 0x0800 */ void* ThreadIndexTable;
  /* 0x0808 */ long __PADDING__[14];
} EPROCESS, *PEPROCESS; /* size: 0x0840 */

struct _PSP_STORAGE;

typedef enum _CMP_FAILURE_INJECTION_POINT
{
  CmpFailurePointPoolAllocation = 0,
  CmpFailurePointFileWrite = 1,
  CmpFailurePointFileRead = 2,
  CmpFailurePointFlush = 3,
  CmpFailurePointFlushAndPurge = 4,
  CmpFailurePointForceLargeBin = 5,
  CmpFailurePointDontFixAlignment = 6,
  CmpFailurePointAllocateCell = 7,
  CmpFailurePointMarkDirty = 8,
  CmpFailurePointForceMultiLevelMap = 9,
  CmpFailurePointAllocateContiguousLogEntry = 10,
  CmpFailurePointAllocateKcb = 11,
  CmpFailurePointCreateKeyBody = 12,
  CmpFailurePointForceFreeKcb = 13,
  CmpFailurePointKcbLockUpgrade = 14,
  CmpFailurePointKcbLockUpgradeDelay = 15,
  CmpFailurePointKeyEnumResumeContextVerification = 16,
  CmpFailurePointKeyEnumForceRetry = 17,
  CmpFailurePointForceReorganization = 18,
  CmpFailurePointForceLazyCOWByPolicy = 19,
  CmpFailurePointForceBugcheckRecoveryEnabled = 20,
  CmpFailurePointCreateHiveCacheEntry = 21,
  CmpFailurePointClaimHiveCacheEntry = 22,
  CmpFailurePointSubscribePnpNotifications = 23,
  CmpFailurePointCreateOplockMonitoringThread = 24,
  CmpFailurePointOpenHiveFile = 25,
  CmpFailurePointRequestOplockOnPrimary = 26,
  CmpFailurePointRequestOplockOnLog1 = 27,
  CmpFailurePointRequestOplockOnLog2 = 28,
  CmpFailurePointCreateHive = 29,
  CmpFailurePointOpenHiveFilesToBreakOplocks = 30,
  CmpFailureInjectionPointCount = 31,
} CMP_FAILURE_INJECTION_POINT, *PCMP_FAILURE_INJECTION_POINT;

typedef union _WHEA_IN_USE_PAGE_NOTIFY_FLAGS
{
  union
  {
    struct
    {
      struct /* bitfield */
      {
        /* 0x0000 */ unsigned char PlatformDirected : 1; /* bit position: 0 */
        /* 0x0000 */ unsigned char PageSwapped : 1; /* bit position: 1 */
        /* 0x0000 */ unsigned char PageDemoted : 1; /* bit position: 2 */
        /* 0x0000 */ unsigned char Reserved : 3; /* bit position: 3 */
        /* 0x0000 */ unsigned char NotifyAllOfflines : 1; /* bit position: 6 */
        /* 0x0000 */ unsigned char PageOfflined : 1; /* bit position: 7 */
      }; /* bitfield */
    } /* size: 0x0001 */ Bits;
    /* 0x0000 */ unsigned char AsUCHAR;
  }; /* size: 0x0001 */
} WHEA_IN_USE_PAGE_NOTIFY_FLAGS, *PWHEA_IN_USE_PAGE_NOTIFY_FLAGS; /* size: 0x0001 */

typedef union _WHEA_RECOVERY_CONTEXT_ACTION_TAKEN_ADDITIONAL_INFO
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned __int64 Reserved : 64; /* bit position: 0 */
    } /* size: 0x0008 */ Bits;
    /* 0x0000 */ unsigned __int64 AsULONG64;
  }; /* size: 0x0008 */
} WHEA_RECOVERY_CONTEXT_ACTION_TAKEN_ADDITIONAL_INFO, *PWHEA_RECOVERY_CONTEXT_ACTION_TAKEN_ADDITIONAL_INFO; /* size: 0x0008 */

typedef struct _WHEA_RECOVERY_CONTEXT_PAGE_INFO
{
  /* 0x0000 */ unsigned long ComponentTag;
  /* 0x0004 */ long PageStatus;
  /* 0x0008 */ enum _WHEA_RECOVERY_CONTEXT_ACTION_TAKEN ActionTaken;
  /* 0x000c */ union _WHEA_IN_USE_PAGE_NOTIFY_FLAGS NotifyFlags;
  /* 0x000d */ unsigned char ImmediateSuccess;
  /* 0x000e */ unsigned short Reserved;
  /* 0x0010 */ union _WHEA_RECOVERY_CONTEXT_ACTION_TAKEN_ADDITIONAL_INFO ActionTakenAdditionalInfo;
} WHEA_RECOVERY_CONTEXT_PAGE_INFO, *PWHEA_RECOVERY_CONTEXT_PAGE_INFO; /* size: 0x0018 */

typedef struct _ETW_LAST_ENABLE_INFO
{
  /* 0x0000 */ union _LARGE_INTEGER EnableFlags;
  /* 0x0008 */ unsigned short LoggerId;
  /* 0x000a */ unsigned char Level;
  struct /* bitfield */
  {
    /* 0x000b */ unsigned char Enabled : 1; /* bit position: 0 */
    /* 0x000b */ unsigned char InternalFlag : 7; /* bit position: 1 */
  }; /* bitfield */
  /* 0x000c */ long __PADDING__[1];
} ETW_LAST_ENABLE_INFO, *PETW_LAST_ENABLE_INFO; /* size: 0x0010 */

enum PCW_REGISTRATION_FLAGS
{
  PcwRegistrationNone = 0,
  PcwRegistrationSiloNeutral = 1,
};

typedef union _IOMMU_SVM_CAPABILITIES
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long AtsCapability : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned long PriCapability : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned long PasidCapability : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned long Rsvd0 : 29; /* bit position: 3 */
    }; /* bitfield */
    struct
    {
      struct /* bitfield */
      {
        /* 0x0000 */ unsigned long Padding : 3; /* bit position: 0 */
        /* 0x0000 */ unsigned long PasidMaxWidth : 5; /* bit position: 3 */
        /* 0x0000 */ unsigned long PasidExePerm : 1; /* bit position: 8 */
        /* 0x0000 */ unsigned long PasidPrivMode : 1; /* bit position: 9 */
        /* 0x0000 */ unsigned long AtsPageAlignedRequest : 1; /* bit position: 10 */
        /* 0x0000 */ unsigned long AtsGlobalInvalidate : 1; /* bit position: 11 */
        /* 0x0000 */ unsigned long AtsInvalidateQueueDepth : 5; /* bit position: 12 */
        /* 0x0000 */ unsigned long PriPrgResponsePasidRequired : 1; /* bit position: 17 */
        /* 0x0000 */ unsigned long Rsvd : 14; /* bit position: 18 */
      }; /* bitfield */
    } /* size: 0x0004 */ CapReg;
    struct
    {
      struct /* bitfield */
      {
        /* 0x0000 */ unsigned long Padding : 18; /* bit position: 0 */
        /* 0x0000 */ unsigned long AtsEnable : 1; /* bit position: 18 */
        /* 0x0000 */ unsigned long PriEnable : 1; /* bit position: 19 */
        /* 0x0000 */ unsigned long PasidEnable : 1; /* bit position: 20 */
        /* 0x0000 */ unsigned long ExecutePermissionEnable : 1; /* bit position: 21 */
        /* 0x0000 */ unsigned long PrivilegedModeEnable : 1; /* bit position: 22 */
        /* 0x0000 */ unsigned long Rsvd : 9; /* bit position: 23 */
      }; /* bitfield */
    } /* size: 0x0004 */ EnabledCaps;
    struct
    {
      struct /* bitfield */
      {
        /* 0x0000 */ unsigned long Padding : 23; /* bit position: 0 */
        /* 0x0000 */ unsigned long IsSecureDevice : 1; /* bit position: 23 */
        /* 0x0000 */ unsigned long Rsvd : 8; /* bit position: 24 */
      }; /* bitfield */
    } /* size: 0x0004 */ DeviceInformation;
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long AtsPriPasidBits : 3; /* bit position: 0 */
      /* 0x0000 */ unsigned long CapRegBits : 15; /* bit position: 3 */
      /* 0x0000 */ unsigned long EnabledCapsBits : 5; /* bit position: 18 */
      /* 0x0000 */ unsigned long DeviceInformationBits : 1; /* bit position: 23 */
      /* 0x0000 */ unsigned long Rsvd1 : 8; /* bit position: 24 */
    }; /* bitfield */
    /* 0x0000 */ unsigned long AsULONG;
  }; /* size: 0x0004 */
} IOMMU_SVM_CAPABILITIES, *PIOMMU_SVM_CAPABILITIES; /* size: 0x0004 */

typedef struct _GROUP_FAULT_REFERENCE
{
  union
  {
    union
    {
      struct
      {
        /* 0x0000 */ unsigned long Count;
        struct /* bitfield */
        {
          /* 0x0004 */ unsigned long Pending : 1; /* bit position: 0 */
          /* 0x0004 */ unsigned long Asid : 20; /* bit position: 1 */
          /* 0x0004 */ unsigned long LastInGroupSeen : 1; /* bit position: 21 */
          /* 0x0004 */ unsigned long Error : 1; /* bit position: 22 */
          /* 0x0004 */ unsigned long Unused : 9; /* bit position: 23 */
        }; /* bitfield */
      }; /* size: 0x0008 */
      /* 0x0000 */ unsigned __int64 Long;
    }; /* size: 0x0008 */
  } /* size: 0x0008 */ u1;
} GROUP_FAULT_REFERENCE, *PGROUP_FAULT_REFERENCE; /* size: 0x0008 */

typedef struct _IOMMU_TRACKED_DEVICE
{
  /* 0x0000 */ struct _LIST_ENTRY ListEntry;
  /* 0x0010 */ unsigned __int64 Lock;
  /* 0x0018 */ void* Iommu;
  /* 0x0020 */ unsigned long IommuCapabilities;
  /* 0x0024 */ unsigned long ReferenceCount;
  /* 0x0028 */ unsigned __int64 SourceId;
  /* 0x0030 */ union _IOMMU_SVM_CAPABILITIES Capabilities;
  /* 0x0034 */ unsigned long Flags;
  /* 0x0038 */ struct _LIST_ENTRY ActiveDeviceListHead;
  /* 0x0048 */ struct _IOMMU_DMA_DEVICE* DmaDevice;
  /* 0x0050 */ unsigned long LastGroupFaultSequenceNumber;
  /* 0x0054 */ long Padding_75;
  /* 0x0058 */ struct _GROUP_FAULT_REFERENCE GroupFaultReferences[512];
} IOMMU_TRACKED_DEVICE, *PIOMMU_TRACKED_DEVICE; /* size: 0x1058 */

typedef struct _CURDIR
{
  /* 0x0000 */ struct _UNICODE_STRING DosPath;
  /* 0x0010 */ void* Handle;
} CURDIR, *PCURDIR; /* size: 0x0018 */

typedef struct _STRING
{
  /* 0x0000 */ unsigned short Length;
  /* 0x0002 */ unsigned short MaximumLength;
  /* 0x0004 */ long Padding_76;
  /* 0x0008 */ char* Buffer;
} STRING, *PSTRING; /* size: 0x0010 */

typedef struct _RTL_DRIVE_LETTER_CURDIR
{
  /* 0x0000 */ unsigned short Flags;
  /* 0x0002 */ unsigned short Length;
  /* 0x0004 */ unsigned long TimeStamp;
  /* 0x0008 */ struct _STRING DosPath;
} RTL_DRIVE_LETTER_CURDIR, *PRTL_DRIVE_LETTER_CURDIR; /* size: 0x0018 */

typedef struct _RTL_USER_PROCESS_PARAMETERS
{
  /* 0x0000 */ unsigned long MaximumLength;
  /* 0x0004 */ unsigned long Length;
  /* 0x0008 */ unsigned long Flags;
  /* 0x000c */ unsigned long DebugFlags;
  /* 0x0010 */ void* ConsoleHandle;
  /* 0x0018 */ unsigned long ConsoleFlags;
  /* 0x001c */ long Padding_77;
  /* 0x0020 */ void* StandardInput;
  /* 0x0028 */ void* StandardOutput;
  /* 0x0030 */ void* StandardError;
  /* 0x0038 */ struct _CURDIR CurrentDirectory;
  /* 0x0050 */ struct _UNICODE_STRING DllPath;
  /* 0x0060 */ struct _UNICODE_STRING ImagePathName;
  /* 0x0070 */ struct _UNICODE_STRING CommandLine;
  /* 0x0080 */ void* Environment;
  /* 0x0088 */ unsigned long StartingX;
  /* 0x008c */ unsigned long StartingY;
  /* 0x0090 */ unsigned long CountX;
  /* 0x0094 */ unsigned long CountY;
  /* 0x0098 */ unsigned long CountCharsX;
  /* 0x009c */ unsigned long CountCharsY;
  /* 0x00a0 */ unsigned long FillAttribute;
  /* 0x00a4 */ unsigned long WindowFlags;
  /* 0x00a8 */ unsigned long ShowWindowFlags;
  /* 0x00ac */ long Padding_78;
  /* 0x00b0 */ struct _UNICODE_STRING WindowTitle;
  /* 0x00c0 */ struct _UNICODE_STRING DesktopInfo;
  /* 0x00d0 */ struct _UNICODE_STRING ShellInfo;
  /* 0x00e0 */ struct _UNICODE_STRING RuntimeData;
  /* 0x00f0 */ struct _RTL_DRIVE_LETTER_CURDIR CurrentDirectores[32];
  /* 0x03f0 */ unsigned __int64 EnvironmentSize;
  /* 0x03f8 */ unsigned __int64 EnvironmentVersion;
  /* 0x0400 */ void* PackageDependencyData;
  /* 0x0408 */ unsigned long ProcessGroupId;
  /* 0x040c */ unsigned long LoaderThreads;
  /* 0x0410 */ struct _UNICODE_STRING RedirectionDllName;
  /* 0x0420 */ struct _UNICODE_STRING HeapPartitionName;
  /* 0x0430 */ unsigned __int64* DefaultThreadpoolCpuSetMasks;
  /* 0x0438 */ unsigned long DefaultThreadpoolCpuSetMaskCount;
  /* 0x043c */ unsigned long DefaultThreadpoolThreadMaximum;
  /* 0x0440 */ unsigned long HeapMemoryTypeMask;
  /* 0x0444 */ long __PADDING__[1];
} RTL_USER_PROCESS_PARAMETERS, *PRTL_USER_PROCESS_PARAMETERS; /* size: 0x0448 */

typedef enum _KHETERO_CPU_POLICY
{
  KHeteroCpuPolicyAll = 0,
  KHeteroCpuPolicyLarge = 1,
  KHeteroCpuPolicyLargeOrIdle = 2,
  KHeteroCpuPolicySmall = 3,
  KHeteroCpuPolicySmallOrIdle = 4,
  KHeteroCpuPolicyDynamic = 5,
  KHeteroCpuPolicyStaticMax = 5,
  KHeteroCpuPolicyBiasedSmall = 6,
  KHeteroCpuPolicyBiasedLarge = 7,
  KHeteroCpuPolicyDefault = 8,
  KHeteroCpuPolicyMax = 9,
} KHETERO_CPU_POLICY, *PKHETERO_CPU_POLICY;

typedef union _KI_PROCESS_CONCURRENCY_COUNT
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long Fraction : 18; /* bit position: 0 */
      /* 0x0000 */ unsigned long Count : 14; /* bit position: 18 */
    }; /* bitfield */
    /* 0x0000 */ unsigned long AllFields;
  }; /* size: 0x0004 */
} KI_PROCESS_CONCURRENCY_COUNT, *PKI_PROCESS_CONCURRENCY_COUNT; /* size: 0x0004 */

enum PROFILE_STATUS
{
  DOCK_NOTDOCKDEVICE = 0,
  DOCK_QUIESCENT = 1,
  DOCK_ARRIVING = 2,
  DOCK_DEPARTING = 3,
  DOCK_EJECTIRP_COMPLETED = 4,
};

typedef struct _NB10
{
  /* 0x0000 */ unsigned long Signature;
  /* 0x0004 */ unsigned long Offset;
  /* 0x0008 */ unsigned long TimeStamp;
  /* 0x000c */ unsigned long Age;
  /* 0x0010 */ char PdbName[1];
  /* 0x0011 */ char __PADDING__[3];
} NB10, *PNB10; /* size: 0x0014 */

typedef struct _RSDS
{
  /* 0x0000 */ unsigned long Signature;
  /* 0x0004 */ struct _GUID Guid;
  /* 0x0014 */ unsigned long Age;
  /* 0x0018 */ char PdbName[1];
  /* 0x0019 */ char __PADDING__[3];
} RSDS, *PRSDS; /* size: 0x001c */

typedef union _CVDD
{
  union
  {
    /* 0x0000 */ unsigned long Signature;
    /* 0x0000 */ struct _NB10 NB10;
    /* 0x0000 */ struct _RSDS RsDs;
  }; /* size: 0x001c */
} CVDD, *PCVDD; /* size: 0x001c */

typedef struct _KAFFINITY_EX
{
  /* 0x0000 */ unsigned short Count;
  /* 0x0002 */ unsigned short Size;
  /* 0x0004 */ unsigned long Reserved;
  union
  {
    /* 0x0008 */ unsigned __int64 Bitmap[1];
    /* 0x0008 */ unsigned __int64 StaticBitmap[32];
  }; /* size: 0x0100 */
} KAFFINITY_EX, *PKAFFINITY_EX; /* size: 0x0108 */

enum EmptyCVariant_featurestaging_moments
{
  CVariant_featurestaging_moments_Empty = 0,
};

enum EmptyCVariant_FeatureStaging_servicing_releases
{
  CVariant_FeatureStaging_servicing_releases_Empty = 0,
};

typedef struct _PPM_VETO_ACCOUNTING
{
  /* 0x0000 */ volatile long VetoPresent;
  /* 0x0004 */ long Padding_79;
  /* 0x0008 */ struct _LIST_ENTRY VetoListHead;
  /* 0x0018 */ unsigned char CsAccountingBlocks;
  /* 0x0019 */ unsigned char BlocksDrips;
  /* 0x001a */ char Padding_80[2];
  /* 0x001c */ unsigned long PreallocatedVetoCount;
  /* 0x0020 */ struct _PPM_VETO_ENTRY* PreallocatedVetoList;
} PPM_VETO_ACCOUNTING, *PPPM_VETO_ACCOUNTING; /* size: 0x0028 */

typedef struct _PPM_PLATFORM_STATE
{
  /* 0x0000 */ unsigned __int64 LevelId;
  /* 0x0008 */ unsigned long Latency;
  /* 0x000c */ unsigned long BreakEvenDuration;
  /* 0x0010 */ struct _PPM_VETO_ACCOUNTING VetoAccounting;
  /* 0x0038 */ unsigned char TransitionDebugger;
  /* 0x0039 */ unsigned char Platform;
  /* 0x003a */ unsigned char Enabled;
  /* 0x003b */ unsigned char CoordinatedDependencies;
  /* 0x003c */ unsigned long DependencyListCount;
  /* 0x0040 */ struct _KAFFINITY_EX Processors;
  /* 0x0148 */ struct _UNICODE_STRING Name;
  /* 0x0158 */ struct _PPM_SELECTION_DEPENDENCY* DependencyLists;
  /* 0x0160 */ volatile union _PPM_COORDINATED_SYNCHRONIZATION Synchronization;
  /* 0x0164 */ long Padding_81;
  /* 0x0168 */ volatile unsigned __int64 EnterTime;
  /* 0x0170 */ long Padding_82[4];
  union
  {
    /* 0x0180 */ volatile long RefCount;
    /* 0x0180 */ unsigned char CacheAlign0[64];
  }; /* size: 0x0040 */
} PPM_PLATFORM_STATE, *PPPM_PLATFORM_STATE; /* size: 0x01c0 */

typedef struct _KAB_UM_PROCESS_TREE
{
  /* 0x0000 */ struct _RTL_RB_TREE Tree;
  /* 0x0010 */ unsigned __int64 TreeLock;
} KAB_UM_PROCESS_TREE, *PKAB_UM_PROCESS_TREE; /* size: 0x0018 */

enum EmptyCVariant_FeatureStaging_ContinuousDelivery
{
  CVariant_FeatureStaging_ContinuousDelivery_Empty = 0,
};

enum EmptyCVariant_FeatureStaging_KernelPnP
{
  CVariant_FeatureStaging_KernelPnP_Empty = 0,
};

typedef struct _ETW_FILTER_STRING_TOKEN_ELEMENT
{
  /* 0x0000 */ unsigned short Length;
  /* 0x0002 */ char Padding_83[6];
  /* 0x0008 */ wchar_t* String;
} ETW_FILTER_STRING_TOKEN_ELEMENT, *PETW_FILTER_STRING_TOKEN_ELEMENT; /* size: 0x0010 */

typedef struct _ETW_FILTER_STRING_TOKEN
{
  /* 0x0000 */ unsigned short Count;
  /* 0x0002 */ char Padding_84[6];
  /* 0x0008 */ struct _ETW_FILTER_STRING_TOKEN_ELEMENT Tokens[1];
} ETW_FILTER_STRING_TOKEN, *PETW_FILTER_STRING_TOKEN; /* size: 0x0018 */

typedef struct _KGATE
{
  /* 0x0000 */ struct _DISPATCHER_HEADER Header;
} KGATE, *PKGATE; /* size: 0x0018 */

typedef struct _MI_EXTENT_DELETION_WAIT_BLOCK
{
  /* 0x0000 */ struct _MI_EXTENT_DELETION_WAIT_BLOCK* Next;
  /* 0x0008 */ struct _KGATE Gate;
} MI_EXTENT_DELETION_WAIT_BLOCK, *PMI_EXTENT_DELETION_WAIT_BLOCK; /* size: 0x0020 */

struct _DRIVER_PROXY_EXTENSION;

typedef enum _ARBITER_REQUEST_SOURCE
{
  ArbiterRequestUndefined = -1,
  ArbiterRequestLegacyReported = 0,
  ArbiterRequestHalReported = 1,
  ArbiterRequestLegacyAssigned = 2,
  ArbiterRequestPnpDetected = 3,
  ArbiterRequestPnpEnumerated = 4,
} ARBITER_REQUEST_SOURCE, *PARBITER_REQUEST_SOURCE;

typedef struct _CM_PATH_HASH
{
  /* 0x0000 */ unsigned long Hash;
} CM_PATH_HASH, *PCM_PATH_HASH; /* size: 0x0004 */

typedef struct _CM_KEY_HASH
{
  /* 0x0000 */ struct _CM_PATH_HASH ConvKey;
  /* 0x0004 */ long Padding_85;
  /* 0x0008 */ struct _CM_KEY_HASH* NextHash;
  /* 0x0010 */ struct _HHIVE* KeyHive;
  /* 0x0018 */ unsigned long KeyCell;
  /* 0x001c */ long __PADDING__[1];
} CM_KEY_HASH, *PCM_KEY_HASH; /* size: 0x0020 */

typedef struct _CHILD_LIST
{
  /* 0x0000 */ unsigned long Count;
  /* 0x0004 */ unsigned long List;
} CHILD_LIST, *PCHILD_LIST; /* size: 0x0008 */

typedef struct _CM_INTENT_LOCK
{
  /* 0x0000 */ unsigned long OwnerCount;
  /* 0x0004 */ long Padding_86;
  /* 0x0008 */ struct _CM_KCB_UOW** OwnerTable;
} CM_INTENT_LOCK, *PCM_INTENT_LOCK; /* size: 0x0010 */

typedef struct _CM_KEY_CONTROL_BLOCK
{
  /* 0x0000 */ unsigned __int64 RefCount;
  struct /* bitfield */
  {
    /* 0x0008 */ unsigned long ExtFlags : 16; /* bit position: 0 */
    /* 0x0008 */ unsigned long Freed : 1; /* bit position: 16 */
    /* 0x0008 */ unsigned long Discarded : 1; /* bit position: 17 */
    /* 0x0008 */ unsigned long HiveUnloaded : 1; /* bit position: 18 */
    /* 0x0008 */ unsigned long Decommissioned : 1; /* bit position: 19 */
    /* 0x0008 */ unsigned long SpareExtFlag : 1; /* bit position: 20 */
    /* 0x0008 */ unsigned long TotalLevels : 10; /* bit position: 21 */
  }; /* bitfield */
  /* 0x000c */ long Padding_87;
  union
  {
    /* 0x0010 */ struct _CM_KEY_HASH KeyHash;
    struct
    {
      /* 0x0010 */ struct _CM_PATH_HASH ConvKey;
      /* 0x0014 */ long Padding_88;
      /* 0x0018 */ struct _CM_KEY_HASH* NextHash;
      /* 0x0020 */ struct _HHIVE* KeyHive;
      /* 0x0028 */ unsigned long KeyCell;
    }; /* size: 0x0018 */
  }; /* size: 0x0020 */
  /* 0x0030 */ struct _EX_PUSH_LOCK KcbPushlock;
  union
  {
    /* 0x0038 */ struct _KTHREAD* Owner;
    /* 0x0038 */ long SharedCount;
  }; /* size: 0x0008 */
  struct /* bitfield */
  {
    /* 0x0040 */ unsigned char DelayedDeref : 1; /* bit position: 0 */
    /* 0x0040 */ unsigned char DelayedClose : 1; /* bit position: 1 */
    /* 0x0040 */ unsigned char Parking : 1; /* bit position: 2 */
  }; /* bitfield */
  /* 0x0041 */ unsigned char LayerSemantics;
  /* 0x0042 */ short LayerHeight;
  /* 0x0044 */ unsigned long Spare1;
  /* 0x0048 */ struct _CM_KEY_CONTROL_BLOCK* ParentKcb;
  /* 0x0050 */ struct _CM_NAME_CONTROL_BLOCK* NameBlock;
  /* 0x0058 */ struct _CM_KEY_SECURITY_CACHE* CachedSecurity;
  /* 0x0060 */ struct _CHILD_LIST ValueList;
  /* 0x0068 */ struct _CM_KEY_CONTROL_BLOCK* LinkTarget;
  union
  {
    /* 0x0070 */ struct _CM_INDEX_HINT_BLOCK* IndexHint;
    /* 0x0070 */ unsigned long HashKey;
    /* 0x0070 */ unsigned long SubKeyCount;
  }; /* size: 0x0008 */
  union
  {
    /* 0x0078 */ struct _LIST_ENTRY KeyBodyListHead;
    /* 0x0078 */ struct _LIST_ENTRY ClonedListEntry;
  }; /* size: 0x0010 */
  /* 0x0088 */ struct _CM_KEY_BODY* KeyBodyArray[4];
  /* 0x00a8 */ union _LARGE_INTEGER KcbLastWriteTime;
  /* 0x00b0 */ unsigned short KcbMaxNameLen;
  /* 0x00b2 */ unsigned short KcbMaxValueNameLen;
  /* 0x00b4 */ unsigned long KcbMaxValueDataLen;
  struct /* bitfield */
  {
    /* 0x00b8 */ unsigned long KcbUserFlags : 4; /* bit position: 0 */
    /* 0x00b8 */ unsigned long KcbVirtControlFlags : 4; /* bit position: 4 */
    /* 0x00b8 */ unsigned long KcbDebug : 8; /* bit position: 8 */
    /* 0x00b8 */ unsigned long Flags : 16; /* bit position: 16 */
  }; /* bitfield */
  /* 0x00bc */ unsigned long Spare3;
  /* 0x00c0 */ struct _CM_KCB_LAYER_INFO* LayerInfo;
  /* 0x00c8 */ char* RealKeyName;
  /* 0x00d0 */ struct _LIST_ENTRY KCBUoWListHead;
  union
  {
    /* 0x00e0 */ struct _LIST_ENTRY DelayQueueEntry;
    /* 0x00e0 */ volatile unsigned char* Stolen;
  }; /* size: 0x0010 */
  /* 0x00f0 */ struct _CM_TRANS* TransKCBOwner;
  /* 0x00f8 */ struct _CM_INTENT_LOCK KCBLock;
  /* 0x0108 */ struct _CM_INTENT_LOCK KeyLock;
  /* 0x0118 */ struct _CHILD_LIST TransValueCache;
  /* 0x0120 */ struct _CM_TRANS* TransValueListOwner;
  union
  {
    /* 0x0128 */ struct _UNICODE_STRING* FullKCBName;
    struct /* bitfield */
    {
      /* 0x0128 */ unsigned __int64 FullKCBNameStale : 1; /* bit position: 0 */
      /* 0x0128 */ unsigned __int64 Reserved : 63; /* bit position: 1 */
    }; /* bitfield */
  }; /* size: 0x0008 */
  /* 0x0130 */ unsigned __int64 SequenceNumber;
} CM_KEY_CONTROL_BLOCK, *PCM_KEY_CONTROL_BLOCK; /* size: 0x0138 */

typedef enum _POWER_REQUEST_TYPE
{
  PowerRequestDisplayRequired = 0,
  PowerRequestSystemRequired = 1,
  PowerRequestAwayModeRequired = 2,
  PowerRequestExecutionRequired = 3,
} POWER_REQUEST_TYPE, *PPOWER_REQUEST_TYPE;

typedef struct _RTL_ATOM_TABLE
{
  /* 0x0000 */ unsigned long Signature;
  /* 0x0004 */ volatile long ReferenceCount;
  /* 0x0008 */ struct _EX_PUSH_LOCK PushLock;
  /* 0x0010 */ struct _HANDLE_TABLE* ExHandleTable;
  /* 0x0018 */ unsigned long Flags;
  /* 0x001c */ unsigned long NumberOfBuckets;
  /* 0x0020 */ struct _RTL_ATOM_TABLE_ENTRY* Buckets[1];
} RTL_ATOM_TABLE, *PRTL_ATOM_TABLE; /* size: 0x0028 */

typedef enum _POWER_REQUEST_TYPE_INTERNAL
{
  PowerRequestDisplayRequiredInternal = 0,
  PowerRequestSystemRequiredInternal = 1,
  PowerRequestAwayModeRequiredInternal = 2,
  PowerRequestExecutionRequiredInternal = 3,
  PowerRequestPerfBoostRequiredInternal = 4,
  PowerRequestActiveLockScreenInternal = 5,
  PowerRequestInternalInvalid = 6,
} POWER_REQUEST_TYPE_INTERNAL, *PPOWER_REQUEST_TYPE_INTERNAL;

typedef enum _PNP_DEVICE_ACTION_REQUEST
{
  AssignResources = 0,
  ClearDeviceProblem = 1,
  ClearProblem = 2,
  ClearEjectProblem = 3,
  ReservedAction0 = 4,
  QueryPowerRelations = 5,
  Rebalance = 6,
  ReenumerateBootDevices = 7,
  ReenumerateDeviceOnly = 8,
  ReenumerateDeviceTree = 9,
  ReenumerateRootDevices = 10,
  RequeryDeviceState = 11,
  ResetDevice = 12,
  ResourceRequirementsChanged = 13,
  RestartEnumeration = 14,
  SetDeviceProblem = 15,
  StartDevice = 16,
  StartSystemDevicesPass0 = 17,
  StartSystemDevicesPass1 = 18,
  NotifyTransportRelationsChange = 19,
  NotifyEjectionRelationsChange = 20,
  ConfigureDevice = 21,
  ConfigureDeviceClass = 22,
  ConfigureDeviceExtensions = 23,
  ConfigureDeviceReset = 24,
  ClearDmaGuardProblem = 25,
  RequestDeviceReset = 26,
  UpdateConsoleLockState = 27,
  PnpDeviceActionRequestMax = 28,
} PNP_DEVICE_ACTION_REQUEST, *PPNP_DEVICE_ACTION_REQUEST;

typedef struct _PERF_CONTROL_STATE_SELECTION
{
  /* 0x0000 */ unsigned __int64 SelectedState;
  /* 0x0008 */ unsigned __int64 SelectedResourcePriority;
  /* 0x0010 */ unsigned long SelectedPercent;
  /* 0x0014 */ unsigned long SelectedFrequency;
  /* 0x0018 */ unsigned long MinPercent;
  /* 0x001c */ unsigned long MaxPercent;
  /* 0x0020 */ unsigned long TolerancePercent;
  /* 0x0024 */ unsigned long EppPercent;
  /* 0x0028 */ unsigned long AutonomousActivityWindow;
  /* 0x002c */ unsigned long ResourcePriorityPercent;
  /* 0x0030 */ unsigned char Autonomous;
  /* 0x0031 */ unsigned char InheritFromDomain;
  /* 0x0032 */ char __PADDING__[6];
} PERF_CONTROL_STATE_SELECTION, *PPERF_CONTROL_STATE_SELECTION; /* size: 0x0038 */

typedef enum _PEP_ACPI_RESOURCE_TYPE
{
  PepAcpiMemory = 0,
  PepAcpiIoPort = 1,
  PepAcpiInterrupt = 2,
  PepAcpiGpioIo = 3,
  PepAcpiGpioInt = 4,
  PepAcpiSpbI2c = 5,
  PepAcpiSpbSpi = 6,
  PepAcpiSpbUart = 7,
  PepAcpiExtendedMemory = 8,
  PepAcpiExtendedIo = 9,
} PEP_ACPI_RESOURCE_TYPE, *PPEP_ACPI_RESOURCE_TYPE;

typedef enum _GPIO_PIN_CONFIG_TYPE
{
  PullDefault = 0,
  PullUp = 1,
  PullDown = 2,
  PullNone = 3,
} GPIO_PIN_CONFIG_TYPE, *PGPIO_PIN_CONFIG_TYPE;

typedef enum _KTBFLUSH_TYPE
{
  FlushKernel = 0,
  FlushUser = 1,
  FlushEntire = 2,
  FlushEntireAttributeChange = 3,
} KTBFLUSH_TYPE, *PKTBFLUSH_TYPE;

typedef enum _GPIO_PIN_IORESTRICTION_TYPE
{
  IoRestrictionNone = 0,
  IoRestrictionInputOnly = 1,
  IoRestrictionOutputOnly = 2,
  IoRestrictionNoneAndPreserve = 3,
} GPIO_PIN_IORESTRICTION_TYPE, *PGPIO_PIN_IORESTRICTION_TYPE;

typedef struct _DMA_COMMON_BUFFER_VECTOR
{
  /* 0x0000 */ struct _LIST_ENTRY ListEntry;
  /* 0x0010 */ unsigned __int64 SizeOfEntries;
  /* 0x0018 */ unsigned long NumberOfEntries;
  /* 0x001c */ long Padding_89;
  /* 0x0020 */ struct _HALP_DMA_DOMAIN_OBJECT* Domain;
  /* 0x0028 */ struct _MDL* Mdl;
  /* 0x0030 */ void* BaseAddress;
  /* 0x0038 */ unsigned __int64 BaseLogicalAddress;
  /* 0x0040 */ struct _DMA_COMMON_BUFFER_ENTRY* Entries;
  /* 0x0048 */ unsigned char LogicalAddressMapped;
  /* 0x0049 */ char __PADDING__[7];
} DMA_COMMON_BUFFER_VECTOR, *PDMA_COMMON_BUFFER_VECTOR; /* size: 0x0050 */

typedef enum _PPM_DEEP_SLEEP_STATE
{
  PpmDeepSleepStateDisabled = 0,
  PpmDeepSleepStateEnabled = 1,
  PpmDeepSleepStateAusterity = 2,
} PPM_DEEP_SLEEP_STATE, *PPPM_DEEP_SLEEP_STATE;

typedef enum _MI_KSTACK_TYPE
{
  MiRegularKstack = 0,
  MiShortLivedKstack = 1,
  MiXStateKstack = 2,
  MiKernelShadowStackTypeUserThread = 3,
  MiKernelShadowStackTypeKernelThread = 4,
  MiKernelShadowStackTypeRstorssp = 5,
  MiMaximumCachedKernelStackType = 5,
  MiKernelShadowStackTypeSetssbsy = 6,
  MiKernelShadowStackTypeSetssbsyForSystemStartup = 7,
  MiMaximumKstack = 8,
} MI_KSTACK_TYPE, *PMI_KSTACK_TYPE;

typedef enum _PPM_HETERO_POLICY
{
  PpmHeteroPolicyNone = 0,
  PpmHeteroPolicyManual = 1,
  PpmHeteroPolicySmallOnly = 2,
  PpmHeteroPolicyLargeOnly = 3,
  PpmHeteroPolicyDynamic = 4,
  PpmHeteroPolicyMaximum = 5,
} PPM_HETERO_POLICY, *PPPM_HETERO_POLICY;

typedef enum _BOOT_ENTROPY_SOURCE_RESULT_CODE
{
  BootEntropySourceStructureUninitialized = 0,
  BootEntropySourceDisabledByPolicy = 1,
  BootEntropySourceNotPresent = 2,
  BootEntropySourceError = 3,
  BootEntropySourceSuccess = 4,
} BOOT_ENTROPY_SOURCE_RESULT_CODE, *PBOOT_ENTROPY_SOURCE_RESULT_CODE;

typedef struct _BOOT_ENTROPY_SOURCE_LDR_RESULT
{
  /* 0x0000 */ enum _BOOT_ENTROPY_SOURCE_ID SourceId;
  /* 0x0004 */ long Padding_90;
  /* 0x0008 */ unsigned __int64 Policy;
  /* 0x0010 */ enum _BOOT_ENTROPY_SOURCE_RESULT_CODE ResultCode;
  /* 0x0014 */ long ResultStatus;
  /* 0x0018 */ unsigned __int64 Time;
  /* 0x0020 */ unsigned long EntropyLength;
  /* 0x0024 */ unsigned char EntropyData[64];
  /* 0x0064 */ long __PADDING__[1];
} BOOT_ENTROPY_SOURCE_LDR_RESULT, *PBOOT_ENTROPY_SOURCE_LDR_RESULT; /* size: 0x0068 */

typedef struct _BOOT_ENTROPY_LDR_RESULT
{
  /* 0x0000 */ unsigned long maxEntropySources;
  /* 0x0004 */ long Padding_91;
  /* 0x0008 */ struct _BOOT_ENTROPY_SOURCE_LDR_RESULT EntropySourceResult[10];
  /* 0x0418 */ unsigned char SeedBytesForCng[48];
  /* 0x0448 */ unsigned char RngBytesForNtoskrnl[1024];
  /* 0x0848 */ unsigned char KdEntropy[32];
} BOOT_ENTROPY_LDR_RESULT, *PBOOT_ENTROPY_LDR_RESULT; /* size: 0x0868 */

typedef enum _SYSTEM_PROCESS_CLASSIFICATION
{
  SystemProcessClassificationNormal = 0,
  SystemProcessClassificationSystem = 1,
  SystemProcessClassificationSecureSystem = 2,
  SystemProcessClassificationMemCompression = 3,
  SystemProcessClassificationRegistry = 4,
  SystemProcessClassificationMaximum = 5,
} SYSTEM_PROCESS_CLASSIFICATION, *PSYSTEM_PROCESS_CLASSIFICATION;

typedef enum _SERVERSILO_STATE
{
  SERVERSILO_INITING = 0,
  SERVERSILO_STARTED = 1,
  SERVERSILO_SHUTTING_DOWN = 2,
  SERVERSILO_TERMINATING = 3,
  SERVERSILO_TERMINATED = 4,
} SERVERSILO_STATE, *PSERVERSILO_STATE;

typedef struct _ARBITER_ALLOCATION_STATE
{
  /* 0x0000 */ unsigned __int64 Start;
  /* 0x0008 */ unsigned __int64 End;
  /* 0x0010 */ unsigned __int64 CurrentMinimum;
  /* 0x0018 */ unsigned __int64 CurrentMaximum;
  /* 0x0020 */ struct _ARBITER_LIST_ENTRY* Entry;
  /* 0x0028 */ struct _ARBITER_ALTERNATIVE* CurrentAlternative;
  /* 0x0030 */ unsigned long AlternativeCount;
  /* 0x0034 */ long Padding_92;
  /* 0x0038 */ struct _ARBITER_ALTERNATIVE* Alternatives;
  /* 0x0040 */ unsigned short Flags;
  /* 0x0042 */ unsigned char RangeAttributes;
  /* 0x0043 */ unsigned char RangeAvailableAttributes;
  /* 0x0044 */ long Padding_93;
  /* 0x0048 */ unsigned __int64 WorkSpace;
} ARBITER_ALLOCATION_STATE, *PARBITER_ALLOCATION_STATE; /* size: 0x0050 */

enum EmptyCVariant_FeatureStaging_StorageAndFilesystems
{
  CVariant_FeatureStaging_StorageAndFilesystems_Empty = 0,
};

typedef union _KSR_CAPABILITIES
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long PerennialDatabase : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned long SkipSubAllocator : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned long ExtendedNotifications : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned long Kseg0Vtl1Mappings64KBAligned : 1; /* bit position: 3 */
      /* 0x0000 */ unsigned long Vtl1IsolatedDatabase : 1; /* bit position: 4 */
      /* 0x0000 */ unsigned long Reserved : 27; /* bit position: 5 */
    }; /* bitfield */
    /* 0x0000 */ unsigned long AsULong;
  }; /* size: 0x0004 */
} KSR_CAPABILITIES, *PKSR_CAPABILITIES; /* size: 0x0004 */

typedef struct _VIRTUAL_EFI_RUNTIME_SERVICES
{
  /* 0x0000 */ unsigned __int64 GetTime;
  /* 0x0008 */ unsigned __int64 SetTime;
  /* 0x0010 */ unsigned __int64 GetWakeupTime;
  /* 0x0018 */ unsigned __int64 SetWakeupTime;
  /* 0x0020 */ unsigned __int64 SetVirtualAddressMap;
  /* 0x0028 */ unsigned __int64 ConvertPointer;
  /* 0x0030 */ unsigned __int64 GetVariable;
  /* 0x0038 */ unsigned __int64 GetNextVariableName;
  /* 0x0040 */ unsigned __int64 SetVariable;
  /* 0x0048 */ unsigned __int64 GetNextHighMonotonicCount;
  /* 0x0050 */ unsigned __int64 ResetSystem;
  /* 0x0058 */ unsigned __int64 UpdateCapsule;
  /* 0x0060 */ unsigned __int64 QueryCapsuleCapabilities;
  /* 0x0068 */ unsigned __int64 QueryVariableInfo;
} VIRTUAL_EFI_RUNTIME_SERVICES, *PVIRTUAL_EFI_RUNTIME_SERVICES; /* size: 0x0070 */

struct DEBUG_MEMORY_REQUIREMENTS
{
  /* 0x0000 */ union _LARGE_INTEGER Start;
  /* 0x0008 */ union _LARGE_INTEGER MaxEnd;
  /* 0x0010 */ void* VirtualAddress;
  /* 0x0018 */ unsigned long Length;
  /* 0x001c */ unsigned char Cached;
  /* 0x001d */ unsigned char Aligned;
  /* 0x001e */ char __PADDING__[2];
}; /* size: 0x0020 */

typedef union _KSR_FLAGS
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long MpwrResume : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned long Reserved : 31; /* bit position: 1 */
    }; /* bitfield */
    /* 0x0000 */ unsigned long AsULong;
  }; /* size: 0x0004 */
} KSR_FLAGS, *PKSR_FLAGS; /* size: 0x0004 */

typedef struct _KSR_FIRMWARE_INFORMATION
{
  /* 0x0000 */ unsigned long Version;
  /* 0x0004 */ union _KSR_CAPABILITIES DownlevelCapabilities;
  /* 0x0008 */ struct _UNICODE_STRING EfiVersionString;
  /* 0x0018 */ struct _VIRTUAL_EFI_RUNTIME_SERVICES EfiRuntimeServices;
  /* 0x0088 */ void* EfiMemoryMap;
  /* 0x0090 */ unsigned long EfiMemoryMapSize;
  /* 0x0094 */ unsigned long EfiMemoryMapDescriptorSize;
  /* 0x0098 */ struct _MEMORY_CACHING_REQUIREMENTS* CachingRequirements;
  /* 0x00a0 */ unsigned long CachingRequirementsCount;
  /* 0x00a4 */ long Padding_94;
  /* 0x00a8 */ void* Smbios;
  /* 0x00b0 */ struct _INBV_DISPLAY_CONTEXT* DisplayContext;
  /* 0x00b8 */ void* SecureBootPolicy;
  /* 0x00c0 */ unsigned long SecureBootPolicySize;
  /* 0x00c4 */ long Padding_95;
  /* 0x00c8 */ struct DEBUG_MEMORY_REQUIREMENTS DebugDeviceMemory;
  /* 0x00e8 */ unsigned long SoftRestartCount;
  /* 0x00ec */ long Padding_96;
  /* 0x00f0 */ void* CodeIntegrityPolicy;
  /* 0x00f8 */ unsigned long CodeIntegrityPolicySize;
  /* 0x00fc */ long Padding_97;
  /* 0x0100 */ void* EfiMemoryAttributes;
  /* 0x0108 */ void* Esrt;
  /* 0x0110 */ unsigned long EsrtSize;
  /* 0x0114 */ long Padding_98;
  /* 0x0118 */ void* CodeIntegrityPolicyHash;
  /* 0x0120 */ unsigned long CodeIntegrityPolicyHashSize;
  /* 0x0124 */ long Padding_99;
  /* 0x0128 */ void* CodeIntegrityPolicyOriginalHash;
  /* 0x0130 */ unsigned long CodeIntegrityPolicyOriginalHashSize;
  /* 0x0134 */ long Padding_100;
  /* 0x0138 */ struct _PHYSICAL_MEMORY_RANGE* BadPageRanges;
  /* 0x0140 */ unsigned long BadPageRangeCount;
  /* 0x0144 */ union _KSR_CAPABILITIES Capabilities;
  /* 0x0148 */ union _KSR_FLAGS Flags;
  /* 0x014c */ long __PADDING__[1];
} KSR_FIRMWARE_INFORMATION, *PKSR_FIRMWARE_INFORMATION; /* size: 0x0150 */

typedef enum _KI_CALLBACK
{
  KiCallbackNmi = 0,
  KiCallbackBound = 1,
  KiCallbackSx = 2,
  KiCallbackCount = 3,
  KiFirstCallback = 0,
} KI_CALLBACK, *PKI_CALLBACK;

typedef union _EXT_IOMMU_CREATE_DEVICE_FLAGS
{
  union
  {
    /* 0x0000 */ unsigned int AsUINT32;
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned int WildCard : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned int ForceCreate : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned int LiveTraffic : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned int DeviceIsReserved : 1; /* bit position: 3 */
      /* 0x0000 */ unsigned int Reserved : 28; /* bit position: 4 */
    }; /* bitfield */
  }; /* size: 0x0004 */
} EXT_IOMMU_CREATE_DEVICE_FLAGS, *PEXT_IOMMU_CREATE_DEVICE_FLAGS; /* size: 0x0004 */

typedef struct _MI_AVAILABLE_PAGE_WAIT_STATES
{
  /* 0x0000 */ struct _KEVENT Event;
  /* 0x0018 */ unsigned long EventSets;
  /* 0x001c */ long __PADDING__[1];
} MI_AVAILABLE_PAGE_WAIT_STATES, *PMI_AVAILABLE_PAGE_WAIT_STATES; /* size: 0x0020 */

enum EmptyCVariant_FeatureStaging_kernelcachemanager
{
  CVariant_FeatureStaging_kernelcachemanager_Empty = 0,
};

typedef enum _WORKER_FUNCTION
{
  NoopFunction = 0,
  ReadAhead = 1,
  WriteBehind = 2,
  LazyWriteScan = 3,
  EventSet = 4,
  AsyncRead = 5,
  CompleteAsyncRead = 6,
  AsyncWriteBehind = 7,
  CompleteAsyncWriteBehind = 8,
} WORKER_FUNCTION, *PWORKER_FUNCTION;

typedef enum _EXQUEUEINDEX
{
  ExPoolUntrusted = 0,
  IoPoolUntrusted = 1,
  ExPoolMax = 8,
} EXQUEUEINDEX, *PEXQUEUEINDEX;

typedef enum _CC_NUMA_TYPE
{
  InvalidNumaNodeType = 0,
  PartitionNumaNode = 1,
  VolumeNumaNode = 2,
  MaxNumaNodeType = 3,
} CC_NUMA_TYPE, *PCC_NUMA_TYPE;

typedef struct _DIRTY_PAGE_STATISTICS
{
  /* 0x0000 */ unsigned __int64 DirtyPages;
  /* 0x0008 */ unsigned __int64 DirtyPagesLastScan;
  /* 0x0010 */ unsigned long DirtyPagesScheduledLastScan;
  /* 0x0014 */ long __PADDING__[1];
} DIRTY_PAGE_STATISTICS, *PDIRTY_PAGE_STATISTICS; /* size: 0x0018 */

typedef struct _DIRTY_PAGE_THRESHOLDS
{
  /* 0x0000 */ unsigned __int64 DirtyPageThreshold;
  /* 0x0008 */ unsigned __int64 DirtyPageThresholdTop;
  /* 0x0010 */ unsigned __int64 DirtyPageThresholdBottom;
  /* 0x0018 */ unsigned long DirtyPageTarget;
  /* 0x001c */ long Padding_101;
  /* 0x0020 */ unsigned __int64 AggregateAvailablePages;
  /* 0x0028 */ unsigned __int64 AggregateDirtyPages;
  /* 0x0030 */ unsigned long AvailableHistory;
  /* 0x0034 */ long __PADDING__[1];
} DIRTY_PAGE_THRESHOLDS, *PDIRTY_PAGE_THRESHOLDS; /* size: 0x0038 */

typedef struct _LOG_HANDLE_CONTEXT
{
  /* 0x0000 */ void* LogHandle;
  /* 0x0008 */ void* FlushToLsnRoutine /* function */;
  /* 0x0010 */ void* QueryLogHandleInfoRoutine /* function */;
  /* 0x0018 */ struct _DIRTY_PAGE_STATISTICS DirtyPageStatistics;
  /* 0x0030 */ struct _DIRTY_PAGE_THRESHOLDS DirtyPageThresholds;
  /* 0x0068 */ unsigned long AdditionalPagesToWrite;
  /* 0x006c */ unsigned long CcLWScanDPThreshold;
  /* 0x0070 */ union _LARGE_INTEGER LargestLsnForCurrentLWScan;
  /* 0x0078 */ struct _FILE_OBJECT* RelatedFileObject;
  /* 0x0080 */ unsigned __int64 LargestLsnFileObjectKey;
  /* 0x0088 */ union _LARGE_INTEGER LastLWTimeStamp;
  /* 0x0090 */ unsigned long Flags;
  /* 0x0094 */ long __PADDING__[1];
} LOG_HANDLE_CONTEXT, *PLOG_HANDLE_CONTEXT; /* size: 0x0098 */

typedef enum _RTLP_HP_MEMORY_TYPE
{
  HeapMemoryPaged = 0,
  HeapMemoryNonPaged = 1,
  HeapMemory64KPage = 2,
  HeapMemoryLargePage = 3,
  HeapMemoryHugePage = 4,
  HeapMemoryTypeCustom = 5,
  HeapMemoryTypeMax = 6,
} RTLP_HP_MEMORY_TYPE, *PRTLP_HP_MEMORY_TYPE;

typedef enum _MI_ASSIGNED_REGION_TYPES
{
  AssignedRegionPfnDatabase = 0,
  AssignedRegionNonPagedPool = 1,
  AssignedRegionPagedPool = 2,
  AssignedRegionSystemCache = 3,
  AssignedRegionSystemPtes = 4,
  AssignedRegionKasan = 5,
  AssignedRegionUltraZero = 6,
  AssignedRegionCfg = 7,
  AssignedRegionHyperSpace = 8,
  AssignedRegionKernelStacks = 9,
  AssignedRegionNonCachedMappings = 10,
  AssignedRegionSoftWsles = 11,
  AssignedRegionPageTables = 12,
  AssignedRegionNotUsed = 13,
  AssignedRegionSecureNonPagedPool = 14,
  AssignedRegionKernelShadowStacks = 15,
  AssignedRegionSystemDataViews = 16,
  AssignedRegionSystemImages = 17,
  AssignedRegionMaximum = 18,
} MI_ASSIGNED_REGION_TYPES, *PMI_ASSIGNED_REGION_TYPES;

typedef struct _MI_DBG_PATCH
{
  union
  {
    /* 0x0000 */ struct _CONTROL_AREA* ControlArea;
  } /* size: 0x0008 */ u1;
  union
  {
    union
    {
      /* 0x0008 */ unsigned long EntireField;
      struct
      {
        struct /* bitfield */
        {
          /* 0x0008 */ unsigned long Pending : 1; /* bit position: 0 */
          /* 0x0008 */ unsigned long Reserved : 1; /* bit position: 1 */
          /* 0x0008 */ unsigned long Offset : 30; /* bit position: 2 */
        }; /* bitfield */
      } /* size: 0x0004 */ e2;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ u2;
  /* 0x000c */ unsigned long OriginalBytes;
  /* 0x0010 */ unsigned long NewBytes;
  /* 0x0014 */ unsigned long Padding;
} MI_DBG_PATCH, *PMI_DBG_PATCH; /* size: 0x0018 */

typedef struct _MI_DEBUGGER_STATE
{
  /* 0x0000 */ unsigned char TransientWrite;
  /* 0x0001 */ char Padding_102[7];
  /* 0x0008 */ struct _MMPTE* DebugPtes[2];
  /* 0x0018 */ unsigned long PoisonedTb;
  /* 0x001c */ volatile long InDebugger;
  /* 0x0020 */ void* volatile Pfns[32];
  /* 0x0120 */ struct _MI_DBG_PATCH PatchBuffer[256];
  /* 0x1920 */ unsigned long PatchBufferInsertIndex;
  /* 0x1924 */ unsigned long PatchBufferRemoveIndex;
  /* 0x1928 */ struct _MI_DBG_PATCH PatchTableSpace[512];
  /* 0x4928 */ struct _MI_DBG_PATCH* PatchTable[512];
  /* 0x5928 */ volatile long PatchTableLock;
  /* 0x592c */ unsigned long PatchTableFreeEntry;
  /* 0x5930 */ unsigned long PatchTableEntryCount;
  /* 0x5934 */ long __PADDING__[1];
} MI_DEBUGGER_STATE, *PMI_DEBUGGER_STATE; /* size: 0x5938 */

typedef enum _PROCESSOR_PRESENCE
{
  ProcessorPresenceNt = 0,
  ProcessorPresenceHv = 1,
  ProcessorPresenceHidden = 2,
} PROCESSOR_PRESENCE, *PPROCESSOR_PRESENCE;

typedef struct _PROC_PERF_QOS_CLASS_POLICY
{
  /* 0x0000 */ unsigned long MaxPolicyPercent;
  /* 0x0004 */ unsigned long MaxEquivalentFrequencyPercent;
  /* 0x0008 */ unsigned long MinPolicyPercent;
  /* 0x000c */ unsigned long AutonomousActivityWindow;
  /* 0x0010 */ unsigned long EnergyPerfPreference;
  /* 0x0014 */ unsigned char ProvideGuidance;
  /* 0x0015 */ unsigned char AllowThrottling;
  /* 0x0016 */ unsigned char PerfBoostMode;
  /* 0x0017 */ unsigned char LatencyHintPerf;
  /* 0x0018 */ unsigned char LatencyHintEpp;
  /* 0x0019 */ unsigned char TrackDesiredCrossClass;
  /* 0x001a */ char Padding_103[2];
  /* 0x001c */ unsigned long ResourcePriority;
} PROC_PERF_QOS_CLASS_POLICY, *PPROC_PERF_QOS_CLASS_POLICY; /* size: 0x0020 */

typedef struct _PROC_PERF_DOMAIN
{
  /* 0x0000 */ struct _LIST_ENTRY Link;
  /* 0x0010 */ struct _PROC_PERF_CHECK_CONTEXT* Master;
  /* 0x0018 */ struct _KAFFINITY_EX Members;
  /* 0x0120 */ unsigned __int64 DomainContext;
  /* 0x0128 */ unsigned long ProcessorCount;
  /* 0x012c */ unsigned char EfficiencyClass;
  /* 0x012d */ unsigned char NominalPerformanceClass;
  /* 0x012e */ unsigned char PerformanceClass;
  /* 0x012f */ char Padding_104;
  /* 0x0130 */ enum _PROCESSOR_PRESENCE Presence;
  /* 0x0134 */ long Padding_105;
  /* 0x0138 */ struct _PROC_PERF_CONSTRAINT* Processors;
  /* 0x0140 */ void* GetFFHThrottleState /* function */;
  /* 0x0148 */ void* TimeWindowHandler /* function */;
  /* 0x0150 */ void* BoostPolicyHandler /* function */;
  /* 0x0158 */ void* BoostModeHandler /* function */;
  /* 0x0160 */ void* AutonomousActivityWindowHandler /* function */;
  /* 0x0168 */ void* AutonomousModeHandler /* function */;
  /* 0x0170 */ void* ReinitializeHandler /* function */;
  /* 0x0178 */ void* PerfSelectionHandler /* function */;
  /* 0x0180 */ void* PerfPriorityHandler /* function */;
  /* 0x0188 */ void* PerfControlHandler /* function */;
  /* 0x0190 */ void* PerfControlHandlerHidden /* function */;
  /* 0x0198 */ void* DomainPerfControlHandler /* function */;
  /* 0x01a0 */ void* PerfUpdateHwDebugData /* function */;
  /* 0x01a8 */ void* PerfQueryProcMeasurementCapabilities /* function */;
  /* 0x01b0 */ void* PerfQueryProcMeasurementValues /* function */;
  /* 0x01b8 */ unsigned long Id;
  /* 0x01bc */ unsigned long MaxFrequency;
  /* 0x01c0 */ unsigned long NominalFrequency;
  /* 0x01c4 */ unsigned long MaxPercent;
  /* 0x01c8 */ unsigned long MinPerfPercent;
  /* 0x01cc */ unsigned long MinThrottlePercent;
  /* 0x01d0 */ unsigned long AdvertizedMaximumFrequency;
  /* 0x01d4 */ long Padding_106;
  /* 0x01d8 */ unsigned __int64 MinimumRelativePerformance;
  /* 0x01e0 */ unsigned __int64 NominalRelativePerformance;
  /* 0x01e8 */ unsigned char NominalRelativePerformancePercent;
  /* 0x01e9 */ unsigned char Coordination;
  /* 0x01ea */ unsigned char HardPlatformCap;
  /* 0x01eb */ unsigned char AffinitizeControl;
  /* 0x01ec */ unsigned char EfficientThrottle;
  /* 0x01ed */ unsigned char AllowSchedulerDirectedPerfStates;
  /* 0x01ee */ unsigned char InitiateAllProcessors;
  /* 0x01ef */ unsigned char AllowVmPerfSelection;
  /* 0x01f0 */ unsigned char TurboRangeKnown;
  /* 0x01f1 */ char Padding_107[3];
  /* 0x01f4 */ unsigned long VmFrequencyStepMhz;
  /* 0x01f8 */ unsigned long VmHighestFrequencyMhz;
  /* 0x01fc */ unsigned long VmNominalFrequencyMhz;
  /* 0x0200 */ unsigned long VmLowestFrequencyMhz;
  /* 0x0204 */ unsigned long VmThrottlePriorityCount;
  /* 0x0208 */ unsigned char AutonomousMode;
  /* 0x0209 */ unsigned char AutonomousCapability;
  /* 0x020a */ unsigned char ProvideGuidance;
  /* 0x020b */ unsigned char EppSupported;
  /* 0x020c */ unsigned long DesiredPercent;
  /* 0x0210 */ unsigned long GuaranteedPercent;
  /* 0x0214 */ unsigned char EngageResponsivenessOverrides;
  /* 0x0215 */ char Padding_108[3];
  /* 0x0218 */ struct _PROC_PERF_QOS_CLASS_POLICY QosPolicies[7];
  /* 0x02f8 */ unsigned long QosDisableReasons[7];
  /* 0x0314 */ unsigned short QosEquivalencyMasks[7];
  /* 0x0322 */ unsigned char QosSupported;
  /* 0x0323 */ char Padding_109;
  /* 0x0324 */ volatile unsigned long SelectionGeneration;
  /* 0x0328 */ struct _PERF_CONTROL_STATE_SELECTION QosSelection[7];
  /* 0x04b0 */ unsigned __int64 PerfChangeTime;
  /* 0x04b8 */ unsigned long PerfChangeIntervalCount;
  /* 0x04bc */ unsigned char Force;
  /* 0x04bd */ unsigned char Update;
  /* 0x04be */ unsigned char Apply;
  /* 0x04bf */ char __PADDING__[1];
} PROC_PERF_DOMAIN, *PPROC_PERF_DOMAIN; /* size: 0x04c0 */

enum RTLP_CSPARSE_BITMAP_STATE
{
  CommitBitmapInvalid = 0,
  UserBitmapInvalid = 1,
  UserBitmapValid = 2,
};

typedef enum _RTLP_HP_ADDRESS_SPACE_TYPE
{
  HeapAddressUser = 0,
  HeapAddressKernel = 1,
  HeapAddressSession = 2,
  HeapAddressSecure = 3,
  HeapAddressTypeMax = 4,
} RTLP_HP_ADDRESS_SPACE_TYPE, *PRTLP_HP_ADDRESS_SPACE_TYPE;

typedef struct _OBP_SYSTEM_DOS_DEVICE_STATE
{
  /* 0x0000 */ unsigned long GlobalDeviceMap;
  /* 0x0004 */ unsigned long LocalDeviceCount[26];
} OBP_SYSTEM_DOS_DEVICE_STATE, *POBP_SYSTEM_DOS_DEVICE_STATE; /* size: 0x006c */

typedef struct _OBJECT_NAMESPACE_LOOKUPTABLE
{
  /* 0x0000 */ struct _LIST_ENTRY HashBuckets[37];
  /* 0x0250 */ struct _EX_PUSH_LOCK Lock;
  /* 0x0258 */ unsigned long NumberOfPrivateSpaces;
  /* 0x025c */ long __PADDING__[1];
} OBJECT_NAMESPACE_LOOKUPTABLE, *POBJECT_NAMESPACE_LOOKUPTABLE; /* size: 0x0260 */

typedef struct _OBP_SILODRIVERSTATE
{
  /* 0x0000 */ struct _EX_FAST_REF SystemDeviceMap;
  /* 0x0008 */ struct _OBP_SYSTEM_DOS_DEVICE_STATE SystemDosDeviceState;
  /* 0x0074 */ long Padding_110;
  /* 0x0078 */ struct _EX_PUSH_LOCK DeviceMapLock;
  /* 0x0080 */ struct _OBJECT_NAMESPACE_LOOKUPTABLE PrivateNamespaceLookupTable;
} OBP_SILODRIVERSTATE, *POBP_SILODRIVERSTATE; /* size: 0x02e0 */

typedef enum _INTERRUPT_STEERING_MODE
{
  IntSteerModeNone = 0,
  IntSteerModeController = 1,
  IntSteerModeRedirect = 2,
  IntSteerModeControllerFixed = 3,
} INTERRUPT_STEERING_MODE, *PINTERRUPT_STEERING_MODE;

typedef enum _RTLP_HP_LOCK_TYPE
{
  HeapLockPaged = 0,
  HeapLockNonPaged = 1,
  HeapLockTypeMax = 2,
} RTLP_HP_LOCK_TYPE, *PRTLP_HP_LOCK_TYPE;

typedef enum _HEAP_LFH_LOCKMODE
{
  HeapLockNotHeld = 0,
  HeapLockShared = 1,
  HeapLockExclusive = 2,
} HEAP_LFH_LOCKMODE, *PHEAP_LFH_LOCKMODE;

typedef enum _PO_CS_DEVICE_NOTIFICATION_TYPE
{
  PoCsDeviceNotificationStorage = 0,
  PoCsDeviceNotificationWiFi = 1,
  PoCsDeviceNotificationMbn = 2,
  PoCsDeviceNotificationAudio = 3,
  PoCsDeviceNotificationEthernet = 4,
  PoCsDeviceNotificationMaximum = 5,
} PO_CS_DEVICE_NOTIFICATION_TYPE, *PPO_CS_DEVICE_NOTIFICATION_TYPE;

typedef enum _HEAP_SEG_RANGE_TYPE
{
  HeapSegRangeUser = 0,
  HeapSegRangeInternal = 1,
  HeapSegRangeLFH = 2,
  HeapSegRangeVS = 3,
  HeapSegRangeTypeMax = 3,
} HEAP_SEG_RANGE_TYPE, *PHEAP_SEG_RANGE_TYPE;

typedef enum _RTLP_HP_ALLOCATOR
{
  RtlpHpSegmentSm = 0,
  RtlpHpSegmentLg = 1,
  RtlpHpSegmentTypes = 2,
  RtlpHpHugeAllocator = 2,
  RtlpHpAllocatorMax = 3,
} RTLP_HP_ALLOCATOR, *PRTLP_HP_ALLOCATOR;

typedef enum _MM_PAGE_ACCESS_TYPE
{
  MmPteAccessType = 0,
  MmCcReadAheadType = 1,
  MmPfnRepurposeType = 2,
  MmMaximumPageAccessType = 3,
} MM_PAGE_ACCESS_TYPE, *PMM_PAGE_ACCESS_TYPE;

typedef enum _EXP_POOL_CONTEXT_TYPE
{
  ExpPoolContextInvalid = 0,
  ExpPoolContextPrivate = 1,
  ExpPoolContextSecure = 2,
} EXP_POOL_CONTEXT_TYPE, *PEXP_POOL_CONTEXT_TYPE;

typedef enum _HEAP_FAILURE_TYPE
{
  heap_failure_internal = 0,
  heap_failure_unknown = 1,
  heap_failure_generic = 2,
  heap_failure_entry_corruption = 3,
  heap_failure_multiple_entries_corruption = 4,
  heap_failure_virtual_block_corruption = 5,
  heap_failure_buffer_overrun = 6,
  heap_failure_buffer_underrun = 7,
  heap_failure_block_not_busy = 8,
  heap_failure_invalid_argument = 9,
  heap_failure_invalid_allocation_type = 10,
  heap_failure_usage_after_free = 11,
  heap_failure_cross_heap_operation = 12,
  heap_failure_freelists_corruption = 13,
  heap_failure_listentry_corruption = 14,
  heap_failure_lfh_bitmap_mismatch = 15,
  heap_failure_segment_lfh_bitmap_corruption = 16,
  heap_failure_segment_lfh_double_free = 17,
  heap_failure_vs_subsegment_corruption = 18,
  heap_failure_null_heap = 19,
  heap_failure_allocation_limit = 20,
  heap_failure_commit_limit = 21,
  heap_failure_invalid_va_mgr_query = 22,
  heap_failure_segment_lfh_delay_free_corruption = 23,
} HEAP_FAILURE_TYPE, *PHEAP_FAILURE_TYPE;

typedef enum _KPROCESS_STATE
{
  ProcessInMemory = 0,
  ProcessOutOfMemory = 1,
  ProcessInTransition = 2,
  ProcessOutTransition = 3,
  ProcessInSwap = 4,
  ProcessOutSwap = 5,
  ProcessRetryOutSwap = 6,
  ProcessAllSwapStates = 7,
} KPROCESS_STATE, *PKPROCESS_STATE;

typedef enum _BLOB_ID
{
  BLOB_TYPE_UNKNOWN = 0,
  BLOB_TYPE_CONNECTION_INFO = 1,
  BLOB_TYPE_MESSAGE = 2,
  BLOB_TYPE_SECURITY_CONTEXT = 3,
  BLOB_TYPE_SECTION = 4,
  BLOB_TYPE_REGION = 5,
  BLOB_TYPE_VIEW = 6,
  BLOB_TYPE_RESERVE = 7,
  BLOB_TYPE_DIRECT_TRANSFER = 8,
  BLOB_TYPE_HANDLE_DATA = 9,
  BLOB_TYPE_MAX_ID = 10,
} BLOB_ID, *PBLOB_ID;

typedef enum _KWAIT_REASON
{
  Executive = 0,
  FreePage = 1,
  PageIn = 2,
  PoolAllocation = 3,
  DelayExecution = 4,
  Suspended = 5,
  UserRequest = 6,
  WrExecutive = 7,
  WrFreePage = 8,
  WrPageIn = 9,
  WrPoolAllocation = 10,
  WrDelayExecution = 11,
  WrSuspended = 12,
  WrUserRequest = 13,
  WrSpare0 = 14,
  WrQueue = 15,
  WrLpcReceive = 16,
  WrLpcReply = 17,
  WrVirtualMemory = 18,
  WrPageOut = 19,
  WrRendezvous = 20,
  WrKeyedEvent = 21,
  WrTerminated = 22,
  WrProcessInSwap = 23,
  WrCpuRateControl = 24,
  WrCalloutStack = 25,
  WrKernel = 26,
  WrResource = 27,
  WrPushLock = 28,
  WrMutex = 29,
  WrQuantumEnd = 30,
  WrDispatchInt = 31,
  WrPreempted = 32,
  WrYieldExecution = 33,
  WrFastMutex = 34,
  WrGuardedMutex = 35,
  WrRundown = 36,
  WrAlertByThreadId = 37,
  WrDeferredPreempt = 38,
  WrPhysicalFault = 39,
  WrIoRing = 40,
  WrMdlCache = 41,
  WrRcu = 42,
  MaximumWaitReason = 43,
} KWAIT_REASON, *PKWAIT_REASON;

typedef enum _POP_POWER_AGGREGATOR_DOZE_TIMER_TYPE
{
  PowerAggregatorDozeTimerTypeRestrictedStandby = 0,
  PowerAggregatorDozeTimerTypeRestrictedStandbyExit = 1,
  PowerAggregatorDozeTimerTypeMax = 2,
} POP_POWER_AGGREGATOR_DOZE_TIMER_TYPE, *PPOP_POWER_AGGREGATOR_DOZE_TIMER_TYPE;

enum EmptyCVariant_FeatureStaging_IoManager
{
  CVariant_FeatureStaging_IoManager_Empty = 0,
};

typedef enum _IOP_DISPATCH_FUNCTION_TYPE
{
  IOP_DISPATCH_FUNCTION_TYPE_NORMAL = 0,
  IOP_DISPATCH_FUNCTION_TYPE_VERIFY = 1,
  IOP_DISPATCH_FUNCTION_TYPE_EXTEND = 2,
  IOP_DISPATCH_FUNCTION_TYPE_PERF = 3,
} IOP_DISPATCH_FUNCTION_TYPE, *PIOP_DISPATCH_FUNCTION_TYPE;

typedef struct _INBV_OFFSET
{
  /* 0x0000 */ unsigned long X;
  /* 0x0004 */ unsigned long Y;
} INBV_OFFSET, *PINBV_OFFSET; /* size: 0x0008 */

typedef enum _INVPCID_TYPE
{
  InvpcidIndividualAddress = 0,
  InvpcidSingleContext = 1,
  InvpcidAllContextAndGlobals = 2,
  InvpcidAllContext = 3,
} INVPCID_TYPE, *PINVPCID_TYPE;

typedef enum _LOCK_OPERATION
{
  IoReadAccess = 0,
  IoWriteAccess = 1,
  IoModifyAccess = 2,
} LOCK_OPERATION, *PLOCK_OPERATION;

typedef enum _KISOLATION_WIDTH
{
  KiIsolationWidthLogicalProcessor = 0,
  KiIsolationWidthCore = 1,
  KiIsolationWidthMax = 2,
} KISOLATION_WIDTH, *PKISOLATION_WIDTH;

typedef struct _CMSI_PROCESS_TUPLE
{
  /* 0x0000 */ void* ProcessHandle;
  /* 0x0008 */ void* ProcessReference;
  /* 0x0010 */ struct _CMSI_RW_LOCK WorkingSetLock;
  /* 0x0018 */ unsigned __int64 LockedPageCharges;
  /* 0x0020 */ unsigned __int64 WorkingSetMinimum;
  /* 0x0028 */ unsigned __int64 WorkingSetMaximum;
} CMSI_PROCESS_TUPLE, *PCMSI_PROCESS_TUPLE; /* size: 0x0030 */

typedef enum _IOP_PRIORITY_HINT
{
  IopIoPriorityNotSet = 0,
  IopIoPriorityVeryLow = 1,
  IopIoPriorityLow = 2,
  IopIoPriorityNormal = 3,
  IopIoPriorityHigh = 4,
  IopIoPriorityCritical = 5,
  MaxIopIoPriorityTypes = 6,
} IOP_PRIORITY_HINT, *PIOP_PRIORITY_HINT;

typedef enum _TRANSFER_TYPE
{
  ReadTransfer = 0,
  WriteTransfer = 1,
  OtherTransfer = 2,
} TRANSFER_TYPE, *PTRANSFER_TYPE;

typedef enum _PPM_PARK_NODE_CONTAINMENT_GROUP_TYPE
{
  ContainmentGroupTypeEfficieny = 0,
  ContainmentGroupTypeHybrid = 1,
  ContainmentGroupTypeNone = 2,
  ContainmentGroupTypeMax = 3,
} PPM_PARK_NODE_CONTAINMENT_GROUP_TYPE, *PPPM_PARK_NODE_CONTAINMENT_GROUP_TYPE;

typedef enum _CREATE_FILE_TYPE
{
  CreateFileTypeNone = 0,
  CreateFileTypeNamedPipe = 1,
  CreateFileTypeMailslot = 2,
} CREATE_FILE_TYPE, *PCREATE_FILE_TYPE;

typedef struct _MI_BEST_LARGE_PAGE_CANDIDATES_CONTEXT
{
  /* 0x0000 */ unsigned long BestCandidateCountMax;
  /* 0x0004 */ unsigned long BestCandidateCount;
  /* 0x0008 */ unsigned long BestCandidatesTried;
  /* 0x000c */ unsigned long CandidateUsed;
  /* 0x0010 */ unsigned __int64 NextLargePage;
  /* 0x0018 */ unsigned __int64 BestCandidatesBasePage[8];
} MI_BEST_LARGE_PAGE_CANDIDATES_CONTEXT, *PMI_BEST_LARGE_PAGE_CANDIDATES_CONTEXT; /* size: 0x0058 */

typedef enum _ETW_RT_EVENT_LOSS
{
  EtwRtEventNoLoss = 0,
  EtwRtEventLost = 1,
  EtwRtBufferLost = 2,
  EtwRtBackupLost = 3,
  EtwRtEventLossMax = 4,
} ETW_RT_EVENT_LOSS, *PETW_RT_EVENT_LOSS;

typedef struct _SEP_CACHED_HANDLES_TABLE
{
  /* 0x0000 */ struct _EX_PUSH_LOCK Lock;
  /* 0x0008 */ struct _RTL_DYNAMIC_HASH_TABLE* HashTable;
} SEP_CACHED_HANDLES_TABLE, *PSEP_CACHED_HANDLES_TABLE; /* size: 0x0010 */

typedef enum _KENLISTMENT_STATE
{
  KEnlistmentUninitialized = 0,
  KEnlistmentActive = 256,
  KEnlistmentPreparing = 257,
  KEnlistmentPrepared = 258,
  KEnlistmentInDoubt = 259,
  KEnlistmentCommitted = 260,
  KEnlistmentCommittedNotify = 261,
  KEnlistmentCommitRequested = 262,
  KEnlistmentAborted = 263,
  KEnlistmentDelegated = 264,
  KEnlistmentDelegatedDisconnected = 265,
  KEnlistmentPrePreparing = 266,
  KEnlistmentForgotten = 267,
  KEnlistmentRecovering = 268,
  KEnlistmentAborting = 269,
  KEnlistmentReadOnly = 270,
  KEnlistmentOutcomeUnavailable = 271,
  KEnlistmentOffline = 272,
  KEnlistmentPrePrepared = 273,
  KEnlistmentInitialized = 274,
} KENLISTMENT_STATE, *PKENLISTMENT_STATE;

typedef struct _PPM_ENGINE_SETTINGS
{
  /* 0x0000 */ union _PPM_POLICY_SETTINGS_MASK ExplicitSetting[2];
  /* 0x0020 */ unsigned char ThrottlingPolicy;
  /* 0x0021 */ char Padding_111[3];
  /* 0x0024 */ unsigned long PerfTimeCheck;
  /* 0x0028 */ unsigned char PerfHistoryCount[2];
  /* 0x002a */ unsigned char PerfMinPolicy[2];
  /* 0x002c */ unsigned char PerfMaxPolicy[2];
  /* 0x002e */ unsigned char PerfDecreaseTime[2];
  /* 0x0030 */ unsigned char PerfIncreaseTime[2];
  /* 0x0032 */ unsigned char PerfDecreasePolicy[2];
  /* 0x0034 */ unsigned char PerfIncreasePolicy[2];
  /* 0x0036 */ unsigned char PerfDecreaseThreshold[2];
  /* 0x0038 */ unsigned char PerfIncreaseThreshold[2];
  /* 0x003a */ char Padding_112[2];
  /* 0x003c */ unsigned long PerfFrequencyCap[2];
  /* 0x0044 */ unsigned long PerfBoostPolicy;
  /* 0x0048 */ unsigned long PerfBoostMode;
  /* 0x004c */ unsigned long PerfReductionTolerance;
  /* 0x0050 */ unsigned long EnergyPerfPreference[2];
  /* 0x0058 */ unsigned long AutonomousActivityWindow;
  /* 0x005c */ unsigned char AutonomousPreference;
  /* 0x005d */ unsigned char LatencyHintPerf[2];
  /* 0x005f */ unsigned char LatencyHintEpp[2];
  /* 0x0061 */ unsigned char LatencyHintUnpark[2];
  /* 0x0063 */ char Padding_113;
  /* 0x0064 */ unsigned long ResponsivenessDisableThreshold[2];
  /* 0x006c */ unsigned long ResponsivenessEnableThreshold[2];
  /* 0x0074 */ unsigned char ResponsivenessDisableTime[2];
  /* 0x0076 */ unsigned char ResponsivenessEnableTime[2];
  /* 0x0078 */ unsigned long ResponsivenessEppCeiling[2];
  /* 0x0080 */ unsigned long ResponsivenessPerfFloor[2];
  /* 0x0088 */ unsigned char DutyCycling;
  /* 0x0089 */ unsigned char ParkingPerfState[2];
  /* 0x008b */ unsigned char DistributeUtility;
  /* 0x008c */ unsigned char CoreParkingOverUtilizationThreshold;
  /* 0x008d */ unsigned char CoreParkingConcurrencyThreshold;
  /* 0x008e */ unsigned char CoreParkingHeadroomThreshold;
  /* 0x008f */ unsigned char CoreParkingDistributionThreshold;
  /* 0x0090 */ unsigned char CoreParkingDecreasePolicy;
  /* 0x0091 */ unsigned char CoreParkingIncreasePolicy;
  /* 0x0092 */ char Padding_114[2];
  /* 0x0094 */ unsigned long CoreParkingDecreaseTime;
  /* 0x0098 */ unsigned long CoreParkingIncreaseTime;
  /* 0x009c */ unsigned char CoreParkingMinCores[2];
  /* 0x009e */ unsigned char CoreParkingMaxCores[2];
  /* 0x00a0 */ unsigned long SoftParkLatency;
  /* 0x00a4 */ unsigned char AllowScaling;
  /* 0x00a5 */ unsigned char IdleDisabled;
  /* 0x00a6 */ char Padding_115[2];
  /* 0x00a8 */ unsigned long IdleTimeCheck;
  /* 0x00ac */ unsigned char IdleDemotePercent;
  /* 0x00ad */ unsigned char IdlePromotePercent;
  /* 0x00ae */ unsigned char IdleStateMax;
  /* 0x00af */ unsigned char ResourcePriority[2];
  /* 0x00b1 */ unsigned char HeteroDecreaseTime;
  /* 0x00b2 */ unsigned char HeteroIncreaseTime;
  /* 0x00b3 */ unsigned char HeteroDecreaseThreshold[64][2];
  /* 0x0133 */ unsigned char HeteroIncreaseThreshold[64][2];
  /* 0x01b3 */ unsigned char Class0FloorPerformance;
  /* 0x01b4 */ unsigned char Class1InitialPerformance;
  /* 0x01b5 */ char Padding_116[3];
  /* 0x01b8 */ unsigned long ShortThreadRuntimeThreshold;
  /* 0x01bc */ enum _KHETERO_CPU_POLICY ThreadPolicies[2];
  /* 0x01c4 */ unsigned char ArchClassLowerThreshold[2];
  /* 0x01c6 */ unsigned char ArchClassUpperThreshold[2];
  /* 0x01c8 */ unsigned char ModuleUnparkPolicy;
  /* 0x01c9 */ unsigned char ComplexUnparkPolicy;
  /* 0x01ca */ unsigned char SmtUnparkPolicy;
  /* 0x01cb */ char Padding_117;
  /* 0x01cc */ enum _PPM_HETERO_POLICY HeteroPolicy;
  /* 0x01d0 */ unsigned long HeteroContainmentDecreaseTime;
  /* 0x01d4 */ unsigned long HeteroContainmentIncreaseTime;
  /* 0x01d8 */ unsigned long HeteroEfficiencyContainmentThreshold;
  /* 0x01dc */ unsigned long HeteroHybridContainmentThreshold;
  /* 0x01e0 */ unsigned long HeteroContainmentPolicy;
  /* 0x01e4 */ unsigned char RestrictionCount;
  /* 0x01e5 */ char __PADDING__[3];
} PPM_ENGINE_SETTINGS, *PPPM_ENGINE_SETTINGS; /* size: 0x01e8 */

typedef struct _ECP_LIST
{
  /* 0x0000 */ unsigned long Signature;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ struct _LIST_ENTRY EcpList;
} ECP_LIST, *PECP_LIST; /* size: 0x0018 */

enum ETW_COMPRESSION_RESUMPTION_MODE
{
  EtwCompressionModeRestart = 0,
  EtwCompressionModeNoDisable = 1,
  EtwCompressionModeNoRestart = 2,
};

typedef enum _ETW_BUFFER_STATE
{
  EtwBufferStateFree = 0,
  EtwBufferStateGeneralLogging = 1,
  EtwBufferStateCSwitch = 2,
  EtwBufferStateFlush = 3,
  EtwBufferStatePendingCompression = 4,
  EtwBufferStateCompressed = 5,
  EtwBufferStatePlaceholder = 6,
  EtwBufferStateMaximum = 7,
} ETW_BUFFER_STATE, *PETW_BUFFER_STATE;

enum IORING_VERSION
{
  IORING_VERSION_INVALID = 0,
  IORING_VERSION_1 = 1,
  IORING_VERSION_2 = 2,
  IORING_VERSION_3 = 300,
  IORING_VERSION_4 = 400,
};

typedef struct _DMA_ADAPTER
{
  /* 0x0000 */ unsigned short Version;
  /* 0x0002 */ unsigned short Size;
  /* 0x0004 */ long Padding_118;
  /* 0x0008 */ struct _DMA_OPERATIONS* DmaOperations;
} DMA_ADAPTER, *PDMA_ADAPTER; /* size: 0x0010 */

typedef struct _HALP_DMA_TRANSLATION_BUFFER_POSITION
{
  /* 0x0000 */ struct _HALP_DMA_TRANSLATION_BUFFER* Buffer;
  /* 0x0008 */ unsigned long Offset;
  /* 0x000c */ long __PADDING__[1];
} HALP_DMA_TRANSLATION_BUFFER_POSITION, *PHALP_DMA_TRANSLATION_BUFFER_POSITION; /* size: 0x0010 */

typedef struct _HALP_DMA_ADAPTER_OBJECT
{
  /* 0x0000 */ struct _DMA_ADAPTER DmaHeader;
  /* 0x0010 */ unsigned long Signature;
  /* 0x0014 */ long Padding_119;
  /* 0x0018 */ struct _RTL_BITMAP* ContiguousMapRegisters;
  /* 0x0020 */ struct _HALP_DMA_TRANSLATION_ENTRY* ScatterBufferListHead;
  /* 0x0028 */ unsigned long NumberOfFreeScatterBuffers;
  /* 0x002c */ long Padding_120;
  /* 0x0030 */ struct _HALP_DMA_TRANSLATION_BUFFER* ContiguousTranslations;
  /* 0x0038 */ struct _HALP_DMA_TRANSLATION_BUFFER* ScatterTranslations;
  /* 0x0040 */ struct _HALP_DMA_TRANSLATION_BUFFER_POSITION ContiguousTranslationEnd;
  /* 0x0050 */ struct _HALP_DMA_TRANSLATION_BUFFER_POSITION ScatterTranslationEnd;
  struct
  {
    /* 0x0060 */ struct _HALP_DMA_TRANSLATION_BUFFER_POSITION ContiguousHint;
    /* 0x0070 */ struct _HALP_DMA_TRANSLATION_BUFFER_POSITION ScatterHint;
  } /* size: 0x0020 */ CrashDump;
  /* 0x0080 */ unsigned __int64 SpinLock;
  /* 0x0088 */ unsigned __int64 GrowLock;
  /* 0x0090 */ union _LARGE_INTEGER MaximumPhysicalAddress;
  /* 0x0098 */ unsigned char IsMasterAdapter;
  /* 0x0099 */ unsigned char DmaCanCross64K;
  /* 0x009a */ char Padding_121[2];
  /* 0x009c */ unsigned long LibraryVersion;
} HALP_DMA_ADAPTER_OBJECT, *PHALP_DMA_ADAPTER_OBJECT; /* size: 0x00a0 */

typedef struct _HALP_DMA_MASTER_ADAPTER_OBJECT
{
  /* 0x0000 */ struct _HALP_DMA_ADAPTER_OBJECT AdapterObject;
  /* 0x00a0 */ struct _LIST_ENTRY ContiguousAdapterQueue;
  /* 0x00b0 */ struct _LIST_ENTRY ScatterAdapterQueue;
  /* 0x00c0 */ unsigned long MapBufferSize;
  /* 0x00c4 */ long Padding_122;
  /* 0x00c8 */ union _LARGE_INTEGER MapBufferPhysicalAddress;
  /* 0x00d0 */ unsigned long ContiguousPageCount;
  /* 0x00d4 */ unsigned long ContiguousPageLimit;
  /* 0x00d8 */ unsigned long ScatterPageCount;
  /* 0x00dc */ unsigned long ScatterPageLimit;
} HALP_DMA_MASTER_ADAPTER_OBJECT, *PHALP_DMA_MASTER_ADAPTER_OBJECT; /* size: 0x00e0 */

typedef enum _KPROFILE_SOURCE
{
  ProfileTime = 0,
  ProfileAlignmentFixup = 1,
  ProfileTotalIssues = 2,
  ProfilePipelineDry = 3,
  ProfileLoadInstructions = 4,
  ProfilePipelineFrozen = 5,
  ProfileBranchInstructions = 6,
  ProfileTotalNonissues = 7,
  ProfileDcacheMisses = 8,
  ProfileIcacheMisses = 9,
  ProfileCacheMisses = 10,
  ProfileBranchMispredictions = 11,
  ProfileStoreInstructions = 12,
  ProfileFpInstructions = 13,
  ProfileIntegerInstructions = 14,
  Profile2Issue = 15,
  Profile3Issue = 16,
  Profile4Issue = 17,
  ProfileSpecialInstructions = 18,
  ProfileTotalCycles = 19,
  ProfileIcacheIssues = 20,
  ProfileDcacheAccesses = 21,
  ProfileMemoryBarrierCycles = 22,
  ProfileLoadLinkedIssues = 23,
  ProfileMaximum = 24,
} KPROFILE_SOURCE, *PKPROFILE_SOURCE;

typedef enum _TOKEN_TYPE
{
  TokenPrimary = 1,
  TokenImpersonation = 2,
} TOKEN_TYPE, *PTOKEN_TYPE;

typedef enum _WNF_STATE_NAME_LIFETIME
{
  WnfWellKnownStateName = 0,
  WnfPermanentStateName = 1,
  WnfPersistentStateName = 2,
  WnfTemporaryStateName = 3,
} WNF_STATE_NAME_LIFETIME, *PWNF_STATE_NAME_LIFETIME;

struct _CHPEV2_PROCESS_INFO;

typedef struct _MMVAD_FLAGS
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long Lock : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned long LockContended : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned long DeleteInProgress : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned long NoChange : 1; /* bit position: 3 */
      /* 0x0000 */ unsigned long VadType : 3; /* bit position: 4 */
      /* 0x0000 */ unsigned long Protection : 5; /* bit position: 7 */
      /* 0x0000 */ unsigned long PreferredNode : 7; /* bit position: 12 */
      /* 0x0000 */ unsigned long PageSize : 2; /* bit position: 19 */
      /* 0x0000 */ unsigned long PrivateMemory : 1; /* bit position: 21 */
    }; /* bitfield */
    /* 0x0000 */ unsigned long EntireField;
  }; /* size: 0x0004 */
} MMVAD_FLAGS, *PMMVAD_FLAGS; /* size: 0x0004 */

typedef struct _MM_PRIVATE_VAD_FLAGS
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned long Lock : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned long LockContended : 1; /* bit position: 1 */
    /* 0x0000 */ unsigned long DeleteInProgress : 1; /* bit position: 2 */
    /* 0x0000 */ unsigned long NoChange : 1; /* bit position: 3 */
    /* 0x0000 */ unsigned long VadType : 3; /* bit position: 4 */
    /* 0x0000 */ unsigned long Protection : 5; /* bit position: 7 */
    /* 0x0000 */ unsigned long PreferredNode : 7; /* bit position: 12 */
    /* 0x0000 */ unsigned long PageSize : 2; /* bit position: 19 */
    /* 0x0000 */ unsigned long PrivateMemoryAlwaysSet : 1; /* bit position: 21 */
    /* 0x0000 */ unsigned long WriteWatch : 1; /* bit position: 22 */
    /* 0x0000 */ unsigned long FixedLargePageSize : 1; /* bit position: 23 */
    /* 0x0000 */ unsigned long ZeroFillPagesOptional : 1; /* bit position: 24 */
    /* 0x0000 */ unsigned long MemCommit : 1; /* bit position: 25 */
    /* 0x0000 */ unsigned long Graphics : 1; /* bit position: 26 */
    /* 0x0000 */ unsigned long Enclave : 1; /* bit position: 27 */
    /* 0x0000 */ unsigned long ShadowStack : 1; /* bit position: 28 */
    /* 0x0000 */ unsigned long PhysicalMemoryPfnsReferenced : 1; /* bit position: 29 */
  }; /* bitfield */
} MM_PRIVATE_VAD_FLAGS, *PMM_PRIVATE_VAD_FLAGS; /* size: 0x0004 */

typedef struct _MM_GRAPHICS_VAD_FLAGS
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned long Lock : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned long LockContended : 1; /* bit position: 1 */
    /* 0x0000 */ unsigned long DeleteInProgress : 1; /* bit position: 2 */
    /* 0x0000 */ unsigned long NoChange : 1; /* bit position: 3 */
    /* 0x0000 */ unsigned long VadType : 3; /* bit position: 4 */
    /* 0x0000 */ unsigned long Protection : 5; /* bit position: 7 */
    /* 0x0000 */ unsigned long PreferredNode : 7; /* bit position: 12 */
    /* 0x0000 */ unsigned long PageSize : 2; /* bit position: 19 */
    /* 0x0000 */ unsigned long PrivateMemoryAlwaysSet : 1; /* bit position: 21 */
    /* 0x0000 */ unsigned long WriteWatch : 1; /* bit position: 22 */
    /* 0x0000 */ unsigned long FixedLargePageSize : 1; /* bit position: 23 */
    /* 0x0000 */ unsigned long ZeroFillPagesOptional : 1; /* bit position: 24 */
    /* 0x0000 */ unsigned long MemCommit : 1; /* bit position: 25 */
    /* 0x0000 */ unsigned long GraphicsAlwaysSet : 1; /* bit position: 26 */
    /* 0x0000 */ unsigned long GraphicsUseCoherentBus : 1; /* bit position: 27 */
    /* 0x0000 */ unsigned long GraphicsNoCache : 1; /* bit position: 28 */
    /* 0x0000 */ unsigned long GraphicsPageProtection : 3; /* bit position: 29 */
  }; /* bitfield */
} MM_GRAPHICS_VAD_FLAGS, *PMM_GRAPHICS_VAD_FLAGS; /* size: 0x0004 */

typedef struct _MM_SHARED_VAD_FLAGS
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned long Lock : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned long LockContended : 1; /* bit position: 1 */
    /* 0x0000 */ unsigned long DeleteInProgress : 1; /* bit position: 2 */
    /* 0x0000 */ unsigned long NoChange : 1; /* bit position: 3 */
    /* 0x0000 */ unsigned long VadType : 3; /* bit position: 4 */
    /* 0x0000 */ unsigned long Protection : 5; /* bit position: 7 */
    /* 0x0000 */ unsigned long PreferredNode : 7; /* bit position: 12 */
    /* 0x0000 */ unsigned long PageSize : 2; /* bit position: 19 */
    /* 0x0000 */ unsigned long PrivateMemoryAlwaysClear : 1; /* bit position: 21 */
    /* 0x0000 */ unsigned long PrivateFixup : 1; /* bit position: 22 */
    /* 0x0000 */ unsigned long HotPatchState : 2; /* bit position: 23 */
  }; /* bitfield */
} MM_SHARED_VAD_FLAGS, *PMM_SHARED_VAD_FLAGS; /* size: 0x0004 */

typedef struct _MI_NODE_NUMBER_ZERO_BASED
{
  /* 0x0000 */ unsigned long ZeroBased;
} MI_NODE_NUMBER_ZERO_BASED, *PMI_NODE_NUMBER_ZERO_BASED; /* size: 0x0004 */

typedef struct _MI_SLAB_ALLOCATOR_CONTEXT
{
  /* 0x0000 */ struct _RTL_RB_TREE SlabTree;
  /* 0x0010 */ volatile long Lock;
  /* 0x0014 */ long Padding_123;
  /* 0x0018 */ struct _MI_PARTITION* Partition;
  struct
  {
    union
    {
      struct
      {
        /* 0x0020 */ struct _MI_SLAB_ALLOCATOR_ENTRY* AllocationHint;
        /* 0x0028 */ struct _MI_SLAB_ALLOCATOR_ENTRY* FreeHint;
      } /* size: 0x0010 */ NonIdentity;
      struct
      {
        /* 0x0020 */ struct _MI_SLAB_ALLOCATOR_ENTRY** AllocationHints;
        /* 0x0028 */ struct _MI_SLAB_ALLOCATOR_ENTRY** FreeHints;
      } /* size: 0x0010 */ Identity;
    }; /* size: 0x0010 */
    /* 0x0030 */ struct _MI_SLAB_ALLOCATOR_ENTRY* DefragSourceEntry;
    /* 0x0038 */ struct _MI_SLAB_ALLOCATOR_ENTRY* DefragTargetEntry;
  } /* size: 0x0020 */ Hints;
  /* 0x0040 */ void* StandbyPageCache;
  /* 0x0048 */ void* StandbyPageList;
  /* 0x0050 */ struct _MMPFNLIST* RepurposedStandbyPageList;
  /* 0x0058 */ struct _LIST_ENTRY* SlabListsByIdentity;
  /* 0x0060 */ unsigned __int64 FreePageCount;
  /* 0x0068 */ unsigned __int64 AvailablePagesGoal;
  /* 0x0070 */ unsigned __int64 ChargedPageCount;
  /* 0x0078 */ unsigned __int64 SlabEntryCount;
  /* 0x0080 */ enum _MI_SLAB_ALLOCATOR_TYPE Type;
  /* 0x0084 */ struct _MI_NODE_NUMBER_ZERO_BASED NumaNodeIndex;
  union
  {
    union
    {
      struct /* bitfield */
      {
        /* 0x0088 */ unsigned long EntryBecameEmpty : 1; /* bit position: 0 */
        /* 0x0088 */ unsigned long DemoteInProgress : 1; /* bit position: 1 */
        /* 0x0088 */ unsigned long PreferZeroedPages : 1; /* bit position: 2 */
        /* 0x0088 */ unsigned long ZeroOnFree : 1; /* bit position: 3 */
        /* 0x0088 */ unsigned long LargePageIndex : 2; /* bit position: 4 */
        /* 0x0088 */ unsigned long Spare : 26; /* bit position: 6 */
      }; /* bitfield */
      /* 0x0088 */ unsigned long AllFlags;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ Flags;
  /* 0x008c */ volatile long ReEvaluateAllocationHint;
  /* 0x0090 */ unsigned long SlabEntriesAllocated;
  /* 0x0094 */ unsigned long SlabEntriesDemoted;
  /* 0x0098 */ unsigned long SlabEntriesFailedFast;
  /* 0x009c */ unsigned long SlabEntriesFailedSlow;
  /* 0x00a0 */ unsigned long SlabPagesFreedNonZeroed;
  /* 0x00a4 */ unsigned long SlabPagesCrossIdentity;
  /* 0x00a8 */ unsigned __int64 LastReplenishTime;
  /* 0x00b0 */ unsigned __int64 LastFailureTime;
  /* 0x00b8 */ struct _WORK_QUEUE_ITEM ReplenishWorkItem;
  /* 0x00d8 */ struct _LIST_ENTRY ReplenishWaitList;
} MI_SLAB_ALLOCATOR_CONTEXT, *PMI_SLAB_ALLOCATOR_CONTEXT; /* size: 0x00e8 */

typedef struct _LUID
{
  /* 0x0000 */ unsigned long LowPart;
  /* 0x0004 */ long HighPart;
} LUID, *PLUID; /* size: 0x0008 */

typedef struct _TOKEN_MANDATORY_POLICY
{
  /* 0x0000 */ unsigned long Policy;
} TOKEN_MANDATORY_POLICY, *PTOKEN_MANDATORY_POLICY; /* size: 0x0004 */

typedef struct _TOKEN_ACCESS_INFORMATION
{
  /* 0x0000 */ struct _SID_AND_ATTRIBUTES_HASH* SidHash;
  /* 0x0008 */ struct _SID_AND_ATTRIBUTES_HASH* RestrictedSidHash;
  /* 0x0010 */ struct _TOKEN_PRIVILEGES* Privileges;
  /* 0x0018 */ struct _LUID AuthenticationId;
  /* 0x0020 */ enum _TOKEN_TYPE TokenType;
  /* 0x0024 */ enum _SECURITY_IMPERSONATION_LEVEL ImpersonationLevel;
  /* 0x0028 */ struct _TOKEN_MANDATORY_POLICY MandatoryPolicy;
  /* 0x002c */ unsigned long Flags;
  /* 0x0030 */ unsigned long AppContainerNumber;
  /* 0x0034 */ long Padding_124;
  /* 0x0038 */ void* PackageSid;
  /* 0x0040 */ struct _SID_AND_ATTRIBUTES_HASH* CapabilitiesHash;
  /* 0x0048 */ void* TrustLevelSid;
  /* 0x0050 */ void* SecurityAttributes;
} TOKEN_ACCESS_INFORMATION, *PTOKEN_ACCESS_INFORMATION; /* size: 0x0058 */

typedef enum _WNF_SUBSCRIPTION_STATE
{
  WNF_SUB_STATE_QUIESCENT = 0,
  WNF_SUB_STATE_READY_TO_DELIVER = 1,
  WNF_SUB_STATE_IN_DELIVERY = 2,
  WNF_SUB_STATE_RETRY = 3,
} WNF_SUBSCRIPTION_STATE, *PWNF_SUBSCRIPTION_STATE;

typedef enum _KCLOCK_TIMER_DEADLINE_TYPE
{
  KClockTimerKTimerExpirationNonHr = 0,
  KClockTimerKTimerExpirationPseudoHr = 1,
  KClockTimerKTimer2ExpirationHr = 2,
  KClockTimerKTimersMax = 2,
  KClockTimerQuantumEnd = 3,
  KClockTimerGroupSchedulingGenerationEnd = 4,
  KClockTimerIdlePromotion = 5,
  KClockTimerBamQosHysteresisEnd = 6,
  KClockTimerMax = 7,
} KCLOCK_TIMER_DEADLINE_TYPE, *PKCLOCK_TIMER_DEADLINE_TYPE;

typedef struct _PEBS_DS_SAVE_AREA32
{
  /* 0x0000 */ unsigned long BtsBufferBase;
  /* 0x0004 */ unsigned long BtsIndex;
  /* 0x0008 */ unsigned long BtsAbsoluteMaximum;
  /* 0x000c */ unsigned long BtsInterruptThreshold;
  /* 0x0010 */ unsigned long PebsBufferBase;
  /* 0x0014 */ unsigned long PebsIndex;
  /* 0x0018 */ unsigned long PebsAbsoluteMaximum;
  /* 0x001c */ unsigned long PebsInterruptThreshold;
  /* 0x0020 */ unsigned __int64 PebsGpCounterReset[8];
  /* 0x0060 */ unsigned __int64 PebsFixedCounterReset[4];
} PEBS_DS_SAVE_AREA32, *PPEBS_DS_SAVE_AREA32; /* size: 0x0080 */

typedef struct _PEBS_DS_SAVE_AREA64
{
  /* 0x0000 */ unsigned __int64 BtsBufferBase;
  /* 0x0008 */ unsigned __int64 BtsIndex;
  /* 0x0010 */ unsigned __int64 BtsAbsoluteMaximum;
  /* 0x0018 */ unsigned __int64 BtsInterruptThreshold;
  /* 0x0020 */ unsigned __int64 PebsBufferBase;
  /* 0x0028 */ unsigned __int64 PebsIndex;
  /* 0x0030 */ unsigned __int64 PebsAbsoluteMaximum;
  /* 0x0038 */ unsigned __int64 PebsInterruptThreshold;
  /* 0x0040 */ unsigned __int64 PebsGpCounterReset[8];
  /* 0x0080 */ unsigned __int64 PebsFixedCounterReset[4];
} PEBS_DS_SAVE_AREA64, *PPEBS_DS_SAVE_AREA64; /* size: 0x00a0 */

typedef struct _PEBS_DS_SAVE_AREA
{
  union
  {
    /* 0x0000 */ struct _PEBS_DS_SAVE_AREA32 As32Bit;
    /* 0x0000 */ struct _PEBS_DS_SAVE_AREA64 As64Bit;
  }; /* size: 0x00a0 */
} PEBS_DS_SAVE_AREA, *PPEBS_DS_SAVE_AREA; /* size: 0x00a0 */

typedef struct _PROCESSOR_PROFILE_CONTROL_AREA
{
  union
  {
    /* 0x0000 */ struct _PEBS_DS_SAVE_AREA PebsDsSaveArea;
    struct
    {
      /* 0x0000 */ void* RawBuffer;
      /* 0x0008 */ long __PADDING__[38];
    }; /* size: 0x00a0 */
  }; /* size: 0x00a0 */
} PROCESSOR_PROFILE_CONTROL_AREA, *PPROCESSOR_PROFILE_CONTROL_AREA; /* size: 0x00a0 */

typedef enum _MI_IO_PFN_TYPE
{
  MiIoPfnProbes = 0,
  MiIoPfnMaps = 1,
  MiMaximumIoPfnType = 2,
} MI_IO_PFN_TYPE, *PMI_IO_PFN_TYPE;

typedef union _XPF_MC_BANK_FLAGS
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned char ClearOnInitializationRW : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned char ControlDataRW : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned char Reserved : 6; /* bit position: 2 */
    }; /* bitfield */
    /* 0x0000 */ unsigned char AsUCHAR;
  }; /* size: 0x0001 */
} XPF_MC_BANK_FLAGS, *PXPF_MC_BANK_FLAGS; /* size: 0x0001 */

typedef enum _IO_RATE_CONTROL_TYPE
{
  IoRateControlTypeCapMin = 0,
  IoRateControlTypeIopsCap = 0,
  IoRateControlTypeBandwidthCap = 1,
  IoRateControlTypeTimePercentCap = 2,
  IoRateControlTypeCapMax = 2,
  IoRateControlTypeReservationMin = 3,
  IoRateControlTypeIopsReservation = 3,
  IoRateControlTypeBandwidthReservation = 4,
  IoRateControlTypeTimePercentReservation = 5,
  IoRateControlTypeReservationMax = 5,
  IoRateControlTypeCriticalReservationMin = 6,
  IoRateControlTypeIopsCriticalReservation = 6,
  IoRateControlTypeBandwidthCriticalReservation = 7,
  IoRateControlTypeTimePercentCriticalReservation = 8,
  IoRateControlTypeCriticalReservationMax = 8,
  IoRateControlTypeSoftCapMin = 9,
  IoRateControlTypeIopsSoftCap = 9,
  IoRateControlTypeBandwidthSoftCap = 10,
  IoRateControlTypeTimePercentSoftCap = 11,
  IoRateControlTypeSoftCapMax = 11,
  IoRateControlTypeLimitExcessNotifyMin = 12,
  IoRateControlTypeIopsLimitExcessNotify = 12,
  IoRateControlTypeBandwidthLimitExcessNotify = 13,
  IoRateControlTypeTimePercentLimitExcessNotify = 14,
  IoRateControlTypeLimitExcessNotifyMax = 14,
  IoRateControlTypeMax = 15,
} IO_RATE_CONTROL_TYPE, *PIO_RATE_CONTROL_TYPE;

typedef struct _DBGKD_LOAD_SYMBOLS64
{
  /* 0x0000 */ unsigned long PathNameLength;
  /* 0x0004 */ long Padding_125;
  /* 0x0008 */ unsigned __int64 BaseOfDll;
  /* 0x0010 */ unsigned __int64 ProcessId;
  /* 0x0018 */ unsigned long CheckSum;
  /* 0x001c */ unsigned long SizeOfImage;
  /* 0x0020 */ unsigned char UnloadSymbols;
  /* 0x0021 */ char __PADDING__[7];
} DBGKD_LOAD_SYMBOLS64, *PDBGKD_LOAD_SYMBOLS64; /* size: 0x0028 */

typedef enum _JOBOBJECTINFOCLASS
{
  JobObjectBasicAccountingInformation = 1,
  JobObjectBasicLimitInformation = 2,
  JobObjectBasicProcessIdList = 3,
  JobObjectBasicUIRestrictions = 4,
  JobObjectSecurityLimitInformation = 5,
  JobObjectEndOfJobTimeInformation = 6,
  JobObjectAssociateCompletionPortInformation = 7,
  JobObjectBasicAndIoAccountingInformation = 8,
  JobObjectExtendedLimitInformation = 9,
  JobObjectJobSetInformation = 10,
  JobObjectGroupInformation = 11,
  JobObjectNotificationLimitInformation = 12,
  JobObjectLimitViolationInformation = 13,
  JobObjectGroupInformationEx = 14,
  JobObjectCpuRateControlInformation = 15,
  JobObjectCompletionFilter = 16,
  JobObjectCompletionCounter = 17,
  JobObjectFreezeInformation = 18,
  JobObjectExtendedAccountingInformation = 19,
  JobObjectWakeInformation = 20,
  JobObjectBackgroundInformation = 21,
  JobObjectSchedulingRankBiasInformation = 22,
  JobObjectTimerVirtualizationInformation = 23,
  JobObjectCycleTimeNotification = 24,
  JobObjectClearEvent = 25,
  JobObjectInterferenceInformation = 26,
  JobObjectClearPeakJobMemoryUsed = 27,
  JobObjectMemoryUsageInformation = 28,
  JobObjectSharedCommit = 29,
  JobObjectContainerId = 30,
  JobObjectIoRateControlInformation = 31,
  JobObjectSiloRootDirectory = 37,
  JobObjectServerSiloBasicInformation = 38,
  JobObjectServerSiloUserSharedData = 39,
  JobObjectServerSiloInitialize = 40,
  JobObjectServerSiloRunningState = 41,
  JobObjectIoAttribution = 42,
  JobObjectMemoryPartitionInformation = 43,
  JobObjectContainerTelemetryId = 44,
  JobObjectSiloSystemRoot = 45,
  JobObjectEnergyTrackingState = 46,
  JobObjectThreadImpersonationInformation = 47,
  JobObjectIoPriorityLimit = 48,
  JobObjectPagePriorityLimit = 49,
  JobObjectServerSiloDiagnosticInformation = 50,
  JobObjectReserved1Information = 18,
  JobObjectReserved2Information = 19,
  JobObjectReserved3Information = 20,
  JobObjectReserved4Information = 21,
  JobObjectReserved5Information = 22,
  JobObjectReserved6Information = 23,
  JobObjectReserved7Information = 24,
  JobObjectReserved8Information = 25,
  JobObjectReserved9Information = 26,
  JobObjectReserved10Information = 27,
  JobObjectReserved11Information = 28,
  JobObjectReserved12Information = 29,
  JobObjectReserved13Information = 30,
  JobObjectReserved14Information = 31,
  JobObjectNetRateControlInformation = 32,
  JobObjectNotificationLimitInformation2 = 33,
  JobObjectLimitViolationInformation2 = 34,
  JobObjectCreateSilo = 35,
  JobObjectSiloBasicInformation = 36,
  JobObjectReserved15Information = 37,
  JobObjectReserved16Information = 38,
  JobObjectReserved17Information = 39,
  JobObjectReserved18Information = 40,
  JobObjectReserved19Information = 41,
  JobObjectReserved20Information = 42,
  JobObjectReserved21Information = 43,
  JobObjectReserved22Information = 44,
  JobObjectReserved23Information = 45,
  JobObjectReserved24Information = 46,
  JobObjectReserved25Information = 47,
  JobObjectReserved26Information = 48,
  JobObjectReserved27Information = 49,
  JobObjectReserved28Information = 50,
  JobObjectNetworkAccountingInformation = 51,
  MaxJobObjectInfoClass = 52,
} JOBOBJECTINFOCLASS, *PJOBOBJECTINFOCLASS;

typedef enum _OBJECT_INFORMATION_CLASS
{
  ObjectBasicInformation = 0,
  ObjectNameInformation = 1,
  ObjectTypeInformation = 2,
  ObjectTypesInformation = 3,
  ObjectHandleFlagInformation = 4,
  ObjectSessionInformation = 5,
  ObjectSessionObjectInformation = 6,
  MaxObjectInfoClass = 7,
} OBJECT_INFORMATION_CLASS, *POBJECT_INFORMATION_CLASS;

typedef enum _KE_WAKE_SOURCE_TYPE
{
  KeWakeSourceTypeSpuriousWake = 0,
  KeWakeSourceTypeSpuriousClock = 1,
  KeWakeSourceTypeSpuriousInterrupt = 2,
  KeWakeSourceTypeQueryFailure = 3,
  KeWakeSourceTypeAccountingFailure = 4,
  KeWakeSourceTypeNonIrTimer = 5,
  KeWakeSourceTypeDebugPoll = 6,
  KeWakeSourceTypeClockWatchdog = 7,
  KeWakeSourceTypeClockInternal = 8,
  KeWakeSourceTypeClockNotOwner = 9,
  KeWakeSourceTypeClockNotArmed = 10,
  KeWakeSourceTypeExTimer = 11,
  KeWakeSourceTypeStaticSourceMax = 11,
  KeWakeSourceTypeInterrupt = 128,
  KeWakeSourceTypeIRTimer = 129,
  KeWakeSourceTypeMax = 130,
} KE_WAKE_SOURCE_TYPE, *PKE_WAKE_SOURCE_TYPE;

typedef struct _CACHE_MANAGER_CALLBACK_FUNCTIONS
{
  /* 0x0000 */ void* AcquireForLazyWriteEx /* function */;
  /* 0x0008 */ void* ReleaseFromLazyWrite /* function */;
  /* 0x0010 */ void* AcquireForReadAhead /* function */;
  /* 0x0018 */ void* ReleaseFromReadAhead /* function */;
} CACHE_MANAGER_CALLBACK_FUNCTIONS, *PCACHE_MANAGER_CALLBACK_FUNCTIONS; /* size: 0x0020 */

enum PPM_IDLE_BUCKET_TIME_TYPE
{
  PpmIdleBucketTimeInQpc = 0,
  PpmIdleBucketTimeIn100ns = 1,
  PpmIdleBucketTimeMaximum = 2,
};

typedef enum _PROCESS_SECTION_TYPE
{
  ProcessSectionData = 0,
  ProcessSectionImage = 1,
  ProcessSectionImageNx = 2,
  ProcessSectionPagefileBacked = 3,
  ProcessSectionMax = 4,
} PROCESS_SECTION_TYPE, *PPROCESS_SECTION_TYPE;

typedef struct _WHEA_IPF_MCA_DESCRIPTOR
{
  /* 0x0000 */ unsigned short Type;
  /* 0x0002 */ unsigned char Enabled;
  /* 0x0003 */ unsigned char Reserved;
} WHEA_IPF_MCA_DESCRIPTOR, *PWHEA_IPF_MCA_DESCRIPTOR; /* size: 0x0004 */

typedef enum _POP_DIRECTED_DRIPS_PROBLEM_DEVICE_REASON
{
  DirectedDripsProblemDeviceReasonSpecialDevice = 0,
  DirectedDripsProblemDeviceReasonNoDfx = 1,
  DirectedDripsProblemDeviceReasonNoPs4 = 2,
  DirectedDripsProblemDeviceReasonNoPs4Root = 3,
  DirectedDripsProblemDeviceReasonComponentContraint = 4,
  DirectedDripsProblemDeviceReasonDfxFailure = 5,
  DirectedDripsProblemDeviceReasonPagingDevice = 6,
  DirectedDripsProblemDeviceReasonDebuggingDevice = 7,
  DirectedDripsProblemDeviceReasonDfxNotAllowed = 8,
  DirectedDripsProblemDeviceReasonDfxOptOut = 9,
  DirectedDripsProblemDeviceReasonMax = 10,
} POP_DIRECTED_DRIPS_PROBLEM_DEVICE_REASON, *PPOP_DIRECTED_DRIPS_PROBLEM_DEVICE_REASON;

enum FEATURE_CHANGE_TIME
{
  FEATURE_CHANGE_TIME_READ = 0,
  FEATURE_CHANGE_TIME_MODULE_RELOAD = 1,
  FEATURE_CHANGE_TIME_SESSION = 2,
  FEATURE_CHANGE_TIME_REBOOT = 3,
  FEATURE_CHANGE_TIME_USER_FLAG = 128,
};

typedef enum _EX_HEAP_TYPE
{
  ExHeapTypeNonPagedMin = 0,
  ExHeapTypeNonPaged = 0,
  ExHeapTypeNonPagedMax = 1,
  ExHeapTypeNonPagedNx = 1,
  ExHeapTypePagedMin = 2,
  ExHeapTypePaged = 2,
  ExHeapTypePagedMax = 3,
  ExHeapTypeMmSt = 3,
  ExHeapTypeMax = 4,
  ExHeapTypeSpecialMax = 4,
} EX_HEAP_TYPE, *PEX_HEAP_TYPE;

typedef enum _OB_OPEN_REASON
{
  ObCreateHandle = 0,
  ObOpenHandle = 1,
  ObDuplicateHandle = 2,
  ObInheritHandle = 3,
  ObMaxOpenReason = 4,
} OB_OPEN_REASON, *POB_OPEN_REASON;

typedef enum _SECURITY_OPERATION_CODE
{
  SetSecurityDescriptor = 0,
  QuerySecurityDescriptor = 1,
  DeleteSecurityDescriptor = 2,
  AssignSecurityDescriptor = 3,
} SECURITY_OPERATION_CODE, *PSECURITY_OPERATION_CODE;

typedef enum _RTL_FEATURE_ENABLED_STATE_OPTIONS
{
  FeatureEnabledStateOptionsNone = 0,
  FeatureEnabledStateOptionsWexpConfig = 1,
} RTL_FEATURE_ENABLED_STATE_OPTIONS, *PRTL_FEATURE_ENABLED_STATE_OPTIONS;

typedef enum _POP_PEP_NOTIFY_DEVICE_DSTATE_REASON
{
  PepNotifyDeviceDStateReasonNone = 0,
  PepNotifyDeviceDStateReasonSystemTransition = 1,
  PepNotifyDeviceDStateReasonDfx = 2,
  PepNotifyDeviceDStateReasonMax = 3,
} POP_PEP_NOTIFY_DEVICE_DSTATE_REASON, *PPOP_PEP_NOTIFY_DEVICE_DSTATE_REASON;

typedef enum _POP_IRP_WATCHDOG_STATE
{
  IrpWatchdogStateDisabled = 0,
  IrpWatchdogStateEnabled = 1,
  IrpWatchdogStateCompleted = 2,
} POP_IRP_WATCHDOG_STATE, *PPOP_IRP_WATCHDOG_STATE;

typedef enum _DEVPROP_OPERATOR
{
  DEVPROP_OPERATOR_MODIFIER_NOT = 0x10000,
  DEVPROP_OPERATOR_MODIFIER_IGNORE_CASE = 0x20000,
  DEVPROP_OPERATOR_NONE = 0,
  DEVPROP_OPERATOR_EXISTS = 1,
  DEVPROP_OPERATOR_NOT_EXISTS = 0x10001,
  DEVPROP_OPERATOR_EQUALS = 2,
  DEVPROP_OPERATOR_NOT_EQUALS = 0x10002,
  DEVPROP_OPERATOR_GREATER_THAN = 3,
  DEVPROP_OPERATOR_LESS_THAN = 4,
  DEVPROP_OPERATOR_GREATER_THAN_EQUALS = 5,
  DEVPROP_OPERATOR_LESS_THAN_EQUALS = 6,
  DEVPROP_OPERATOR_EQUALS_IGNORE_CASE = 0x20002,
  DEVPROP_OPERATOR_NOT_EQUALS_IGNORE_CASE = 0x30002,
  DEVPROP_OPERATOR_BITWISE_AND = 7,
  DEVPROP_OPERATOR_BITWISE_OR = 8,
  DEVPROP_OPERATOR_BEGINS_WITH = 9,
  DEVPROP_OPERATOR_ENDS_WITH = 10,
  DEVPROP_OPERATOR_CONTAINS = 11,
  DEVPROP_OPERATOR_BEGINS_WITH_IGNORE_CASE = 0x20009,
  DEVPROP_OPERATOR_ENDS_WITH_IGNORE_CASE = 0x2000a,
  DEVPROP_OPERATOR_CONTAINS_IGNORE_CASE = 0x2000b,
  DEVPROP_OPERATOR_LIST_CONTAINS = 4096,
  DEVPROP_OPERATOR_LIST_ELEMENT_BEGINS_WITH = 8192,
  DEVPROP_OPERATOR_LIST_ELEMENT_ENDS_WITH = 12288,
  DEVPROP_OPERATOR_LIST_ELEMENT_CONTAINS = 16384,
  DEVPROP_OPERATOR_LIST_CONTAINS_IGNORE_CASE = 0x21000,
  DEVPROP_OPERATOR_LIST_ELEMENT_BEGINS_WITH_IGNORE_CASE = 0x22000,
  DEVPROP_OPERATOR_LIST_ELEMENT_ENDS_WITH_IGNORE_CASE = 0x23000,
  DEVPROP_OPERATOR_LIST_ELEMENT_CONTAINS_IGNORE_CASE = 0x24000,
  DEVPROP_OPERATOR_AND_OPEN = 0x100000,
  DEVPROP_OPERATOR_AND_CLOSE = 0x200000,
  DEVPROP_OPERATOR_OR_OPEN = 0x300000,
  DEVPROP_OPERATOR_OR_CLOSE = 0x400000,
  DEVPROP_OPERATOR_NOT_OPEN = 0x500000,
  DEVPROP_OPERATOR_NOT_CLOSE = 0x600000,
  DEVPROP_OPERATOR_ARRAY_CONTAINS = 0x10000000,
  DEVPROP_OPERATOR_MASK_EVAL = 4095,
  DEVPROP_OPERATOR_MASK_LIST = 0xfffff000,
  DEVPROP_OPERATOR_MASK_MODIFIER = 0xf0000,
  DEVPROP_OPERATOR_MASK_NOT_LOGICAL = -267386881,
  DEVPROP_OPERATOR_MASK_LOGICAL = 0xff00000,
  DEVPROP_OPERATOR_MASK_ARRAY = -268435456,
} DEVPROP_OPERATOR, *PDEVPROP_OPERATOR;

typedef enum _OBP_LOOKUP_DIR_ENTRY_FLAGS
{
  OBP_LOOKUP_SEARCH_SHADOW = 1,
  OBP_LOOKUP_IS_SANDBOXED = 2,
  OBP_LOOKUP_IS_NOT_SANDBOXED = 4,
  OBP_LOOKUP_SANDBOX_COMPUTED = 6,
  OBP_LOOKUP_CASE_INSENSITIVE = 64,
} OBP_LOOKUP_DIR_ENTRY_FLAGS, *POBP_LOOKUP_DIR_ENTRY_FLAGS;

typedef struct _DBGKD_GET_INTERNAL_BREAKPOINT64
{
  /* 0x0000 */ unsigned __int64 BreakpointAddress;
  /* 0x0008 */ unsigned long Flags;
  /* 0x000c */ unsigned long Calls;
  /* 0x0010 */ unsigned long MaxCallsPerPeriod;
  /* 0x0014 */ unsigned long MinInstructions;
  /* 0x0018 */ unsigned long MaxInstructions;
  /* 0x001c */ unsigned long TotalInstructions;
} DBGKD_GET_INTERNAL_BREAKPOINT64, *PDBGKD_GET_INTERNAL_BREAKPOINT64; /* size: 0x0020 */

typedef enum _MI_ENGINE_TYPE
{
  MiEngineAccelerator = 0,
  MiEngineFastProcessor = 1,
  MiEngineSlowProcessor = 2,
  MiEngineMaximumTypes = 3,
} MI_ENGINE_TYPE, *PMI_ENGINE_TYPE;

typedef enum _KCLOCK_TIMER_ONE_SHOT_STATE
{
  KClockTimerOneShotUnarmed = 0,
  KClockTimerOneShotArmed = 1,
  KClockTimerOneShotRearmRequired = 2,
  KClockTimerOneShotInvalid = 3,
} KCLOCK_TIMER_ONE_SHOT_STATE, *PKCLOCK_TIMER_ONE_SHOT_STATE;

typedef enum _IOP_MC_BUFFER_ENTRY_FLAGS
{
  IOP_MCBF_UNLOCK = 1,
  IOP_MCBF_SIGNAL_RUNDOWN = 2,
  IOP_MCBF_CLEANED_UP = 4,
} IOP_MC_BUFFER_ENTRY_FLAGS, *PIOP_MC_BUFFER_ENTRY_FLAGS;

typedef enum _KWAIT_BLOCK_STATE
{
  WaitBlockBypassStart = 0,
  WaitBlockBypassComplete = 1,
  WaitBlockSuspendBypassStart = 2,
  WaitBlockSuspendBypassComplete = 3,
  WaitBlockActive = 4,
  WaitBlockInactive = 5,
  WaitBlockSuspended = 6,
  WaitBlockAllStates = 7,
} KWAIT_BLOCK_STATE, *PKWAIT_BLOCK_STATE;

typedef enum _VI_DEADLOCK_RESOURCE_TYPE
{
  VfDeadlockUnknown = 0,
  VfDeadlockMutex = 1,
  VfDeadlockMutexAbandoned = 2,
  VfDeadlockFastMutex = 3,
  VfDeadlockFastMutexUnsafe = 4,
  VfDeadlockSpinLock = 5,
  VfDeadlockInStackQueuedSpinLock = 6,
  VfDeadlockUnusedSpinLock = 7,
  VfDeadlockEresource = 8,
  VfDeadlockTypeMaximum = 9,
} VI_DEADLOCK_RESOURCE_TYPE, *PVI_DEADLOCK_RESOURCE_TYPE;

typedef struct _MMINPAGE_FLAGS
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned long GetExtents : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned long VmType : 4; /* bit position: 1 */
    /* 0x0000 */ unsigned long VaPrefetchReadBlock : 1; /* bit position: 5 */
    /* 0x0000 */ unsigned long CollidedFlowThrough : 1; /* bit position: 6 */
    /* 0x0000 */ unsigned long ForceCollisions : 1; /* bit position: 7 */
    /* 0x0000 */ unsigned long InPageExpanded : 1; /* bit position: 8 */
    /* 0x0000 */ unsigned long IssuedAtLowPriority : 1; /* bit position: 9 */
    /* 0x0000 */ unsigned long FaultFromStore : 1; /* bit position: 10 */
    /* 0x0000 */ unsigned long PagePriority : 3; /* bit position: 11 */
    /* 0x0000 */ unsigned long ClusteredPagePriority : 3; /* bit position: 14 */
    /* 0x0000 */ unsigned long MakeClusterValid : 1; /* bit position: 17 */
    /* 0x0000 */ unsigned long ZeroLastPage : 1; /* bit position: 18 */
    /* 0x0000 */ unsigned long UserFault : 1; /* bit position: 19 */
    /* 0x0000 */ unsigned long StandbyProtectionNeeded : 1; /* bit position: 20 */
    /* 0x0000 */ unsigned long PteChanged : 1; /* bit position: 21 */
    /* 0x0000 */ unsigned long PageFileFault : 1; /* bit position: 22 */
    /* 0x0000 */ unsigned long PageFilePageHashActive : 1; /* bit position: 23 */
    /* 0x0000 */ unsigned long CoalescedIo : 1; /* bit position: 24 */
    /* 0x0000 */ unsigned long VmLockNotNeeded : 1; /* bit position: 25 */
    /* 0x0000 */ unsigned long PartitionReferenced : 1; /* bit position: 26 */
    /* 0x0000 */ unsigned long Spare0 : 1; /* bit position: 27 */
    /* 0x0000 */ unsigned long Spare1 : 4; /* bit position: 28 */
  }; /* bitfield */
} MMINPAGE_FLAGS, *PMMINPAGE_FLAGS; /* size: 0x0004 */

typedef enum _RTL_FEATURE_CONFIGURATION_PRIORITY
{
  FeatureConfigurationPriorityImageDefault = 0,
  FeatureConfigurationPriorityEKB = 1,
  FeatureConfigurationPrioritySafeguard = 2,
  FeatureConfigurationPriorityPersistent = 2,
  FeatureConfigurationPriorityReserved3 = 3,
  FeatureConfigurationPriorityService = 4,
  FeatureConfigurationPriorityReserved5 = 5,
  FeatureConfigurationPriorityDynamic = 6,
  FeatureConfigurationPriorityReserved7 = 7,
  FeatureConfigurationPriorityUser = 8,
  FeatureConfigurationPrioritySecurity = 9,
  FeatureConfigurationPriorityUserPolicy = 10,
  FeatureConfigurationPriorityReserved11 = 11,
  FeatureConfigurationPriorityTest = 12,
  FeatureConfigurationPriorityReserved13 = 13,
  FeatureConfigurationPriorityReserved14 = 14,
  FeatureConfigurationPriorityImageOverride = 15,
  FeatureConfigurationPriorityMax = 15,
} RTL_FEATURE_CONFIGURATION_PRIORITY, *PRTL_FEATURE_CONFIGURATION_PRIORITY;

typedef struct _PO_DEVICE_NOTIFY
{
  /* 0x0000 */ struct _LIST_ENTRY Link;
  /* 0x0010 */ struct _LIST_ENTRY PowerChildren;
  /* 0x0020 */ struct _LIST_ENTRY PowerParents;
  /* 0x0030 */ struct _DEVICE_OBJECT* TargetDevice;
  /* 0x0038 */ unsigned char OrderLevel;
  /* 0x0039 */ char Padding_126[7];
  /* 0x0040 */ struct _DEVICE_OBJECT* DeviceObject;
  /* 0x0048 */ wchar_t* DeviceName;
  /* 0x0050 */ wchar_t* DriverName;
  /* 0x0058 */ unsigned long ChildCount;
  /* 0x005c */ unsigned long ActiveChild;
  /* 0x0060 */ unsigned long ParentCount;
  /* 0x0064 */ unsigned long ActiveParent;
} PO_DEVICE_NOTIFY, *PPO_DEVICE_NOTIFY; /* size: 0x0068 */

typedef enum _MI_ALTERNATE_LOCK_VA_TYPE
{
  AlternateLockVaTypeSystemPtes = 0,
  AlternateLockVaTypeNonPagedPool = 1,
  AlternateLockVaTypeUser = 2,
  AlternateLockVaTypeSystem = 3,
  AlternateLockVaTypeMaximum = 4,
} MI_ALTERNATE_LOCK_VA_TYPE, *PMI_ALTERNATE_LOCK_VA_TYPE;

typedef enum _POP_SLEEP_CHECKPOINT
{
  PopSleepCheckpointInvalid = 0,
  PopSleepCheckpointPowerTransitionStart = 1,
  PopSleepCheckpointSuspendAppsBefore = 2,
  PopSleepCheckpointSuspendAppsAfter = 3,
  PopSleepCheckpointSuspendServicesBefore = 4,
  PopSleepCheckpointSuspendServicesAfter = 5,
  PopSleepCheckpointNotifySuperfetchBefore = 6,
  PopSleepCheckpointNotifySuperfetchAfter = 7,
  PopSleepCheckpointNotifyCallbacksBefore = 8,
  PopSleepCheckpointNotifyCallbacksAfter = 9,
  PopSleepCheckpointSleepTransactionCommitted = 10,
  PopSleepCheckpointQueryDriversBefore = 11,
  PopSleepCheckpointQueryDriversAfter = 12,
  PopSleepCheckpointAllocatingHiberContext = 13,
  PopSleepCheckpointSuspendDriversBefore = 14,
  PopSleepCheckpointPreSleepNotification = 16,
  PopSleepCheckpointInterruptsDisabledBegin = 17,
  PopSleepCheckpointInvokeHandlerBefore = 18,
  PopSleepCheckpointSaveHiberContextBegin = 19,
  PopSleepCheckpointInitializeDumpStackFailed = 20,
  PopSleepCheckpointHiberWriteFailed = 21,
  PopSleepCheckpointHiberFileTooSmall = 22,
  PopSleepCheckpointSaveHiberContextFailed = 23,
  PopSleepCheckpointSaveHiberContextEnd = 24,
  PopSleepCheckpointHiberKernelHandoff = 25,
  PopSleepCheckpointInvokeHandlerAfter = 26,
  PopSleepCheckpointReadHiberfileBefore = 27,
  PopSleepCheckpointInitializeDumpStackForReadFailed = 28,
  PopSleepCheckpointHiberReadFailed = 29,
  PopSleepCheckpointChecksumFailure = 30,
  PopSleepCheckpointDecompressionFailed = 31,
  PopSleepCheckpointReadHiberfileAfter = 32,
  PopSleepCheckpointInterruptsDisabledEnd = 33,
  PopSleepCheckpointWakeDriversAfter = 36,
  PopSleepCheckpointResumeAppsBefore = 37,
  PopSleepCheckpointResumeAppsAfter = 38,
  PopSleepCheckpointResumeServicesBefore = 39,
  PopSleepCheckpointResumeServicesAfter = 40,
  PopSleepCheckpointPowerTransitionEnd = 41,
  PopSleepCheckpointAllocatingHiberContextNoFileObject = 42,
  PopSleepCheckpointAllocatingHiberContextGetDumpStackFailed = 43,
  PopSleepCheckpointAllocatingHiberContextLoadResumeContextFailed = 44,
  PopSleepCheckpointAllocatingHiberContextBcdOpenFailed = 45,
  PopSleepCheckpointAllocatingHiberContextEstablishResumeObjectFailed = 46,
  PopSleepCheckpointAllocatingHiberContextSetPendingResumeFailed = 47,
  PopSleepCheckpointAllocatingHiberContextAllocateIoPagesPagesFailed = 48,
  PopSleepCheckpointAllocatingHiberContextAdapterBuffersInvalid1 = 49,
  PopSleepCheckpointAllocatingHiberContextAllocateDumpPagesFailed = 50,
  PopSleepCheckpointAllocatingHiberContextAdapterBuffersInvalid2 = 51,
  PopSleepCheckpointAllocatingHiberContextUnHibernatedMdlFailed = 52,
  PopSleepCheckpointAllocatingHiberContextSecureResourcesFailed = 53,
  PopSleepCheckpointPrepareSleepBefore = 54,
  PopSleepCheckpointPrepareSleepAfter = 55,
  PopSleepCheckpointBootstatAvailable = 56,
  PopSleepCheckpointMax = 57,
} POP_SLEEP_CHECKPOINT, *PPOP_SLEEP_CHECKPOINT;

typedef enum _CM_HIVE_CACHE_EVENT_TYPE
{
  OplockEventOnPrimary = 0,
  OplockEventOnLog1 = 1,
  OplockEventOnLog2 = 2,
  OplockBreakThreadKillEvent = 3,
  HiveCachePopulateFinished = 4,
  HiveCachePopulateExit = 5,
  OplockBreakThreadWaitEventsMax = 4,
  HiveCacheRelatedEventsMax = 6,
} CM_HIVE_CACHE_EVENT_TYPE, *PCM_HIVE_CACHE_EVENT_TYPE;

typedef struct _PROC_PERF_LOAD
{
  /* 0x0000 */ unsigned char BusyPercentage;
  /* 0x0001 */ unsigned char FrequencyPercentage;
} PROC_PERF_LOAD, *PPROC_PERF_LOAD; /* size: 0x0002 */

typedef union _WHEA_REVISION
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned char MinorRevision;
      /* 0x0001 */ unsigned char MajorRevision;
    }; /* size: 0x0002 */
    /* 0x0000 */ unsigned short AsUSHORT;
  }; /* size: 0x0002 */
} WHEA_REVISION, *PWHEA_REVISION; /* size: 0x0002 */

typedef union _WHEA_ERROR_RECORD_HEADER_VALIDBITS
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long PlatformId : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned long Timestamp : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned long PartitionId : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned long Reserved : 29; /* bit position: 3 */
    }; /* bitfield */
    /* 0x0000 */ unsigned long AsULONG;
  }; /* size: 0x0004 */
} WHEA_ERROR_RECORD_HEADER_VALIDBITS, *PWHEA_ERROR_RECORD_HEADER_VALIDBITS; /* size: 0x0004 */

typedef union _WHEA_TIMESTAMP
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned __int64 Seconds : 8; /* bit position: 0 */
      /* 0x0000 */ unsigned __int64 Minutes : 8; /* bit position: 8 */
      /* 0x0000 */ unsigned __int64 Hours : 8; /* bit position: 16 */
      /* 0x0000 */ unsigned __int64 Precise : 1; /* bit position: 24 */
      /* 0x0000 */ unsigned __int64 Reserved : 7; /* bit position: 25 */
      /* 0x0000 */ unsigned __int64 Day : 8; /* bit position: 32 */
      /* 0x0000 */ unsigned __int64 Month : 8; /* bit position: 40 */
      /* 0x0000 */ unsigned __int64 Year : 8; /* bit position: 48 */
      /* 0x0000 */ unsigned __int64 Century : 8; /* bit position: 56 */
    }; /* bitfield */
    /* 0x0000 */ union _LARGE_INTEGER AsLARGE_INTEGER;
  }; /* size: 0x0008 */
} WHEA_TIMESTAMP, *PWHEA_TIMESTAMP; /* size: 0x0008 */

typedef union _WHEA_ERROR_RECORD_HEADER_FLAGS
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long Recovered : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned long PreviousError : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned long Simulated : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned long DeviceDriver : 1; /* bit position: 3 */
      /* 0x0000 */ unsigned long CriticalEvent : 1; /* bit position: 4 */
      /* 0x0000 */ unsigned long PersistPfn : 1; /* bit position: 5 */
      /* 0x0000 */ unsigned long SectionsTruncated : 1; /* bit position: 6 */
      /* 0x0000 */ unsigned long RecoveryInProgress : 1; /* bit position: 7 */
      /* 0x0000 */ unsigned long Throttle : 1; /* bit position: 8 */
      /* 0x0000 */ unsigned long Reserved : 23; /* bit position: 9 */
    }; /* bitfield */
    /* 0x0000 */ unsigned long AsULONG;
  }; /* size: 0x0004 */
} WHEA_ERROR_RECORD_HEADER_FLAGS, *PWHEA_ERROR_RECORD_HEADER_FLAGS; /* size: 0x0004 */

typedef union _WHEA_PERSISTENCE_INFO
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned __int64 Signature : 16; /* bit position: 0 */
      /* 0x0000 */ unsigned __int64 Length : 24; /* bit position: 16 */
      /* 0x0000 */ unsigned __int64 Identifier : 16; /* bit position: 40 */
      /* 0x0000 */ unsigned __int64 Attributes : 2; /* bit position: 56 */
      /* 0x0000 */ unsigned __int64 DoNotLog : 1; /* bit position: 58 */
      /* 0x0000 */ unsigned __int64 Reserved : 5; /* bit position: 59 */
    }; /* bitfield */
    /* 0x0000 */ unsigned __int64 AsULONGLONG;
  }; /* size: 0x0008 */
} WHEA_PERSISTENCE_INFO, *PWHEA_PERSISTENCE_INFO; /* size: 0x0008 */

typedef struct _WHEA_ERROR_RECORD_HEADER
{
  /* 0x0000 */ unsigned long Signature;
  /* 0x0004 */ union _WHEA_REVISION Revision;
  /* 0x0006 */ unsigned long SignatureEnd;
  /* 0x000a */ unsigned short SectionCount;
  /* 0x000c */ enum _WHEA_ERROR_SEVERITY Severity;
  /* 0x0010 */ union _WHEA_ERROR_RECORD_HEADER_VALIDBITS ValidBits;
  /* 0x0014 */ unsigned long Length;
  /* 0x0018 */ union _WHEA_TIMESTAMP Timestamp;
  /* 0x0020 */ struct _GUID PlatformId;
  /* 0x0030 */ struct _GUID PartitionId;
  /* 0x0040 */ struct _GUID CreatorId;
  /* 0x0050 */ struct _GUID NotifyType;
  /* 0x0060 */ unsigned __int64 RecordId;
  /* 0x0068 */ union _WHEA_ERROR_RECORD_HEADER_FLAGS Flags;
  /* 0x006c */ union _WHEA_PERSISTENCE_INFO PersistenceInfo;
  union
  {
    struct
    {
      /* 0x0074 */ unsigned long OsBuildNumber;
      /* 0x0078 */ unsigned char Reserved2[8];
    }; /* size: 0x000c */
    /* 0x0074 */ unsigned char Reserved[12];
  }; /* size: 0x000c */
} WHEA_ERROR_RECORD_HEADER, *PWHEA_ERROR_RECORD_HEADER; /* size: 0x0080 */

enum PDC_CS_PHASE
{
  PdcNoCsPhase = 0,
  PdcConnectionPhase = 1,
  PdcShellPhase = 2,
  PdcPlmPhase = 3,
  PdcMaintenancePhase = 4,
  PdcDamPhase = 5,
  PdcLowPowerPhase = 6,
  PdcResiliencyNotificationPhase = 7,
  PdcResiliencyPhase = 8,
  PdcInvalidPhase = 9,
  PdcMaxPhase = 9,
};

typedef enum _MI_PAGELIST_LOCK_TYPES
{
  MiPageListPreviousGlobal = 0,
  MiPageListNextGlobal = 1,
  MiPageListPreviousSecondary = 2,
  MiPageListNextSecondary = 3,
  MiPageListPageMaximum = 4,
} MI_PAGELIST_LOCK_TYPES, *PMI_PAGELIST_LOCK_TYPES;

typedef enum _ARBITER_RESULT
{
  ArbiterResultUndefined = -1,
  ArbiterResultSuccess = 0,
  ArbiterResultExternalConflict = 1,
  ArbiterResultNullRequest = 2,
} ARBITER_RESULT, *PARBITER_RESULT;

enum MI_NEXT_PTE_ACTION
{
  NextPteToTrim = 0,
  NextPteToAge = 1,
  NextPteToAccessClear = 2,
  NextPteMaximum = 3,
};

typedef union _WHEA_NOTIFICATION_FLAGS
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned short PollIntervalRW : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned short SwitchToPollingThresholdRW : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned short SwitchToPollingWindowRW : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned short ErrorThresholdRW : 1; /* bit position: 3 */
      /* 0x0000 */ unsigned short ErrorThresholdWindowRW : 1; /* bit position: 4 */
      /* 0x0000 */ unsigned short Reserved : 11; /* bit position: 5 */
    }; /* bitfield */
    /* 0x0000 */ unsigned short AsUSHORT;
  }; /* size: 0x0002 */
} WHEA_NOTIFICATION_FLAGS, *PWHEA_NOTIFICATION_FLAGS; /* size: 0x0002 */

typedef enum _MI_FILE_EXTENT_TYPES
{
  MiExtentCopyImage = 0,
  MiExtentCopyData = 1,
  MiExtentCopyMaximum = 2,
} MI_FILE_EXTENT_TYPES, *PMI_FILE_EXTENT_TYPES;

typedef enum _PROCESS_TERMINATE_REQUEST_REASON
{
  ProcessTerminateRequestReasonNone = 0,
  ProcessTerminateCommitFail = 1,
  ProcessTerminateWriteToExecuteMemory = 2,
  ProcessTerminateAttachedWriteToExecuteMemory = 3,
  ProcessTerminateRequestReasonMax = 4,
} PROCESS_TERMINATE_REQUEST_REASON, *PPROCESS_TERMINATE_REQUEST_REASON;

typedef struct _VF_AVL_TABLE
{
  /* 0x0000 */ struct _RTL_AVL_TABLE RtlTable;
  /* 0x0068 */ struct _VF_AVL_TREE_NODE* ReservedNode;
  /* 0x0070 */ void* NodeToFree;
  /* 0x0078 */ long Padding_127[2];
  /* 0x0080 */ volatile long Lock;
  /* 0x0084 */ long Padding_128;
  /* 0x0088 */ struct _KTHREAD* volatile ExclusiveOwnerThread;
  /* 0x0090 */ long __PADDING__[12];
} VF_AVL_TABLE, *PVF_AVL_TABLE; /* size: 0x00c0 */

typedef enum _FREQUENCY_QOS_BUCKET
{
  FrequencyQosBucketHigh = 0,
  FrequencyQosBucketLow = 1,
  FrequencyQosBucketTotal = 2,
  FrequencyQosBucketMax = 3,
} FREQUENCY_QOS_BUCKET, *PFREQUENCY_QOS_BUCKET;

typedef enum _VRF_RULE_CLASS_ID
{
  DifPluginSpecialPool = 0,
  DifPluginIrqlRuleClass = 1,
  DifPluginLowResourceSimulation = 2,
  DifPluginPoolTracking = 3,
  DifPluginIoRuleClass = 4,
  DifPluginDeadlock = 5,
