struct tagACTCTXA
{
  /* 0x0000 */ unsigned long cbSize;
  /* 0x0004 */ unsigned long dwFlags;
  /* 0x0008 */ const char* lpSource;
  /* 0x000c */ unsigned short wProcessorArchitecture;
  /* 0x000e */ unsigned short wLangId;
  /* 0x0010 */ const char* lpAssemblyDirectory;
  /* 0x0014 */ const char* lpResourceName;
  /* 0x0018 */ const char* lpApplicationName;
  /* 0x001c */ struct HINSTANCE__* hModule;
}; /* size: 0x0020 */

