struct AsyncIAdviseSink2Vtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* Begin_OnDataChange /* function */;
  /* 0x0020 */ void* Finish_OnDataChange /* function */;
  /* 0x0028 */ void* Begin_OnViewChange /* function */;
  /* 0x0030 */ void* Finish_OnViewChange /* function */;
  /* 0x0038 */ void* Begin_OnRename /* function */;
  /* 0x0040 */ void* Finish_OnRename /* function */;
  /* 0x0048 */ void* Begin_OnSave /* function */;
  /* 0x0050 */ void* Finish_OnSave /* function */;
  /* 0x0058 */ void* Begin_OnClose /* function */;
  /* 0x0060 */ void* Finish_OnClose /* function */;
  /* 0x0068 */ void* Begin_OnLinkSrcChange /* function */;
  /* 0x0070 */ void* Finish_OnLinkSrcChange /* function */;
}; /* size: 0x0078 */

