enum _TAG_UNNAMED_1;
enum _TAG_UNNAMED_2;
enum _TAG_UNNAMED_3;
enum _TAG_UNNAMED_4;
enum _TAG_UNNAMED_5;
enum _TAG_UNNAMED_6;
enum _TAG_UNNAMED_7;
enum _TAG_UNNAMED_8;
enum _TAG_UNNAMED_9;
enum _TAG_UNNAMED_10;
enum _TAG_UNNAMED_11;
struct <vc_attributes>::aggregatableAttribute;
enum <vc_attributes>::aggregatableAttribute::type_e;
struct <vc_attributes>::appobjectAttribute;
struct <vc_attributes>::async_uuidAttribute;
struct <vc_attributes>::atl::aggregatesAttribute;
struct <vc_attributes>::atl::com_interface_entryAttribute;
struct <vc_attributes>::atl::db_accessorAttribute;
struct <vc_attributes>::atl::db_columnAttribute;
struct <vc_attributes>::atl::db_commandAttribute;
struct <vc_attributes>::atl::db_paramAttribute;
struct <vc_attributes>::atl::db_sourceAttribute;
struct <vc_attributes>::atl::db_tableAttribute;
struct <vc_attributes>::atl::implements_categoryAttribute;
struct <vc_attributes>::atl::perf_counterAttribute;
struct <vc_attributes>::atl::perf_objectAttribute;
struct <vc_attributes>::atl::perfmonAttribute;
struct <vc_attributes>::atl::rdxAttribute;
struct <vc_attributes>::atl::registration_scriptAttribute;
struct <vc_attributes>::atl::request_handlerAttribute;
struct <vc_attributes>::atl::requires_categoryAttribute;
struct <vc_attributes>::atl::soap_handlerAttribute;
struct <vc_attributes>::atl::soap_headerAttribute;
struct <vc_attributes>::atl::soap_methodAttribute;
struct <vc_attributes>::atl::soap_namespaceAttribute;

struct tagTYPEDESC;
enum tagTYPEFLAGS;
enum tagTYPEKIND;
enum tagTYSPEC;
enum tagThreadingModel;
enum tagUASFLAGS;
struct tagUPDATELAYEREDWINDOWINFO;
enum tagURLTEMPLATE;
enum tagURLZONE;
enum tagUSERCLASSTYPE;
struct tagUSEROBJECTFLAGS;
struct tagVARDESC;
enum tagVARFLAGS;
struct tagVARIANT;
enum tagVARKIND;
enum tagVIEWSTATUS;
struct tagVS_FIXEDFILEINFO;
struct tagVersionedStream;
struct tagWCRANGE;
struct tagWIN16BITMAP;
struct tagWIN16METAFILEPICT;
struct tagWIN16RECT;
struct tagWINDOWINFO;
struct tagWINDOWPLACEMENT;
struct tagWINDOWPOS;
struct tagWNDCLASSA;
struct tagWNDCLASSEXA;
struct tagWNDCLASSEXW;
struct tagWNDCLASSW;
struct tagWTSSESSION_NOTIFICATION;
struct tagXAptAddRefData;
struct tagXAptCallback;
struct tagXAptQIData;
struct tagXAptReleaseData;
struct tagXCtxDisconnectData;
struct tagXCtxMarshalData;
struct tagXCtxQIData;
struct tagXCtxWrapperData;
struct tagXFORM;
enum tagXFORMCOORDS;
enum tagXMLEMEM_TYPE;
struct threadlocaleinfostruct;
struct threadmbcinfostruct;
struct tm;
class type_info;
struct val_context;
struct value_entA;
struct value_entW;

typedef enum _TAG_UNNAMED_1
{
  sfImage = 0,
  sfDbg = 1,
  sfPdb = 2,
  sfMpd = 3,
  sfMax = 4,
} TAG_UNNAMED_1, *PTAG_UNNAMED_1;

typedef enum _TAG_UNNAMED_2
{
  IMETHOD_FIRST = 3,
  IMETHOD_GetTypeInfoCount = 3,
  IMETHOD_GetTypeInfo = 4,
  IMETHOD_GetIDsOfNames = 5,
  IMETHOD_Invoke = 6,
  IMETHOD_DISPATCH_MAX = 7,
  IPARAM_Invoke_DispId = 0,
  IPARAM_Invoke_Iid = 1,
  IPARAM_Invoke_Lcid = 2,
  IPARAM_Invoke_WFlags = 3,
  IPARAM_Invoke_DispParams = 4,
  IPARAM_Invoke_PVarResult = 5,
  IPARAM_Invoke_PExcepInfo = 6,
  IPARAM_Invoke_PUArgErr = 7,
} TAG_UNNAMED_2, *PTAG_UNNAMED_2;

typedef enum _TAG_UNNAMED_3
{
  AUMGR_ALLLOCAL = 1,
  AUMGR_IUNKNOWN = 2,
  AUMGR_IMULTIQI = 3,
} TAG_UNNAMED_3, *PTAG_UNNAMED_3;

typedef enum _TAG_UNNAMED_4
{
  dliStartProcessing = 0,
  dliNotePreLoadLibrary = 1,
  dliNotePreGetProcAddress = 2,
  dliFailLoadLib = 3,
  dliFailGetProc = 4,
  dliNoteEndProcessing = 5,
} TAG_UNNAMED_4, *PTAG_UNNAMED_4;

typedef enum _TAG_UNNAMED_5
{
  WPP_TRACE_OPTIONS = 43,
} TAG_UNNAMED_5, *PTAG_UNNAMED_5;

typedef enum _TAG_UNNAMED_6
{
  QIC_STATICMARSHAL = 1,
  QIC_DISCONNECTED = 2,
  QIC_ASYNC = 4,
  QIC_WEAKCLIENT = 8,
  QIC_BEGINCALLED = 16,
} TAG_UNNAMED_6, *PTAG_UNNAMED_6;

typedef enum _TAG_UNNAMED_7
{
  WPP_VER_WIN2K_CB_FORWARD_PTR = 1,
  WPP_VER_WHISTLER_CB_FORWARD_PTR = 2,
  WPP_VER_LH_CB_FORWARD_PTR = 3,
} TAG_UNNAMED_7, *PTAG_UNNAMED_7;

typedef enum _TAG_UNNAMED_8
{
  RIFFLG_HASCOUNTERPART = 1,
  RIFFLG_HASCLSID = 2,
} TAG_UNNAMED_8, *PTAG_UNNAMED_8;

typedef enum _TAG_UNNAMED_9
{
  AVT_OSVERSIONINFO = 1,
  AVT_PATCHINFO = 2,
} TAG_UNNAMED_9, *PTAG_UNNAMED_9;

typedef enum _TAG_UNNAMED_10
{
  hdBase = 0,
  hdSym = 1,
  hdSrc = 2,
  hdMax = 3,
} TAG_UNNAMED_10, *PTAG_UNNAMED_10;

typedef enum _TAG_UNNAMED_11
{
  sevInfo = 0,
  sevProblem = 1,
  sevAttn = 2,
  sevFatal = 3,
  sevMax = 4,
} TAG_UNNAMED_11, *PTAG_UNNAMED_11;

struct <vc_attributes>::aggregatableAttribute
{
  /* 0x0000 */ enum <vc_attributes>::aggregatableAttribute::type_e type;
}; /* size: 0x0004 */

enum <vc_attributes>::aggregatableAttribute::type_e
{
  never = 0,
  allowed = 1,
  always = 2,
};

struct <vc_attributes>::appobjectAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::async_uuidAttribute
{
  /* 0x0000 */ const char* uuid;
}; /* size: 0x0004 */

struct <vc_attributes>::atl::aggregatesAttribute
{
  /* 0x0000 */ const char* clsid;
}; /* size: 0x0004 */

struct <vc_attributes>::atl::com_interface_entryAttribute
{
  /* 0x0000 */ const char* value;
}; /* size: 0x0004 */

struct <vc_attributes>::atl::db_accessorAttribute
{
  /* 0x0000 */ int id;
  /* 0x0004 */ BOOL auto_;
  /* 0x0005 */ char __PADDING__[3];
}; /* size: 0x0008 */

struct <vc_attributes>::atl::db_columnAttribute
{
  /* 0x0000 */ const char* ordinal;
  /* 0x0004 */ const char* dbtype;
  /* 0x0008 */ const char* precision;
  /* 0x000c */ const char* scale;
  /* 0x0010 */ const char* status;
  /* 0x0014 */ const char* length;
}; /* size: 0x0018 */

struct <vc_attributes>::atl::db_commandAttribute
{
  /* 0x0000 */ const char* command;
  /* 0x0004 */ const char* name;
  /* 0x0008 */ const char* source_name;
  /* 0x000c */ const char* hresult;
  /* 0x0010 */ const char* bindings;
  /* 0x0014 */ const char* bulk_fetch;
}; /* size: 0x0018 */

struct <vc_attributes>::atl::db_paramAttribute
{
  /* 0x0000 */ const char* ordinal;
  /* 0x0004 */ const char* paramtype;
  /* 0x0008 */ const char* dbtype;
  /* 0x000c */ const char* precision;
  /* 0x0010 */ const char* scale;
  /* 0x0014 */ const char* status;
  /* 0x0018 */ const char* length;
}; /* size: 0x001c */

struct <vc_attributes>::atl::db_sourceAttribute
{
  /* 0x0000 */ const char* source;
  /* 0x0004 */ const char* name;
  /* 0x0008 */ const char* hresult;
}; /* size: 0x000c */

struct <vc_attributes>::atl::db_tableAttribute
{
  /* 0x0000 */ const char* table;
  /* 0x0004 */ const char* name;
  /* 0x0008 */ const char* source_name;
  /* 0x000c */ const char* hresult;
  /* 0x0010 */ const char* bulk_fetch;
}; /* size: 0x0014 */

struct <vc_attributes>::atl::implements_categoryAttribute
{
  /* 0x0000 */ const char* value;
}; /* size: 0x0004 */

struct <vc_attributes>::atl::perf_counterAttribute
{
  /* 0x0000 */ const char* namestring;
  /* 0x0004 */ const char* helpstring;
  /* 0x0008 */ int name_res;
  /* 0x000c */ int help_res;
  /* 0x0010 */ int countertype;
  /* 0x0014 */ int defscale;
  /* 0x0018 */ BOOL default_counter;
  /* 0x001c */ int detail;
  /* 0x0020 */ int max_counter_size;
  /* 0x0024 */ const char* countertype_string;
}; /* size: 0x0028 */

struct <vc_attributes>::atl::perf_objectAttribute
{
  /* 0x0000 */ int name_res;
  /* 0x0004 */ int help_res;
  /* 0x0008 */ const char* namestring;
  /* 0x000c */ const char* helpstring;
  /* 0x0010 */ int detail;
  /* 0x0014 */ BOOL no_instances;
  /* 0x0018 */ const char* class_;
  /* 0x001c */ int maxinstnamelen;
}; /* size: 0x0020 */

struct <vc_attributes>::atl::perfmonAttribute
{
  /* 0x0000 */ const char* name;
  /* 0x0004 */ BOOL register;
  /* 0x0005 */ char __PADDING__[3];
}; /* size: 0x0008 */

struct <vc_attributes>::atl::rdxAttribute
{
  /* 0x0000 */ const char* key;
  /* 0x0004 */ const char* valuename;
  /* 0x0008 */ const char* regtype;
}; /* size: 0x000c */

struct <vc_attributes>::atl::registration_scriptAttribute
{
  /* 0x0000 */ const char* script;
}; /* size: 0x0004 */

struct <vc_attributes>::atl::request_handlerAttribute
{
  /* 0x0000 */ const char* name;
  /* 0x0004 */ const char* sdl;
}; /* size: 0x0008 */

struct <vc_attributes>::atl::requires_categoryAttribute
{
  /* 0x0000 */ const char* value;
}; /* size: 0x0004 */

struct <vc_attributes>::atl::soap_handlerAttribute
{
  /* 0x0000 */ const char* name;
  /* 0x0004 */ const char* namespace;
  /* 0x0008 */ const char* protocol;
  /* 0x000c */ const char* style;
  /* 0x0010 */ const char* use;
}; /* size: 0x0014 */

struct <vc_attributes>::atl::soap_headerAttribute
{
  /* 0x0000 */ const char* value;
  /* 0x0004 */ BOOL required;
  /* 0x0005 */ BOOL in;
  /* 0x0006 */ BOOL out;
  /* 0x0007 */ char __PADDING__[1];
}; /* size: 0x0008 */

struct <vc_attributes>::atl::soap_methodAttribute
{
  /* 0x0000 */ const char* name;
}; /* size: 0x0004 */

struct <vc_attributes>::atl::soap_namespaceAttribute
{
  /* 0x0000 */ const char* value;
}; /* size: 0x0004 */

struct <vc_attributes>::atl::support_error_infoAttribute
{
  /* 0x0000 */ const char* error_interface;
}; /* size: 0x0004 */

struct <vc_attributes>::atl::synchronizeAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::atl::tag_nameAttribute
{
  /* 0x0000 */ const char* name;
  /* 0x0004 */ const char* parse_func;
}; /* size: 0x0008 */

struct <vc_attributes>::bindableAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::call_asAttribute
{
  /* 0x0000 */ void* local_proc;
}; /* size: 0x0004 */

struct <vc_attributes>::caseAttribute
{
  /* 0x0000 */ int value;
}; /* size: 0x0004 */

struct <vc_attributes>::coclassAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::controlAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::cpp_quoteAttribute
{
  /* 0x0000 */ const char* string;
}; /* size: 0x0004 */

struct <vc_attributes>::customAttribute
{
  /* 0x0000 */ char* value;
}; /* size: 0x0004 */

struct <vc_attributes>::defaultAttribute
{
  /* 0x0000 */ const char* value;
}; /* size: 0x0004 */

struct <vc_attributes>::defaultbindAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::defaultcollelemAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::defaultvalueAttribute
{
  /* 0x0000 */ const char* value;
}; /* size: 0x0004 */

struct <vc_attributes>::defaultvtableAttribute
{
  /* 0x0000 */ const char* value;
}; /* size: 0x0004 */

struct <vc_attributes>::dispinterfaceAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::displaybindAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::dualAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::emitidlAttribute
{
  union
  {
    /* 0x0000 */ const int restricted;
    /* 0x0000 */ const int forced;
    /* 0x0000 */ const int push;
    /* 0x0000 */ const int pop;
    /* 0x0000 */ int value;
  }; /* size: 0x0004 */
  /* 0x0004 */ BOOL defaultimports;
  /* 0x0005 */ char __PADDING__[3];
}; /* size: 0x0008 */

struct <vc_attributes>::entryAttribute
{
  /* 0x0000 */ const char* entry_id;
}; /* size: 0x0004 */

struct <vc_attributes>::event_receiverAttribute
{
  /* 0x0000 */ enum <vc_attributes>::event_receiverAttribute::type_e type;
  /* 0x0004 */ BOOL layout_dependent;
  /* 0x0005 */ char __PADDING__[3];
}; /* size: 0x0008 */

enum <vc_attributes>::event_receiverAttribute::type_e
{
  native = 0,
  com = 1,
  managed = 2,
};

struct <vc_attributes>::event_sourceAttribute
{
  /* 0x0000 */ enum <vc_attributes>::event_sourceAttribute::type_e type;
  /* 0x0004 */ enum <vc_attributes>::event_sourceAttribute::optimize_e optimize;
  /* 0x0008 */ BOOL decorate;
  /* 0x0009 */ char __PADDING__[3];
}; /* size: 0x000c */

enum <vc_attributes>::event_sourceAttribute::optimize_e
{
  speed = 0,
  size = 1,
};

enum <vc_attributes>::event_sourceAttribute::type_e
{
  native = 0,
  com = 1,
  managed = 2,
};

struct <vc_attributes>::exportAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::first_isAttribute
{
  /* 0x0000 */ const char* value;
}; /* size: 0x0004 */

struct <vc_attributes>::helpcontextAttribute
{
  /* 0x0000 */ const char* helpcontext_value;
}; /* size: 0x0004 */

struct <vc_attributes>::helper_attributes::as_stringAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::helper_attributes::attributeAttribute
{
  union
  {
    /* 0x0000 */ const int All;
    /* 0x0000 */ const int Assembly;
    /* 0x0000 */ const int Class;
    /* 0x0000 */ const int Constructor;
    /* 0x0000 */ const int Delegate;
    /* 0x0000 */ const int Enum;
    /* 0x0000 */ const int Event;
    /* 0x0000 */ const int Field;
    /* 0x0000 */ const int GenericParameter;
    /* 0x0000 */ const int Interface;
    /* 0x0000 */ const int Method;
    /* 0x0000 */ const int Module;
    /* 0x0000 */ const int Parameter;
    /* 0x0000 */ const int Property;
    /* 0x0000 */ const int ReturnValue;
    /* 0x0000 */ const int Struct;
    /* 0x0000 */ int ValidOn;
  }; /* size: 0x0004 */
  /* 0x0004 */ BOOL AllowMultiple;
  /* 0x0005 */ BOOL Inherited;
  /* 0x0006 */ char __PADDING__[2];
}; /* size: 0x0008 */

struct <vc_attributes>::helper_attributes::default_valueAttribute
{
  /* 0x0000 */ void* value;
}; /* size: 0x0004 */

struct <vc_attributes>::helper_attributes::help_stringAttribute
{
  /* 0x0000 */ const char* value;
}; /* size: 0x0004 */

struct <vc_attributes>::helper_attributes::multi_valueAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::helper_attributes::notify_atlprovAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::helper_attributes::process_earlyAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::helper_attributes::repeatableAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::helper_attributes::requires_valueAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::helper_attributes::source_annotation_attributeAttribute
{
  union
  {
    /* 0x0000 */ const int All;
    /* 0x0000 */ const int Assembly;
    /* 0x0000 */ const int Class;
    /* 0x0000 */ const int Constructor;
    /* 0x0000 */ const int Delegate;
    /* 0x0000 */ const int Enum;
    /* 0x0000 */ const int Event;
    /* 0x0000 */ const int Field;
    /* 0x0000 */ const int GenericParameter;
    /* 0x0000 */ const int Interface;
    /* 0x0000 */ const int Method;
    /* 0x0000 */ const int Module;
    /* 0x0000 */ const int Parameter;
    /* 0x0000 */ const int Property;
    /* 0x0000 */ const int ReturnValue;
    /* 0x0000 */ const int Struct;
    /* 0x0000 */ int ValidOn;
  }; /* size: 0x0004 */
  /* 0x0004 */ BOOL AllowMultiple;
  /* 0x0005 */ char __PADDING__[3];
}; /* size: 0x0008 */

struct <vc_attributes>::helper_attributes::usageAttribute
{
  /* 0x0000 */ unsigned int value;
}; /* size: 0x0004 */

enum <vc_attributes>::helper_attributes::usageAttribute::usage_e
{
  eAnyUsage = 0,
  eCoClassUsage = 1,
  eCOMInterfaceUsage = 2,
  eInterfaceUsage = 6,
  eMemberUsage = 8,
  eMethodUsage = 16,
  eInterfaceMethodUsage = 32,
  eInterfaceMemberUsage = 64,
  eCoClassMemberUsage = 128,
  eCoClassMethodUsage = 256,
  eGlobalMethodUsage = 768,
  eGlobalDataUsage = 1024,
  eClassUsage = 2048,
  eInterfaceParameterUsage = 4096,
  eMethodParameterUsage = 12288,
  eIDLModuleUsage = 16384,
  eAnonymousUsage = 0xffff8000,
  eTypedefUsage = 0x10000,
  eUnionUsage = 0x20000,
  eEnumUsage = 0x40000,
  eDefineTagUsage = 0x80000,
  eStructUsage = 0x100000,
  eLocalUsage = 0x200000,
  ePropertyUsage = 0x400000,
  eEventUsage = 0x800000,
  eTemplateUsage = 0x1000000,
  eModuleUsage = 0x1000000,
  eIllegalUsage = 0x2000000,
  eAsynchronousUsage = 0x4000000,
  eAnyIDLUsage = 0x3f7fff,
};

struct <vc_attributes>::helper_attributes::v1_alttypeAttribute
{
  /* 0x0000 */ enum <vc_attributes>::helper_attributes::v1_alttypeAttribute::type_e type;
}; /* size: 0x0004 */

enum <vc_attributes>::helper_attributes::v1_alttypeAttribute::type_e
{
  eBoolean = 0,
  eInteger = 1,
  eFloat = 2,
  eDouble = 3,
};

struct <vc_attributes>::helper_attributes::v1_earlyAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::helper_attributes::v1_nameAttribute
{
  /* 0x0000 */ const char* name;
}; /* size: 0x0004 */

struct <vc_attributes>::helpfileAttribute
{
  /* 0x0000 */ const char* filename;
}; /* size: 0x0004 */

struct <vc_attributes>::helpstringAttribute
{
  /* 0x0000 */ const char* help_text_string;
}; /* size: 0x0004 */

struct <vc_attributes>::helpstringcontextAttribute
{
  /* 0x0000 */ int contextid;
}; /* size: 0x0004 */

struct <vc_attributes>::helpstringdllAttribute
{
  /* 0x0000 */ const char* dllname;
}; /* size: 0x0004 */

struct <vc_attributes>::hiddenAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::hookAttribute
{
  /* 0x0000 */ const char* event;
  /* 0x0004 */ const char* source;
  /* 0x0008 */ const char* handler;
  /* 0x000c */ const char* receiver;
}; /* size: 0x0010 */

struct <vc_attributes>::idAttribute
{
  /* 0x0000 */ int id_num;
}; /* size: 0x0004 */

struct <vc_attributes>::idl_moduleAttribute
{
  /* 0x0000 */ const char* name;
  /* 0x0004 */ const char* dllname;
  /* 0x0008 */ const char* version;
  /* 0x000c */ const char* uuid;
  /* 0x0010 */ const char* helpstring;
  /* 0x0014 */ int helpstringcontext;
  /* 0x0018 */ int helpcontext;
  /* 0x001c */ BOOL hidden;
  /* 0x001d */ BOOL restricted;
  /* 0x001e */ char __PADDING__[2];
}; /* size: 0x0020 */

struct <vc_attributes>::idl_quoteAttribute
{
  /* 0x0000 */ const char* text;
}; /* size: 0x0004 */

struct <vc_attributes>::iid_isAttribute
{
  /* 0x0000 */ const char* limited_expression;
}; /* size: 0x0004 */

struct <vc_attributes>::immediatebindAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::implementsAttribute
{
  /* 0x0000 */ const char* interfaces;
  /* 0x0004 */ const char* dispinterfaces;
}; /* size: 0x0008 */

struct <vc_attributes>::importAttribute
{
  /* 0x0000 */ const char* idl_file;
}; /* size: 0x0004 */

struct <vc_attributes>::importidlAttribute
{
  /* 0x0000 */ const char* value;
}; /* size: 0x0004 */

struct <vc_attributes>::importlibAttribute
{
  /* 0x0000 */ const char* tlb_file;
}; /* size: 0x0004 */

struct <vc_attributes>::inAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::includeAttribute
{
  /* 0x0000 */ const char* include_file;
}; /* size: 0x0004 */

struct <vc_attributes>::includelibAttribute
{
  /* 0x0000 */ const char* value;
}; /* size: 0x0004 */

struct <vc_attributes>::last_isAttribute
{
  /* 0x0000 */ const char* expression;
}; /* size: 0x0004 */

struct <vc_attributes>::lcidAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::length_isAttribute
{
  /* 0x0000 */ const char* expression;
}; /* size: 0x0004 */

struct <vc_attributes>::library_blockAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::licensedAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::localAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::max_isAttribute
{
  /* 0x0000 */ const char* expression;
}; /* size: 0x0004 */

struct <vc_attributes>::moduleAttribute
{
  /* 0x0000 */ enum <vc_attributes>::moduleAttribute::type_e type;
  /* 0x0004 */ const char* name;
  /* 0x0008 */ const char* version;
  /* 0x000c */ const char* uuid;
  /* 0x0010 */ int lcid;
  /* 0x0014 */ BOOL control;
  /* 0x0018 */ const char* helpstring;
  /* 0x001c */ int helpstringcontext;
  /* 0x0020 */ const char* helpstringdll;
  /* 0x0024 */ const char* helpfile;
  /* 0x0028 */ int helpcontext;
  /* 0x002c */ BOOL hidden;
  /* 0x002d */ BOOL restricted;
  /* 0x0030 */ const char* custom;
  /* 0x0034 */ const char* resource_name;
}; /* size: 0x0038 */

enum <vc_attributes>::moduleAttribute::type_e
{
  dll = 1,
  exe = 2,
  service = 3,
  unspecified = 4,
  EXE = 2,
  SERVICE = 3,
};

struct <vc_attributes>::ms_unionAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::no_injected_textAttribute
{
  /* 0x0000 */ BOOL value;
}; /* size: 0x0001 */

struct <vc_attributes>::nonbrowsableAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::noncreatableAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::nonextensibleAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::objectAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::odlAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::oleautomationAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::optionalAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::outAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::pointer_defaultAttribute
{
  /* 0x0000 */ enum <vc_attributes>::pointer_defaultAttribute::type_e type;
}; /* size: 0x0004 */

enum <vc_attributes>::pointer_defaultAttribute::type_e
{
  ptr = 0,
  ref = 1,
  unique = 2,
};

struct <vc_attributes>::pragmaAttribute
{
  /* 0x0000 */ const char* token_sequence;
}; /* size: 0x0004 */

struct <vc_attributes>::progidAttribute
{
  /* 0x0000 */ const char* name;
}; /* size: 0x0004 */

struct <vc_attributes>::propgetAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::propputAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::propputrefAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::providerAttribute
{
  /* 0x0000 */ const char* name;
  /* 0x0004 */ const char* uuid;
  /* 0x0008 */ int cookies;
}; /* size: 0x000c */

struct <vc_attributes>::ptrAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::publicAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::rangeAttribute
{
  /* 0x0000 */ int low_val;
  /* 0x0004 */ int high_val;
}; /* size: 0x0008 */

struct <vc_attributes>::readonlyAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::refAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::requesteditAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::restrictedAttribute
{
  /* 0x0000 */ const char* value;
}; /* size: 0x0004 */

struct <vc_attributes>::retvalAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::satypeAttribute
{
  /* 0x0000 */ const char* type;
}; /* size: 0x0004 */

struct <vc_attributes>::size_isAttribute
{
  /* 0x0000 */ const char* expression;
}; /* size: 0x0004 */

struct <vc_attributes>::sourceAttribute
{
  /* 0x0000 */ const char* value;
}; /* size: 0x0004 */

struct <vc_attributes>::stringAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::switch_isAttribute
{
  /* 0x0000 */ const char* limited_expression;
}; /* size: 0x0004 */

struct <vc_attributes>::switch_typeAttribute
{
  /* 0x0000 */ const char* switch_type_specifier;
}; /* size: 0x0004 */

struct <vc_attributes>::threadingAttribute
{
  /* 0x0000 */ enum <vc_attributes>::threadingAttribute::threading_e value;
}; /* size: 0x0004 */

enum <vc_attributes>::threadingAttribute::threading_e
{
  apartment = 1,
  single = 2,
  free = 3,
  neutral = 4,
  both = 5,
};

struct <vc_attributes>::transmit_asAttribute
{
  /* 0x0000 */ const char* xmit_type;
}; /* size: 0x0004 */

struct <vc_attributes>::uidefaultAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::unhookAttribute
{
  /* 0x0000 */ const char* event;
  /* 0x0004 */ const char* source;
  /* 0x0008 */ const char* handler;
  /* 0x000c */ const char* receiver;
}; /* size: 0x0010 */

struct <vc_attributes>::uniqueAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::usesgetlasterrorAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::uuidAttribute
{
  /* 0x0000 */ const char* value;
}; /* size: 0x0004 */

struct <vc_attributes>::v1_enumAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::varargAttribute
{
}; /* size: 0x0001 */

struct <vc_attributes>::versionAttribute
{
  /* 0x0000 */ const char* value;
}; /* size: 0x0004 */

struct <vc_attributes>::vi_progidAttribute
{
  /* 0x0000 */ const char* value;
}; /* size: 0x0004 */

struct <vc_attributes>::wire_marshalAttribute
{
  /* 0x0000 */ const char* wire_type;
}; /* size: 0x0004 */

enum ACTCTX_REQUESTED_RUN_LEVEL
{
  ACTCTX_RUN_LEVEL_UNSPECIFIED = 0,
  ACTCTX_RUN_LEVEL_AS_INVOKER = 1,
  ACTCTX_RUN_LEVEL_HIGHEST_AVAILABLE = 2,
  ACTCTX_RUN_LEVEL_REQUIRE_ADMIN = 3,
  ACTCTX_RUN_LEVEL_NUMBERS = 4,
};

struct ACTIVATION_PROPERTIES
{
  /* 0x0000 */ const struct _GUID& _rclsid;
  /* 0x0004 */ struct _GUID _partition;
  /* 0x0014 */ const struct _GUID& _riid;
  /* 0x0018 */ unsigned long _dwFlags;
  /* 0x001c */ unsigned long _dwActvFlags;
  /* 0x0020 */ unsigned long _dwContext;
  /* 0x0024 */ unsigned long _dwDllServerType;
  /* 0x0028 */ wchar_t* _pwszDllServer;
  /* 0x002c */ struct IUnknown** _ppUnk;
  /* 0x0030 */ struct IComClassInfo* _pCI;
}; /* size: 0x0034 */

enum ACTIVATION_PROPERTIES::eFlags
{
  fFOR_SCM = 1,
  fSURROGATE = 4,
  fDO_NOT_LOAD = 8,
  fRELOAD_DARWIN = 16,
  fLSVR_ONLY = 32,
};

enum ADDRESS_MODE
{
  AddrMode1616 = 0,
  AddrMode1632 = 1,
  AddrModeReal = 2,
  AddrModeFlat = 3,
};

struct AENTRY
{
  /* 0x0000 */ unsigned long dwCollision;
  /* 0x0004 */ void* pAllocation;
}; /* size: 0x0008 */

struct ANON_OBJECT_HEADER
{
  /* 0x0000 */ unsigned short Sig1;
  /* 0x0002 */ unsigned short Sig2;
  /* 0x0004 */ unsigned short Version;
  /* 0x0006 */ unsigned short Machine;
  /* 0x0008 */ unsigned long TimeDateStamp;
  /* 0x000c */ struct _GUID ClassID;
  /* 0x001c */ unsigned long SizeOfData;
}; /* size: 0x0020 */

struct ANON_OBJECT_HEADER_V2
{
  /* 0x0000 */ unsigned short Sig1;
  /* 0x0002 */ unsigned short Sig2;
  /* 0x0004 */ unsigned short Version;
  /* 0x0006 */ unsigned short Machine;
  /* 0x0008 */ unsigned long TimeDateStamp;
  /* 0x000c */ struct _GUID ClassID;
  /* 0x001c */ unsigned long SizeOfData;
  /* 0x0020 */ unsigned long Flags;
  /* 0x0024 */ unsigned long MetaDataSize;
  /* 0x0028 */ unsigned long MetaDataOffset;
}; /* size: 0x002c */

struct API_VERSION
{
  /* 0x0000 */ unsigned short MajorVersion;
  /* 0x0002 */ unsigned short MinorVersion;
  /* 0x0004 */ unsigned short Revision;
  /* 0x0006 */ unsigned short Reserved;
}; /* size: 0x0008 */

struct ARRAY_INFO
{
  /* 0x0000 */ long Dimension;
  /* 0x0004 */ unsigned long* BufferConformanceMark;
  /* 0x0008 */ unsigned long* BufferVarianceMark;
  /* 0x000c */ unsigned long* MaxCountArray;
  /* 0x0010 */ unsigned long* OffsetArray;
  /* 0x0014 */ unsigned long* ActualCountArray;
}; /* size: 0x0018 */

enum ASSOCCLASS
{
  ASSOCCLASS_SHELL_KEY = 0,
  ASSOCCLASS_PROGID_KEY = 1,
  ASSOCCLASS_PROGID_STR = 2,
  ASSOCCLASS_CLSID_KEY = 3,
  ASSOCCLASS_CLSID_STR = 4,
  ASSOCCLASS_APP_KEY = 5,
  ASSOCCLASS_APP_STR = 6,
  ASSOCCLASS_SYSTEM_STR = 7,
  ASSOCCLASS_FOLDER = 8,
  ASSOCCLASS_STAR = 9,
};

struct ASSOCIATIONELEMENT_
{
  /* 0x0000 */ enum ASSOCCLASS ac;
  /* 0x0004 */ struct HKEY__* hkClass;
  /* 0x0008 */ const wchar_t* pszClass;
}; /* size: 0x000c */

struct A_SHA_CTX
{
  union
  {
    /* 0x0000 */ unsigned char buffer[64];
  } /* size: 0x0040 */ u;
  /* 0x0040 */ unsigned long state[5];
  /* 0x0054 */ unsigned long count[2];
}; /* size: 0x005c */

class ActivationProperties
{
  /* 0x000c */ enum _TAG_UNNAMED_12 _marshalState;
  /* 0x0010 */ struct _GUID _actCLSID;
  /* 0x0020 */ int _unSerialized;
  /* 0x0024 */ int _unSerializedInproc;
  /* 0x0028 */ long _refCount;
  /* 0x002c */ struct tagCustomHeader _serHeader;
  /* 0x005c */ struct tagCustomHeader _unSerHeader;
  /* 0x008c */ unsigned long _marshalFlags;
  /* 0x0090 */ unsigned long _size;
  /* 0x0094 */ int _toDelete;
  /* 0x0098 */ int _fDestruct;
  /* 0x009c */ int _fInprocSerializationRequired;
  /* 0x00a0 */ unsigned long _totalSize;
  /* 0x00a4 */ class SerializableProperty* serializableIfsCollection[10];
  /* 0x00cc */ unsigned long _ifsIndex;
  /* 0x00d0 */ struct _GUID _clsidArray[10];
  /* 0x0170 */ unsigned long _sizeArray[10];
  /* 0x0198 */ unsigned long _headerSize;
  /* 0x019c */ class Serializer* _pUnSer;
  /* 0x01a0 */ void* _blob;
}; /* size: 0x01a4 */

typedef enum _TAG_UNNAMED_12
{
  NOT_MARSHALLED = 1,
  SIZED = 2,
  MARSHALLED = 3,
  UNMARSHALLED = 4,
} TAG_UNNAMED_12, *PTAG_UNNAMED_12;

class ActivationPropertiesIn
{
  /* 0x01b0 */ enum tagACTIVATION_STAGE _stage;
  /* 0x01b4 */ unsigned long _cCustomAct;
  /* 0x01b8 */ unsigned long _customIndex;
  /* 0x01bc */ unsigned long _dwInitialContext;
  /* 0x01c0 */ int _delegated;
  /* 0x01c4 */ void* _clientToken;
  /* 0x01c8 */ int _fUseSystemIdentity;
  /* 0x01cc */ int _fComplusOnly;
  /* 0x01d0 */ struct IComClassInfo* _pClassInfo;
  /* 0x01d4 */ struct ISystemActivator** _customActList;
  /* 0x01d8 */ class InstantiationInfo* _pinst;
  /* 0x01dc */ class InstanceInfo* _pPersist;
  /* 0x01e0 */ class ContextInfo* _pContextInfo;
  /* 0x01e4 */ class ServerLocationInfo* _pServerLocationInfo;
  /* 0x01e8 */ class SecurityInfo* _pSecurityInfo;
  /* 0x01ec */ class SpecialProperties* _pSpecialProperties;
  /* 0x01f0 */ class ActivationPropertiesOut _actOut;
  /* 0x049c */ class SecurityInfo _securityInfo;
  /* 0x04d0 */ class ServerLocationInfo _serverLocationInfo;
  /* 0x04fc */ class InstantiationInfo _instantiationInfo;
  /* 0x05e0 */ class ContextInfo _contextInfo;
  /* 0x062c */ class InstanceInfo _instanceInfo;
  /* 0x0654 */ class ScmRequestInfo _scmRequestInfo;
  /* 0x0670 */ class SpecialProperties _specialProperties;
  /* 0x06e0 */ void* _pDip;
  /* 0x06e4 */ struct IClassFactory* _pCF;
}; /* size: 0x06e8 */

class ActivationPropertiesOut
{
  /* 0x01ac */ class ActivationPropertiesOut::OutSerializer* _pOutSer;
  /* 0x01b0 */ class ActivationPropertiesOut::OutSerializer _outSer;
  /* 0x0288 */ class ScmReplyInfo _scmReplyInfo;
  /* 0x02a4 */ struct tagCOMVERSION _clientCOMVersion;
  /* 0x02a8 */ int _fBrokenRefCount;
}; /* size: 0x02ac */

class ActivationPropertiesOut::OutSerializer
{
  /* 0x0010 */ struct tagPropsOutInfo _info;
  /* 0x0020 */ struct IUnknown* _pUnk;
  /* 0x0024 */ void** _ppvObj;
  /* 0x0028 */ unsigned long _size;
  /* 0x002c */ struct tagCOMVERSION* _pClientCOMVersion;
  /* 0x0030 */ struct _GUID _pIIDs[10];
  /* 0x00d0 */ int _fBrokenRefCount;
  /* 0x00d4 */ int _fToReleaseIFD;
}; /* size: 0x00d8 */

struct AllocateThrow
{
}; /* size: 0x0001 */

class AllocationWrapper
{
}; /* size: 0x0001 */

struct ApartmentEntry
{
  /* 0x0000 */ struct SDWORDHashNode node;
  /* 0x000c */ unsigned long hActivator;
}; /* size: 0x0010 */

class AppRegistration
{
  /* 0x0000 */ struct _GUID appid;
  /* 0x0010 */ const wchar_t* appName;
  /* 0x0014 */ int dllSurrogate;
  /* 0x0018 */ struct HINSTANCE__* hModuleSurrogate;
}; /* size: 0x001c */

struct AsyncIAdviseSink
{
  /* 0x0000 */ struct AsyncIAdviseSinkVtbl* lpVtbl;
}; /* size: 0x0004 */

struct AsyncIAdviseSink2
{
}; /* size: 0x0004 */

struct AsyncIAdviseSink2Vtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* Begin_OnDataChange /* function */;
  /* 0x0010 */ void* Finish_OnDataChange /* function */;
  /* 0x0014 */ void* Begin_OnViewChange /* function */;
  /* 0x0018 */ void* Finish_OnViewChange /* function */;
  /* 0x001c */ void* Begin_OnRename /* function */;
  /* 0x0020 */ void* Finish_OnRename /* function */;
  /* 0x0024 */ void* Begin_OnSave /* function */;
  /* 0x0028 */ void* Finish_OnSave /* function */;
  /* 0x002c */ void* Begin_OnClose /* function */;
  /* 0x0030 */ void* Finish_OnClose /* function */;
  /* 0x0034 */ void* Begin_OnLinkSrcChange /* function */;
  /* 0x0038 */ void* Finish_OnLinkSrcChange /* function */;
}; /* size: 0x003c */

struct AsyncIAdviseSinkVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* Begin_OnDataChange /* function */;
  /* 0x0010 */ void* Finish_OnDataChange /* function */;
  /* 0x0014 */ void* Begin_OnViewChange /* function */;
  /* 0x0018 */ void* Finish_OnViewChange /* function */;
  /* 0x001c */ void* Begin_OnRename /* function */;
  /* 0x0020 */ void* Finish_OnRename /* function */;
  /* 0x0024 */ void* Begin_OnSave /* function */;
  /* 0x0028 */ void* Finish_OnSave /* function */;
  /* 0x002c */ void* Begin_OnClose /* function */;
  /* 0x0030 */ void* Finish_OnClose /* function */;
}; /* size: 0x0034 */

struct AsyncIMultiQI
{
}; /* size: 0x0004 */

struct AsyncIPipeByte
{
}; /* size: 0x0004 */

struct AsyncIPipeDouble
{
}; /* size: 0x0004 */

struct AsyncIPipeLong
{
}; /* size: 0x0004 */

struct AsyncIRemUnknown
{
}; /* size: 0x0004 */

struct AsyncIRemUnknown2
{
}; /* size: 0x0004 */

struct AsyncIUnknown
{
}; /* size: 0x0004 */

struct BATTERY_REPORTING_SCALE
{
  /* 0x0000 */ unsigned long Granularity;
  /* 0x0004 */ unsigned long Capacity;
}; /* size: 0x0008 */

struct BITMAPV4HEADER
{
  /* 0x0000 */ unsigned long bV4Size;
  /* 0x0004 */ long bV4Width;
  /* 0x0008 */ long bV4Height;
  /* 0x000c */ unsigned short bV4Planes;
  /* 0x000e */ unsigned short bV4BitCount;
  /* 0x0010 */ unsigned long bV4V4Compression;
  /* 0x0014 */ unsigned long bV4SizeImage;
  /* 0x0018 */ long bV4XPelsPerMeter;
  /* 0x001c */ long bV4YPelsPerMeter;
  /* 0x0020 */ unsigned long bV4ClrUsed;
  /* 0x0024 */ unsigned long bV4ClrImportant;
  /* 0x0028 */ unsigned long bV4RedMask;
  /* 0x002c */ unsigned long bV4GreenMask;
  /* 0x0030 */ unsigned long bV4BlueMask;
  /* 0x0034 */ unsigned long bV4AlphaMask;
  /* 0x0038 */ unsigned long bV4CSType;
  /* 0x003c */ struct tagICEXYZTRIPLE bV4Endpoints;
  /* 0x0060 */ unsigned long bV4GammaRed;
  /* 0x0064 */ unsigned long bV4GammaGreen;
  /* 0x0068 */ unsigned long bV4GammaBlue;
}; /* size: 0x006c */

struct BITMAPV5HEADER
{
  /* 0x0000 */ unsigned long bV5Size;
  /* 0x0004 */ long bV5Width;
  /* 0x0008 */ long bV5Height;
  /* 0x000c */ unsigned short bV5Planes;
  /* 0x000e */ unsigned short bV5BitCount;
  /* 0x0010 */ unsigned long bV5Compression;
  /* 0x0014 */ unsigned long bV5SizeImage;
  /* 0x0018 */ long bV5XPelsPerMeter;
  /* 0x001c */ long bV5YPelsPerMeter;
  /* 0x0020 */ unsigned long bV5ClrUsed;
  /* 0x0024 */ unsigned long bV5ClrImportant;
  /* 0x0028 */ unsigned long bV5RedMask;
  /* 0x002c */ unsigned long bV5GreenMask;
  /* 0x0030 */ unsigned long bV5BlueMask;
  /* 0x0034 */ unsigned long bV5AlphaMask;
  /* 0x0038 */ unsigned long bV5CSType;
  /* 0x003c */ struct tagICEXYZTRIPLE bV5Endpoints;
  /* 0x0060 */ unsigned long bV5GammaRed;
  /* 0x0064 */ unsigned long bV5GammaGreen;
  /* 0x0068 */ unsigned long bV5GammaBlue;
  /* 0x006c */ unsigned long bV5Intent;
  /* 0x0070 */ unsigned long bV5ProfileData;
  /* 0x0074 */ unsigned long bV5ProfileSize;
  /* 0x0078 */ unsigned long bV5Reserved;
}; /* size: 0x007c */

struct BSMINFO
{
  /* 0x0000 */ unsigned int cbSize;
  /* 0x0004 */ struct HDESK__* hdesk;
  /* 0x0008 */ struct HWND__* hwnd;
  /* 0x000c */ struct _LUID luid;
}; /* size: 0x0014 */

struct BSTR_INTERNAL
{
  /* 0x0000 */ unsigned long cbPayload;
  /* 0x0004 */ wchar_t* sz /* zero-length array */;
}; /* size: 0x0004 */

class BUCL::CByteAllocator
{
}; /* size: 0x0001 */

class BUCL::CConvertToSignedType<__int64>
{
}; /* size: 0x0001 */

class BUCL::CConvertToSignedType<int>
{
}; /* size: 0x0001 */

class BUCL::CConvertToSignedType<long>
{
}; /* size: 0x0001 */

class BUCL::CConvertToSignedType<short>
{
}; /* size: 0x0001 */

class BUCL::CConvertToSignedType<signed char>
{
}; /* size: 0x0001 */

class BUCL::CConvertToSignedType<unsigned __int64>
{
}; /* size: 0x0001 */

class BUCL::CConvertToSignedType<unsigned char>
{
}; /* size: 0x0001 */

class BUCL::CConvertToSignedType<unsigned int>
{
}; /* size: 0x0001 */

class BUCL::CConvertToSignedType<unsigned long>
{
}; /* size: 0x0001 */

class BUCL::CConvertToSignedType<unsigned short>
{
}; /* size: 0x0001 */

class BUCL::CConvertToUnsignedType<__int64>
{
}; /* size: 0x0001 */

class BUCL::CConvertToUnsignedType<int>
{
}; /* size: 0x0001 */

class BUCL::CConvertToUnsignedType<long>
{
}; /* size: 0x0001 */

class BUCL::CConvertToUnsignedType<short>
{
}; /* size: 0x0001 */

class BUCL::CConvertToUnsignedType<signed char>
{
}; /* size: 0x0001 */

class BUCL::CConvertToUnsignedType<unsigned __int64>
{
}; /* size: 0x0001 */

class BUCL::CConvertToUnsignedType<unsigned char>
{
}; /* size: 0x0001 */

class BUCL::CConvertToUnsignedType<unsigned int>
{
}; /* size: 0x0001 */

class BUCL::CConvertToUnsignedType<unsigned long>
{
}; /* size: 0x0001 */

class BUCL::CConvertToUnsignedType<unsigned short>
{
}; /* size: 0x0001 */

class BUCL::CDequeBase
{
  /* 0x0000 */ class BUCL::CDequeLinkage m_Head;
  /* 0x000c */ unsigned long m_EntryCount;
}; /* size: 0x0010 */

class BUCL::CDequeLinkage
{
  /* 0x0008 */ class BUCL::CDequeBase* m_pDeque;
}; /* size: 0x000c */

class BUCL::CIsSignedType<__int64>
{
}; /* size: 0x0001 */

typedef enum _TAG_UNNAMED_13
{
  Value = 1,
} TAG_UNNAMED_13, *PTAG_UNNAMED_13;

class BUCL::CIsSignedType<int>
{
}; /* size: 0x0001 */

typedef enum _TAG_UNNAMED_14
{
  Value = 1,
} TAG_UNNAMED_14, *PTAG_UNNAMED_14;

class BUCL::CIsSignedType<long>
{
}; /* size: 0x0001 */

typedef enum _TAG_UNNAMED_15
{
  Value = 1,
} TAG_UNNAMED_15, *PTAG_UNNAMED_15;

class BUCL::CIsSignedType<short>
{
}; /* size: 0x0001 */

typedef enum _TAG_UNNAMED_16
{
  Value = 1,
} TAG_UNNAMED_16, *PTAG_UNNAMED_16;

class BUCL::CIsSignedType<signed char>
{
}; /* size: 0x0001 */

typedef enum _TAG_UNNAMED_17
{
  Value = 1,
} TAG_UNNAMED_17, *PTAG_UNNAMED_17;

class BUCL::CIsSignedType<unsigned __int64>
{
}; /* size: 0x0001 */

typedef enum _TAG_UNNAMED_18
{
  Value = 0,
} TAG_UNNAMED_18, *PTAG_UNNAMED_18;

class BUCL::CIsSignedType<unsigned char>
{
}; /* size: 0x0001 */

typedef enum _TAG_UNNAMED_19
{
  Value = 0,
} TAG_UNNAMED_19, *PTAG_UNNAMED_19;

class BUCL::CIsSignedType<unsigned int>
{
}; /* size: 0x0001 */

typedef enum _TAG_UNNAMED_20
{
  Value = 0,
} TAG_UNNAMED_20, *PTAG_UNNAMED_20;

class BUCL::CIsSignedType<unsigned long>
{
}; /* size: 0x0001 */

typedef enum _TAG_UNNAMED_21
{
  Value = 0,
} TAG_UNNAMED_21, *PTAG_UNNAMED_21;

class BUCL::CIsSignedType<unsigned short>
{
}; /* size: 0x0001 */

typedef enum _TAG_UNNAMED_22
{
  Value = 0,
} TAG_UNNAMED_22, *PTAG_UNNAMED_22;

typedef enum _TAG_UNNAMED_23
{
  Value = 1,
} TAG_UNNAMED_23, *PTAG_UNNAMED_23;

class BUCL::CMultiplier<unsigned long,BUCL::Rtl::CCallDisposition>
{
}; /* size: 0x0001 */

enum BUCL::DequeIteratorMovementDirection
{
  eDequeIteratorMoveForward = 0,
  eDequeIteratorMoveBackward = 1,
};

enum BUCL::HashTable::InsertOrUpdateIfPresentDisposition
{
  eUpdateValue = 0,
  eLeaveValueAlone = 1,
};

class BUCL::MultiplyHelpers::CPromotedSize<unsigned char>
{
}; /* size: 0x0001 */

class BUCL::MultiplyHelpers::CPromotedSize<unsigned int>
{
}; /* size: 0x0001 */

class BUCL::MultiplyHelpers::CPromotedSize<unsigned long>
{
}; /* size: 0x0001 */

class BUCL::MultiplyHelpers::CPromotedSize<unsigned short>
{
}; /* size: 0x0001 */

class BUCL::Rtl::CCallDisposition
{
  /* 0x0000 */ long m_NtStatus;
}; /* size: 0x0004 */

struct BULK_SECURITY_TEST_DATA
{
  /* 0x0000 */ unsigned long DesiredAccess;
  /* 0x0004 */ unsigned long SecurityIds[1];
}; /* size: 0x0008 */

class C2Security
{
  /* 0x0000 */ int m_bProtectionMode;
}; /* size: 0x0004 */

class CALLFRAME_CACHE<INTERFACE_HELPER_CLSID>
{
  /* 0x0068 */ class XSLOCK m_xslAgeOutLock;
  /* 0x00b0 */ volatile unsigned long m_dwLastAgeOutTime;
  /* 0x00b4 */ unsigned long m_dwNumPtrsInPage;
}; /* size: 0x00b8 */

class CALLFRAME_CACHE<TYPEINFOVTBL>
{
  /* 0x0068 */ class XSLOCK m_xslAgeOutLock;
  /* 0x00b0 */ volatile unsigned long m_dwLastAgeOutTime;
  /* 0x00b4 */ unsigned long m_dwNumPtrsInPage;
}; /* size: 0x00b8 */

class CALLFRAME_CACHE_ENTRY<INTERFACE_HELPER_CLSID>
{
  /* 0x0004 */ unsigned long m_dwReleaseTime;
  /* 0x0008 */ class CALLFRAME_CACHE<INTERFACE_HELPER_CLSID>* m_pcache;
  /* 0x000c */ volatile long m_refs;
  /* 0x0010 */ struct _GUID m_guidkey;
}; /* size: 0x0020 */

class CALLFRAME_CACHE_ENTRY<TYPEINFOVTBL>
{
  /* 0x0004 */ unsigned long m_dwReleaseTime;
  /* 0x0008 */ class CALLFRAME_CACHE<TYPEINFOVTBL>* m_pcache;
  /* 0x000c */ volatile long m_refs;
  /* 0x0010 */ struct _GUID m_guidkey;
}; /* size: 0x0020 */

enum CALLFRAME_FREE
{
  CALLFRAME_FREE_NONE = 0,
  CALLFRAME_FREE_IN = 1,
  CALLFRAME_FREE_INOUT = 2,
  CALLFRAME_FREE_OUT = 4,
  CALLFRAME_FREE_TOP_INOUT = 8,
  CALLFRAME_FREE_TOP_OUT = 16,
  CALLFRAME_FREE_ALL = 31,
};

enum CALLFRAME_NULL
{
  CALLFRAME_NULL_NONE = 0,
  CALLFRAME_NULL_INOUT = 2,
  CALLFRAME_NULL_OUT = 4,
  CALLFRAME_NULL_ALL = 6,
};

enum CALLFRAME_WALK
{
  CALLFRAME_WALK_IN = 1,
  CALLFRAME_WALK_INOUT = 2,
  CALLFRAME_WALK_OUT = 4,
};

class CAddrControl
{
}; /* size: 0x0008 */

class CAddrExclusionList
{
  /* 0x0004 */ long _lRefs;
  /* 0x0008 */ unsigned long _dwCursor;
  /* 0x000c */ unsigned long _dwNumStrings;
  /* 0x0010 */ wchar_t** _ppszStrings;
}; /* size: 0x0014 */

class CAggId
{
  /* 0x0004 */ unsigned long _cRefs;
  /* 0x0008 */ struct IUnknown* _punkInner;
  /* 0x000c */ struct IMarshal* _pmshInner;
  /* 0x0010 */ class CStdIdentity* _pStdId;
}; /* size: 0x0014 */

class CAntiMoniker
{
  /* 0x0014 */ unsigned long m_count;
}; /* size: 0x0018 */

class CApartmentActivator
{
}; /* size: 0x0004 */

class CApartmentHashTable
{
  union
  {
    struct
    {
      /* 0x0000 */ class CDWORDHashTable _hashtbl;
      /* 0x0018 */ int _fTableInitialized;
    }; /* size: 0x001c */
    /* 0x0000 */ class COleStaticMutexSem _mxsAptTblLock;
  }; /* size: 0x0030 */
}; /* size: 0x001c */

class CAptCallCtrl
{
  /* 0x0000 */ struct IMessageFilter* _pMF;
  /* 0x0004 */ int _fInMsgFilter;
  /* 0x0008 */ class CCliModalLoop* _pTopCML;
  /* 0x000c */ struct tagSWindowData _WD[2];
}; /* size: 0x0024 */

class CAptRpcChnl
{
  /* 0x0034 */ unsigned long _dwTIDCallee;
  /* 0x0038 */ unsigned long _dwAptId;
}; /* size: 0x003c */

class CArray<CCacheNode>
{
  /* 0x0000 */ unsigned long m_refs;
  /* 0x0004 */ unsigned long m_ulFlags;
  /* 0x0008 */ unsigned long m_ulStepSize;
  /* 0x000c */ unsigned long m_ulCurSize;
  /* 0x0010 */ unsigned long m_ulLength;
  /* 0x0014 */ unsigned long m_ulResSlots;
  /* 0x0018 */ unsigned long m_ulHeadNode;
  /* 0x001c */ unsigned long m_ulTailNode;
  /* 0x0020 */ int m_iFree;
  /* 0x0024 */ int* m_piAllocList;
  /* 0x0028 */ struct CArray<CCacheNode>::ArrayNode* m_pBuffer;
}; /* size: 0x002c */

struct CArray<CCacheNode>::ArrayNode
{
  /* 0x0000 */ class CCacheNode item;
  /* 0x0058 */ unsigned long next;
  /* 0x005c */ unsigned long prev;
}; /* size: 0x0060 */

class CArray<CFormatEtc>
{
  /* 0x0000 */ unsigned long m_refs;
  /* 0x0004 */ unsigned long m_ulFlags;
  /* 0x0008 */ unsigned long m_ulStepSize;
  /* 0x000c */ unsigned long m_ulCurSize;
  /* 0x0010 */ unsigned long m_ulLength;
  /* 0x0014 */ unsigned long m_ulResSlots;
  /* 0x0018 */ unsigned long m_ulHeadNode;
  /* 0x001c */ unsigned long m_ulTailNode;
  /* 0x0020 */ int m_iFree;
  /* 0x0024 */ int* m_piAllocList;
  /* 0x0028 */ struct CArray<CFormatEtc>::ArrayNode* m_pBuffer;
}; /* size: 0x002c */

struct CArray<CFormatEtc>::ArrayNode
{
  /* 0x0000 */ class CFormatEtc item;
  /* 0x0018 */ unsigned long next;
  /* 0x001c */ unsigned long prev;
}; /* size: 0x0020 */

class CArray<CStatData>
{
  /* 0x0000 */ unsigned long m_refs;
  /* 0x0004 */ unsigned long m_ulFlags;
  /* 0x0008 */ unsigned long m_ulStepSize;
  /* 0x000c */ unsigned long m_ulCurSize;
  /* 0x0010 */ unsigned long m_ulLength;
  /* 0x0014 */ unsigned long m_ulResSlots;
  /* 0x0018 */ unsigned long m_ulHeadNode;
  /* 0x001c */ unsigned long m_ulTailNode;
  /* 0x0020 */ int m_iFree;
  /* 0x0024 */ int* m_piAllocList;
  /* 0x0028 */ struct CArray<CStatData>::ArrayNode* m_pBuffer;
}; /* size: 0x002c */

struct CArray<CStatData>::ArrayNode
{
  /* 0x0000 */ class CStatData item;
  /* 0x0024 */ unsigned long next;
  /* 0x0028 */ unsigned long prev;
}; /* size: 0x002c */

class CArrayFValue
{
  /* 0x0000 */ unsigned char* m_pData;
  /* 0x0004 */ unsigned int m_cbValue;
  /* 0x0008 */ int m_nSize;
  /* 0x000c */ int m_nMaxSize;
  /* 0x0010 */ int m_nGrowBy;
}; /* size: 0x0014 */

class CAsyncCall
{
  /* 0x00c8 */ unsigned long _iRefCount;
  /* 0x00cc */ unsigned long _lFlags;
  /* 0x00d0 */ class CChannelObject* _pChnlObj;
  /* 0x00d4 */ void* _pRequestBuffer;
  /* 0x00d8 */ unsigned long _lApt;
  /* 0x00dc */ struct _RPC_ASYNC_STATE _AsyncState;
  /* 0x0120 */ struct HWND__* _hwndSTA;
  /* 0x0124 */ class CAsyncCall* _pNext;
  /* 0x0128 */ enum ESignalState _eSignalState;
  union
  {
    /* 0x0000 */ class CAsyncCall* _aList[8];
    /* 0x0000 */ unsigned long _iNext;
  }; /* size: 0x0020 */
}; /* size: 0x012c */

class CAsyncConnection
{
  /* 0x0004 */ struct IConnectionPointContainer* _pCPC;
  /* 0x0008 */ struct IDocfileAsyncConnectionPoint* _pdacp;
  /* 0x000c */ unsigned long _dwAsyncFlags;
  /* 0x0010 */ long _cReferences;
}; /* size: 0x0014 */

class CAsyncConnectionContainer
{
  /* 0x0004 */ class CAsyncConnection _cpoint;
}; /* size: 0x0018 */

class CAsyncStateMachine
{
  /* 0x0004 */ unsigned long _dwState;
  /* 0x0008 */ HRESULT _hr;
  /* 0x000c */ enum _TAG_UNNAMED_24 eflags;
}; /* size: 0x0010 */

typedef enum _TAG_UNNAMED_24
{
  STATE_WAITINGFORBEGIN = 1,
  STATE_WAITINGFORFINISH = 2,
  STATE_BEGINABORTED = 3,
  STATE_EXECUTINGFINISH = 4,
  STATE_INITIALIZINGOBJECT = 5,
} TAG_UNNAMED_24, *PTAG_UNNAMED_24;

class CAsyncUnknownMgr
{
  /* 0x0018 */ class CAsyncUnknownMgr::CPrivUnknown _privUnk;
  /* 0x001c */ unsigned long _dwFlags;
  /* 0x0020 */ class CClientCallMgr* _pNextMgr;
  /* 0x0024 */ unsigned long _cRefs;
  /* 0x0028 */ struct IUnknown* _pUnkOuter;
  /* 0x002c */ class CStdIdentity* _pStdId;
  /* 0x0030 */ struct IUnknown* _pARUObj;
  /* 0x0034 */ struct AsyncIRemUnknown2* _pARU;
  /* 0x0038 */ struct tagMULTI_QI _MQI;
  /* 0x0044 */ unsigned long _ulRefs;
  /* 0x0048 */ struct tagQICONTEXT* _pQIC;
  /* 0x004c */ unsigned long _cAcquired;
  /* 0x0050 */ unsigned long _cMQIs;
  /* 0x0054 */ struct _GUID* _pIIDs;
  /* 0x0058 */ struct tagMULTI_QI** _ppMQI;
  /* 0x005c */ struct tagMULTI_QI* _pMQISave;
}; /* size: 0x0060 */

class CAsyncUnknownMgr::CPrivUnknown
{
}; /* size: 0x0004 */

class CAtom
{
  /* 0x0000 */ unsigned short m_atom;
}; /* size: 0x0002 */

class CAuthInfo
{
  union
  {
    /* 0x0000 */ struct tagSOLE_AUTHENTICATION_LIST* _sList;
    /* 0x0000 */ int _fNeedSSL;
  }; /* size: 0x0004 */
}; /* size: 0x0001 */

class CBaseMoniker
{
  /* 0x0008 */ unsigned long m_refs;
  /* 0x000c */ class CMarshalImplPStream m_marshal;
}; /* size: 0x0014 */

class CBaseStorageVariant
{
}; /* size: 0x0010 */

class CBasedBytePtr
{
  /* 0x0000 */ unsigned long _p;
}; /* size: 0x0004 */

class CBasedContextPtr
{
  /* 0x0000 */ unsigned long _p;
}; /* size: 0x0004 */

class CBasedDFBasisPtr
{
  /* 0x0000 */ unsigned long _p;
}; /* size: 0x0004 */

class CBasedDeltaBlockPtr
{
  /* 0x0000 */ unsigned long _p;
}; /* size: 0x0004 */

class CBasedDeltaBlockPtrPtr
{
  /* 0x0000 */ unsigned long _p;
}; /* size: 0x0004 */

class CBasedDeltaListPtr
{
  /* 0x0000 */ unsigned long _p;
}; /* size: 0x0004 */

class CBasedDirectStreamPtr
{
  /* 0x0000 */ unsigned long _p;
}; /* size: 0x0004 */

class CBasedDlElementPtr
{
  /* 0x0000 */ unsigned long _p;
}; /* size: 0x0004 */

class CBasedDocFilePtr
{
  /* 0x0000 */ unsigned long _p;
}; /* size: 0x0004 */

class CBasedFatPtr
{
  /* 0x0000 */ unsigned long _p;
}; /* size: 0x0004 */

class CBasedFreeBlockPtr
{
  /* 0x0000 */ unsigned long _p;
}; /* size: 0x0004 */

class CBasedGlobalContextPtr
{
  /* 0x0000 */ unsigned long _p;
}; /* size: 0x0004 */

class CBasedGlobalFileStreamPtr
{
  /* 0x0000 */ unsigned long _p;
}; /* size: 0x0004 */

class CBasedILockBytesPtrPtr
{
  /* 0x0000 */ unsigned long _p;
}; /* size: 0x0004 */

class CBasedMSFPagePtr
{
  /* 0x0000 */ unsigned long _p;
}; /* size: 0x0004 */

class CBasedMSFPagePtrPtr
{
  /* 0x0000 */ unsigned long _p;
}; /* size: 0x0004 */

class CBasedMSFPageTablePtr
{
  /* 0x0000 */ unsigned long _p;
}; /* size: 0x0004 */

class CBasedMStreamPtr
{
  /* 0x0000 */ unsigned long _p;
}; /* size: 0x0004 */

class CBasedMappedStreamPtr
{
  /* 0x0000 */ unsigned long _p;
}; /* size: 0x0004 */

class CBasedMarshalListPtr
{
  /* 0x0000 */ unsigned long _p;
}; /* size: 0x0004 */

class CBasedPagedVectorPtr
{
  /* 0x0000 */ unsigned long _p;
}; /* size: 0x0004 */

class CBasedPerContextPtr
{
  /* 0x0000 */ unsigned long _p;
}; /* size: 0x0004 */

class CBasedPubDocFilePtr
{
  /* 0x0000 */ unsigned long _p;
}; /* size: 0x0004 */

class CBasedPubStreamPtr
{
  /* 0x0000 */ unsigned long _p;
}; /* size: 0x0004 */

class CBasedRevertablePtr
{
  /* 0x0000 */ unsigned long _p;
}; /* size: 0x0004 */

class CBasedSStreamPtr
{
  /* 0x0000 */ unsigned long _p;
}; /* size: 0x0004 */

class CBasedSeekPointerPtr
{
  /* 0x0000 */ unsigned long _p;
}; /* size: 0x0004 */

class CBasedTSetMemberPtr
{
  /* 0x0000 */ unsigned long _p;
}; /* size: 0x0004 */

class CBasedTransactedStreamPtr
{
  /* 0x0000 */ unsigned long _p;
}; /* size: 0x0004 */

class CBasedUpdatePtr
{
  /* 0x0000 */ unsigned long _p;
}; /* size: 0x0004 */

class CBasedVectBitsPtr
{
  /* 0x0000 */ unsigned long _p;
}; /* size: 0x0004 */

class CBindCtx
{
  /* 0x0004 */ unsigned long m_refs;
  /* 0x0008 */ struct tagBIND_OPTS3 m_bindopts;
  /* 0x002c */ class CBindCtx::CObjList* m_pFirstObj;
  /* 0x0030 */ class CMapStringToPtr* m_pMap;
}; /* size: 0x0034 */

class CBindCtx::CObjList
{
  /* 0x0000 */ struct IUnknown* m_punk;
  /* 0x0004 */ class CBindCtx::CObjList* m_pNext;
}; /* size: 0x0008 */

class CBindStatusCallback
{
  /* 0x0008 */ long _cRef;
  /* 0x000c */ HRESULT _hr;
  /* 0x0010 */ void* _hEvent;
}; /* size: 0x0014 */

class CBlockHeader
{
  /* 0x0008 */ unsigned long _ulNext;
}; /* size: 0x000c */

class CBlockPreHeader
{
  /* 0x0000 */ unsigned long _ulSize;
  /* 0x0004 */ int _fFree;
}; /* size: 0x0008 */

class CBool
{
  /* 0x0000 */ int value;
}; /* size: 0x0004 */

class CCOMSurrogate
{
  union
  {
    /* 0x0000 */ struct ISurrogate* _pSurrogate;
    /* 0x0000 */ int _fNewStyleSurrogate;
  }; /* size: 0x0004 */
}; /* size: 0x0001 */

class CCache
{
  /* 0x0000 */ struct _RTL_SRWLOCK m_srwLock;
  /* 0x0004 */ struct tagElement** m_paBuckets;
  /* 0x0008 */ unsigned long m_cBuckets;
  /* 0x000c */ unsigned long m_cElements;
  /* 0x0010 */ __int64 m_i64LocalCacheCount;
}; /* size: 0x0018 */

class CCacheNode
{
  /* 0x0000 */ struct _GUID m_clsid;
  /* 0x0010 */ struct tagFORMATETC m_foretc;
  /* 0x0024 */ unsigned long m_advf;
  /* 0x0028 */ long m_lWidth;
  /* 0x002c */ long m_lHeight;
  /* 0x0030 */ unsigned long m_dwFlags;
  /* 0x0034 */ struct IStorage* m_pStg;
  /* 0x0038 */ int m_iStreamNum;
  /* 0x003c */ unsigned long m_dwPresBitsPos;
  /* 0x0040 */ unsigned long m_dwSavedPresBitsPos;
  /* 0x0044 */ int m_fConvert;
  /* 0x0048 */ struct IOlePresObj* m_pPresObj;
  /* 0x004c */ struct IOlePresObj* m_pPresObjAfterFreeze;
  /* 0x0050 */ struct IDataObject* m_pDataObject;
  /* 0x0054 */ unsigned long m_dwAdvConnId;
}; /* size: 0x0058 */

class CCallTable
{
  union
  {
    /* 0x0000 */ unsigned long m_cCalls;
    /* 0x0000 */ int m_fInitialized;
    /* 0x0000 */ class CPageAllocator m_Allocator;
  }; /* size: 0x0040 */
}; /* size: 0x0004 */

class CChannelHandle
{
  /* 0x0000 */ void* _hRpc;
  /* 0x0004 */ unsigned long _lAuthn;
  /* 0x0008 */ unsigned long _lImp;
  /* 0x000c */ void* _hToken;
  /* 0x0010 */ long _eState;
  /* 0x0014 */ int _fFirstCall;
  /* 0x0018 */ unsigned long _cRef;
  /* 0x001c */ struct _SCHANNEL_CRED _sCred;
  /* 0x0054 */ const struct _CERT_CONTEXT* _pCert;
}; /* size: 0x0058 */

class CChannelObject
{
  /* 0x0014 */ volatile unsigned long _dwState;
  /* 0x0018 */ unsigned long _cRefs;
  /* 0x001c */ unsigned long _dwAptID;
  /* 0x0020 */ class CClientCallMgr* _pCallMgr;
  /* 0x0024 */ class CCtxComChnl* _pChnl;
  /* 0x0028 */ HRESULT _hr;
  /* 0x002c */ class CAsyncCall* _pCall;
  /* 0x0030 */ struct ISynchronize* _pSync;
  /* 0x0034 */ struct SPendingCall _pendingCall;
  /* 0x0040 */ struct tagRPCOLEMESSAGE _msg;
}; /* size: 0x006c */

enum CChannelObject::eState
{
  STATE_ERROR = 1,
  STATE_READYFORGETBUFFER = 2,
  STATE_READYFORSEND = 3,
  STATE_SENDING = 4,
  STATE_READYFORSIGNAL = 5,
  STATE_RECEIVING = 6,
  STATE_READYFORRECEIVE = 7,
  STATE_READYFORFREEBUFFER = 8,
  STATE_AMBIGUOUS = 9,
};

class CChildInstanceList
{
  /* 0x0000 */ class CBasedRevertablePtr _prvHead;
}; /* size: 0x0004 */

class CClass
{
  /* 0x0000 */ struct _GUID m_clsid;
  /* 0x0010 */ wchar_t* m_szClsid;
}; /* size: 0x0014 */

class CClassCache
{
  union
  {
    /* 0x0000 */ unsigned long _dwFlags;
    /* 0x0000 */ class CRWLock _mxs;
    /* 0x0000 */ class CClassCache::CCEHashTable _ClassEntries;
    /* 0x0000 */ class CClassCache::CDPEHashTable _DllPathEntries;
    /* 0x0000 */ const unsigned long _cCEBuckets;
    /* 0x0000 */ const unsigned long _cDPEBuckets;
    /* 0x0000 */ struct SHashChain _CEBuckets[23];
    /* 0x0000 */ struct SHashChain _DPEBuckets[23];
    /* 0x0000 */ class CClassCache::CLSvrClassEntry* _MTALSvrsFront;
    /* 0x0000 */ class CClassCache::CLSvrClassEntry* _NTALSvrsFront;
    /* 0x0000 */ unsigned long _cRefsServerProcess;
    /* 0x0000 */ const unsigned long _CollectAtObjectCount;
    /* 0x0000 */ const unsigned long _CollectAtInterval;
    /* 0x0000 */ unsigned long _LastCollectionTickCount;
    /* 0x0000 */ unsigned long _LastObjectCount;
    /* 0x0000 */ class CClassCache::CCollectable* _ObjectsForCollection;
  }; /* size: 0x00b8 */
}; /* size: 0x0001 */

class CClassCache::CBaseClassEntry
{
  /* 0x0004 */ class CClassCache::CBaseClassEntry* _pNext;
  /* 0x0008 */ class CClassCache::CBaseClassEntry* _pPrev;
  /* 0x000c */ class CClassCache::CClassEntry* _pClassEntry;
  /* 0x0010 */ unsigned long _dwContext;
  /* 0x0014 */ unsigned long _dwSig;
}; /* size: 0x0018 */

class CClassCache::CCEHashTable
{
}; /* size: 0x0018 */

enum CClassCache::CCEHashTable::eFlags
{
  fTREAT_AS = 1,
  fINCOMPLETE = 2,
  fDO_NOT_HASH = 4,
  fCOMPLUS = 8,
  fSIDE_BY_SIDE = 16,
  fSIDE_BY_SIDE_WITH_NO_HASHING = 32,
};

class CClassCache::CClassEntry
{
  /* 0x000c */ struct SMultiGUIDHashNode _hashNode;
  /* 0x001c */ struct _GUID _guids[2];
  /* 0x003c */ unsigned long _dwSig;
  /* 0x0040 */ unsigned long _dwFlags;
  /* 0x0044 */ class CClassCache::CClassEntry* _pTreatAsList;
  /* 0x0048 */ class CClassCache::CBaseClassEntry* _pBCEListFront;
  /* 0x004c */ class CClassCache::CBaseClassEntry* _pBCEListBack;
  /* 0x0050 */ unsigned long _cLocks;
  /* 0x0054 */ unsigned long _dwFailedContexts;
  /* 0x0058 */ struct IComClassInfo* _pCI;
  union
  {
    /* 0x0000 */ const unsigned long TREAT_AS_SIG;
    /* 0x0000 */ const unsigned long CLASS_ENTRY_SIG;
    /* 0x0000 */ const unsigned long INCOMPLETE_ENTRY_SIG;
    /* 0x0000 */ unsigned long _dwSxSMaxHashCount;
    /* 0x0000 */ unsigned long _dwSxSHashCount;
    /* 0x0000 */ class CPageAllocator _palloc;
    /* 0x0000 */ const unsigned long _cNumPerPage;
  }; /* size: 0x0040 */
}; /* size: 0x005c */

enum CClassCache::CClassEntry::eFlags
{
  fTREAT_AS = 1,
  fINCOMPLETE = 2,
  fDO_NOT_HASH = 4,
  fCOMPLUS = 8,
  fSIDE_BY_SIDE = 16,
  fSIDE_BY_SIDE_WITH_NO_HASHING = 32,
};

enum CClassCache::CClassEntry::eGUIDIndex
{
  iCLSID = 0,
  iPartition = 1,
  iTotal = 2,
};

class CClassCache::CCollectable
{
  union
  {
    struct
    {
      /* 0x0000 */ class CClassCache::CCollectable* NOT_COLLECTED;
      /* 0x0004 */ class CClassCache::CCollectable* _pNextCollectee;
      /* 0x0008 */ unsigned long _dwTickLastTouched;
    }; /* size: 0x000c */
    /* 0x0000 */ unsigned long _dwCollectionGracePeriod;
    /* 0x0000 */ unsigned long _dwCollectionFrequency;
  }; /* size: 0x000c */
}; /* size: 0x000c */

class CClassCache::CDPEHashTable
{
}; /* size: 0x0018 */

class CClassCache::CDllAptEntry
{
  union
  {
    struct
    {
      /* 0x0000 */ class CClassCache::CDllAptEntry* _pNext;
      /* 0x0004 */ class CClassCache::CDllAptEntry* _pPrev;
      /* 0x0008 */ unsigned long _dwSig;
      /* 0x000c */ unsigned long _hApt;
      /* 0x0010 */ struct HINSTANCE__* _hDll;
    }; /* size: 0x0014 */
    /* 0x0000 */ const unsigned long SIG;
    /* 0x0000 */ class CPageAllocator _palloc;
    /* 0x0000 */ const unsigned long _cNumPerPage;
  }; /* size: 0x0040 */
}; /* size: 0x0014 */

class CClassCache::CDllClassEntry
{
  /* 0x0018 */ unsigned long _dwDllThreadModel;
  /* 0x001c */ class CClassCache::CDllPathEntry* _pDllPathEntry;
  /* 0x0020 */ class CClassCache::CDllClassEntry* _pDllClsNext;
  /* 0x0024 */ struct _GUID _impclsid;
  union
  {
    /* 0x0000 */ const unsigned long SIG;
    /* 0x0000 */ class CPageAllocator _palloc;
    /* 0x0000 */ const unsigned long _cNumPerPage;
  }; /* size: 0x0040 */
}; /* size: 0x0034 */

class CClassCache::CDllFnPtrMoniker
{
  /* 0x0004 */ unsigned long _cRefs;
  /* 0x0008 */ class CClassCache::CDllClassEntry* _pDCE;
}; /* size: 0x000c */

class CClassCache::CDllPathEntry
{
  union
  {
    struct
    {
      /* 0x0000 */ class CClassCache::CDllPathEntry* _pNext;
      /* 0x0004 */ class CClassCache::CDllPathEntry* _pPrev;
      /* 0x0008 */ unsigned long _dwHash;
      /* 0x000c */ wchar_t* _psPath;
      /* 0x0010 */ unsigned long _dwSig;
      /* 0x0014 */ void* _pfnGetClassObject /* function */;
      /* 0x0018 */ void* _pfnDllCanUnload /* function */;
      /* 0x001c */ unsigned long _dwFlags;
      /* 0x0020 */ int _fGCO_WAS_HERE;
      /* 0x0024 */ class CClassCache::CDllClassEntry* _p1stClass;
      /* 0x0028 */ unsigned long _cUsing;
      /* 0x002c */ class CClassCache::CDllAptEntry* _pAptEntryFront;
      /* 0x0030 */ class CClassCache::CDllAptEntry* _pAptEntryBack;
      /* 0x0034 */ struct HINSTANCE__* _hDll32;
      /* 0x0038 */ unsigned long _dwExpireTime;
    }; /* size: 0x003c */
    /* 0x0000 */ const unsigned long DLL_DELAY_UNLOAD_TIME;
    /* 0x0000 */ const char* DLL_GET_CLASS_OBJECT_EP /* zero-length array */;
    /* 0x0000 */ const char* DLL_CAN_UNLOAD_EP /* zero-length array */;
    /* 0x0000 */ const unsigned long SIG;
    /* 0x0000 */ class CPageAllocator _palloc;
    /* 0x0000 */ const unsigned long _cNumPerPage;
  }; /* size: 0x0040 */
}; /* size: 0x003c */

class CClassCache::CDllPathEntry::CFinishObject
{
  /* 0x0004 */ struct HINSTANCE__* _hDll;
  /* 0x0008 */ unsigned long _dwFlags;
}; /* size: 0x000c */

enum CClassCache::CDllPathEntry::eFlags
{
  fSIXTEEN_BIT = 1,
  fWX86 = 2,
  fIS_OLE32 = 4,
  fDELAYED_UNLOAD = 16,
};

class CClassCache::CFinishComposite
{
  /* 0x0000 */ struct CClassCache::CFinishComposite::node* _pFinishNodesFront;
  /* 0x0004 */ struct CClassCache::CFinishComposite::node* _pFinishNodesBack;
}; /* size: 0x0008 */

struct CClassCache::CFinishComposite::node
{
  /* 0x0000 */ struct CClassCache::CFinishComposite::node* _pNext;
  /* 0x0004 */ struct CClassCache::CFinishComposite::node* _pPrev;
  /* 0x0008 */ class IFinish* _pIF;
}; /* size: 0x000c */

class CClassCache::CLSvrClassEntry
{
  /* 0x0018 */ class CClassCache::CLSvrClassEntry* _pNextLSvr;
  /* 0x001c */ class CClassCache::CLSvrClassEntry* _pPrevLSvr;
  /* 0x0020 */ struct IUnknown* _pUnk;
  /* 0x0024 */ unsigned long _dwRegFlags;
  /* 0x0028 */ unsigned long _dwFlags;
  /* 0x002c */ unsigned long _dwScmReg;
  /* 0x0030 */ unsigned long _hApt;
  /* 0x0034 */ struct HWND__* _hWndDdeServer;
  /* 0x0038 */ class CObjServer* _pObjServer;
  /* 0x003c */ unsigned long _dwCookie;
  /* 0x0040 */ unsigned long _cUsing;
  union
  {
    /* 0x0000 */ const unsigned long SIG;
    /* 0x0000 */ const unsigned long DUMMY_SIG;
    /* 0x0000 */ const unsigned long NO_SCM_REG;
    /* 0x0000 */ unsigned long _dwNextCookieCount;
    /* 0x0000 */ unsigned long _cOutstandingObjects;
    /* 0x0000 */ class CPageAllocator _palloc;
    /* 0x0000 */ const unsigned long _cNumPerPage;
  }; /* size: 0x0040 */
}; /* size: 0x0044 */

class CClassCache::CLSvrClassEntry::CFinishObject
{
  /* 0x0004 */ unsigned long _dwScmReg;
  /* 0x0008 */ struct HWND__* _hWndDdeServer;
  /* 0x000c */ struct IUnknown* _pUnk;
  /* 0x0010 */ struct _GUID _clsid;
}; /* size: 0x0020 */

enum CClassCache::CLSvrClassEntry::eFlags
{
  fAT_STORAGE = 1,
  fREVOKE_PENDING = 2,
  fBEEN_USED = 16,
};

class CClassCache::CpUnkMoniker
{
  /* 0x0004 */ unsigned long _cRefs;
  /* 0x0008 */ struct IUnknown* _pUnk;
}; /* size: 0x000c */

class CClassCache::IMiniMoniker
{
}; /* size: 0x0004 */

struct CClassCache::ReleaseCatalogObjects::__l2::STmpCI
{
  /* 0x0000 */ struct IComClassInfo* arCI[10];
  /* 0x0028 */ struct CClassCache::ReleaseCatalogObjects::__l2::STmpCI* pNext;
}; /* size: 0x002c */

struct CClassCache::SDPEHashKey
{
  /* 0x0000 */ wchar_t* _pstr;
  /* 0x0004 */ unsigned long _dwDIPFlags;
}; /* size: 0x0008 */

enum CClassCache::eFlags
{
  fINITIALIZED = 1,
  fSHUTTINGDOWN = 2,
};

class CClassMoniker
{
  /* 0x000c */ long _cRefs;
  /* 0x0010 */ struct ClassMonikerData _data;
  /* 0x0024 */ void* _pExtra;
  /* 0x0028 */ wchar_t* _pszCodeBase;
  /* 0x002c */ unsigned long _dwFileVersionMS;
  /* 0x0030 */ unsigned long _dwFileVersionLS;
}; /* size: 0x0034 */

class CClassMonikerFactory
{
}; /* size: 0x0008 */

class CCliModalLoop
{
  /* 0x0000 */ HRESULT _hr;
  /* 0x0004 */ class CCliModalLoop* _pPrev;
  /* 0x0008 */ unsigned long _dwTIDCallee;
  /* 0x000c */ unsigned long _dwMsgQInputFlag;
  /* 0x0010 */ struct _GUID _lid;
  /* 0x0020 */ unsigned long _dwFlags;
  /* 0x0024 */ unsigned long _dwWaitFlags;
  /* 0x0028 */ unsigned int _wQuitCode;
  /* 0x002c */ unsigned long _dwTimeOfCall;
  /* 0x0030 */ unsigned long _dwWakeup;
  /* 0x0034 */ unsigned long _dwMillSecToWait;
  /* 0x0038 */ unsigned long _dwCancelTimeout;
  /* 0x003c */ int _fUseOldModalLoop;
  /* 0x0040 */ class CAptCallCtrl* _pACC;
  /* 0x0044 */ void* _hToken;
  /* 0x0048 */ int _fCoWaitCalled;
}; /* size: 0x004c */

class CCliRotHintTable
{
  /* 0x0004 */ void* _hSm;
}; /* size: 0x0008 */

class CClientCall
{
  /* 0x00c8 */ unsigned long m_cRefs;
  /* 0x00cc */ unsigned long m_dwFlags;
  /* 0x00d0 */ void* m_hThread;
  /* 0x00d4 */ unsigned long m_dwThreadId;
  union
  {
    /* 0x0000 */ void* _aList[8];
    /* 0x0000 */ unsigned long _iNext;
  }; /* size: 0x0020 */
}; /* size: 0x00d8 */

class CClientCallMgr
{
  /* 0x0010 */ class CClientCallMgr::CPrivUnknown _privUnk;
  /* 0x0014 */ unsigned long _dwFlags;
  /* 0x0018 */ unsigned long _cRefs;
  /* 0x001c */ struct IUnknown* _pUnkOuter;
  /* 0x0020 */ class CClientCallMgr* _pNextMgr;
  /* 0x0024 */ struct _GUID _asyncIID;
  /* 0x0034 */ class CStdIdentity* _pStdId;
  /* 0x0038 */ struct IRpcProxyBuffer* _pProxyObj;
  /* 0x003c */ class CChannelObject* _pChnlObj;
  /* 0x0040 */ struct IClientSecurity* _pICS;
  /* 0x0044 */ struct ICancelMethodCalls* _pICMC;
  /* 0x0048 */ class CStdEvent _cStdEvent;
}; /* size: 0x0064 */

class CClientCallMgr::CPrivUnknown
{
}; /* size: 0x0004 */

class CClientContextActivator
{
}; /* size: 0x0004 */

class CClientSecurity
{
  /* 0x0004 */ class CStdIdentity* _pStdId;
}; /* size: 0x0008 */

class CClipDataObject
{
  /* 0x0008 */ void* m_hOle1;
  /* 0x000c */ struct IUnknown* m_pUnkOle1;
  /* 0x0010 */ unsigned long m_refs;
  /* 0x0014 */ unsigned long m_Internalrefs;
  /* 0x0018 */ struct FORMATETCDATAARRAY* m_pFormatEtcDataArray;
  /* 0x001c */ struct IDataObject* m_pDataObject;
  /* 0x0020 */ int m_fTriedToGetDataObject;
}; /* size: 0x0024 */

class CCoTaskAllocator
{
}; /* size: 0x0004 */

class CComActivator
{
  /* 0x000c */ long _ulRef;
  /* 0x0010 */ class OpaqueDataInfo* _pOpaqueData;
  /* 0x0014 */ class SpecialProperties* _pProps;
  /* 0x0018 */ int _fActPropsInitNecessary;
}; /* size: 0x001c */

class CComApartment
{
  /* 0x0004 */ unsigned long _cRefs;
  /* 0x0008 */ unsigned long _dwState;
  /* 0x000c */ enum tagAPTKIND _AptKind;
  /* 0x0010 */ unsigned long _AptId;
  /* 0x0014 */ class OXIDEntry* _pOXIDEntry;
  /* 0x0018 */ class CRemoteUnknown* _pRemUnk;
  /* 0x001c */ long _cWaiters;
  /* 0x0020 */ void* _hEventOID;
  /* 0x0024 */ unsigned long _cPreRegOidsAvail;
  /* 0x0028 */ unsigned __int64 _arPreRegOids[20];
  /* 0x00c8 */ unsigned long _cOidsReturn;
  /* 0x00d0 */ unsigned __int64 _arOidsReturn[20];
  /* 0x0170 */ struct CComApartment::MessageListHead _arMessageParams[8];
  /* 0x01b0 */ int _fInitializedCS;
  /* 0x01b4 */ struct _RTL_CRITICAL_SECTION _csMessageParams;
}; /* size: 0x01d0 */

struct CComApartment::MessageListHead
{
  /* 0x0000 */ class IMessageParam* pFirst;
  /* 0x0004 */ class IMessageParam* pLast;
}; /* size: 0x0008 */

class CComCat
{
  /* 0x0008 */ class CComCat::CInnerUnk* m_punkInner;
  /* 0x000c */ struct IUnknown* m_punkOuter;
  /* 0x0010 */ struct ICatInformation* m_pcsICatInfo;
  /* 0x0014 */ struct _RTL_CRITICAL_SECTION m_csCatInfoInit;
  /* 0x002c */ unsigned long m_dwRefCount;
  /* 0x0030 */ int m_fCsFlag;
  /* 0x0034 */ int m_bLockValid;
}; /* size: 0x0038 */

class CComCat::CInnerUnk
{
  /* 0x0004 */ class CComCat* m_pObj;
}; /* size: 0x0008 */

class CComCatalog
{
  /* 0x0018 */ long m_cRef;
  /* 0x001c */ struct IComCatalogInternal* m_pCatalogRegNative;
  /* 0x0020 */ struct IComCatalogInternal* m_pCatalogCOMBaseInCLB;
  /* 0x0024 */ struct IComCatalogInternal* m_pCatalogRegNonNative;
  /* 0x0028 */ struct IComCatalogInternal* m_pCatalogCLB;
  /* 0x002c */ struct IComCatalogInternal* m_pCatalogSxS;
  union
  {
    /* 0x0000 */ int ms_fComPlusEnabled;
    /* 0x0000 */ int ms_fComPlusEnabledInitialized;
    /* 0x0000 */ int ms_fComPlusCatalogsResolved;
    /* 0x0000 */ int ms_fInitialized;
  }; /* size: 0x0004 */
}; /* size: 0x0030 */

class CComClassInfo
{
  /* 0x0014 */ long m_cRef;
  /* 0x0018 */ long m_cLocks;
  /* 0x001c */ struct _GUID m_clsid;
  /* 0x002c */ struct _GUID m_guidProcessId;
  /* 0x003c */ enum tagLocalServerType m_serverType;
  /* 0x0040 */ struct IUnknown* m_pProcessInfo;
  /* 0x0044 */ wchar_t m_wszClsidString[45];
  /* 0x00a0 */ wchar_t* m_pwszProgid;
  /* 0x00a4 */ wchar_t* m_pwszClassName;
  /* 0x00a8 */ int m_clsctx;
  /* 0x00ac */ int m_threadingmodel;
  /* 0x00b0 */ unsigned long m_regType;
  /* 0x00b4 */ wchar_t* m_pwszInprocServer32;
  /* 0x00b8 */ wchar_t* m_pwszInprocHandler32;
  /* 0x00bc */ wchar_t* m_pwszLocalServer;
  /* 0x00c0 */ wchar_t* m_pwszInprocServer16;
  /* 0x00c4 */ wchar_t* m_pwszInprocHandler16;
  /* 0x00c8 */ wchar_t* m_pwszSurrogateCommand;
  /* 0x00cc */ wchar_t* m_pwszServerExecutable;
  /* 0x00d0 */ unsigned long m_dwPreferredServerBitness;
  /* 0x00d4 */ unsigned long m_dwLocalServer32BinaryBitness;
  /* 0x00d8 */ int m_bLUAEnabled;
  /* 0x00dc */ wchar_t* m_pwszDisplayName;
  /* 0x00e0 */ wchar_t* m_pwszBinaryName;
  /* 0x00e4 */ wchar_t* m_pwszIconReference;
  /* 0x00e8 */ struct _KEY_FULL_INFORMATION* m_pKeyInformation;
  /* 0x00ec */ struct _KEY_NAME_INFORMATION* m_pKeyNameInformation;
}; /* size: 0x00f0 */

class CComNoClassInfo
{
  /* 0x000c */ long m_cRef;
  /* 0x0010 */ struct _GUID m_clsid;
  /* 0x0020 */ wchar_t* m_wszProgID;
  /* 0x0024 */ unsigned long m_ValueFlags;
}; /* size: 0x0028 */

class CComProcessInfo
{
  /* 0x000c */ long m_cRef;
  /* 0x0010 */ struct _GUID m_guidProcessId;
  /* 0x0020 */ wchar_t* m_pwszProcessName;
  /* 0x0024 */ enum tagProcessType m_eProcessType;
  /* 0x0028 */ wchar_t* m_pwszServiceName;
  /* 0x002c */ wchar_t* m_pwszServiceParameters;
  /* 0x0030 */ int m_fActivateAtStorage;
  /* 0x0034 */ wchar_t* m_pwszRunAsUser;
  /* 0x0038 */ enum tagRunAsType m_eRunAsType;
  /* 0x003c */ wchar_t* m_pwszSurrogatePath;
  /* 0x0040 */ struct _SECURITY_DESCRIPTOR* m_pLaunchPermission;
  /* 0x0044 */ unsigned long m_cbLaunchPermission;
  /* 0x0048 */ unsigned long m_dwAuthenticationLevel;
  /* 0x004c */ unsigned long m_dwROTFlags;
  /* 0x0050 */ unsigned long m_dwAppIDFlags;
  /* 0x0054 */ wchar_t* m_pwszRemoteServerName;
  /* 0x0058 */ unsigned long m_dwFlags;
  /* 0x005c */ unsigned long m_dwSaferTrustLevel;
  /* 0x0060 */ struct _KEY_FULL_INFORMATION* m_pKeyInformation;
  /* 0x0064 */ struct _KEY_NAME_INFORMATION* m_pKeyNameInformation;
  union
  {
    /* 0x0000 */ int m_fGotLegacyLevels;
    /* 0x0000 */ unsigned long m_dwLegacyAuthenticationLevel;
    /* 0x0000 */ unsigned long m_dwLegacyImpersonationLevel;
  }; /* size: 0x0004 */
  /* 0x0068 */ unsigned long m_dwPreferredServerBitness;
  /* 0x006c */ wchar_t* m_pwszSurrogateCommandDebug;
  /* 0x0070 */ wchar_t* m_pwszServerExecutable;
  /* 0x0074 */ int m_bLoadUserSettings;
  /* 0x0078 */ int m_fDebugSurrogate;
}; /* size: 0x007c */

class CComRegCatalog
{
  /* 0x0004 */ unsigned long m_regType;
  /* 0x0008 */ long m_cRef;
  /* 0x000c */ struct HKEY__* m_hkeyClassesRoot;
}; /* size: 0x0010 */

class CComSxSCatalog
{
  /* 0x0004 */ long m_cRef;
}; /* size: 0x0008 */

class CComSxSClassInfo
{
  /* 0x000c */ long m_cRef;
  /* 0x0010 */ long m_cLocks;
  /* 0x0014 */ long m_cLocksExternal;
  /* 0x0018 */ void* m_hActCtx;
  /* 0x001c */ const struct _ACTIVATION_CONTEXT_DATA_COM_SERVER_REDIRECTION* m_pData;
  /* 0x0020 */ unsigned long m_ulDataLength;
  /* 0x0024 */ void* m_pSectionBase;
  /* 0x0028 */ unsigned long m_ulSectionLength;
  /* 0x002c */ wchar_t m_bufModulePath[260];
}; /* size: 0x0234 */

class CCompositeMoniker
{
  /* 0x0014 */ class CTrackingCompositeMoniker _tcm;
  /* 0x001c */ struct IMoniker* m_pmkLeft;
  /* 0x0020 */ struct IMoniker* m_pmkRight;
  /* 0x0024 */ int m_fReduced;
  /* 0x0028 */ int m_fReduceForced;
}; /* size: 0x002c */

class CCompositeMonikerEnum
{
  /* 0x0004 */ unsigned long m_refs;
  /* 0x0008 */ class CCompositeMoniker* m_pCM;
  /* 0x000c */ int m_fForward;
  /* 0x0010 */ struct CCompositeMonikerEnum::se* m_pBase;
  /* 0x0014 */ struct CCompositeMonikerEnum::se* m_pTop;
  /* 0x0018 */ struct IMoniker* m_pNext;
}; /* size: 0x001c */

struct CCompositeMonikerEnum::se
{
  /* 0x0000 */ class CCompositeMoniker* m_pCM;
  /* 0x0004 */ struct CCompositeMonikerEnum::se* m_pseNext;
  /* 0x0008 */ struct CCompositeMonikerEnum::se* m_psePrev;
}; /* size: 0x000c */

class CConnectionPoint
{
  /* 0x0004 */ unsigned long _dwCookie;
  /* 0x0008 */ long _cReferences;
  /* 0x000c */ class CSinkList* _pSinkHead;
  /* 0x0010 */ struct IDocfileAsyncConnectionPoint* _pParentCP;
  /* 0x0014 */ int _fCSInitialized;
  /* 0x0018 */ struct _RTL_CRITICAL_SECTION _csSinkList;
}; /* size: 0x0030 */

class CContext
{
  /* 0x0000 */ unsigned long ctxid;
  /* 0x0004 */ class CBasedContextPtr pctxNext;
}; /* size: 0x0008 */

class CContextLife
{
  /* 0x0000 */ unsigned long _dwAlive;
  /* 0x0004 */ long _cRefs;
}; /* size: 0x0008 */

class CContextList
{
  /* 0x0000 */ class CBasedContextPtr _pctxHead;
  /* 0x0004 */ long _cReferences;
}; /* size: 0x0008 */

class CContextPropList
{
  union
  {
    struct
    {
      /* 0x0000 */ int _Max;
      /* 0x0004 */ int _iFirst;
      /* 0x0008 */ int _iLast;
      /* 0x000c */ int _Count;
      /* 0x0010 */ int _cCompareProps;
      /* 0x0014 */ unsigned long _Hash;
      /* 0x0018 */ int _slotIdx;
      /* 0x001c */ struct tagContextProperty* _pProps;
      /* 0x0020 */ int* _pSlots;
      /* 0x0024 */ struct tagContextProperty* _pCompareBuffer;
      /* 0x0028 */ struct _tagSCtxListIndex* _pIndex;
    }; /* size: 0x002c */
    /* 0x0000 */ class CPageAllocator s_NodeAllocator;
  }; /* size: 0x0040 */
}; /* size: 0x002c */

class CContextSwitcher
{
  /* 0x0004 */ class CObjectContext* _context;
  /* 0x0008 */ long _cRefs;
}; /* size: 0x000c */

class CContinue
{
  /* 0x0004 */ long _cRef;
  /* 0x0008 */ void* _pfnContinue /* function */;
  /* 0x000c */ long _dwContinue;
}; /* size: 0x0010 */

class CCtxCall
{
  /* 0x0004 */ unsigned long _dwFlags;
  /* 0x0008 */ unsigned long _dwStage;
  /* 0x000c */ unsigned long _cMarshalItfs;
  /* 0x0010 */ unsigned long _cUnmarshalItfs;
  /* 0x0014 */ unsigned long _cFree;
  /* 0x0018 */ unsigned long _cError;
  /* 0x001c */ int _fError;
  /* 0x0020 */ unsigned long _dwDestCtx;
  /* 0x0024 */ unsigned long _cItfs;
  /* 0x0028 */ unsigned long _idx;
  /* 0x002c */ void** _ppItfs;
  /* 0x0030 */ unsigned long _cPolicies;
  /* 0x0034 */ unsigned long _cbExtent;
  /* 0x0038 */ void* _pvExtent;
  /* 0x003c */ HRESULT _hr;
  /* 0x0040 */ class CPolicySet* _pPS;
  /* 0x0044 */ class CObjectContext* _pContext;
  /* 0x0048 */ unsigned long _dataRep;
  /* 0x004c */ HRESULT _hrServer;
  union
  {
    /* 0x0000 */ void* s_pAllocList[20];
    /* 0x0000 */ int s_iAvailable;
    /* 0x0000 */ class COleStaticMutexSem _mxsCtxCallLock;
  }; /* size: 0x0050 */
}; /* size: 0x0050 */

class CCtxChnl
{
  /* 0x0008 */ unsigned long _dwState;
  /* 0x000c */ unsigned long _cRefs;
  /* 0x0010 */ class IFaceEntry* _pIFaceEntry;
  /* 0x0014 */ class CStdWrapper* _pStdWrapper;
  /* 0x0000 */ class CPageAllocator s_allocator;
}; /* size: 0x0018 */

class CCtxComChnl
{
  union
  {
    /* 0x0000 */ class CPageAllocator s_allocator;
    struct
    {
      /* 0x0000 */ class COleStaticMutexSem _mxsCtxChnlLock;
      /* 0x003c */ class CObjectContext* _disconnectCtx;
    }; /* size: 0x0034 */
  }; /* size: 0x0040 */
}; /* size: 0x0040 */

class CCtxConnectionManager
{
  /* 0x0000 */ class CpUnkList* _pUnkList;
  /* 0x0004 */ class CObjServer* _pobjServer;
  /* 0x0008 */ volatile int _cObjRefs;
  /* 0x000c */ BOOL _disconnecting;
  /* 0x0010 */ void* _hdisconnectEvent;
  /* 0x0014 */ class CMutexSem2 _mutex;
  /* 0x0030 */ unsigned long _cRefs;
}; /* size: 0x0034 */

class CCtxHook
{
}; /* size: 0x0004 */

class CCtxPropHashTable
{
}; /* size: 0x0018 */

class CCtxTable
{
  union
  {
    /* 0x0000 */ class CCtxPropHashTable s_CtxPropHashTable;
    /* 0x0000 */ class CCtxUUIDHashTable s_CtxUUIDHashTable;
    /* 0x0000 */ struct SHashChain s_CtxPropBuckets[23];
    /* 0x0000 */ struct SHashChain s_CtxUUIDBuckets[23];
    /* 0x0000 */ int s_fInitialized;
  }; /* size: 0x00b8 */
}; /* size: 0x0001 */

class CCtxUUIDHashTable
{
}; /* size: 0x0018 */

class CDAHolder
{
  /* 0x0014 */ unsigned long m_dwConnection;
  /* 0x0018 */ int m_iSize;
  /* 0x001c */ struct tagSTATDATA* m_pSD;
}; /* size: 0x0020 */

class CDDEServer
{
  /* 0x0000 */ struct _GUID m_clsid;
  /* 0x0010 */ unsigned long m_dwClassFactoryKey;
  /* 0x0014 */ struct IClassFactory* m_pClassFactory;
  /* 0x0018 */ class CDdeServerCallMgr m_pCallMgr;
  /* 0x002c */ int m_bTerminate;
  /* 0x0030 */ struct HWND__* m_hwnd;
  /* 0x0034 */ void* m_hcli;
  /* 0x0038 */ int m_termNo;
  /* 0x003c */ int m_cSrvrClients;
  /* 0x0040 */ unsigned long m_fcfFlags;
  /* 0x0044 */ enum CNVTYP m_cnvtyp;
  /* 0x0048 */ enum CHK m_chk;
  /* 0x004c */ unsigned short m_aClass;
  /* 0x004e */ unsigned short m_aOriginalClass;
  /* 0x0050 */ unsigned short m_aExe;
  /* 0x0054 */ int m_fDoNotDestroyWindow;
}; /* size: 0x0058 */

enum CDFB_CLASSTYPE
{
  CDFB_DIRECTDOCFILE = 0,
  CDFB_DIRECTSTREAM = 1,
  CDFB_WRAPPEDDOCFILE = 2,
  CDFB_TRANSACTEDSTREAM = 3,
};

class CDFBasis
{
  union
  {
    struct
    {
      /* 0x0000 */ class CBasedMStreamPtr _pms;
      /* 0x0004 */ class CBasedMStreamPtr _pmsScratch;
      /* 0x0008 */ struct ILockBytes* _plkbBase;
      /* 0x000c */ struct CFileStream* _pfstDirty;
      /* 0x0010 */ struct ILockBytes* _plkbOriginal;
      /* 0x0014 */ const unsigned long _dfOpen;
      /* 0x0018 */ long _cReferences;
      /* 0x001c */ class CBasedPubDocFilePtr _pdfCopyBase;
      /* 0x0020 */ class CBasedGlobalContextPtr _pgcGlobalContext;
      /* 0x0024 */ unsigned long _dwOrigLocks;
      /* 0x0028 */ class CFreeList _afrl[4];
    }; /* size: 0x0038 */
    /* 0x0000 */ unsigned int _aReserveSize[4];
  }; /* size: 0x0038 */
  /* 0x0038 */ int _fDirectWriterMode;
  /* 0x003c */ int _fWriteLocked;
  /* 0x0040 */ struct IMalloc* const _pMalloc;
}; /* size: 0x0044 */

class CDIFat
{
  /* 0x0000 */ class CFatVector _fv;
  /* 0x0020 */ class CBasedMStreamPtr _pmsParent;
  /* 0x0024 */ unsigned long _cfsTable;
  /* 0x0028 */ int _fDoingFixup;
  /* 0x002c */ unsigned long _cUnmarked;
  /* 0x0030 */ unsigned long _sectUnmarked[8];
  /* 0x0050 */ unsigned long _sectMarkTo[8];
  /* 0x0070 */ unsigned long _sectFree[8];
}; /* size: 0x0090 */

class CDWORDHashTable
{
}; /* size: 0x0018 */

class CData
{
  /* 0x0000 */ unsigned long m_cbSize;
  /* 0x0004 */ void* m_pv;
  /* 0x0008 */ void* m_h;
  /* 0x000c */ int m_fNoFree;
}; /* size: 0x0010 */

class CDataAdviseCache
{
  /* 0x0000 */ struct IDataAdviseHolder* m_pDAH;
  /* 0x0004 */ class CMapDwordDword m_mapClientToDelegate;
}; /* size: 0x002c */

class CDbgGuidStr
{
}; /* size: 0x0001 */

class CDdeConnectionTable
{
  /* 0x0000 */ void* m_h;
  /* 0x0004 */ unsigned long m_cinfo;
}; /* size: 0x0008 */

class CDdeObject
{
  /* 0x0000 */ int m_fDoingSendOnDataChange;
  /* 0x0004 */ unsigned long m_cRefCount;
  /* 0x0008 */ struct CDdeObject::CUnknownImpl m_Unknown;
  /* 0x0010 */ struct CDdeObject::COleObjectImpl m_Ole;
  /* 0x0018 */ struct CDdeObject::CDataObjectImpl m_Data;
  /* 0x0020 */ struct CDdeObject::CPersistStgImpl m_PersistStg;
  /* 0x0028 */ struct CDdeObject::CProxyManagerImpl m_ProxyMgr;
  /* 0x0030 */ struct CDdeObject::COleItemContainerImpl m_OleItemContainer;
  /* 0x0038 */ struct CDdeObject::CRpcStubBufferImpl m_RpcStubBuffer;
  /* 0x0040 */ unsigned long m_refs;
  /* 0x0044 */ unsigned long m_ulObjType;
  /* 0x0048 */ struct _GUID m_clsid;
  /* 0x0058 */ unsigned short m_aClass;
  /* 0x005a */ unsigned short m_aExeName;
  /* 0x005c */ unsigned short m_aTopic;
  /* 0x005e */ unsigned short m_aItem;
  /* 0x0060 */ int m_bRunning;
  /* 0x0064 */ struct IUnknown* m_pUnkOuter;
  /* 0x0068 */ struct IOleClientSite* m_pOleClientSite;
  /* 0x006c */ struct IStorage* m_pstg;
  /* 0x0070 */ int m_bInitNew;
  /* 0x0074 */ int m_bOldSvr;
  /* 0x0078 */ void* m_hNative;
  /* 0x007c */ void* m_hPict;
  /* 0x0080 */ void* m_hExtra;
  /* 0x0084 */ unsigned short m_cfPict;
  /* 0x0086 */ unsigned short m_cfExtra;
  /* 0x0088 */ int m_fDidSendOnClose;
  /* 0x008c */ int m_fNoStdCloseDoc;
  /* 0x0090 */ int m_fDidStdCloseDoc;
  /* 0x0094 */ int m_fDidStdOpenDoc;
  /* 0x0098 */ int m_fDidGetObject;
  /* 0x009c */ int m_fDidLaunchApp;
  /* 0x00a0 */ int m_fUpdateOnSave;
  /* 0x00a4 */ int m_fGotCloseData;
  /* 0x00a8 */ unsigned long m_cLocks;
  /* 0x00ac */ int m_fVisible;
  /* 0x00b0 */ int m_fWasEverVisible;
  /* 0x00b4 */ int m_fCalledOnShow;
  /* 0x00b8 */ unsigned long m_chk;
  /* 0x00bc */ struct tagDVTARGETDEVICE* m_ptd;
  /* 0x00c0 */ int m_iAdvClose;
  /* 0x00c4 */ int m_iAdvSave;
  /* 0x00c8 */ int m_iAdvChange;
  /* 0x00cc */ int m_fDidAdvNative;
  /* 0x00d0 */ unsigned short m_wTerminate;
  /* 0x00d4 */ struct IDataAdviseHolder* m_pDataAdvHolder;
  /* 0x00d8 */ struct IOleAdviseHolder* m_pOleAdvHolder;
  /* 0x00dc */ class CDdeConnectionTable m_ConnectionTable;
  /* 0x00e4 */ class DDE_CHANNEL* m_pSysChannel;
  /* 0x00e8 */ class DDE_CHANNEL* m_pDocChannel;
}; /* size: 0x00ec */

struct CDdeObject::CDataObjectImpl
{
  /* 0x0004 */ class CDdeObject* m_pDdeObject;
}; /* size: 0x0008 */

struct CDdeObject::COleItemContainerImpl
{
  /* 0x0004 */ class CDdeObject* m_pDdeObject;
}; /* size: 0x0008 */

struct CDdeObject::COleObjectImpl
{
  /* 0x0004 */ class CDdeObject* m_pDdeObject;
}; /* size: 0x0008 */

struct CDdeObject::CPersistStgImpl
{
  /* 0x0004 */ class CDdeObject* m_pDdeObject;
}; /* size: 0x0008 */

struct CDdeObject::CProxyManagerImpl
{
  /* 0x0004 */ class CDdeObject* m_pDdeObject;
}; /* size: 0x0008 */

struct CDdeObject::CRpcStubBufferImpl
{
  /* 0x0004 */ class CDdeObject* m_pDdeObject;
}; /* size: 0x0008 */

struct CDdeObject::CUnknownImpl
{
  /* 0x0004 */ class CDdeObject* m_pDdeObject;
}; /* size: 0x0008 */

class CDdeServerCallMgr
{
  /* 0x000c */ class CDefClient* m_pDefClient;
  /* 0x0010 */ class CDDEServer* m_pDDEServer;
}; /* size: 0x0014 */

class CDebugChannelHook
{
}; /* size: 0x0004 */

class CDebugEventFire
{
  /* 0x0004 */ unsigned long _cRef;
  /* 0x0008 */ struct _RTL_CRITICAL_SECTION _csEventFire;
  /* 0x0020 */ int _fLogDisabled;
  /* 0x0024 */ struct _GUID _guidSession;
  /* 0x0034 */ wchar_t* _strSessionName;
  /* 0x0038 */ struct ISystemDebugEventFire* _pEventFire;
  /* 0x003c */ struct IUnknown* _punkFTM;
}; /* size: 0x0040 */

class CDebugEventFireCF
{
}; /* size: 0x0004 */

class CDefClassFactory
{
  /* 0x000c */ struct _GUID m_clsid;
}; /* size: 0x001c */

class CDefClient
{
  /* 0x0000 */ enum CHK m_chk;
  /* 0x0004 */ class CDdeServerCallMgr m_pCallMgr;
  /* 0x0018 */ enum tagSERVERCALLEX m_CallState;
  /* 0x001c */ struct IUnknown* m_pUnkOuter;
  /* 0x0020 */ struct IOleObject* m_lpoleObj;
  /* 0x0024 */ struct IDataObject* m_lpdataObj;
  /* 0x0028 */ int m_bCreateInst;
  /* 0x002c */ int m_bTerminate;
  /* 0x0030 */ int m_termNo;
  /* 0x0034 */ unsigned short m_aItem;
  /* 0x0038 */ void* m_hcli;
  /* 0x003c */ class CDefClient* m_lpNextItem;
  /* 0x0040 */ int m_bContainer;
  /* 0x0044 */ int m_cRef;
  /* 0x0048 */ struct HWND__* m_hwnd;
  /* 0x004c */ void* m_hdevInfo;
  /* 0x0050 */ void* m_hcliInfo;
  /* 0x0054 */ int m_fDidRealSetHostNames;
  /* 0x0058 */ int m_fDidSetClientSite;
  /* 0x005c */ int m_fGotDdeAdvise;
  /* 0x0060 */ int m_fCreatedNotConnected;
  /* 0x0064 */ int m_fInOnClose;
  /* 0x0068 */ int m_fInOleSave;
  /* 0x006c */ struct EXECUTEACK m_ExecuteAck;
  /* 0x007c */ unsigned long m_dwConnectionOleObj;
  /* 0x0080 */ unsigned long m_dwConnectionDataObj;
  /* 0x0084 */ struct ILockBytes* m_plkbytNative;
  /* 0x0088 */ struct IStorage* m_pstgNative;
  /* 0x008c */ int m_fRunningInSDI;
  /* 0x0090 */ class CDDEServer* m_psrvrParent;
  /* 0x0094 */ struct tagDVTARGETDEVICE* m_ptd;
  /* 0x0098 */ int m_fGotStdCloseDoc;
  /* 0x009c */ int m_fGotEditNoPokeNativeYet;
  /* 0x00a0 */ int m_fLocked;
  /* 0x00a4 */ int m_fCallData;
  /* 0x00a8 */ int m_fEmbed;
  /* 0x00ac */ int m_cClients;
  /* 0x00b0 */ class CDefClient* m_pdoc;
  /* 0x00b4 */ struct CDefClient::CUnknownImpl m_Unknown;
  /* 0x00bc */ struct CDefClient::COleClientSiteImpl m_OleClientSite;
  /* 0x00c4 */ struct CDefClient::CAdviseSinkImpl m_AdviseSink;
}; /* size: 0x00cc */

struct CDefClient::CAdviseSinkImpl
{
  /* 0x0004 */ class CDefClient* m_pDefClient;
}; /* size: 0x0008 */

struct CDefClient::COleClientSiteImpl
{
  /* 0x0004 */ class CDefClient* m_pDefClient;
}; /* size: 0x0008 */

struct CDefClient::CUnknownImpl
{
  /* 0x0004 */ class CDefClient* m_pDefClient;
}; /* size: 0x0008 */

class CDefLink
{
  /* 0x0030 */ class CDefLink::CPrivUnknown m_Unknown;
  /* 0x0034 */ class CDefLink::CAdvSinkImpl m_AdviseSink;
  /* 0x0038 */ unsigned long m_flags;
  /* 0x003c */ unsigned long m_dwObjFlags;
  /* 0x0040 */ struct IDataObject* m_pDataDelegate;
  /* 0x0044 */ struct IOleObject* m_pOleDelegate;
  /* 0x0048 */ struct IRunnableObject* m_pRODelegate;
  /* 0x004c */ struct IOleItemContainer* m_pOleItemContainerDelegate;
  /* 0x0050 */ HRESULT m_ContentSRVMSHResult;
  /* 0x0054 */ unsigned long m_ContentSRVMSBits;
  /* 0x0058 */ HRESULT m_ContentREGMSHResult;
  /* 0x005c */ unsigned long m_ContentREGMSBits;
  /* 0x0060 */ unsigned long m_cRefsOnLink;
  /* 0x0064 */ struct IUnknown* m_pUnkOuter;
  /* 0x0068 */ struct IMoniker* m_pMonikerAbs;
  /* 0x006c */ struct IMoniker* m_pMonikerRel;
  /* 0x0070 */ struct IUnknown* m_pUnkDelegate;
  /* 0x0074 */ unsigned long m_dwUpdateOpt;
  /* 0x0078 */ struct _GUID m_clsid;
  /* 0x0088 */ struct IStorage* m_pStg;
  /* 0x008c */ class COleCache* m_pCOleCache;
  /* 0x0090 */ class COAHolder* m_pCOAHolder;
  /* 0x0094 */ unsigned long m_dwConnOle;
  /* 0x0098 */ class CDataAdviseCache* m_pDataAdvCache;
  /* 0x009c */ struct IOleClientSite* m_pAppClientSite;
  /* 0x00a0 */ unsigned long m_dwConnTime;
  /* 0x00a4 */ struct _FILETIME m_ltChangeOfUpdate;
  /* 0x00ac */ struct _FILETIME m_ltKnownUpToDate;
  /* 0x00b4 */ struct _FILETIME m_rtUpdate;
}; /* size: 0x00bc */

typedef enum _TAG_UNNAMED_25
{
  None = 0,
  Relative = 1,
  Ids = 2,
  Absolute = 3,
} TAG_UNNAMED_25, *PTAG_UNNAMED_25;

class CDefLink::CAdvSinkImpl
{
}; /* size: 0x0004 */

class CDefLink::CPrivUnknown
{
}; /* size: 0x0004 */

class CDefObject
{
  /* 0x0030 */ class CDefObject::CPrivUnknown m_Unknown;
  /* 0x0034 */ class CDefObject::CAdvSinkImpl m_AdviseSink;
  /* 0x0038 */ HRESULT m_ContentSRVMSHResult;
  /* 0x003c */ unsigned long m_ContentSRVMSBits;
  /* 0x0040 */ HRESULT m_ContentREGMSHResult;
  /* 0x0044 */ unsigned long m_ContentREGMSBits;
  /* 0x0048 */ struct IOleObject* m_pOleDelegate;
  /* 0x004c */ struct IDataObject* m_pDataDelegate;
  /* 0x0050 */ struct IPersistStorage* m_pPSDelegate;
  /* 0x0054 */ unsigned long m_cConnections;
  /* 0x0058 */ struct IUnknown* m_pUnkOuter;
  /* 0x005c */ struct _GUID m_clsidServer;
  /* 0x006c */ struct _GUID m_clsidBits;
  /* 0x007c */ unsigned long m_flags;
  /* 0x0080 */ unsigned long m_dwObjFlags;
  /* 0x0084 */ struct IClassFactory* m_pCFDelegate;
  /* 0x0088 */ struct IUnknown* m_pUnkDelegate;
  /* 0x008c */ struct IProxyManager* m_pProxyMgr;
  /* 0x0090 */ class COleCache* m_pCOleCache;
  /* 0x0094 */ class COAHolder* m_pOAHolder;
  /* 0x0098 */ unsigned long m_dwConnOle;
  /* 0x009c */ struct IOleClientSite* m_pAppClientSite;
  /* 0x00a0 */ struct IStorage* m_pStg;
  /* 0x00a4 */ char* m_pHostNames;
  /* 0x00a8 */ unsigned long m_ibCntrObj;
  /* 0x00ac */ class CDataAdviseCache* m_pDataAdvCache;
}; /* size: 0x00b0 */

class CDefObject::CAdvSinkImpl
{
}; /* size: 0x0004 */

class CDefObject::CPrivUnknown
{
}; /* size: 0x0004 */

class CDelayUnlockContainer
{
  /* 0x0004 */ unsigned long m_refs;
  /* 0x0008 */ struct IOleItemContainer* m_pOleCont;
}; /* size: 0x000c */

class CDeltaList
{
  /* 0x0000 */ class CBasedDeltaBlockPtrPtr _apdb;
  /* 0x0004 */ unsigned long _ulSize;
  /* 0x0008 */ class CBasedMStreamPtr _pmsScratch;
  /* 0x000c */ class CBasedMStreamPtr _pms;
  /* 0x0010 */ class CBasedTransactedStreamPtr _ptsParent;
  /* 0x0014 */ unsigned long _sectStart;
}; /* size: 0x0018 */

class CDestObject
{
  /* 0x0004 */ struct tagCOMVERSION _comversion;
  /* 0x0008 */ unsigned long _dwDestCtx;
}; /* size: 0x000c */

class CDestObjectWrapper
{
  /* 0x0008 */ long m_cRef;
  /* 0x000c */ struct IDestInfo* m_pIDI;
}; /* size: 0x0010 */

class CDfMutex
{
  /* 0x0000 */ struct _GLOBAL_SHARED_CRITICAL_SECTION* _pGlobalPortion;
  /* 0x0004 */ void* _hLockEvent;
}; /* size: 0x0008 */

class CDfName
{
  /* 0x0000 */ unsigned char _ab[64];
  /* 0x0040 */ unsigned short _cb;
}; /* size: 0x0042 */

class CDfNameList
{
  /* 0x0000 */ class CDfName _df;
  /* 0x0044 */ unsigned long _sectStart;
  /* 0x0048 */ unsigned long _ulSize;
  /* 0x004c */ class CDfNameList* _pdflNext;
}; /* size: 0x0050 */

class CDirEntry
{
}; /* size: 0x0080 */

class CDirSect
{
  /* 0x0000 */ class CDirEntry* _adeEntry /* zero-length array */;
}; /* size: 0x0001 */

class CDirVector
{
  /* 0x001c */ unsigned short _cbSector;
}; /* size: 0x0020 */

class CDirectStream
{
  /* 0x000c */ class CStmHandle _stmh;
  /* 0x0014 */ class CStreamCache _stmc;
  /* 0x0098 */ unsigned __int64 _ulSize;
  /* 0x00a0 */ unsigned __int64 _ulOldSize;
  /* 0x00a8 */ class CBasedDeltaListPtr _pdlHolder;
}; /* size: 0x00b0 */

class CDirectory
{
  /* 0x0000 */ class CDirVector _dv;
  /* 0x0020 */ unsigned long _cdsTable;
  /* 0x0024 */ class CBasedMStreamPtr _pmsParent;
  /* 0x0028 */ unsigned short _cdeEntries;
  /* 0x002c */ unsigned long _sidFirstFree;
}; /* size: 0x0030 */

class CDlElement
{
  /* 0x0000 */ class CBasedDlElementPtr _pdlePrev;
  /* 0x0004 */ class CBasedDlElementPtr _pdleNext;
}; /* size: 0x0008 */

class CDllHost
{
  /* 0x000c */ struct IDLLHost* _pIDllProxy;
  /* 0x0010 */ class CStdIdentity* _pStdId;
  /* 0x0014 */ unsigned long _dwType;
  /* 0x0018 */ unsigned long _dwHostAptId;
  /* 0x001c */ unsigned long _hActivator;
  /* 0x0020 */ unsigned long _dwTid;
  /* 0x0024 */ HRESULT _hrMarshal;
  /* 0x0028 */ void* _hEvent;
  /* 0x002c */ void* _hEventWakeUp;
  /* 0x0030 */ HRESULT _hr;
  /* 0x0038 */ struct tagOBJREF _objref;
  /* 0x0090 */ class COleStaticMutexSem _mxs;
}; /* size: 0x00c0 */

class CDocFile
{
  /* 0x000c */ class CUpdateList _ulChangedHolder;
  /* 0x0014 */ class CStgHandle _stgh;
  /* 0x001c */ const class CBasedDFBasisPtr _pdfb;
}; /* size: 0x0020 */

class CDocfileStreamName
{
  /* 0x0000 */ wchar_t _wszName[37];
}; /* size: 0x004a */

class CDocfileUnmarshalFactory
{
  /* 0x0008 */ unsigned long _sig;
}; /* size: 0x000c */

class CDragDataObject
{
  /* 0x0004 */ unsigned long _cRefs;
  /* 0x0008 */ void* _pvMarshaledDataObject;
  /* 0x000c */ struct IDataObject* _pIDataObject;
  /* 0x0010 */ struct FORMATETCDATAARRAY* m_pFormatEtcDataArray;
  /* 0x0014 */ unsigned long _dwSmId;
}; /* size: 0x0018 */

class CDragDefaultCursors
{
  /* 0x0000 */ struct HICON__* ahcursorDefaults[4][2];
}; /* size: 0x0020 */

enum CDragDefaultCursors::CURSOR_ID
{
  NO_DROP = 0,
  MOVE_DROP = 1,
  COPY_DROP = 2,
  LINK_DROP = 3,
};

enum CDragDefaultCursors::SCROLL_TYPE
{
  NO_SCROLL = 0,
  SCROLL = 1,
};

class CDragOperation
{
  union
  {
    struct
    {
      /* 0x0000 */ struct IDataObject* _pDataObject;
      /* 0x0004 */ void* _DOBuffer;
      /* 0x0008 */ struct IDropSource* _pDropSource;
      /* 0x000c */ struct IDropSourceQueryEx* _pDSQueryEx;
      /* 0x0010 */ struct IDropSourceNotify* _pDSNotify;
      /* 0x0014 */ struct IDropTarget* _pDropTarget;
      /* 0x0018 */ struct IDropTarget* _pRealDropTarget;
      /* 0x001c */ void* _hFormats;
      /* 0x0020 */ class CPoint _cpt;
      /* 0x0028 */ unsigned long _dwOKEffects;
      /* 0x002c */ unsigned long* _pdwEffect;
      /* 0x0030 */ int _fEscapePressed;
      /* 0x0034 */ struct HICON__* _curOld;
      /* 0x0038 */ struct HWND__* _hwndLast;
      /* 0x003c */ unsigned long _grfKeyState;
      /* 0x0040 */ HRESULT _hrDragResult;
      /* 0x0044 */ int _fReleasedCapture;
      /* 0x0048 */ class CDragDefaultCursors* _pcddcDefault;
      /* 0x004c */ int _fUseWin31;
      /* 0x0050 */ unsigned long _dwFinalKeyState;
      /* 0x0054 */ class CPoint _cptFinalCursorPos;
    }; /* size: 0x005c */
    /* 0x0000 */ long s_wScrollInt;
  }; /* size: 0x005c */
}; /* size: 0x005c */

class CDropTarget
{
  /* 0x0004 */ struct HWND__* _hwndOLE;
  /* 0x0008 */ struct HWND__* _hwnd31;
  /* 0x000c */ unsigned long _dwEffectLast;
  /* 0x0010 */ unsigned long _crefs;
  /* 0x0014 */ class CDragOperation* _pdo;
  /* 0x0018 */ void* _hDDInfo;
}; /* size: 0x001c */

class CDualStringArray
{
  /* 0x0000 */ struct tagDUALSTRINGARRAY* _pdsa;
  /* 0x0004 */ long _cRef;
}; /* size: 0x0008 */

class CDwordBag
{
  /* 0x0014 */ unsigned long _dwSlotsUsed;
}; /* size: 0x0018 */

class CEMfObject
{
  /* 0x0004 */ unsigned long m_ulRefs;
  /* 0x0008 */ struct HENHMETAFILE__* m_hPres;
  /* 0x000c */ int m_fMetaDC;
  /* 0x0010 */ int m_nRecord;
  /* 0x0014 */ HRESULT m_error;
  /* 0x0018 */ struct tagLOGPALETTE* m_pColorSet;
  /* 0x001c */ void* m_pfnContinue /* function */;
  /* 0x0020 */ unsigned long m_dwContinue;
  /* 0x0024 */ unsigned long m_dwAspect;
  /* 0x0028 */ unsigned long m_dwSize;
  /* 0x002c */ long m_lWidth;
  /* 0x0030 */ long m_lHeight;
  /* 0x0034 */ class CCacheNode* m_pCacheNode;
}; /* size: 0x0038 */

class CEffPermsCacheLUID
{
  /* 0x0000 */ struct CEffPermsCacheLUID::tagCACHE_ENTRY m_cache[23];
  /* 0x0114 */ struct _RTL_CRITICAL_SECTION m_CacheLock;
  /* 0x012c */ int m_bLockValid;
}; /* size: 0x0130 */

struct CEffPermsCacheLUID::tagCACHE_ENTRY
{
  /* 0x0000 */ struct _LUID lClient;
  /* 0x0008 */ unsigned long dwEffectivePermissions;
}; /* size: 0x000c */

class CEndPointAtom
{
  /* 0x0000 */ unsigned short s_AtomProp;
}; /* size: 0x0001 */

class CEndpointEntry
{
  /* 0x0000 */ class CEndpointEntry* m_pNext;
  /* 0x0004 */ unsigned short m_wTowerId;
  /* 0x0008 */ wchar_t* m_pszEndpoint;
  /* 0x000c */ wchar_t* m_pszProtSeq;
  /* 0x0010 */ unsigned long m_dwFlags;
  /* 0x0014 */ int m_fProcessed;
}; /* size: 0x0018 */

class CEndpointsTable
{
  union
  {
    struct
    {
      /* 0x0000 */ class CEndpointEntry* m_pHead;
      /* 0x0004 */ int m_nCount;
    }; /* size: 0x0008 */
    /* 0x0000 */ class CPageAllocator _palloc;
  }; /* size: 0x0040 */
}; /* size: 0x0008 */

class CEnumCategories
{
  /* 0x0004 */ struct HKEY__* m_hKey;
  /* 0x0008 */ unsigned long m_dwIndex;
  /* 0x000c */ unsigned long m_lcid;
  /* 0x0010 */ struct IEnumCATEGORYINFO* m_pcsIEnumCat;
  /* 0x0014 */ int m_fromcs;
  /* 0x0018 */ unsigned long m_dwRefCount;
}; /* size: 0x001c */

class CEnumCategoriesOfClass
{
  /* 0x0004 */ unsigned long m_dwRefCount;
  /* 0x0008 */ int m_bMapOldKeys;
  /* 0x000c */ struct HKEY__* m_hKey;
  /* 0x0010 */ unsigned long m_dwIndex;
  /* 0x0014 */ struct HKEY__* m_hKeyCats;
  /* 0x0018 */ unsigned long m_dwOldKeyIndex;
  /* 0x001c */ struct IUnknown* m_pCloned;
}; /* size: 0x0020 */

class CEnumClassesOfCategories
{
  /* 0x0004 */ unsigned long m_dwRefCount;
  /* 0x0008 */ struct HKEY__* m_hClassKey;
  /* 0x000c */ unsigned long m_dwIndex;
  /* 0x0010 */ unsigned long m_cImplemented;
  /* 0x0014 */ struct _GUID* m_rgcatidImpl;
  /* 0x0018 */ unsigned long m_cRequired;
  /* 0x001c */ struct _GUID* m_rgcatidReq;
  /* 0x0020 */ struct IEnumGUID* m_pcsIEnumClsid;
  /* 0x0024 */ int m_fromcs;
  /* 0x0028 */ struct IUnknown* m_pCloned;
}; /* size: 0x002c */

class CEnumContextProps
{
  /* 0x0004 */ long _cRefs;
  /* 0x0008 */ struct tagContextProperty* _pList;
  /* 0x000c */ unsigned long* _pcListRefs;
  /* 0x0010 */ unsigned long _cItems;
  /* 0x0014 */ unsigned long _CurrentPosition;
}; /* size: 0x0018 */

class CEnumFmt
{
  /* 0x0004 */ unsigned long m_cRef;
  /* 0x0008 */ wchar_t* m_szClsid;
  /* 0x000c */ unsigned long m_dwDirection;
  /* 0x0010 */ unsigned long m_iKey;
  /* 0x0014 */ struct FMTCACHE m_cache;
}; /* size: 0x0030 */

class CEnumFmt10
{
  /* 0x0030 */ struct FMT* m_rgFmt;
  /* 0x0034 */ unsigned int m_cFmt;
}; /* size: 0x0038 */

class CEnumFormatEtc
{
  /* 0x0008 */ unsigned long m_ulFlags;
  /* 0x000c */ unsigned long m_refs;
  /* 0x0010 */ unsigned long m_index;
  /* 0x0014 */ class CArray<CFormatEtc>* m_pFEArray;
}; /* size: 0x0018 */

class CEnumFormatEtcDataArray
{
  /* 0x0008 */ unsigned long m_refs;
  /* 0x000c */ unsigned long m_cOffset;
  /* 0x0010 */ struct FORMATETCDATAARRAY* m_pFormatEtcDataArray;
}; /* size: 0x0014 */

class CEnumGeneric
{
  /* 0x0004 */ struct _GUID m_iid;
  /* 0x0014 */ unsigned long m_refs;
  /* 0x0018 */ unsigned long m_dwCurrent;
  /* 0x001c */ unsigned long m_dwDirection;
  /* 0x0020 */ struct IEnumCallback* m_pEnumCallback;
  /* 0x0024 */ struct IEnumHolder* m_pParent;
  /* 0x0028 */ struct IEnumGeneric* m_pNext;
  /* 0x002c */ struct IEnumGeneric* m_pPrev;
}; /* size: 0x0030 */

class CEnumHolder
{
  /* 0x0004 */ unsigned long m_refs;
  /* 0x0008 */ unsigned short m_nCount;
  /* 0x000c */ struct IEnumGeneric* m_pFirst;
  /* 0x0010 */ struct IEnumGeneric* m_pLast;
}; /* size: 0x0014 */

class CEnumSTATDATA
{
  /* 0x0004 */ unsigned long m_refs;
  /* 0x0008 */ int m_iDataEnum;
  /* 0x000c */ class CDAHolder* m_pHolder;
}; /* size: 0x0010 */

class CEnumSTATPROPBAG
{
  /* 0x0004 */ long _cRefs;
  /* 0x0008 */ struct IBlockingLock* _pBlockingLock;
  /* 0x000c */ class CSTATPROPBAGArray* _parray;
  /* 0x0010 */ unsigned long _iarray;
}; /* size: 0x0014 */

class CEnumSTATPROPSETSTG
{
  /* 0x0004 */ unsigned long _ulSig;
  /* 0x0008 */ long _cRefs;
  /* 0x000c */ struct IEnumSTATSTG* _penumSTATSTG;
  /* 0x0010 */ struct tagSTATSTG _statarray[1];
  /* 0x0058 */ unsigned long _cstatTotalInArray;
  /* 0x005c */ unsigned long _istatNextToRead;
}; /* size: 0x0060 */

class CEnumSTATPROPSTG
{
  /* 0x0004 */ unsigned long _ulSig;
  /* 0x0008 */ long _cRefs;
  /* 0x000c */ class CStatArray* _psa;
  /* 0x0010 */ unsigned long _ipropNext;
}; /* size: 0x0014 */

class CEnumStatData
{
  /* 0x0008 */ unsigned long m_ulFlags;
  /* 0x000c */ unsigned long m_refs;
  /* 0x0010 */ unsigned long m_index;
  /* 0x0014 */ class CArray<CStatData>* m_pSDArray;
}; /* size: 0x0018 */

class CEnumVerb
{
  /* 0x0004 */ unsigned long m_cRef;
  /* 0x0008 */ long m_iVerb;
  /* 0x000c */ struct VerbList* m_VerbList;
}; /* size: 0x0010 */

class CErrorChannelHook
{
}; /* size: 0x0004 */

class CErrorObject
{
  /* 0x000c */ long _refCount;
  /* 0x0010 */ struct ErrorObjectData _data;
  /* 0x0028 */ wchar_t* _pszSource;
  /* 0x002c */ wchar_t* _pszDescription;
  /* 0x0030 */ wchar_t* _pszHelpFile;
}; /* size: 0x0034 */

class CErrorSmAllocator
{
}; /* size: 0x001c */

class CEventCache
{
  union
  {
    /* 0x0000 */ void* _list[20];
    /* 0x0000 */ unsigned long _ifree;
    /* 0x0000 */ class COleStaticMutexSem _mxsEventCache;
  }; /* size: 0x0050 */
}; /* size: 0x0001 */

class CEventSem
{
  /* 0x0000 */ void* _hEvent;
}; /* size: 0x0004 */

class CException
{
  /* 0x0004 */ long _lError;
}; /* size: 0x0008 */

class CExceptionContext
{
  /* 0x0000 */ class CTry* _pTopTry;
  /* 0x0004 */ unsigned char* _pLastNew;
  /* 0x0008 */ int _cbLastNew;
  /* 0x000c */ int _fNewReadyForUnwind;
  /* 0x0010 */ class CException _exception;
  /* 0x0018 */ char buffer[256];
  /* 0x0118 */ class CExceptionContext::StackElement* _aStack;
  /* 0x011c */ int _StackTop;
  /* 0x0120 */ int _StackSize;
}; /* size: 0x0124 */

class CExceptionContext::StackElement
{
  /* 0x0000 */ void* _pthis;
  /* 0x0004 */ void* _pfn /* function */;
  /* 0x0008 */ unsigned long _cbElement;
}; /* size: 0x000c */

class CExpParameterValidate
{
}; /* size: 0x0001 */

class CExposedDocFile
{
  /* 0x0054 */ class CPubDocFile* _pdf;
  /* 0x0058 */ class CDFBasis* _pdfb;
  /* 0x005c */ class CPerContext* _ppc;
  /* 0x0060 */ unsigned long _sig;
  /* 0x0064 */ long _cReferences;
  /* 0x0068 */ class CPropertyBagEx _PropertyBagEx;
}; /* size: 0x008c */

struct CExposedIterator
{
  /* 0x001c */ class CPubDocFile* _ppdf;
  /* 0x0020 */ class CDFBasis* _pdfb;
  /* 0x0024 */ class CPerContext* _ppc;
  /* 0x0028 */ long _cReferences;
  /* 0x002c */ unsigned long _sig;
  /* 0x0030 */ class CDfName _dfnKey;
  /* 0x0072 */ char __PADDING__[2];
}; /* size: 0x0074 */

class CExposedStream
{
  /* 0x0030 */ class CPubStream* _pst;
  /* 0x0034 */ class CDFBasis* _pdfb;
  /* 0x0038 */ class CPerContext* _ppc;
  /* 0x003c */ unsigned long _sig;
  /* 0x0040 */ long _cReferences;
  /* 0x0044 */ class CSeekPointer* _psp;
}; /* size: 0x0048 */

class CExtHashTable
{
}; /* size: 0x0018 */

class CExtentList
{
  /* 0x0000 */ unsigned long m_cbMonikerExtents;
  /* 0x0004 */ unsigned char* m_pchMonikerExtents;
}; /* size: 0x0008 */

class CFAccessControl
{
  /* 0x0004 */ long m_cRefs;
}; /* size: 0x0008 */

class CFILETIME
{
  union
  {
    /* 0x0000 */ struct _FILETIME _filetime;
    /* 0x0000 */ __int64 _ll;
    /* 0x0000 */ union _LARGE_INTEGER _li;
    /* 0x0000 */ union _ULARGE_INTEGER _uli;
  }; /* size: 0x0008 */
}; /* size: 0x0008 */

class CFastBH
{
  /* 0x0000 */ void* m_hRpc;
  /* 0x0004 */ void* m_ifHandle;
}; /* size: 0x0008 */

class CFat
{
  /* 0x0000 */ class CFatVector _fv;
  /* 0x0020 */ class CBasedMStreamPtr _pmsParent;
  /* 0x0024 */ const unsigned long _sid;
  /* 0x0028 */ class CBasedFatPtr _pfatReal;
  /* 0x002c */ class CBasedFatPtr _pfatNoScratch;
  /* 0x0030 */ unsigned long _sectNoSnapshot;
  /* 0x0034 */ unsigned long _sectNoSnapshotFree;
  /* 0x0038 */ unsigned short _uFatShift;
  /* 0x003a */ unsigned short _uFatMask;
  /* 0x003c */ unsigned long _cfsTable;
  /* 0x0040 */ unsigned long _ulFreeSects;
  /* 0x0044 */ unsigned long _cUnmarkedSects;
  /* 0x0048 */ unsigned long _sectFirstFree;
  /* 0x004c */ unsigned long _sectLastUsed;
  /* 0x0050 */ unsigned long _sectMax;
  /* 0x0054 */ unsigned long _ipfsRangeLocks;
  /* 0x0058 */ unsigned short _isectRangeLocks;
}; /* size: 0x005c */

class CFatSect
{
  /* 0x0000 */ unsigned long* _asectEntry /* zero-length array */;
}; /* size: 0x0001 */

class CFatVector
{
  /* 0x001c */ unsigned short _csectTable;
  /* 0x001e */ unsigned short _csectBlock;
}; /* size: 0x0020 */

class CFileMoniker
{
  /* 0x0014 */ struct _GUID m_clsid;
  /* 0x0024 */ class CExtentList m_ExtentList;
  /* 0x002c */ wchar_t* m_szPath;
  /* 0x0030 */ char* m_pszAnsiPath;
  /* 0x0034 */ unsigned short m_ccPath;
  /* 0x0036 */ unsigned short m_cbAnsiPath;
  /* 0x0038 */ unsigned long m_dwHashValue;
  struct /* bitfield */
  {
    /* 0x003c */ unsigned long m_fUnicodeExtent : 1; /* bit position: 0 */
    /* 0x003c */ unsigned long m_fClassVerified : 1; /* bit position: 1 */
    /* 0x003c */ unsigned long m_fHashValueValid : 1; /* bit position: 2 */
  }; /* bitfield */
  /* 0x0040 */ unsigned char m_fShellLinkInitialized;
  struct /* bitfield */
  {
    /* 0x0044 */ unsigned long m_fTrackingEnabled : 1; /* bit position: 0 */
    /* 0x0044 */ unsigned long m_fSaveShellLink : 1; /* bit position: 1 */
    /* 0x0044 */ unsigned long m_fDirty : 1; /* bit position: 2 */
    /* 0x0044 */ unsigned long m_fReduceEnabled : 1; /* bit position: 3 */
  }; /* bitfield */
  /* 0x0048 */ unsigned short m_cAnti;
  /* 0x004a */ unsigned short m_endServer;
  /* 0x004c */ enum CFileMoniker::olever m_ole1;
  /* 0x0050 */ struct IShellLinkW* m_pShellLink;
  /* 0x0054 */ class CTrackingFileMoniker _tfm;
  /* 0x005c */ class CMutexSem2 m_mxs;
}; /* size: 0x0078 */

enum CFileMoniker::olever
{
  undetermined = 0,
  ole1 = 1,
  ole2 = 2,
};

class CFileMonikerFactory
{
}; /* size: 0x0008 */

struct CFileStream
{
  /* 0x0018 */ class CGlobalFileStream* _pgfst;
  /* 0x001c */ class CPerContext* _ppc;
  /* 0x0020 */ void* _hFile;
  /* 0x0024 */ void* _hPreDuped;
  /* 0x0028 */ unsigned long _sig;
  /* 0x002c */ long _cReferences;
  /* 0x0030 */ struct IMalloc* const _pMalloc;
  /* 0x0034 */ void* _hMapObject;
  /* 0x0038 */ unsigned char* _pbBaseAddr;
  /* 0x003c */ unsigned long _cbViewSize;
}; /* size: 0x0040 */

class CFillLockBytes
{
  /* 0x000c */ struct ILockBytes* _pilb;
  /* 0x0010 */ long _cRefs;
  /* 0x0014 */ unsigned long _ulHighWater;
  /* 0x0018 */ unsigned long _dwTerminate;
  /* 0x001c */ unsigned long _ulFailurePoint;
  /* 0x0020 */ class CPerContext* _ppc;
  /* 0x0024 */ int _fCSInitialized;
  /* 0x0028 */ struct _RTL_CRITICAL_SECTION _csThreadProtect;
}; /* size: 0x0040 */

class CFmCtrlUnknown
{
  /* 0x0004 */ class CFreeMarshaler* _pfm;
  /* 0x0008 */ unsigned long _cRefs;
}; /* size: 0x000c */

class CForcedDropTarget
{
  /* 0x0000 */ struct HWND__* _hwndFDTCurrent;
  /* 0x0004 */ int _fDragDropActive;
}; /* size: 0x0008 */

class CFormat
{
  /* 0x0000 */ enum FORMATTAG m_ftag;
  /* 0x0004 */ unsigned short m_cf;
  /* 0x0008 */ class CData m_dataFormatString;
}; /* size: 0x0018 */

class CFormatEtc
{
  /* 0x0000 */ unsigned long m_ulFlags;
  /* 0x0004 */ struct tagFORMATETC m_foretc;
}; /* size: 0x0018 */

class CFrameFilter
{
  /* 0x0010 */ struct HWND__* m_hwndObject;
  /* 0x0014 */ struct HWND__* m_hwndFrame;
  /* 0x0018 */ struct IOleInPlaceFrame* m_lpFrame;
  /* 0x001c */ struct IOleInPlaceActiveObject* m_lpObject;
  /* 0x0020 */ void* m_lpfnPrevWndProc /* function */;
  /* 0x0024 */ int m_fObjectMenu;
  /* 0x0028 */ int m_fCurItemPopup;
  /* 0x002c */ int m_fInMenuMode;
  /* 0x0030 */ int m_fDiscardWmCommand;
  /* 0x0034 */ int m_fGotMenuCloseEvent;
  /* 0x0038 */ int m_fRemovedWndProc;
  /* 0x003c */ unsigned int m_cmdId;
  /* 0x0040 */ unsigned int m_uCurItemID;
  /* 0x0044 */ struct tagOLEMENU* m_lpOleMenu;
  /* 0x0048 */ struct HMENU__* m_hmenuCombined;
  /* 0x004c */ struct HWND__* m_hwndFocusOnEnter;
  /* 0x0050 */ int m_cAltTab;
}; /* size: 0x0054 */

class CFreeList
{
  /* 0x0000 */ class CBasedFreeBlockPtr _pfbHead;
}; /* size: 0x0004 */

class CFreeMarshaler
{
  /* 0x0004 */ struct IUnknown* _punkCtrl;
  union
  {
    /* 0x0000 */ unsigned char _SecretBlock[16];
    /* 0x0000 */ int _fSecretInit;
    /* 0x0000 */ class COleStaticMutexSem _SecretLock;
  }; /* size: 0x0030 */
}; /* size: 0x0008 */

class CGIPMessageParam
{
  /* 0x0008 */ long m_cRefs;
  /* 0x000c */ unsigned long m_dwCookie;
  /* 0x0010 */ struct _GUID m_causalityId;
}; /* size: 0x0020 */

class CGIPTable
{
  union
  {
    /* 0x0000 */ unsigned long _dwCurrSeqNo;
    /* 0x0000 */ int _fInRevokeAll;
    /* 0x0000 */ int _fInNAUninit;
    /* 0x0000 */ struct tagGIPEntry _InUseHead;
    /* 0x0000 */ class CPageAllocator _palloc;
    /* 0x0000 */ class COleStaticMutexSem _mxs;
  }; /* size: 0x0044 */
}; /* size: 0x0004 */

class CGenObject
{
  /* 0x0004 */ unsigned long m_ulRefs;
  /* 0x0008 */ unsigned long m_dwAspect;
  /* 0x000c */ unsigned long m_dwSize;
  /* 0x0010 */ long m_lWidth;
  /* 0x0014 */ long m_lHeight;
  /* 0x0018 */ void* m_hPres;
  /* 0x001c */ unsigned short m_cfFormat;
  /* 0x0020 */ class CCacheNode* m_pCacheNode;
}; /* size: 0x0024 */

class CGenericObject
{
  /* 0x0000 */ class CClass m_class;
  /* 0x0014 */ class CClass m_classLast;
  /* 0x0028 */ class CPres* m_ppres;
  /* 0x002c */ class CData m_dataNative;
  /* 0x003c */ int m_fLink;
  /* 0x0040 */ int m_fStatic;
  /* 0x0044 */ int m_fNoBlankPres;
  /* 0x0048 */ wchar_t* m_szTopic;
  /* 0x004c */ wchar_t* m_szItem;
  /* 0x0050 */ unsigned long m_lnkupdopt;
}; /* size: 0x0054 */

class CGlobalContext
{
  /* 0x0008 */ int _fTakeLock;
  /* 0x000c */ unsigned long _dfOpenLock;
  /* 0x0010 */ struct IMalloc* const _pMalloc;
  /* 0x0018 */ union _LARGE_INTEGER _luidMutexName;
  /* 0x0020 */ struct _GLOBAL_SHARED_CRITICAL_SECTION _GlobalPortion;
}; /* size: 0x0030 */

class CGlobalFileStream
{
  /* 0x0008 */ unsigned long _df;
  /* 0x000c */ unsigned long _dwStartFlags;
  /* 0x0010 */ struct IMalloc* const _pMalloc;
  /* 0x0018 */ unsigned __int64 _ulPos;
  /* 0x0020 */ unsigned long _cbSector;
  /* 0x0024 */ unsigned long _cbMappedFileSize;
  /* 0x0028 */ unsigned long _cbMappedCommitSize;
  /* 0x002c */ unsigned long _dwMapFlags;
  /* 0x0030 */ wchar_t _awcPath[261];
  /* 0x023c */ unsigned long _dwTerminate;
  /* 0x0240 */ unsigned __int64 _ulHighWater;
  /* 0x0248 */ unsigned __int64 _ulFailurePoint;
}; /* size: 0x0250 */

class CGlobalOptions
{
  /* 0x0008 */ unsigned long _lRefs;
}; /* size: 0x000c */

class CGlobalSecurity
{
  /* 0x0000 */ unsigned char _acl[64];
  /* 0x0040 */ struct _SECURITY_DESCRIPTOR _sd;
  /* 0x0054 */ unsigned char _sdExt[152];
  /* 0x00ec */ struct _SECURITY_ATTRIBUTES _sa;
}; /* size: 0x00f8 */

enum CHK
{
  chkDdeSrvr = 4660,
  chkDefClient = 22136,
};

class CHandle
{
  /* 0x0000 */ class CBasedMStreamPtr _pms;
  /* 0x0004 */ unsigned long _sid;
}; /* size: 0x0008 */

class CHashTable
{
  /* 0x0004 */ class COleStaticMutexSem* _pExLock;
  /* 0x0008 */ class CRWLock* _pRWLock;
  /* 0x000c */ struct SHashChain* _buckets;
  /* 0x0010 */ unsigned long _cCurEntries;
  /* 0x0014 */ unsigned long _cMaxEntries;
}; /* size: 0x0018 */

class CHeapHeader
{
  /* 0x0000 */ unsigned long _ulFirstFree;
  /* 0x0004 */ unsigned long _ulAllocedBlocks;
  /* 0x0008 */ int _fIsCompacted;
  /* 0x000c */ unsigned long _dfLuid;
}; /* size: 0x0010 */

class CHlprDialog
{
  /* 0x0004 */ struct HINSTANCE__* m_hInstance;
}; /* size: 0x0008 */

class CHwnd
{
  /* 0x0000 */ struct HWND__* m_hwnd;
}; /* size: 0x0004 */

class CIDObject
{
  /* 0x0004 */ struct SHashChain _pidChain;
  /* 0x000c */ struct SHashChain _oidChain;
  /* 0x0014 */ unsigned long _dwState;
  /* 0x0018 */ unsigned long _cRefs;
  /* 0x001c */ struct IUnknown* _pServer;
  /* 0x0020 */ class CObjectContext* _pServerCtx;
  /* 0x0024 */ struct _GUID _oid;
  /* 0x0034 */ unsigned long _aptID;
  /* 0x0038 */ class CStdWrapper* _pStdWrapper;
  /* 0x003c */ class CStdIdentity* _pStdID;
  /* 0x0040 */ unsigned long _cCalls;
  /* 0x0044 */ unsigned long _cLocks;
  /* 0x0048 */ struct SHashChain _oidUnpinReqChain;
  /* 0x0050 */ unsigned long _dwOidUnpinReqState;
  /* 0x0054 */ void* _pvObjectTrackCookie;
  union
  {
    /* 0x0000 */ class CPageAllocator s_allocator;
    /* 0x0000 */ int s_fInitialized;
    /* 0x0000 */ unsigned long s_cIDs;
  }; /* size: 0x0040 */
}; /* size: 0x0058 */

class CIPIDTable
{
  union
  {
    /* 0x0000 */ class CPageAllocator _palloc;
    /* 0x0000 */ struct tagIPIDEntry _oidListHead;
  }; /* size: 0x0050 */
}; /* size: 0x0001 */

class CInprocSystemActivator
{
}; /* size: 0x0004 */

class CInterfaceFromWindowProp
{
  /* 0x0004 */ unsigned long _ulRefCnt;
}; /* size: 0x0008 */

class CInternalPageAllocator
{
  /* 0x0000 */ long _cPages;
  /* 0x0004 */ struct tagPageEntry** _pPageListStart;
  /* 0x0008 */ struct tagPageEntry** _pPageListEnd;
  /* 0x000c */ unsigned long _dwFlags;
  /* 0x0010 */ struct tagPageEntry _ListHead;
  /* 0x0018 */ long _cEntries;
  /* 0x001c */ unsigned long _cbPerEntry;
  /* 0x0020 */ unsigned short _cEntriesPerPage;
  /* 0x0024 */ class COleStaticMutexSem* _pLock;
  /* 0x0028 */ void* _pfnMyAlloc /* function */;
  /* 0x002c */ void* _pfnMyFree /* function */;
}; /* size: 0x0030 */

class CItemMoniker
{
  /* 0x0014 */ wchar_t* m_lpszItem;
  /* 0x0018 */ char* m_pszAnsiItem;
  /* 0x001c */ unsigned short m_ccItem;
  /* 0x001e */ unsigned short m_cbAnsiItem;
  /* 0x0020 */ wchar_t* m_lpszDelimiter;
  /* 0x0024 */ char* m_pszAnsiDelimiter;
  /* 0x0028 */ unsigned short m_ccDelimiter;
  /* 0x002a */ unsigned short m_cbAnsiDelimiter;
  /* 0x002c */ unsigned long m_fHashValueValid : 1; /* bit position: 0 */
  /* 0x0030 */ unsigned long m_dwHashValue;
  /* 0x0034 */ class CMutexSem2 m_mxs;
}; /* size: 0x0050 */

class CLUAMoniker
{
  /* 0x001c */ unsigned long m_runLevel;
  /* 0x0020 */ int m_bHaveBindOpts;
  /* 0x0024 */ struct tagBIND_OPTS3 m_bindopts3;
}; /* size: 0x0048 */

class CLinkable
{
  /* 0x0000 */ class CLinkable* m_pNext;
  /* 0x0004 */ class CLinkable* m_pPrev;
}; /* size: 0x0008 */

class CListHeader
{
}; /* size: 0x0008 */

class CLocalAlloc
{
}; /* size: 0x0001 */

class CLocalMachineNames
{
  /* 0x0004 */ unsigned long _lRefs;
  /* 0x0008 */ unsigned long _dwCursor;
  /* 0x000c */ class CMachineNamesHelper* _pMNHelper;
  /* 0x0010 */ int _fNeedNewData;
}; /* size: 0x0014 */

class CLock
{
  /* 0x0000 */ class CMutexSem& _mxs;
}; /* size: 0x0004 */

class CLock2
{
  /* 0x0000 */ class CMutexSem2& m_mxs;
}; /* size: 0x0004 */

class CMIDTable
{
  union
  {
    /* 0x0000 */ class MIDEntry* _pLocalMIDEntry;
    /* 0x0000 */ class CStringHashTable _HashTbl;
    /* 0x0000 */ class CPageAllocator _palloc;
  }; /* size: 0x0040 */
}; /* size: 0x0001 */

class CMIPIDHashTable
{
}; /* size: 0x0018 */

class CMREInnerUnknown
{
  /* 0x0004 */ unsigned long _iRefCount;
  /* 0x0008 */ class CManualResetEvent* _pParent;
}; /* size: 0x000c */

class CMSFHeader
{
  /* 0x0000 */ class CMSFHeaderData _hdr;
  /* 0x0200 */ int _fDirty;
}; /* size: 0x0204 */

class CMSFHeaderData
{
  /* 0x004c */ unsigned long _sectFat[109];
}; /* size: 0x0200 */

class CMSFPage
{
  /* 0x0000 */ class CBasedMSFPagePtr _pmpNext;
  /* 0x0004 */ class CBasedMSFPagePtr _pmpPrev;
  /* 0x0008 */ unsigned long _sid;
  /* 0x000c */ unsigned long _ulOffset;
  /* 0x0010 */ class CBasedPagedVectorPtr _ppv;
  /* 0x0014 */ unsigned long _sect;
  /* 0x0018 */ unsigned long _dwFlags;
  /* 0x001c */ long _cReferences;
  /* 0x0020 */ unsigned char* _ab /* zero-length array */;
}; /* size: 0x0020 */

class CMSFPageTable
{
  /* 0x0000 */ class CBasedMStreamPtr _pmsParent;
  /* 0x0004 */ const unsigned long _cbSector;
  /* 0x0008 */ const unsigned long _cMinPages;
  /* 0x000c */ const unsigned long _cMaxPages;
  /* 0x0010 */ unsigned long _cActivePages;
  /* 0x0014 */ unsigned long _cPages;
  /* 0x0018 */ class CBasedMSFPagePtr _pmpCurrent;
  /* 0x001c */ class CBasedMSFPagePtr _pmpStart;
  /* 0x0020 */ long _cReferences;
}; /* size: 0x0024 */

class CMStream
{
  /* 0x0000 */ class CBasedILockBytesPtrPtr _pplstParent;
  /* 0x0004 */ class CBasedMSFPageTablePtr _pmpt;
  /* 0x0008 */ class CMSFHeader _hdr;
  /* 0x020c */ class CDirectory _dir;
  /* 0x023c */ class CFat _fat;
  /* 0x0298 */ class CDIFat _fatDif;
  /* 0x0328 */ class CFat _fatMini;
  /* 0x0384 */ class CStreamCache _stmcDir;
  /* 0x0404 */ class CStreamCache _stmcMiniFat;
  /* 0x0484 */ class CBasedDirectStreamPtr _pdsministream;
  /* 0x0488 */ class CBasedMStreamPtr _pmsShadow;
  /* 0x048c */ class CBasedBytePtr _pCopySectBuf;
  /* 0x0490 */ const int _fIsScratch;
  /* 0x0494 */ int _fIsNoScratch;
  /* 0x0498 */ class CBasedMStreamPtr _pmsScratch;
  /* 0x049c */ int _fIsNoSnapshot;
  /* 0x04a0 */ int _fBlockWrite;
  /* 0x04a4 */ int _fTruncate;
  /* 0x04a8 */ int _fBlockHeader;
  /* 0x04ac */ int _fNewConvert;
  /* 0x04b0 */ int _fIsShadow;
  /* 0x04b8 */ unsigned __int64 _ulParentSize;
  /* 0x04c0 */ unsigned short _uSectorSize;
  /* 0x04c2 */ unsigned short _uSectorShift;
  /* 0x04c4 */ unsigned short _uSectorMask;
  /* 0x04c8 */ struct IMalloc* const _pMalloc;
  /* 0x04d0 */ union _ULARGE_INTEGER _uliLastKnownSizeForConsolidate;
}; /* size: 0x04d8 */

struct CM_Power_Data_s
{
  /* 0x0000 */ unsigned long PD_Size;
  /* 0x0004 */ enum _DEVICE_POWER_STATE PD_MostRecentPowerState;
  /* 0x0008 */ unsigned long PD_Capabilities;
  /* 0x000c */ unsigned long PD_D1Latency;
  /* 0x0010 */ unsigned long PD_D2Latency;
  /* 0x0014 */ unsigned long PD_D3Latency;
  /* 0x0018 */ enum _DEVICE_POWER_STATE PD_PowerStateMapping[7];
  /* 0x0034 */ enum _SYSTEM_POWER_STATE PD_DeepestSystemWake;
}; /* size: 0x0038 */

class CMachineNamesHelper
{
  /* 0x0000 */ unsigned long _lRefs;
  /* 0x0004 */ unsigned long _dwNumStrings;
  /* 0x0008 */ wchar_t** _ppszStrings;
}; /* size: 0x000c */

struct CMachineNamesHelper::_SBTOTAL
{
  /* 0x0000 */ unsigned long dwcTotalAddrs;
  /* 0x0004 */ wchar_t** ppszAddresses;
}; /* size: 0x0008 */

struct CMachineNamesHelper::_UNIQUEADDRS
{
  /* 0x0000 */ unsigned long dwcTotalUniqueAddrs;
  /* 0x0004 */ unsigned long dwStringSpaceNeeded;
  /* 0x0008 */ unsigned long dwCurrentAddr;
  /* 0x000c */ wchar_t* pszNextAddrToUse;
  /* 0x0010 */ wchar_t** ppszAddrs;
  /* 0x0014 */ unsigned int cchLeft;
}; /* size: 0x0018 */

struct CMalloc
{
  /* 0x0000 */ struct IMallocVtbl* lpVtbl;
}; /* size: 0x0004 */

class CMallocBased
{
}; /* size: 0x0001 */

class CManualResetEvent
{
  /* 0x0008 */ class CMREInnerUnknown _cInner;
  /* 0x0014 */ struct IUnknown* _pControl;
  /* 0x0018 */ class CStdEvent* m_cStdEvent;
}; /* size: 0x001c */

class CMapDwordDword
{
  /* 0x0000 */ class CMapKeyToValue m_mkv;
}; /* size: 0x0028 */

class CMapDwordPtr
{
  /* 0x0000 */ class CMapKeyToValue m_mkv;
}; /* size: 0x0028 */

class CMapKeyToValue
{
  /* 0x0000 */ unsigned int m_cbValue;
  /* 0x0004 */ unsigned int m_cbKey;
  /* 0x0008 */ unsigned int m_cbKeyInAssoc;
  /* 0x000c */ struct CMapKeyToValue::CAssoc** m_pHashTable;
  /* 0x0010 */ unsigned int m_nHashTableSize;
  /* 0x0014 */ void* m_lpfnHashKey /* function */;
  /* 0x0018 */ int m_nCount;
  /* 0x001c */ struct CMapKeyToValue::CAssoc* m_pFreeList;
  /* 0x0020 */ struct CPlex* m_pBlocks;
  /* 0x0024 */ int m_nBlockSize;
}; /* size: 0x0028 */

struct CMapKeyToValue::CAssoc
{
  /* 0x0000 */ struct CMapKeyToValue::CAssoc* pNext;
  /* 0x0004 */ unsigned int nHashValue;
  /* 0x0008 */ union CMapKeyToValue::CKeyWrap key;
}; /* size: 0x0010 */

union CMapKeyToValue::CKeyWrap
{
  union
  {
    /* 0x0000 */ unsigned char rgbKey[8];
    struct
    {
      /* 0x0000 */ void* pKey;
      /* 0x0004 */ unsigned int cbKey;
    }; /* size: 0x0008 */
  }; /* size: 0x0008 */
}; /* size: 0x0008 */

class CMapStringToPtr
{
  /* 0x0000 */ class CMapKeyToValue m_mkv;
}; /* size: 0x0028 */

class CMapUintPtr
{
  /* 0x0000 */ class CMapKeyToValue m_mkv;
}; /* size: 0x0028 */

class CMarshalImplPStream
{
  /* 0x0004 */ struct IPersistStream* m_pPS;
}; /* size: 0x0008 */

class CMarshalList
{
  /* 0x0000 */ class CBasedMarshalListPtr _pmlNext;
  /* 0x0004 */ void* _pvBase;
  /* 0x0008 */ unsigned long _cntxid;
}; /* size: 0x000c */

class CMemBytes
{
  /* 0x0004 */ unsigned long m_dwSig;
  /* 0x0008 */ unsigned long m_refs;
  /* 0x000c */ void* m_hMem;
  /* 0x0010 */ struct MEMSTM* m_pData;
}; /* size: 0x0014 */

class CMemStm
{
  /* 0x0004 */ unsigned long m_dwSig;
  /* 0x0008 */ unsigned long m_refs;
  /* 0x000c */ unsigned long m_pos;
  /* 0x0010 */ void* m_hMem;
  /* 0x0014 */ struct MEMSTM* m_pData;
  /* 0x0018 */ class CRefMutexSem* m_pmxs;
}; /* size: 0x001c */

class CMessageCall
{
  /* 0x000c */ enum tagCALLCATEGORY _callcat;
  /* 0x0010 */ unsigned long _iFlags;
  /* 0x0014 */ long _hResult;
  /* 0x0018 */ void* _hEvent;
  /* 0x001c */ struct HWND__* _hWndCaller;
  /* 0x0020 */ struct _GUID _ipid;
  /* 0x0030 */ void* _hSxsActCtx;
  /* 0x0034 */ unsigned long _server_fault;
  /* 0x0038 */ class CDestObject _destObj;
  /* 0x0044 */ void* _pHeader;
  /* 0x0048 */ class CChannelHandle* _pHandle;
  /* 0x004c */ void* _hRpc;
  /* 0x0050 */ struct IUnknown* _pContext;
  /* 0x0054 */ unsigned long _dwCOMHeaderSize;
  /* 0x0058 */ struct tagRPCOLEMESSAGE message;
  /* 0x0084 */ struct SChannelHookCallInfo hook;
  /* 0x00b4 */ unsigned long _dwErrorBufSize;
  /* 0x00b8 */ unsigned long m_ulCancelTimeout;
  /* 0x00bc */ unsigned long m_dwStartCount;
  /* 0x00c0 */ class CCtxCall* m_pClientCtxCall;
  /* 0x00c4 */ class CCtxCall* m_pServerCtxCall;
}; /* size: 0x00c8 */

class CMfObject
{
  /* 0x0004 */ unsigned long m_ulRefs;
  /* 0x0008 */ struct HMETAFILE__* m_hPres;
  /* 0x000c */ struct _METAINFO* m_pMetaInfo;
  /* 0x0010 */ struct _METADC* m_pCurMdc;
  /* 0x0014 */ int m_fMetaDC;
  /* 0x0018 */ int m_nRecord;
  /* 0x001c */ HRESULT m_error;
  /* 0x0020 */ struct tagLOGPALETTE* m_pColorSet;
  /* 0x0024 */ int m_fConvert;
  /* 0x0028 */ void* m_pfnContinue /* function */;
  /* 0x002c */ unsigned long m_dwContinue;
  /* 0x0030 */ unsigned long m_dwAspect;
  /* 0x0034 */ unsigned long m_dwSize;
  /* 0x0038 */ long m_lWidth;
  /* 0x003c */ long m_lHeight;
  /* 0x0040 */ class CCacheNode* m_pCacheNode;
  /* 0x0044 */ struct HPALETTE__* m_hPalDCOriginal;
  /* 0x0048 */ struct HPALETTE__* m_hPalLast;
}; /* size: 0x004c */

class CMonikerBag
{
}; /* size: 0x0018 */

class CMonikerFactory
{
}; /* size: 0x0008 */

class CMonikerPtrBuf
{
}; /* size: 0x0018 */

class CMultiGUIDHashTable
{
}; /* size: 0x0018 */

class CMutexSem
{
  /* 0x0000 */ struct _RTL_CRITICAL_SECTION _cs;
}; /* size: 0x0018 */

class CMutexSem2
{
  /* 0x0000 */ struct _RTL_CRITICAL_SECTION m_cs;
  /* 0x0018 */ int m_fCsInitialized;
}; /* size: 0x001c */

class CNFFMappedStream
{
  /* 0x0004 */ class CNtfsStream* _pnffstm;
  struct /* bitfield */
  {
    /* 0x0008 */ int _fReserved : 1; /* bit position: 0 */
    /* 0x0008 */ int _fMappedStreamDirty : 1; /* bit position: 1 */
    /* 0x0008 */ int _fUpdateStreamHasLatest : 1; /* bit position: 2 */
    /* 0x0008 */ int _fCheckedForRollForward : 1; /* bit position: 3 */
    /* 0x0008 */ int _fStreamRenameSupported : 1; /* bit position: 4 */
  }; /* bitfield */
  /* 0x000c */ unsigned char* _pbMappedStream;
  /* 0x0010 */ unsigned long _cbMappedStream;
  /* 0x0014 */ unsigned long _cbMappedStreamActual;
  /* 0x0018 */ void* _pMappedStreamOwner;
  /* 0x001c */ unsigned short _cUpdateStreamInUse;
  /* 0x001e */ unsigned short _cLatestStreamInUse;
  /* 0x0020 */ class CNtfsUpdateStreamForPropStg* _pstmUpdate;
}; /* size: 0x0024 */

enum CNFFMappedStream::enumCREATE_NEW_UPDATE_STREAM
{
  CREATE_NEW_UPDATE_STREAM = 1,
  DONT_CREATE_NEW_UPDATE_STREAM = 2,
};

class CNFFTreeMutex
{
  /* 0x0004 */ long _cRefs;
  /* 0x0008 */ int _fInitialized;
  /* 0x000c */ struct _RTL_CRITICAL_SECTION _cs;
}; /* size: 0x0024 */

enum CNVTYP
{
  cnvtypNone = 0,
  cnvtypConvertTo = 1,
  cnvtypTreatAs = 2,
};

class CNameHashTable
{
}; /* size: 0x0018 */

class CNdrStream
{
  /* 0x0004 */ long RefCount;
  /* 0x0008 */ unsigned char* pBuffer;
  /* 0x000c */ unsigned long cbBufferLength;
  /* 0x0010 */ unsigned long position;
}; /* size: 0x0014 */

class CNoEnum
{
  /* 0x0004 */ long m_cRef;
}; /* size: 0x0008 */

class CNtfsEnumSTATSTG
{
  /* 0x0004 */ unsigned long _ulSig;
  /* 0x0008 */ long _cRefs;
  /* 0x000c */ unsigned long _istatNextToRead;
  /* 0x0010 */ struct IBlockingLock* _pBlockingLock;
  /* 0x0014 */ class CNtfsSTATSTGArray* _pstatstgarray;
}; /* size: 0x0018 */

class CNtfsSTATSTGArray
{
  /* 0x0000 */ long _cRefs;
  /* 0x0004 */ struct IBlockingLock* _pBlockingLock;
  /* 0x0008 */ struct _FILE_STREAM_INFORMATION* _pFileStreamInformation;
  /* 0x000c */ unsigned long _cFileStreamInformation;
}; /* size: 0x0010 */

class CNtfsStorage
{
  /* 0x0024 */ unsigned long _sig;
  /* 0x0028 */ class CNFFTreeMutex* _pTreeMutex;
  /* 0x002c */ unsigned long _grfMode;
  /* 0x0030 */ wchar_t _wcDriveLetter;
  /* 0x0034 */ class CNtfsStorageForPropSetStg _NtfsStorageForPropSetStg;
  /* 0x003c */ class CNtfsStream* _pstmOpenList;
  /* 0x0040 */ void* _hFileMainStream;
  /* 0x0044 */ void* _hFileControlStream;
  /* 0x0048 */ unsigned short _hsmStatus;
  /* 0x004c */ unsigned long _dwStgStateBits;
  /* 0x0050 */ struct _GUID _clsidStgClass;
  /* 0x0060 */ class CPropertyBagEx _PropertyBagEx;
  /* 0x0084 */ unsigned long _dwState;
  /* 0x0088 */ struct _FILETIME _filetime;
}; /* size: 0x0090 */

class CNtfsStorageForPropSetStg
{
  /* 0x0004 */ class CNtfsStorage* _pNtfsStorage;
}; /* size: 0x0008 */

class CNtfsStream
{
  /* 0x0008 */ wchar_t* _pwcsName;
  /* 0x000c */ class CNFFMappedStream _nffMappedStream;
  /* 0x0030 */ unsigned long _grfMode;
  /* 0x0034 */ void* _hFile;
  /* 0x0038 */ struct IBlockingLock* _pBlockingLock;
  /* 0x003c */ unsigned long _sig;
  /* 0x0040 */ long _cRefs;
  /* 0x0044 */ class CNtfsStorage* _pnffstg;
  /* 0x0048 */ class TXLargeIntegerWrapper<_LARGE_INTEGER,long,__int64> _liCurrentSeekPosition;
  /* 0x0050 */ class CNtfsStream* _pnffstmPrev;
  /* 0x0054 */ class CNtfsStream* _pnffstmNext;
  /* 0x0058 */ struct _OVERLAPPED _ovlp;
}; /* size: 0x0070 */

class CNtfsStreamName
{
  /* 0x0000 */ unsigned int _count;
  /* 0x0004 */ wchar_t _wsz[256];
}; /* size: 0x0204 */

class CNtfsUpdateStreamForPropStg
{
}; /* size: 0x0070 */

class CNtfsUpdateStreamName
{
  /* 0x0000 */ wchar_t _wszName[37];
}; /* size: 0x004a */

class CNullWalker
{
}; /* size: 0x0004 */

class COAHolder
{
  /* 0x0014 */ struct IAdviseSink** m_ppIAS;
  /* 0x0018 */ int m_iSize;
}; /* size: 0x001c */

class COAccessControl
{
  /* 0x0004 */ long m_cRefs;
  /* 0x0008 */ class COAccessControl::CImpAccessControl* m_ImpObj;
}; /* size: 0x000c */

class COAccessControl::CImpAccessControl
{
  /* 0x0008 */ int m_bInitialized;
  /* 0x000c */ int m_bDirty;
  /* 0x0010 */ int m_bLockValid;
  /* 0x0014 */ struct IUnknown* m_pUnkOuter;
  /* 0x0018 */ struct _RTL_CRITICAL_SECTION m_ACLLock;
  /* 0x0030 */ class CEffPermsCacheLUID m_Cache;
  /* 0x0160 */ struct tagACL_DESCRIPTOR m_ACLDesc;
  /* 0x0184 */ struct tagPCB m_pcb;
}; /* size: 0x01b4 */

class COIDHashTable
{
}; /* size: 0x0018 */

class COIDTable
{
  union
  {
    /* 0x0000 */ int s_fInitialized;
    /* 0x0000 */ class COIDHashTable s_OIDHashTbl;
    /* 0x0000 */ struct SHashChain s_OIDBuckets[23];
    /* 0x0000 */ unsigned long s_UnpinReqsPending;
    /* 0x0000 */ struct SHashChain s_OIDUnpinRequests;
  }; /* size: 0x00b8 */
}; /* size: 0x0001 */

class COLEDragDropHelper
{
  /* 0x0004 */ unsigned long _lRefs;
}; /* size: 0x0008 */

enum COMPARTMENT_ID
{
  UNSPECIFIED_COMPARTMENT_ID = 0,
  DEFAULT_COMPARTMENT_ID = 1,
};

struct COM_CATALOG_CACHE_SECTION
{
  /* 0x0000 */ volatile __int64 CacheTicks;
  /* 0x0008 */ volatile __int64 ComPlusCatalogVer;
}; /* size: 0x0010 */

struct CONFIRMSAFETY
{
  /* 0x0000 */ struct _GUID clsid;
  /* 0x0010 */ struct IUnknown* pUnk;
  /* 0x0014 */ unsigned long dwFlags;
}; /* size: 0x0018 */

struct CONFIRM_CONFLICT_ITEM
{
  /* 0x0000 */ struct IShellItem2* pShellItem;
  /* 0x0004 */ wchar_t* pszOriginalName;
  /* 0x0008 */ wchar_t* pszAlternateName;
  /* 0x000c */ wchar_t* pszLocationShort;
  /* 0x0010 */ wchar_t* pszLocationFull;
  /* 0x0014 */ enum SYNCMGR_CONFLICT_ITEM_TYPE nType;
}; /* size: 0x0018 */

class COXIDTable
{
  union
  {
    /* 0x0000 */ unsigned long _cExpired;
    /* 0x0000 */ class OXIDEntry _InUseHead;
    /* 0x0000 */ class OXIDEntry _ExpireHead;
    /* 0x0000 */ class OXIDEntry _CleanupHead;
  }; /* size: 0x0080 */
}; /* size: 0x0001 */

class CObjServer
{
  /* 0x0004 */ class CStdIdentity* _pStdID;
  /* 0x0008 */ struct _GUID _ipid;
  /* 0x0018 */ unsigned __int64 _oxid;
  /* 0x0020 */ long _cRefs;
}; /* size: 0x0028 */

class CObjectContext
{
  /* 0x001c */ unsigned long _cRefs;
  /* 0x0020 */ long _cUserRefs;
  /* 0x0024 */ long _cInternalRefs;
  /* 0x0028 */ unsigned long _dwFlags;
  /* 0x002c */ struct SHashChain _propChain;
  /* 0x0034 */ struct SHashChain _uuidChain;
  /* 0x003c */ struct tagInterfaceData* _pifData;
  /* 0x0040 */ unsigned long _MarshalSizeMax;
  /* 0x0044 */ class CComApartment* _pApartment;
  /* 0x0048 */ unsigned long _dwHashOfId;
  /* 0x004c */ struct _GUID _contextId;
  /* 0x0060 */ unsigned __int64 _urtCtxId;
  /* 0x0068 */ struct tagSPSCache _PSCache;
  /* 0x0078 */ struct IMarshal* _pMarshalProp;
  /* 0x007c */ long _cReleaseThreads;
  /* 0x0080 */ class CContextPropList _properties;
  /* 0x00ac */ struct IUnknown* _pMtsContext;
  /* 0x00b0 */ class CContextLife* volatile _pContextLife;
  /* 0x00b4 */ class CCtxConnectionManager* _pConnectionMgr;
  union
  {
    /* 0x0000 */ class CPageAllocator s_CXAllocator;
    /* 0x0000 */ int s_fInitialized;
    /* 0x0000 */ unsigned long s_cInstances;
  }; /* size: 0x0040 */
}; /* size: 0x00b8 */

class CObjrefMoniker
{
  /* 0x001c */ wchar_t* m_lpszDisplayName;
}; /* size: 0x0020 */

class CObjrefMonikerFactory
{
}; /* size: 0x0008 */

class COle32DebugEventFire
{
}; /* size: 0x0040 */

class COleCache
{
  /* 0x0028 */ class COleCache::CCacheUnkImpl m_UnkPrivate;
  /* 0x002c */ class COleCache::CCacheDataImpl m_Data;
  /* 0x0030 */ class COleCache::CCacheViewImpl m_ViewObject;
  /* 0x0034 */ class COleCache::CAdviseSinkImpl m_AdviseSink;
  /* 0x0038 */ struct IUnknown* m_pUnkOuter;
  /* 0x003c */ struct IStorage* m_pStg;
  /* 0x0040 */ struct _GUID m_clsid;
  /* 0x0050 */ unsigned short m_cfFormat;
  /* 0x0054 */ unsigned long m_ulFlags;
  /* 0x0058 */ class CArray<CCacheNode>* m_pCacheArray;
  /* 0x005c */ struct IAdviseSink* m_pViewAdvSink;
  /* 0x0060 */ unsigned long m_advfView;
  /* 0x0064 */ unsigned long m_aspectsView;
  /* 0x0068 */ unsigned long m_dwFrozenAspects;
  /* 0x006c */ struct IDataObject* m_pDataObject;
}; /* size: 0x0070 */

class COleCache::CAdviseSinkImpl
{
}; /* size: 0x0004 */

class COleCache::CCacheDataImpl
{
}; /* size: 0x0004 */

class COleCache::CCacheUnkImpl
{
}; /* size: 0x0004 */

class COleCache::CCacheViewImpl
{
}; /* size: 0x0004 */

enum COleCache::GetExtent::__l2::tagCacheType
{
  CACHETYPE_NONE = 0,
  CACHETYPE_NODATA = 1,
  CACHETYPE_ONSTOP = 2,
  CACHETYPE_ONSAVE = 3,
  CACHETYPE_NORMAL = 4,
};

enum COleCache::Locate::__l2::tagFormatType
{
  FORMATTYPE_NONE = 0,
  FORMATTYPE_ANY = 1,
  FORMATTYPE_ENHMF = 2,
  FORMATTYPE_DIB = 3,
  FORMATTYPE_MFPICT = 4,
  FORMATTYPE_USER = 5,
};

class COleStaticLock
{
  /* 0x0000 */ class COleStaticMutexSem& _mxs;
}; /* size: 0x0004 */

class COleStaticMutexSem
{
  /* 0x0000 */ class COleStaticMutexSem* pNextMutex;
  /* 0x0004 */ unsigned char _fInitialized;
  /* 0x0005 */ unsigned char _fAutoDestruct;
  /* 0x0006 */ unsigned char _fUseSpincount;
  /* 0x0008 */ unsigned long _cLocks;
  /* 0x000c */ unsigned long _dwLine;
  /* 0x0010 */ const char* _pszFile;
  /* 0x0014 */ const char* _pszLockName;
  /* 0x0018 */ struct _RTL_CRITICAL_SECTION _cs;
}; /* size: 0x0030 */

class COleTls
{
  /* 0x0000 */ struct tagSOleTlsData* _pData;
}; /* size: 0x0004 */

class CPIDHashTable
{
}; /* size: 0x0018 */

class CPIDTable
{
  union
  {
    /* 0x0000 */ int s_fInitialized;
    /* 0x0000 */ class CPIDHashTable s_PIDHashTbl;
    /* 0x0000 */ struct SHashChain s_PIDBuckets[23];
  }; /* size: 0x00b8 */
}; /* size: 0x0001 */

class CPSHashTable
{
}; /* size: 0x0018 */

class CPSTable
{
  union
  {
    /* 0x0000 */ int s_fInitialized;
    /* 0x0000 */ class CPSHashTable s_PSHashTbl;
    /* 0x0000 */ struct SHashChain s_PSBuckets[23];
  }; /* size: 0x00b8 */
}; /* size: 0x0001 */

class CPaccelEnum
{
  /* 0x0000 */ struct tagACCEL* _lpaccel;
  /* 0x0004 */ struct tagACCEL* _lpaccelBase;
}; /* size: 0x0008 */

class CPackagerMoniker
{
  /* 0x0004 */ unsigned long m_refs;
  /* 0x0008 */ wchar_t* m_szFile;
  /* 0x000c */ struct IMoniker* m_pmk;
  /* 0x0010 */ int m_fLink;
}; /* size: 0x0014 */

class CPageAllocator
{
  /* 0x0000 */ class CInternalPageAllocator _pgalloc;
  /* 0x0030 */ void* _hHeap;
  /* 0x0034 */ unsigned long _cbPerEntry;
  /* 0x0038 */ long _lNumEntries;
  /* 0x003c */ class COleStaticMutexSem* _pLock;
}; /* size: 0x0040 */

enum CPageAllocator::eFlags
{
  fCOUNT_ENTRIES = 1,
};

class CPagedVector
{
  /* 0x0000 */ class CBasedMSFPageTablePtr _pmpt;
  /* 0x0004 */ class CBasedMStreamPtr _pmsParent;
  /* 0x0008 */ class CBasedMSFPagePtrPtr _amp;
  /* 0x000c */ class CBasedVectBitsPtr _avb;
  /* 0x0010 */ const unsigned long _sid;
  /* 0x0014 */ unsigned long _ulSize;
  /* 0x0018 */ unsigned long _ulAllocSize;
}; /* size: 0x001c */

class CPatternTbl
{
  /* 0x0000 */ struct STblHdr* _pTblHdr;
  /* 0x0004 */ unsigned char* _pStart;
}; /* size: 0x0008 */

class CPerContext
{
  /* 0x0008 */ struct ILockBytes* _plkbBase;
  /* 0x000c */ struct CFileStream* _pfstDirty;
  /* 0x0010 */ struct ILockBytes* _plkbOriginal;
  /* 0x0014 */ unsigned long _ulOpenLock;
  /* 0x0018 */ class CGlobalContext* _pgc;
  /* 0x001c */ long _cReferences;
  /* 0x0020 */ struct IMalloc* const _pMalloc;
  /* 0x0024 */ struct IFillInfo* _pfi;
  /* 0x0028 */ void* _hNotificationEvent;
  /* 0x002c */ class CSharedMemoryBlock* _psmb;
  /* 0x0030 */ unsigned char* _pbBase;
  /* 0x0034 */ unsigned long _ulHeapName;
  /* 0x0038 */ class CDfMutex _dmtx;
  /* 0x0040 */ unsigned long _cRecursion;
}; /* size: 0x0044 */

class CPipePSFactory
{
  /* 0x0004 */ long m_cRef;
}; /* size: 0x0008 */

class CPipeProxy<double,&IID_IPipeDouble,&IID_AsyncIPipeDouble,IPipeDouble,AsyncIPipeDouble>
{
  /* 0x0004 */ struct IUnknown* m_pUnkOuter;
  /* 0x0008 */ long m_cRef;
  /* 0x000c */ struct IPipeDouble* m_pRealProxy;
  /* 0x0010 */ struct IUnknown* m_pPullCallObj;
  /* 0x0014 */ struct AsyncIPipeDouble* m_pAsyncPullPipe;
  /* 0x0018 */ struct ISynchronize* m_pISyncPull;
  /* 0x001c */ enum PULLSTATE m_PullState;
  /* 0x0020 */ unsigned long m_cReadAhead;
  /* 0x0024 */ unsigned long m_cLastRead;
  /* 0x0028 */ unsigned long m_cKeepBufferSize;
  /* 0x002c */ double* m_pKeepBuffer;
  /* 0x0030 */ unsigned long m_cKeepDataSize;
  /* 0x0034 */ double* m_pKeepData;
  /* 0x0038 */ struct IUnknown* m_pPushCallObj;
  /* 0x003c */ struct AsyncIPipeDouble* m_pAsyncPushPipe;
  /* 0x0040 */ struct ISynchronize* m_pISyncPush;
  /* 0x0044 */ enum PUSHSTATE m_PushState;
  /* 0x0048 */ unsigned long m_cPushBufferSize;
  /* 0x004c */ double* m_pPushBuffer;
  /* 0x0050 */ unsigned long m_cFreeSpace;
  /* 0x0054 */ double* m_pFreeSpace;
  /* 0x0058 */ void* PullStateFunc[14] /* function */;
  /* 0x0090 */ void* PushStateFunc[12] /* function */;
}; /* size: 0x00c0 */

class CPipeProxy<long,&IID_IPipeLong,&IID_AsyncIPipeLong,IPipeLong,AsyncIPipeLong>
{
  /* 0x0004 */ struct IUnknown* m_pUnkOuter;
  /* 0x0008 */ long m_cRef;
  /* 0x000c */ struct IPipeLong* m_pRealProxy;
  /* 0x0010 */ struct IUnknown* m_pPullCallObj;
  /* 0x0014 */ struct AsyncIPipeLong* m_pAsyncPullPipe;
  /* 0x0018 */ struct ISynchronize* m_pISyncPull;
  /* 0x001c */ enum PULLSTATE m_PullState;
  /* 0x0020 */ unsigned long m_cReadAhead;
  /* 0x0024 */ unsigned long m_cLastRead;
  /* 0x0028 */ unsigned long m_cKeepBufferSize;
  /* 0x002c */ long* m_pKeepBuffer;
  /* 0x0030 */ unsigned long m_cKeepDataSize;
  /* 0x0034 */ long* m_pKeepData;
  /* 0x0038 */ struct IUnknown* m_pPushCallObj;
  /* 0x003c */ struct AsyncIPipeLong* m_pAsyncPushPipe;
  /* 0x0040 */ struct ISynchronize* m_pISyncPush;
  /* 0x0044 */ enum PUSHSTATE m_PushState;
  /* 0x0048 */ unsigned long m_cPushBufferSize;
  /* 0x004c */ long* m_pPushBuffer;
  /* 0x0050 */ unsigned long m_cFreeSpace;
  /* 0x0054 */ long* m_pFreeSpace;
  /* 0x0058 */ void* PullStateFunc[14] /* function */;
  /* 0x0090 */ void* PushStateFunc[12] /* function */;
}; /* size: 0x00c0 */

class CPipeProxy<unsigned char,&IID_IPipeByte,&IID_AsyncIPipeByte,IPipeByte,AsyncIPipeByte>
{
  /* 0x0004 */ struct IUnknown* m_pUnkOuter;
  /* 0x0008 */ long m_cRef;
  /* 0x000c */ struct IPipeByte* m_pRealProxy;
  /* 0x0010 */ struct IUnknown* m_pPullCallObj;
  /* 0x0014 */ struct AsyncIPipeByte* m_pAsyncPullPipe;
  /* 0x0018 */ struct ISynchronize* m_pISyncPull;
  /* 0x001c */ enum PULLSTATE m_PullState;
  /* 0x0020 */ unsigned long m_cReadAhead;
  /* 0x0024 */ unsigned long m_cLastRead;
  /* 0x0028 */ unsigned long m_cKeepBufferSize;
  /* 0x002c */ unsigned char* m_pKeepBuffer;
  /* 0x0030 */ unsigned long m_cKeepDataSize;
  /* 0x0034 */ unsigned char* m_pKeepData;
  /* 0x0038 */ struct IUnknown* m_pPushCallObj;
  /* 0x003c */ struct AsyncIPipeByte* m_pAsyncPushPipe;
  /* 0x0040 */ struct ISynchronize* m_pISyncPush;
  /* 0x0044 */ enum PUSHSTATE m_PushState;
  /* 0x0048 */ unsigned long m_cPushBufferSize;
  /* 0x004c */ unsigned char* m_pPushBuffer;
  /* 0x0050 */ unsigned long m_cFreeSpace;
  /* 0x0054 */ unsigned char* m_pFreeSpace;
  /* 0x0058 */ void* PullStateFunc[14] /* function */;
  /* 0x0090 */ void* PushStateFunc[12] /* function */;
}; /* size: 0x00c0 */

class CPipeProxyImp
{
  /* 0x0004 */ long m_cRef;
  /* 0x0008 */ struct IUnknown* m_pUnkOuter;
  /* 0x000c */ struct IUnknown* m_pRealPipeProxy;
  /* 0x0010 */ struct IUnknown* m_pInternalPipeProxy;
  /* 0x0014 */ struct IRpcProxyBuffer* m_pInternalPB;
  /* 0x0018 */ struct _GUID m_IidOfPipe;
}; /* size: 0x0028 */

struct CPlex
{
  /* 0x0000 */ struct CPlex* pNext;
  /* 0x0004 */ unsigned int nMax;
  /* 0x0008 */ unsigned int nCur;
}; /* size: 0x000c */

class CPoint
{
  /* 0x0000 */ struct tagPOINT _pt;
}; /* size: 0x0008 */

class CPointerHashTable
{
}; /* size: 0x0018 */

class CPointerMoniker
{
  /* 0x0018 */ struct IUnknown* m_pUnk;
}; /* size: 0x001c */

class CPolicySet
{
  /* 0x0004 */ struct SHashChain _chain;
  /* 0x000c */ unsigned long _dwFlags;
  /* 0x0010 */ unsigned long _cRefs;
  /* 0x0014 */ unsigned long _cPolicies;
  /* 0x0018 */ unsigned long _dwAptID;
  /* 0x001c */ class CObjectContext* _pClientCtx;
  /* 0x0020 */ class CObjectContext* _pServerCtx;
  /* 0x0024 */ struct tagPolicyEntry* _pFirstEntry;
  /* 0x0028 */ struct tagPolicyEntry* _pLastEntry;
  /* 0x002c */ struct tagSPSCache _PSCache;
  union
  {
    /* 0x0000 */ class CPageAllocator s_PSallocator;
    /* 0x0000 */ class CPageAllocator s_PEallocator;
    /* 0x0000 */ int s_fInitialized;
    /* 0x0000 */ unsigned long s_cObjects;
  }; /* size: 0x0040 */
}; /* size: 0x003c */

class CPres
{
  /* 0x0000 */ class CFormat m_format;
  /* 0x0018 */ unsigned long m_ulHeight;
  /* 0x001c */ unsigned long m_ulWidth;
  /* 0x0020 */ class CData m_data;
}; /* size: 0x0030 */

class CPrivAlloc
{
}; /* size: 0x0001 */

class CPrivDragDrop
{
  /* 0x0004 */ unsigned long _ulRefCnt;
}; /* size: 0x0008 */

class CProcessActivator
{
}; /* size: 0x0004 */

class CProcessExtensionTbl
{
  /* 0x0000 */ class CExtHashTable _HashTbl;
  /* 0x0018 */ class CPageAllocator _palloc;
}; /* size: 0x0058 */

class CProcessPatternTbl
{
  /* 0x0000 */ class CPatternTbl* m_pPatTbl;
  /* 0x0004 */ class CScmPatternTbl* m_pScmPatTbl;
}; /* size: 0x0008 */

class CProcessSecret
{
  union
  {
    /* 0x0000 */ struct _GUID s_guidOle32Secret;
    /* 0x0000 */ int s_fSecretInit;
    /* 0x0000 */ class COleStaticMutexSem s_SecretLock;
  }; /* size: 0x0030 */
}; /* size: 0x0001 */

class CPropSetName
{
  /* 0x0000 */ wchar_t _oszName[32];
}; /* size: 0x0040 */

class CPropertyBagEx
{
  /* 0x0008 */ int _fLcidInitialized : 1; /* bit position: 0 */
  /* 0x000c */ unsigned long _lcid;
  /* 0x0010 */ struct IPropertySetStorage* _ppropsetstgContainer;
  /* 0x0014 */ struct IPropertyStorage* _ppropstg;
  /* 0x0018 */ struct IBlockingLock* _pBlockingLock;
  /* 0x001c */ unsigned long _grfMode;
  /* 0x0020 */ long _cRefs;
}; /* size: 0x0024 */

class CPropertySetStorage
{
  /* 0x0004 */ struct IStorage* _pstg;
  /* 0x0008 */ struct IBlockingLock* _pBlockingLock;
  /* 0x000c */ unsigned long _ulSig;
  /* 0x0010 */ int _fContainingStgIsRefed : 1; /* bit position: 0 */
  /* 0x0014 */ enum MAPPED_STREAM_OPTS _MSOpts;
  /* 0x0018 */ long _cReferences;
}; /* size: 0x001c */

class CPropertySetStream
{
  /* 0x0000 */ struct tagPROPERTYSETHEADER* _pph;
  /* 0x0004 */ unsigned long _oSection;
  /* 0x0008 */ unsigned long _cSection;
  /* 0x000c */ unsigned short _CodePage;
  /* 0x000e */ unsigned char _Flags;
  /* 0x000f */ unsigned char _State;
  /* 0x0010 */ unsigned long _Locale;
  /* 0x0014 */ unsigned long _grfBehavior;
  /* 0x0018 */ unsigned long _cbTail;
  /* 0x001c */ class PMemoryAllocator* _pma;
  /* 0x0020 */ class IMappedStream* _pmstm;
}; /* size: 0x0024 */

class CPropertyStorage
{
  /* 0x0004 */ unsigned long _ulSig;
  /* 0x0008 */ long _cRefs;
  /* 0x000c */ struct IStorage* _pstgPropSet;
  /* 0x0010 */ struct IStream* _pstmPropSet;
  /* 0x0014 */ class CPropertySetStream* _np;
  /* 0x0018 */ class IMappedStream* _ms;
  /* 0x001c */ enum MAPPED_STREAM_OPTS _fMSOpts;
  /* 0x0020 */ int _fInitCriticalSection;
  /* 0x0024 */ struct _RTL_CRITICAL_SECTION _CriticalSection;
  struct /* bitfield */
  {
    /* 0x003c */ int _fUserDefinedProperties : 1; /* bit position: 0 */
    /* 0x003c */ int _fExplicitelyProbedForWriteAccess : 1; /* bit position: 1 */
  }; /* bitfield */
  /* 0x0040 */ unsigned short _usCodePage;
  /* 0x0044 */ unsigned long _dwOSVersion;
  /* 0x0048 */ unsigned long _grfFlags;
  /* 0x004c */ unsigned long _grfMode;
  /* 0x0050 */ class CCoTaskAllocator _cCoTaskAllocator;
}; /* size: 0x0054 */

enum CPropertyStorage::EInitializePropertyStream
{
  OPEN_PROPSTREAM = 0,
  CREATE_PROPSTREAM = 1,
  DELETE_PROPSTREAM = 2,
};

enum CPropertyStorage::EIsWriteable
{
  PROBE_IF_NECESSARY = 0,
  DO_NOT_PROBE = 1,
};

class CPtrBlock
{
  /* 0x0000 */ int _cPtrs;
  /* 0x0004 */ class CPtrBlock* _pbNext;
  /* 0x0008 */ void* _apv[50];
}; /* size: 0x00d0 */

class CPtrCache
{
  /* 0x0000 */ class CPtrBlock _pbFirst;
  /* 0x00d0 */ class CPtrBlock* _pbHead;
  /* 0x00d4 */ class CPtrBlock* _pbEnum;
  /* 0x00d8 */ int _iEnum;
}; /* size: 0x00dc */

class CPubDocFile
{
  /* 0x0054 */ class CTSSet _tss;
  /* 0x0058 */ class CBasedPubDocFilePtr _pdfParent;
  /* 0x005c */ class CBasedDocFilePtr _pdf;
  /* 0x0060 */ class CChildInstanceList _cilChildren;
  /* 0x0064 */ unsigned short _cTransactedDepth;
  /* 0x0066 */ unsigned short _wFlags;
  /* 0x0068 */ class CBasedMStreamPtr _pmsBase;
  /* 0x006c */ unsigned long _sigMSF;
  /* 0x0070 */ long _cReferences;
  /* 0x0074 */ class CBasedDFBasisPtr _pdfb;
}; /* size: 0x0078 */

class CPubMappedStream
{
  /* 0x0000 */ class CBasedPubStreamPtr _pst;
  /* 0x0004 */ class CBasedBytePtr _pb;
  /* 0x0008 */ class CBasedBytePtr _powner;
  /* 0x000c */ unsigned long _cbUsed;
  /* 0x0010 */ unsigned long _cbOriginalStreamSize;
  /* 0x0014 */ unsigned char _fDirty;
}; /* size: 0x0018 */

class CPubStream
{
  /* 0x0054 */ class CBasedSStreamPtr _psParent;
  /* 0x0058 */ class CBasedPubDocFilePtr _ppdfParent;
  /* 0x005c */ int _fDirty;
  /* 0x0060 */ long _cReferences;
  /* 0x0064 */ class CPubMappedStream _PubMappedStream;
}; /* size: 0x007c */

class CPunkForRelease
{
  /* 0x0004 */ unsigned long _cRefs;
  /* 0x0008 */ unsigned long _fTopLayerMFP : 1; /* bit position: 0 */
  /* 0x000c */ struct tagSTGMEDIUM _stgmed;
  /* 0x0018 */ struct IUnknown* _pUnkForRelease;
}; /* size: 0x001c */

struct CREATE_USN_JOURNAL_DATA
{
  /* 0x0000 */ unsigned __int64 MaximumSize;
  /* 0x0008 */ unsigned __int64 AllocationDelta;
}; /* size: 0x0010 */

class CRGTypeSizes
{
  union
  {
    /* 0x0000 */ const unsigned char* m_ucTypeSizesA /* zero-length array */;
    /* 0x0000 */ const unsigned char* m_ucTypeSizesB /* zero-length array */;
  }; /* size: 0x0001 */
}; /* size: 0x0001 */

class CRIFTable
{
  union
  {
    /* 0x0000 */ int _fPreFilled;
    /* 0x0000 */ class CUUIDHashTable _HashTbl;
    /* 0x0000 */ class CPageAllocator _palloc;
    /* 0x0000 */ class COleStaticMutexSem _mxs;
  }; /* size: 0x0040 */
}; /* size: 0x0001 */

class CROIDTable
{
  union
  {
    /* 0x0000 */ unsigned long _cOidsToAdd;
    /* 0x0000 */ unsigned long _cOidsToRemove;
    /* 0x0000 */ struct SOIDRegistration _ClientOIDRegList;
    /* 0x0000 */ int _fWorker;
    /* 0x0000 */ unsigned long _dwSleepPeriod;
    /* 0x0000 */ class CUUIDHashTable _ClientRegisteredOIDs;
  }; /* size: 0x0040 */
}; /* size: 0x0001 */

class CROTItem
{
  /* 0x0000 */ unsigned short _wItemSig;
  /* 0x0004 */ int _fDontCallApp;
  /* 0x0008 */ struct _SCMREGKEY _scmregkey;
  /* 0x0018 */ unsigned long _hApt;
  /* 0x001c */ void* _pvStubRegistration;
}; /* size: 0x0020 */

class CRWLock
{
  union
  {
    /* 0x0000 */ struct CRWLock::LockState _lockState;
    struct
    {
      /* 0x0000 */ volatile unsigned long _ulLockState;
      /* 0x0004 */ volatile unsigned long _dwWriterSeqNum;
      /* 0x0008 */ volatile unsigned long _dwWriterID;
      /* 0x000c */ unsigned short _wFlags;
      /* 0x000e */ unsigned short _wWriterLevel;
      union
      {
        /* 0x0010 */ struct CRWLock::EventState _eventState;
        /* 0x0010 */ volatile unsigned long _dwEventState;
        /* 0x0010 */ class EventPoolEntry* volatile _pPoolEntry;
      }; /* size: 0x0004 */
    }; /* size: 0x0014 */
    /* 0x0000 */ unsigned long s_dwDefaultTimeout;
    /* 0x0000 */ unsigned long s_dwDefaultSpinCount;
    /* 0x0000 */ unsigned long s_dwNumberOfProcessors;
  }; /* size: 0x0014 */
}; /* size: 0x0014 */

struct CRWLock::EventState
{
  struct /* bitfield */
  {
    /* 0x0000 */ volatile unsigned long _entryIsEventMask : 1; /* bit position: 0 */
    /* 0x0000 */ volatile unsigned long _entryIsMarkedForPooling : 1; /* bit position: 1 */
    /* 0x0000 */ volatile unsigned long _entryIsBeingPooled : 1; /* bit position: 2 */
    /* 0x0000 */ volatile unsigned long _readerEventBeingSignaled : 1; /* bit position: 3 */
    /* 0x0000 */ volatile unsigned long _readerEventBeingReset : 1; /* bit position: 4 */
    /* 0x0000 */ volatile unsigned long _readerCountIsSignalCount : 1; /* bit position: 5 */
    /* 0x0000 */ volatile unsigned long _readerCount : 25; /* bit position: 6 */
    /* 0x0000 */ volatile unsigned long _writerEventSignaled : 1; /* bit position: 31 */
  }; /* bitfield */
}; /* size: 0x0004 */

union CRWLock::GetPoolEntry::__l2::EventStatePoolEntry
{
  union
  {
    /* 0x0000 */ volatile unsigned long dwEventState;
    /* 0x0000 */ class EventPoolEntry* volatile pPoolEntry;
  }; /* size: 0x0004 */
}; /* size: 0x0004 */

struct CRWLock::LockState
{
  struct /* bitfield */
  {
    /* 0x0000 */ volatile unsigned long _numReaders : 10; /* bit position: 0 */
    /* 0x0000 */ volatile unsigned long _writerPresent : 1; /* bit position: 10 */
    /* 0x0000 */ volatile unsigned long _writerSignaled : 1; /* bit position: 11 */
    /* 0x0000 */ volatile unsigned long _readerSignaled : 1; /* bit position: 12 */
    /* 0x0000 */ volatile unsigned long _resetInProgress : 1; /* bit position: 13 */
    /* 0x0000 */ volatile unsigned long _waitingReaders : 9; /* bit position: 14 */
    /* 0x0000 */ volatile unsigned long _waitingWriters : 9; /* bit position: 23 */
  }; /* bitfield */
}; /* size: 0x0004 */

union CRWLock::ReleasePoolEntry::__l2::LockStatePoolEntry
{
  union
  {
    struct
    {
      /* 0x0000 */ volatile unsigned long ulLockState;
      union
      {
        /* 0x0004 */ volatile unsigned long dwEventState;
        /* 0x0004 */ class EventPoolEntry* volatile pPoolEntry;
      }; /* size: 0x0004 */
    }; /* size: 0x0008 */
    /* 0x0000 */ volatile __int64 llState;
  }; /* size: 0x0008 */
}; /* size: 0x0008 */

class CRandomNumberGenerator
{
  /* 0x0000 */ unsigned long _hRngProv;
}; /* size: 0x0004 */

class CRefCache
{
  /* 0x0000 */ unsigned long _cRefs;
  /* 0x0004 */ unsigned long _cStrongItfs;
  /* 0x0008 */ unsigned long _cWeakItfs;
  /* 0x000c */ unsigned long _cTableStrong;
  /* 0x0010 */ unsigned long _cIRCs;
  /* 0x0014 */ struct IRCEntry* _pIRCList;
  /* 0x0018 */ struct SOIDRegistration _soidReg;
}; /* size: 0x0058 */

class CRefExportCount
{
  /* 0x0004 */ unsigned long m_cRefs;
  /* 0x0008 */ unsigned long m_cExportCount;
  /* 0x000c */ unsigned long m_IsZombie;
  /* 0x0010 */ unsigned long m_Status;
  /* 0x0014 */ struct IUnknown* m_pUnkOuter;
}; /* size: 0x0018 */

enum CRefExportCount::tagTokens
{
  ALIVE = 0,
  KILL = 1,
  DEAD = 2,
};

class CRefMutexAutoLock
{
  /* 0x0000 */ class CRefMutexSem* m_pmxs;
}; /* size: 0x0004 */

class CRefMutexSem
{
  /* 0x0000 */ long m_lRefs;
  /* 0x0004 */ class CMutexSem2 m_mxs;
}; /* size: 0x0020 */

class CRefStabilize
{
  /* 0x0000 */ class CRefExportCount* m_pRefExportCount;
}; /* size: 0x0004 */

class CRefcountedObject
{
  /* 0x0000 */ unsigned long _cReferences;
}; /* size: 0x0004 */

class CRemoteUnknown
{
  /* 0x0004 */ class CStdIdentity* _pStdId;
}; /* size: 0x0008 */

class CRootPubDocFile
{
  /* 0x0078 */ unsigned long _ulPriLock;
  /* 0x007c */ struct IMalloc* const _pMalloc;
  /* 0x0080 */ struct _FILETIME _timeModifyAtCommit;
}; /* size: 0x0088 */

class CRotHintTable
{
  /* 0x0000 */ unsigned char* _pbHintArray;
}; /* size: 0x0004 */

class CRotMonikerEnum
{
  /* 0x0004 */ unsigned long _cRefs;
  /* 0x0008 */ unsigned long _dwOffset;
  /* 0x000c */ class CMonikerPtrBuf _mkptrbuf;
}; /* size: 0x0024 */

class CRpcCall
{
  /* 0x000c */ unsigned long _cRefs;
  /* 0x0010 */ struct IUnknown*& _pIdentity;
  /* 0x0014 */ struct tagRPCOLEMESSAGE* _pMessage;
  /* 0x0018 */ const struct _GUID& _riid;
  /* 0x001c */ HRESULT& _hrRet;
  /* 0x0020 */ enum _CALLSOURCE _callSource;
  /* 0x0024 */ HRESULT _ServerHR;
}; /* size: 0x0028 */

class CRpcChannelBuffer
{
  /* 0x0008 */ unsigned long _cRefs;
  /* 0x000c */ unsigned long state;
  /* 0x0010 */ class CChannelHandle* volatile _pRpcDefault;
  /* 0x0014 */ class CChannelHandle* _pRpcCustom;
  /* 0x0018 */ class OXIDEntry* _pOXIDEntry;
  /* 0x001c */ struct tagIPIDEntry* _pIPIDEntry;
  /* 0x0020 */ void* _pInterfaceInfo;
  /* 0x0024 */ class CStdIdentity* _pStdId;
  /* 0x0028 */ class CDestObject _destObj;
}; /* size: 0x0034 */

class CRpcChannelBuffer::CServerCallMgr
{
  /* 0x0010 */ unsigned long _cRefs;
  /* 0x0014 */ unsigned long _dwState;
  /* 0x0018 */ struct _GUID _iid;
  /* 0x0028 */ struct _GUID _iidAsync;
  /* 0x0038 */ struct IUnknown* _pUnkStubCallMgr;
  /* 0x003c */ struct IUnknown* _pUnkServerCallMgr;
  /* 0x0040 */ struct ISynchronize* _pSync;
  /* 0x0044 */ struct IRpcStubBuffer* _pSB;
  /* 0x0048 */ class CMessageCall* _pCall;
  /* 0x004c */ class CStdIdentity* _pStdID;
}; /* size: 0x0050 */

typedef enum _TAG_UNNAMED_26
{
  STATE_WAITINGFORSIGNAL = 0,
  STATE_SIGNALED = 1,
  STATE_ERROR = 2,
} TAG_UNNAMED_26, *PTAG_UNNAMED_26;

class CRpcHelper
{
  /* 0x0004 */ unsigned long _cRefs;
}; /* size: 0x0008 */

class CRpcOptions
{
  /* 0x0004 */ class CStdIdentity* _pStdId;
  /* 0x0008 */ struct IUnknown* _pUnkOuter;
}; /* size: 0x000c */

class CRpcResolver
{
  union
  {
    struct
    {
      /* 0x0000 */ class CFastBH* _fbhILocalObjectExporter;
      /* 0x0004 */ class CFastBH* _fbhIROT;
      /* 0x0008 */ class CFastBH* _fbhISCM;
      /* 0x000c */ class CFastBH* _fbhIMachineActivatorControl;
    }; /* size: 0x0010 */
    /* 0x0000 */ void* _ph;
    /* 0x0000 */ unsigned long _dwFlags;
    /* 0x0000 */ class CDualStringArray* _pdsaLocalResolver;
    /* 0x0000 */ unsigned __int64 _dwCurrentBindingsID;
    /* 0x0000 */ struct _GUID _GuidRPCSSProcessIdentifier;
    /* 0x0000 */ class CMachineNamesHelper* _pMNHelper;
    /* 0x0000 */ unsigned long _cReservedOidsAvail;
    /* 0x0000 */ unsigned __int64 _OidsReserved[10];
    /* 0x0000 */ struct ISCMLocalActivator* _pSCMProxy;
    /* 0x0000 */ struct ISCMLocalActivator* _pCloakedSCMProxy;
    /* 0x0000 */ wchar_t* _pwszWinstaDesktop;
    /* 0x0000 */ wchar_t* _pwszFQDN;
    /* 0x0000 */ unsigned __int64 _ProcessSignature;
    /* 0x0000 */ void* _pNoRegLaunchPermissionsSD;
    /* 0x0000 */ void* _pNoRegAccessPermissionsSD;
    /* 0x0000 */ void* _pNoRegLaunchRestrictionsSD;
    /* 0x0000 */ void* _pNoRegAccessRestrictionsSD;
    /* 0x0000 */ void* _pDefaultAccessRestrictionsSD;
    /* 0x0000 */ void* _pSelfSid;
    /* 0x0000 */ class COleStaticMutexSem _mxsResolver;
    /* 0x0000 */ void* _hResolverWaitEvent;
  }; /* size: 0x0050 */
}; /* size: 0x0010 */

class CRpcThread
{
  /* 0x0000 */ void* _hWakeup;
  /* 0x0004 */ int _fDone;
  /* 0x0008 */ void* _fn /* function */;
  /* 0x000c */ void* _param;
  /* 0x0010 */ class CRpcThread* _pNext;
  /* 0x0014 */ unsigned long _dwThreadID;
  /* 0x0018 */ struct HINSTANCE__* _hInstOle32;
}; /* size: 0x001c */

class CRpcThreadCache
{
  union
  {
    /* 0x0000 */ class CRpcThread* _pFreeList;
    /* 0x0000 */ class COleStaticMutexSem _mxs;
  }; /* size: 0x0030 */
}; /* size: 0x0001 */

class CRtlSmartUcsEncoderTraits<_LUNICODE_STRING>
{
}; /* size: 0x0001 */

class CRtlSmartUcsEncoderTraits<_LUTF8_STRING>
{
}; /* size: 0x0001 */

class CRtlSmartUcsEncoderTraitsBase<CRtlSmartUcsEncoderTraits<_LUNICODE_STRING> >
{
}; /* size: 0x0001 */

class CRtlSmartUcsEncoderTraitsBase<CRtlSmartUcsEncoderTraits<_LUTF8_STRING> >
{
}; /* size: 0x0001 */

class CRunningObjectTable
{
  /* 0x0008 */ class CArrayFValue _afvRotList;
  /* 0x001c */ class CCliRotHintTable _crht;
  /* 0x0024 */ unsigned short _wSigRotItem;
}; /* size: 0x0028 */

class CSCInnerUnknown
{
  /* 0x0004 */ unsigned long _iRefCount;
  /* 0x0008 */ class CSynchronizeContainer* _pParent;
}; /* size: 0x000c */

class CSCMergedEnum<IEnumCATEGORYINFO,tagCATEGORYINFO>
{
  /* 0x0004 */ struct IEnumCATEGORYINFO** m_pcsEnum;
  /* 0x0008 */ unsigned long m_cTotalEnum;
  /* 0x000c */ unsigned long m_dwRefCount;
  /* 0x0010 */ unsigned long m_CurrentEnum;
  /* 0x0014 */ struct _GUID m_myiid;
}; /* size: 0x0024 */

class CSCMergedEnum<IEnumGUID,_GUID>
{
  /* 0x0004 */ struct IEnumGUID** m_pcsEnum;
  /* 0x0008 */ unsigned long m_cTotalEnum;
  /* 0x000c */ unsigned long m_dwRefCount;
  /* 0x0010 */ unsigned long m_CurrentEnum;
  /* 0x0014 */ struct _GUID m_myiid;
}; /* size: 0x0024 */

class CSSL
{
  union
  {
    /* 0x0000 */ unsigned long _hProvider;
    /* 0x0000 */ void* _hMyStore;
    /* 0x0000 */ void* _hRootStore;
    /* 0x0000 */ const struct _CERT_CONTEXT* _pCert;
    /* 0x0000 */ HRESULT _hr;
  }; /* size: 0x0004 */
}; /* size: 0x0001 */

class CSSMappedStream
{
  /* 0x0004 */ long _cRefs;
  /* 0x0008 */ struct IStream* _pstm;
  /* 0x000c */ unsigned char* _pbMappedStream;
  /* 0x0010 */ unsigned long _cbMappedStream;
  /* 0x0014 */ unsigned long _cbActualStreamSize;
  /* 0x0018 */ void* _powner;
  /* 0x001c */ int _fDirty;
}; /* size: 0x0020 */

class CSTATPROPBAGArray
{
  /* 0x0000 */ long _cReferences;
  /* 0x0004 */ struct IEnumSTATPROPSTG* _penum;
  /* 0x0008 */ struct IBlockingLock* _pBlockingLock;
  /* 0x000c */ wchar_t* _poszPrefix;
  /* 0x0010 */ unsigned long _dwFlags;
}; /* size: 0x0014 */

class CSTInnerUnknown
{
  /* 0x0004 */ unsigned long _iRefCount;
  /* 0x0008 */ class CStdEvent* _pParent;
}; /* size: 0x000c */

class CSafeAccess
{
  /* 0x0000 */ class CDFBasis* _pdfb;
  /* 0x0004 */ class CPerContext* _ppc;
  /* 0x0008 */ int _fAccess;
}; /* size: 0x000c */

class CSafeBYTEArray
{
  /* 0x0000 */ unsigned char* _p;
}; /* size: 0x0004 */

class CSafeBindCtx
{
  /* 0x0000 */ struct IBindCtx* _p;
}; /* size: 0x0004 */

class CSafeMarshaledStg
{
  /* 0x0000 */ struct IStorage* _pstg;
}; /* size: 0x0004 */

class CSafeMoniker
{
  /* 0x0000 */ struct IMoniker* _p;
}; /* size: 0x0004 */

class CSafeMultiHeap
{
  /* 0x0000 */ class CSmAllocator* _pSmAllocator;
  /* 0x0004 */ class CPerContext* _ppcPrev;
}; /* size: 0x0008 */

class CSafeRefCount
{
  /* 0x0004 */ unsigned long m_cRefs;
  /* 0x0008 */ int m_fInDelete;
  /* 0x000c */ struct IUnknown* m_pUnkOuter;
}; /* size: 0x0010 */

class CSafeSem
{
  /* 0x0000 */ long _sc;
  /* 0x0004 */ class CPerContext* _ppc;
  /* 0x0008 */ class CPerContext* _ppcPrev;
  /* 0x000c */ class CSmAllocator* _pSmAllocator;
}; /* size: 0x0010 */

class CSafeStgMarshaled
{
  /* 0x0000 */ struct tagInterfaceData* _pIFD;
}; /* size: 0x0004 */

class CScmPatternTbl
{
  /* 0x0000 */ unsigned char* _pLocTbl;
}; /* size: 0x0004 */

class CSecurityDescriptor
{
  /* 0x0000 */ struct _SECURITY_DESCRIPTOR _sd;
}; /* size: 0x0014 */

class CSeekPointer
{
  /* 0x0000 */ unsigned __int64 _ulPos;
  /* 0x0008 */ long _cReferences;
}; /* size: 0x0010 */

class CServerContextActivator
{
}; /* size: 0x0004 */

class CServerSecurity
{
  union
  {
    /* 0x0000 */ class CPageAllocator _palloc;
    struct
    {
      /* 0x0000 */ class COleStaticMutexSem _mxs;
      /* 0x000c */ unsigned long _iRefCount;
      /* 0x0010 */ unsigned long _iFlags;
      /* 0x0014 */ class CChannelHandle* _pHandle;
      /* 0x0018 */ void* _hRpc;
      /* 0x001c */ class CMessageCall* _pClientCall;
      /* 0x0020 */ void* _hSaved;
    }; /* size: 0x0048 */
  }; /* size: 0x0048 */
}; /* size: 0x0024 */

class CSessionMoniker
{
  /* 0x0018 */ unsigned long m_sessionid;
  /* 0x001c */ int m_bUseConsoleSession;
  /* 0x0020 */ int m_bHaveBindOpts;
  /* 0x0024 */ struct tagBIND_OPTS2 m_bindopts2;
}; /* size: 0x0044 */

class CSharedMemHeader
{
  /* 0x0000 */ unsigned long _ulSize;
  /* 0x0004 */ unsigned long ulPad;
}; /* size: 0x0008 */

class CSharedMemoryBlock
{
  /* 0x0000 */ void* _hMem;
  /* 0x0004 */ unsigned char* _pbBase;
  /* 0x0008 */ unsigned long _culCommitSize;
  /* 0x000c */ unsigned long _culInitCommitSize;
  /* 0x0010 */ int _fCreated;
  /* 0x0014 */ int _fReadWrite;
}; /* size: 0x0018 */

class CSimpEnumSTATSTG
{
  /* 0x0004 */ unsigned long _cReferences;
  /* 0x0008 */ class CDfNameList* _pdfl;
  /* 0x000c */ class CDfNameList* _pdflCurrent;
}; /* size: 0x0010 */

struct CSimpStorage
{
  /* 0x0024 */ long _cReferences;
  /* 0x0028 */ void* _hFile;
  /* 0x002c */ int _fDirty;
  /* 0x0030 */ class CMSFHeader _hdr;
  /* 0x0234 */ unsigned char* _pbBuf;
  /* 0x0238 */ unsigned long _sectMax;
  /* 0x023c */ struct _GUID _clsid;
  /* 0x024c */ class CDfNameList* _pdfl;
  /* 0x0250 */ class CDfNameList* _pdflCurrent;
  /* 0x0254 */ unsigned long _cStreams;
}; /* size: 0x0258 */

class CSimpStorageOpen
{
  /* 0x0258 */ unsigned long _grfMode;
  /* 0x025c */ unsigned long _grfStateBits;
  /* 0x0260 */ wchar_t _awcsName[260];
}; /* size: 0x0468 */

struct CSimpStream
{
  /* 0x0008 */ long _cReferences;
  /* 0x000c */ long _ulSeekStart;
  /* 0x0010 */ unsigned long _ulSeekPos;
  /* 0x0014 */ struct CSimpStorage* _pstgParent;
  /* 0x0018 */ void* _hFile;
}; /* size: 0x001c */

class CSimpStreamOpen
{
  /* 0x001c */ class CDfNameList* _pdfl;
  /* 0x0020 */ unsigned long _grfMode;
}; /* size: 0x0024 */

class CSinkList
{
  /* 0x0000 */ struct IProgressNotify* _ppn;
  /* 0x0004 */ unsigned long _dwCookie;
  /* 0x0008 */ class CSinkList* _pslNext;
}; /* size: 0x000c */

class CSmAllocator
{
  /* 0x0004 */ class CSharedMemoryBlock* _psmb;
  /* 0x0008 */ unsigned char* _pbBase;
  /* 0x000c */ class CPerContext* _ppcOwner;
  /* 0x0010 */ unsigned long _cbSize;
  /* 0x0014 */ unsigned long _ulHeapName;
  /* 0x0018 */ unsigned long _cRefs;
}; /* size: 0x001c */

class CSplit_QI
{
  /* 0x0000 */ struct tagMInterfacePointer* SomePMItfPtrs[2];
  /* 0x0008 */ HRESULT SomeHRs[2];
  /* 0x0010 */ struct _GUID SomeIIDs[2];
  /* 0x0030 */ unsigned long _dwCount;
  /* 0x0034 */ char* _pAllocBlock;
  /* 0x0038 */ struct tagMInterfacePointer** _pItfArray;
  /* 0x003c */ HRESULT* _pHrArray;
  /* 0x0040 */ struct _GUID* _pIIDArray;
}; /* size: 0x0044 */

class CSpyTable
{
  /* 0x0000 */ unsigned long m_cAllocations;
  /* 0x0004 */ struct AENTRY* m_table;
  /* 0x0008 */ unsigned long m_cEntries;
}; /* size: 0x000c */

class CSrvCallState
{
  /* 0x0000 */ unsigned long _dwCallCatIn;
  /* 0x0004 */ class CSrvCallState* _pPrev;
}; /* size: 0x0008 */

class CStabilize
{
  /* 0x0000 */ class CSafeRefCount* m_pSafeRefCount;
}; /* size: 0x0004 */

class CStackBuffer
{
  /* 0x0000 */ unsigned char* _pbHeapBuf;
  /* 0x0004 */ unsigned long _cElements;
  /* 0x0008 */ unsigned char* _pbStackBuf;
  /* 0x000c */ unsigned long _cbElement;
}; /* size: 0x0010 */

class CStackWalker
{
  /* 0x0004 */ long m_cRef;
  /* 0x0008 */ void* m_hProcess;
}; /* size: 0x000c */

class CStackWalkerStack
{
  /* 0x0004 */ long m_cRef;
  /* 0x0008 */ unsigned long m_dwFlags;
  /* 0x000c */ class CStackWalkerSymbol* m_pTopSymbol;
}; /* size: 0x0010 */

class CStackWalkerSymbol
{
  /* 0x0004 */ long m_cRef;
  /* 0x0008 */ wchar_t* m_pwszModuleName;
  /* 0x000c */ wchar_t* m_pwszSymbolName;
  /* 0x0010 */ unsigned __int64 m_dw64Displacement;
  /* 0x0018 */ unsigned __int64 m_dw64Address;
  /* 0x0020 */ class CStackWalkerSymbol* m_pNext;
}; /* size: 0x0028 */

class CStatArray
{
  /* 0x0000 */ long _cRefs;
  /* 0x0004 */ struct tagSTATPROPSTG* _psps;
  /* 0x0008 */ unsigned long _cpropActual;
}; /* size: 0x000c */

class CStatData
{
  /* 0x0000 */ unsigned long m_ulFlags;
  /* 0x0004 */ struct tagFORMATETC m_foretc;
  /* 0x0018 */ unsigned long m_dwAdvf;
  /* 0x001c */ struct IAdviseSink* m_pAdvSink;
  /* 0x0020 */ unsigned long m_dwConnID;
}; /* size: 0x0024 */

class CStaticWrapper
{
}; /* size: 0x0004 */

class CStaticWriteLock
{
  /* 0x0000 */ class CRWLock& _rwLock;
}; /* size: 0x0004 */

class CStdClassFactory
{
  /* 0x0004 */ unsigned long _cRefs;
  /* 0x0008 */ unsigned long _dwIndex;
}; /* size: 0x000c */

class CStdEvent
{
  /* 0x0008 */ class CSTInnerUnknown _cInner;
  /* 0x0014 */ struct IUnknown* _pControl;
  /* 0x0018 */ void* m_hEvent;
}; /* size: 0x001c */

class CStdIdentity
{
  /* 0x00a0 */ class CStdIdentity::CInternalUnk m_InternalUnk;
  /* 0x00a8 */ unsigned long m_refs;
  /* 0x00ac */ unsigned long m_flags;
  /* 0x00b0 */ struct IUnknown* m_pUnkOuter;
  /* 0x00b4 */ struct IUnknown* m_pUnkControl;
  /* 0x00b8 */ void* m_pVtableAddress;
  /* 0x00bc */ struct IExternalConnection* m_pIEC;
  /* 0x00c0 */ struct _GUID m_moid;
  /* 0x00d0 */ unsigned long m_dwAptId;
  /* 0x00d4 */ long m_cStrongRefs;
  /* 0x00d8 */ long m_cWeakRefs;
  /* 0x00dc */ HRESULT m_ConnStatus;
  /* 0x00e0 */ void* m_pVoid;
}; /* size: 0x00e4 */

class CStdIdentity::CInternalUnk
{
}; /* size: 0x0008 */

class CStdMarshal
{
  /* 0x0004 */ unsigned long _dwFlags;
  /* 0x0008 */ long _cIPIDs;
  /* 0x000c */ struct tagIPIDEntry* _pFirstIPID;
  /* 0x0010 */ class CStdIdentity* _pStdId;
  /* 0x0014 */ class CCtxComChnl* _pChnl;
  /* 0x0018 */ struct _GUID _clsidHandler;
  /* 0x0028 */ long _cNestedCalls;
  /* 0x002c */ long _cTableRefs;
  /* 0x0030 */ unsigned long _dwMarshalTime;
  /* 0x0034 */ struct IRemUnknown* _pSecureRemUnk;
  /* 0x0038 */ struct IUnknown* _pAsyncRelease;
  /* 0x003c */ class CtxEntry* _pCtxEntryHead;
  /* 0x0040 */ class CtxEntry* _pCtxFreeList;
  /* 0x0044 */ struct _RTL_CRITICAL_SECTION _csCtxEntry;
  /* 0x005c */ int _fCsInitialized;
  /* 0x0060 */ class CPolicySet* _pPS;
  /* 0x0064 */ class CIDObject* _pID;
  /* 0x0068 */ class CRefCache* _pRefCache;
  /* 0x006c */ struct CStdMarshal::DiscSinkNode _discHead;
  /* 0x007c */ unsigned long _dwLastCallTime;
}; /* size: 0x0080 */

struct CStdMarshal::Deactivate::__l3::tagServerRefs
{
  /* 0x0000 */ struct IRpcStubBuffer* pRpcStub;
  /* 0x0004 */ void* pServer;
}; /* size: 0x0008 */

struct CStdMarshal::DiscSinkNode
{
  /* 0x0000 */ struct CStdMarshal::DiscSinkNode* pNext;
  /* 0x0004 */ struct CStdMarshal::DiscSinkNode* pPrev;
  /* 0x0008 */ struct IDisconnectSink* pSink;
  /* 0x000c */ void* pvCookie;
}; /* size: 0x0010 */

struct CStdMarshal::DisconnectCliIPIDs::__l6::_IPIDReleaseSet
{
  /* 0x0000 */ unsigned short cRifRef;
  /* 0x0004 */ struct tagREMINTERFACEREF* pRifRef;
}; /* size: 0x0008 */

struct CStdMarshal::Reactivate::__l3::tagServerRefs;

class CStdWrapper
{
  /* 0x0004 */ unsigned long _dwState;
  /* 0x0008 */ unsigned long _cRefs;
  /* 0x000c */ unsigned long _cCalls;
  /* 0x0010 */ unsigned long _cIFaces;
  /* 0x0014 */ class IFaceEntry* _pIFaceHead;
  /* 0x0018 */ class CtxEntry* _pCtxEntryHead;
  /* 0x001c */ class CtxEntry* _pCtxFreeList;
  /* 0x0020 */ struct IUnknown* _pServer;
  /* 0x0024 */ class CIDObject* _pID;
  /* 0x0028 */ void* _pVtableAddress;
  union
  {
    /* 0x0000 */ class CPageAllocator s_allocator;
    /* 0x0000 */ unsigned long s_cObjects;
    /* 0x0000 */ int s_fInitialized;
  }; /* size: 0x0040 */
}; /* size: 0x002c */

struct CStdWrapper::Deactivate::__l3::tagServerRefs
{
  /* 0x0000 */ struct IRpcStubBuffer* pRpcStub;
  /* 0x0004 */ void* pServer;
}; /* size: 0x0008 */

struct CStdWrapper::Reactivate::__l3::tagServerRefs;

class CStgHandle
{
}; /* size: 0x0008 */

class CStmBuf
{
  /* 0x0000 */ struct IStream* m_pStm;
  /* 0x0004 */ unsigned char m_aBuffer[256];
  /* 0x0104 */ unsigned char* m_pBuffer;
  /* 0x0108 */ unsigned long m_cBuffer;
}; /* size: 0x010c */

class CStmBufRead
{
}; /* size: 0x010c */

class CStmBufWrite
{
}; /* size: 0x010c */

class CStmHandle
{
}; /* size: 0x0008 */

class CStreamCache
{
  /* 0x0000 */ struct SCacheEntry _ase[9];
  /* 0x006c */ class CBasedDirectStreamPtr _pds;
  /* 0x0070 */ class CBasedMStreamPtr _pmsParent;
  /* 0x0074 */ unsigned long _sid;
  /* 0x0078 */ unsigned short _uHighCacheIndex;
  /* 0x007a */ unsigned short _uNextCacheIndex;
  /* 0x007c */ unsigned short _uCacheState;
}; /* size: 0x0080 */

struct CStreamChunk
{
  /* 0x0000 */ unsigned long oOld;
  /* 0x0004 */ long cbChange;
}; /* size: 0x0008 */

class CStreamChunkList
{
  /* 0x0000 */ unsigned long _cMaxChunks;
  /* 0x0004 */ unsigned long _cChunks;
  /* 0x0008 */ struct CStreamChunk* _ascnk;
  /* 0x000c */ unsigned char _fDelete;
}; /* size: 0x0010 */

class CStreamOnMessage
{
  /* 0x0004 */ unsigned char* _pStartOfStream;
  /* 0x0008 */ unsigned char** _ppBuffer;
  /* 0x000c */ unsigned long _cbMaxStreamLength;
  /* 0x0010 */ unsigned long _ref_count;
}; /* size: 0x0014 */

class CStringHashTable
{
}; /* size: 0x0018 */

class CSurrogateActivator
{
  /* 0x0004 */ struct _GUID m_processGuid;
  /* 0x0014 */ int m_fServicesConfigured;
  /* 0x0018 */ unsigned long m_dwObjectCountAtIdleTime;
  /* 0x0000 */ class CSurrogateActivator* s_pCSA;
}; /* size: 0x001c */

class CSurrogateProcessActivator
{
  /* 0x0028 */ long m_lRC;
  /* 0x002c */ void* m_hInitThread;
  /* 0x0030 */ void* m_hStopPingingSCM;
  union
  {
    struct
    {
      /* 0x0000 */ const int PING_INTERVAL;
      /* 0x0034 */ struct IComProcessInfo* m_pIComProcessInfo;
      /* 0x0038 */ struct IProcessServerInfo* m_pIProcessServerInfo;
      /* 0x003c */ class CStdIdentity* m_pStdID;
      /* 0x0040 */ struct ISurrogate* m_pISurrogate;
      /* 0x0044 */ struct HINSTANCE__* m_hCOMSVCS;
      /* 0x0048 */ struct IServicesSink* m_pServices;
      /* 0x004c */ void* m_hInitCompleted;
      /* 0x0050 */ void* m_hFusionContext;
      /* 0x0054 */ unsigned long m_ulServicesPing;
      /* 0x0058 */ unsigned long m_ulInitTimeout;
    }; /* size: 0x002c */
    struct
    {
      /* 0x0000 */ const int TIMEOUT_SERVICES;
      /* 0x005c */ long m_lProcessRefCount;
      /* 0x0060 */ struct _RTL_CRITICAL_SECTION m_timeoutLock;
      /* 0x0078 */ int m_bLockValid;
      /* 0x007c */ void* m_hTimeoutEvent;
      /* 0x0080 */ enum _TAG_UNNAMED_27 m_timeoutState;
      /* 0x0084 */ unsigned long m_cActivations;
      /* 0x0088 */ unsigned long m_cMillisecondsTilDeath;
      /* 0x008c */ unsigned long m_cTimeoutPeriod;
      /* 0x0090 */ int m_bPaused;
    }; /* size: 0x003c */
    struct
    {
      /* 0x0000 */ const int TIMEOUT_SPINLOCK;
      /* 0x0094 */ int m_bInitNotified;
    }; /* size: 0x0008 */
    /* 0x0000 */ const int MAX_SRV_NAME_LEN;
  }; /* size: 0x003c */
  /* 0x0098 */ void* m_hNTServiceThread;
  /* 0x009c */ void* m_hServiceStarted;
  /* 0x00a0 */ struct SERVICE_STATUS_HANDLE__* m_hNTServiceHandle;
  /* 0x00a4 */ struct _SERVICE_STATUS m_NTServiceStatus;
  /* 0x00c0 */ struct _RTL_CRITICAL_SECTION m_serviceStatusLock;
  /* 0x00d8 */ int m_fServiceStatusLockValid;
  /* 0x00dc */ wchar_t m_NTServiceName[256];
}; /* size: 0x02dc */

typedef enum _TAG_UNNAMED_27
{
  TIMEOUT_INACTIVE = 0,
  TIMEOUT_PENDING = 1,
  TIMEOUT_SUSPENDED = 2,
  TIMEOUT_HAPPENING = 3,
  TIMEOUT_FORCED_SHUTDOWN = 4,
} TAG_UNNAMED_27, *PTAG_UNNAMED_27;

class CSurrogatedObjectList
{
  /* 0x0000 */ struct IOleInPlaceActiveObject* _pInplaceObject;
  /* 0x0004 */ struct HWND__* _hWnd;
  /* 0x0008 */ class CSurrogatedObjectList* _pNext;
}; /* size: 0x000c */

class CSynchronizeContainer
{
  /* 0x0004 */ class CSCInnerUnknown _cInner;
  /* 0x0010 */ struct IUnknown* _pControl;
  /* 0x0014 */ unsigned long _lLast;
  /* 0x0018 */ void* _aEvent[63];
  /* 0x0114 */ struct ISynchronize* _aSync[63];
}; /* size: 0x0210 */

class CSystemException
{
  /* 0x0008 */ unsigned long _ulExcept;
}; /* size: 0x000c */

class CTSSet
{
  /* 0x0000 */ class CBasedTSetMemberPtr _ptsmHead;
}; /* size: 0x0004 */

class CThreadCheck
{
  /* 0x0000 */ unsigned long m_tid;
}; /* size: 0x0004 */

class CThreadStack
{
  /* 0x0000 */ unsigned long m_dwCurrentPageSize;
  /* 0x0004 */ unsigned int m_CurrentProcessDefaultStackCommit;
}; /* size: 0x0008 */

class CTmpMkEqBuf
{
  /* 0x0000 */ struct _MnkEqBuf _mkeqbuf;
  /* 0x0008 */ unsigned char _abData[2047];
}; /* size: 0x0808 */

class CTrackingCompositeMoniker
{
  /* 0x0004 */ class CCompositeMoniker* _pCCM;
}; /* size: 0x0008 */

class CTrackingFileMoniker
{
  /* 0x0004 */ class CFileMoniker* _pCFM;
}; /* size: 0x0008 */

class CTransactedStream
{
  /* 0x0068 */ unsigned __int64 _ulSize;
  /* 0x0070 */ class CBasedSStreamPtr _pssBase;
  /* 0x0074 */ unsigned long _sectLastUsed;
  /* 0x0078 */ class CDeltaList _dl;
  /* 0x0090 */ unsigned long _df;
  /* 0x0094 */ int _fBeginCommit;
  /* 0x0098 */ class CBasedDeltaListPtr _pdlOld;
  /* 0x00a0 */ unsigned __int64 _ulOldSize;
}; /* size: 0x00a8 */

class CTransactedTimeEntry
{
  /* 0x0000 */ struct _FILETIME _tt[3];
}; /* size: 0x0018 */

class CTry
{
  /* 0x0000 */ class CTry* _pPrevTry;
  /* 0x0004 */ int _StackTop;
}; /* size: 0x0008 */

class CUUIDHashTable
{
}; /* size: 0x0018 */

class CUnwindable
{
}; /* size: 0x0001 */

class CUpdate
{
  /* 0x0000 */ class CDfName _dfnCurrent;
  /* 0x0042 */ class CDfName _dfnOriginal;
  /* 0x0084 */ unsigned long _dl;
  /* 0x0088 */ unsigned long _dwFlags;
  /* 0x008c */ class CBasedTSetMemberPtr _ptsm;
  /* 0x0090 */ class CBasedUpdatePtr _pudNext;
  /* 0x0094 */ class CBasedUpdatePtr _pudPrev;
}; /* size: 0x0098 */

class CUpdateList
{
  /* 0x0000 */ class CBasedUpdatePtr _pudHead;
  /* 0x0004 */ class CBasedUpdatePtr _pudTail;
}; /* size: 0x0008 */

class CUrlMonWrapper
{
  /* 0x0004 */ long _cRef;
}; /* size: 0x0008 */

class CUserMarshalInfo
{
  /* 0x0000 */ long _RpcStatus;
  /* 0x0004 */ unsigned char* _pSuppliedBuffer;
  /* 0x0008 */ struct _NDR_USER_MARSHAL_INFO _MarshalInfo;
}; /* size: 0x0034 */

struct CVectBits
{
  /* 0x0000 */ unsigned short full : 1; /* bit position: 0 */
  /* 0x0002 */ unsigned short firstfree;
}; /* size: 0x0004 */

class CVerifierStackData
{
  /* 0x0000 */ struct _LIST_ENTRY m_listHead;
  /* 0x0008 */ unsigned long m_dwCount;
}; /* size: 0x000c */

struct CVerifierStackData::tagNode
{
  /* 0x0000 */ void** lpvStack;
  /* 0x0004 */ struct _LIST_ENTRY listEntry;
}; /* size: 0x000c */

class CVerifierTlsData
{
  /* 0x0000 */ class CVerifierStackData stackComInit;
  /* 0x000c */ class CVerifierStackData stackComUninit;
  /* 0x0018 */ class CVerifierStackData stackOLEInit;
  /* 0x0024 */ class CVerifierStackData stackOLEUninit;
  /* 0x0030 */ class CVerifierStackData stackEnterSWC;
  /* 0x003c */ class CVerifierStackData stackLeaveSWC;
}; /* size: 0x0048 */

class CVirtualUnwindable
{
}; /* size: 0x0004 */

class CWorldSecurityDescriptor
{
  /* 0x0000 */ struct _SECURITY_DESCRIPTOR _sd;
  /* 0x0014 */ unsigned long _acl[16];
}; /* size: 0x0054 */

class CWrappedDocFile
{
  /* 0x0064 */ unsigned long _df;
  /* 0x0068 */ class CBasedDocFilePtr _pdfBase;
  /* 0x006c */ class CUpdateList _ulChanged;
  /* 0x0074 */ class CUpdateList _ulChangedHolder;
  /* 0x007c */ class CUpdateList _ulChangedOld;
  /* 0x0084 */ class CTSSet _tssDeletedHolder;
  /* 0x0088 */ class CTransactedTimeEntry _tten;
  /* 0x00a0 */ class CBasedPubDocFilePtr _ppubdf;
  /* 0x00a4 */ struct _GUID _clsid;
  /* 0x00b4 */ unsigned long _grfStateBits;
  /* 0x00b8 */ const class CBasedDFBasisPtr _pdfb;
  /* 0x00bc */ unsigned short _fDirty;
  /* 0x00be */ unsigned char _fBeginCommit;
}; /* size: 0x00c0 */

class CallFrame
{
  /* 0x000c */ struct MD_METHOD* m_pmd;
  /* 0x0010 */ void* m_pvArgs;
  /* 0x0014 */ int m_fIsCopy;
  /* 0x0018 */ int m_fIsUnmarshal;
  /* 0x001c */ int m_hrReturnValue;
  /* 0x0020 */ void* m_pvMemCur;
  /* 0x0024 */ void* m_pvArgsSrc;
  /* 0x0028 */ class Interceptor* m_pInterceptor;
  /* 0x002c */ int m_fPropogatingOutParam;
  /* 0x0030 */ int m_fWorkingOnInParam;
  /* 0x0034 */ int m_fWorkingOnOutParam;
  /* 0x0038 */ class CallFrame* m_pAllocatorFrame;
  /* 0x003c */ struct ICallFrameWalker* m_pWalkerCopy;
  /* 0x0040 */ struct ICallFrameWalker* m_pWalkerFree;
  /* 0x0044 */ struct ICallFrameWalker* m_pWalkerWalk;
  /* 0x0048 */ unsigned char* m_StackTop;
  /* 0x004c */ unsigned char* m_Memory;
  /* 0x0050 */ unsigned long m_MaxCount;
  /* 0x0054 */ unsigned long m_Offset;
  /* 0x0058 */ unsigned long m_ActualCount;
  /* 0x005c */ struct ARRAY_INFO* m_pArrayInfo;
  /* 0x0060 */ long m_refs;
  /* 0x0064 */ unsigned char m_pvMem[256];
  /* 0x0164 */ int m_fCanUseBuffer;
  /* 0x0168 */ struct tagBLOB m_blobBuffer;
  /* 0x0170 */ int m_fWeOwnBlobBuffer;
}; /* size: 0x0174 */

typedef enum _TAG_UNNAMED_28
{
  CB_PRIVATE_BUFFER = 256,
} TAG_UNNAMED_28, *PTAG_UNNAMED_28;

class CarefulBufferReader
{
  /* 0x0000 */ unsigned char* pBuffer;
  /* 0x0004 */ unsigned int cbBuffer;
}; /* size: 0x0008 */

struct ClassMonikerData
{
  /* 0x0000 */ struct _GUID clsid;
  /* 0x0010 */ unsigned long cbExtra;
}; /* size: 0x0014 */

class ClassRegistration
{
  /* 0x0000 */ struct _GUID clsid;
  /* 0x0010 */ unsigned long serverType;
  /* 0x0014 */ struct HINSTANCE__* hModule;
  /* 0x0018 */ const wchar_t* className;
  /* 0x001c */ const wchar_t* progID;
  /* 0x0020 */ const wchar_t* versionIndependentProgID;
  /* 0x0024 */ const wchar_t* threadingModel;
  /* 0x0028 */ struct _GUID appid;
  /* 0x0038 */ struct _GUID moduleid;
  /* 0x0048 */ int fCreateService;
}; /* size: 0x004c */

enum ClassRegistration::SERVER_TYPE
{
  INPROC_SERVER = 1,
  LOCAL_SERVER = 4,
  INPROC_HANDLER = 2,
  SERVER_TYPE_NONE = 0,
};

struct CleanupStack
{
  /* 0x0000 */ struct CleanupStack::Block m_first;
  /* 0x00ac */ struct CleanupStack::Block* m_last;
}; /* size: 0x00b0 */

struct CleanupStack::Block
{
  /* 0x0000 */ struct CleanupStack::memory_to_free mem[20];
  /* 0x00a0 */ unsigned long count;
  /* 0x00a4 */ struct CleanupStack::Block* prev;
  /* 0x00a8 */ struct CleanupStack::Block* next;
}; /* size: 0x00ac */

struct CleanupStack::memory_to_free
{
  /* 0x0000 */ void* pvMemory;
  /* 0x0004 */ class PMemoryAllocator* pAllocator;
}; /* size: 0x0008 */

class CoAllocator
{
}; /* size: 0x0004 */

class ComPsClassFactory
{
  /* 0x0008 */ long m_crefs;
  /* 0x000c */ struct IPSFactoryBuffer* m_pDelegatee;
  /* 0x0010 */ const struct tagProxyFileInfo** m_pProxyFileList;
}; /* size: 0x0014 */

class ComVerifierSettings
{
  union
  {
    /* 0x0000 */ int s_fComVerifierEnabled;
    /* 0x0000 */ int s_fEnableDllMainChecks;
    /* 0x0000 */ int s_fEnableBreakOnException;
    /* 0x0000 */ int s_fEnableVerifyLocks;
    /* 0x0000 */ int s_fEnableVerifyThreadState;
    /* 0x0000 */ int s_fEnableVerifySecurity;
    /* 0x0000 */ int s_fEnableVerifyProxies;
    /* 0x0000 */ int s_fEnableVerifyClassFactory;
    /* 0x0000 */ int s_fEnableObjectTracking;
    /* 0x0000 */ int s_fEnableVTBLTracking;
    /* 0x0000 */ int s_fUseSlowStackTraces;
    /* 0x0000 */ int s_fPgAllocUseSystemHeap;
    /* 0x0000 */ int s_fPgAllocHeapIsPrivate;
    /* 0x0000 */ struct IStackWalker* s_pStackWalker;
    /* 0x0000 */ class ComVerifierSettings s_singleton;
  }; /* size: 0x0004 */
}; /* size: 0x0001 */

struct CompObjHdr
{
  /* 0x0000 */ unsigned long m_dwFirstDword;
  /* 0x0004 */ unsigned long m_dwOSVer;
  /* 0x0008 */ unsigned long m_unused;
  /* 0x000c */ struct _GUID m_clsClass;
}; /* size: 0x001c */

class CompObjStmData
{
  /* 0x0000 */ struct CompObjHdr m_hdr;
  /* 0x001c */ unsigned long m_cchUserType;
  /* 0x0020 */ unsigned long m_cchProgID;
  /* 0x0024 */ unsigned long m_dwFormatTag;
  /* 0x0028 */ unsigned long m_ulFormatID;
  /* 0x002c */ wchar_t* m_pszOUserType;
  /* 0x0030 */ wchar_t* m_pszOProgID;
  /* 0x0034 */ char* m_pszAUserType;
  /* 0x0038 */ char* m_pszAProgID;
  /* 0x003c */ enum TXTTYPE ttClipString;
}; /* size: 0x0040 */

class ContextInfo
{
  /* 0x0018 */ struct tagActivationContextInfoData _contextInfoData;
  /* 0x0030 */ struct _GUID _ctxOverride;
  /* 0x0040 */ class CObjectContext* _pClientCtx;
  /* 0x0044 */ class CObjectContext* _pPrototypeCtx;
  /* 0x0048 */ int _toReleaseIFD;
}; /* size: 0x004c */

class CpUnkList
{
  /* 0x0000 */ struct pUnkListElement* _head;
  /* 0x0004 */ class CMutexSem2 _mutex;
}; /* size: 0x0020 */

enum CreateStackTraceFlags
{
  CREATESTACKTRACE_ONLYADDRESSES = 1,
};

class CsCatInfo
{
  /* 0x0004 */ unsigned long m_uRefs;
  /* 0x0008 */ unsigned long m_cCalls;
  /* 0x000c */ struct ICatInformation** m_pICatInfo;
  /* 0x0010 */ unsigned long m_cICatInfo;
  /* 0x0014 */ struct HINSTANCE__* m_hInstCstore;
}; /* size: 0x0018 */

class CtxEntry
{
  union
  {
    struct
    {
      /* 0x0000 */ class CtxEntry* _pNext;
      /* 0x0004 */ class CtxEntry* _pFree;
      /* 0x0008 */ unsigned long _cRefs;
      /* 0x000c */ class CContextLife* _pLife;
      /* 0x0010 */ class CPolicySet* _pPS;
      /* 0x0014 */ class CObjectContext* _pServerCtx;
    }; /* size: 0x0018 */
    /* 0x0000 */ class CPageAllocator s_allocator;
    /* 0x0000 */ class COleStaticMutexSem s_allocLock;
    /* 0x0000 */ int s_fInitialized;
    /* 0x0000 */ unsigned long s_cEntries;
  }; /* size: 0x0040 */
}; /* size: 0x0018 */

enum DCOM_ENDPOINT_FLAGS
{
  fUseInternetPorts = 1,
};

struct DDEADVISE
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned short reserved : 14; /* bit position: 0 */
    /* 0x0000 */ unsigned short fDeferUpd : 1; /* bit position: 14 */
    /* 0x0000 */ unsigned short fAckReq : 1; /* bit position: 15 */
  }; /* bitfield */
  /* 0x0002 */ short cfFormat;
}; /* size: 0x0004 */

struct DDEDATA
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned short unused : 12; /* bit position: 0 */
    /* 0x0000 */ unsigned short fResponse : 1; /* bit position: 12 */
    /* 0x0000 */ unsigned short fRelease : 1; /* bit position: 13 */
    /* 0x0000 */ unsigned short reserved : 1; /* bit position: 14 */
    /* 0x0000 */ unsigned short fAckReq : 1; /* bit position: 15 */
  }; /* bitfield */
  /* 0x0002 */ short cfFormat;
  /* 0x0004 */ unsigned char Value[1];
  /* 0x0005 */ char __PADDING__[1];
}; /* size: 0x0006 */

struct DDEPOKE
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned short unused : 13; /* bit position: 0 */
    /* 0x0000 */ unsigned short fRelease : 1; /* bit position: 13 */
    /* 0x0000 */ unsigned short fReserved : 2; /* bit position: 14 */
  }; /* bitfield */
  /* 0x0002 */ short cfFormat;
  /* 0x0004 */ unsigned char Value[1];
  /* 0x0005 */ char __PADDING__[1];
}; /* size: 0x0006 */

class DDE_CHANNEL
{
  /* 0x0008 */ unsigned long m_cRefs;
  /* 0x000c */ struct HWND__* hwndCli;
  /* 0x0010 */ struct HWND__* hwndSvr;
  /* 0x0014 */ int bTerminating;
  /* 0x0018 */ int iExtraTerms;
  /* 0x001c */ unsigned short wTimer;
  /* 0x0020 */ unsigned long dwStartTickCount;
  /* 0x0024 */ unsigned short msgFirst;
  /* 0x0026 */ unsigned short msgLast;
  /* 0x0028 */ struct HWND__* msghwnd;
  /* 0x002c */ int fRejected;
  /* 0x0030 */ unsigned short wMsg;
  /* 0x0034 */ long lParam;
  /* 0x0038 */ int iAwaitAck;
  /* 0x003c */ HRESULT hres;
  /* 0x0040 */ void* hopt;
  /* 0x0044 */ void* hDdePoke;
  /* 0x0048 */ void* hCommands;
  /* 0x004c */ unsigned short wChannelDeleted;
  /* 0x0050 */ struct tagDDECALLDATA* pCD;
  /* 0x0054 */ enum tagSERVERCALLEX CallState;
  /* 0x0058 */ int bFreedhopt;
}; /* size: 0x005c */

enum DDE_DISPATCH_FUNC
{
  DDE_DISP_SENDONDATACHANGE = 1,
  DDE_DISP_OLECALLBACK = 2,
  DDE_DISP_SRVRWNDPROC = 3,
  DDE_DISP_DOCWNDPROC = 4,
};

enum DECOLOR
{
  DE_RED = 0,
  DE_BLACK = 1,
};

struct DELETE_USN_JOURNAL_DATA
{
  /* 0x0000 */ unsigned __int64 UsnJournalID;
  /* 0x0008 */ unsigned long DeleteFlags;
  /* 0x000c */ long __PADDING__[1];
}; /* size: 0x0010 */

enum DIRENTRYOP
{
  DEOP_FIND = 0,
  DEOP_REMOVE = 1,
};

struct DISABLED_FEATURES
{
  /* 0x0000 */ int fDisableAll;
  /* 0x0004 */ int fDisableTypelibs;
  /* 0x0008 */ int fDisableDispatch;
  /* 0x000c */ int fDisableAllForOle32;
  /* 0x0010 */ int fDisableDispatchForOle32;
}; /* size: 0x0014 */

struct DISPATCH_CLIENT_FRAME
{
  /* 0x0030 */ int m_fDoneProxyPrecheck;
  /* 0x0034 */ int m_fIsCopy;
  /* 0x0038 */ struct FRAME_RemoteInvoke m_remoteFrame;
  /* 0x0068 */ struct tagDISPPARAMS m_dispParams;
  /* 0x0078 */ struct tagVARIANT m_varResult;
  /* 0x0088 */ struct tagEXCEPINFO m_excepInfo;
  /* 0x00a8 */ unsigned int m_uArgErr;
  /* 0x00ac */ unsigned int m_aVarRefIdx[16];
  /* 0x00f0 */ struct tagVARIANT m_aVarRef[16];
  /* 0x01f0 */ struct tagVARIANT m_aVarArg[16];
  /* 0x02f0 */ unsigned char* m_pBuffer;
  /* 0x02f4 */ long __PADDING__[1];
}; /* size: 0x02f8 */

struct DISPATCH_FRAME
{
}; /* size: 0x002c */

struct DISPATCH_INTERCEPTOR
{
}; /* size: 0x0078 */

struct DISPATCH_SERVER_FRAME
{
  /* 0x0030 */ struct FRAME_Invoke m_memoryFrame;
  /* 0x0054 */ int m_fDoneStubPrecheck;
  /* 0x0058 */ int m_fDoneStubPostcheck;
}; /* size: 0x005c */

struct DLGITEMTEMPLATE
{
  /* 0x0000 */ unsigned long style;
  /* 0x0004 */ unsigned long dwExtendedStyle;
  /* 0x0008 */ short x;
  /* 0x000a */ short y;
  /* 0x000c */ short cx;
  /* 0x000e */ short cy;
  /* 0x0010 */ unsigned short id;
}; /* size: 0x0012 */

struct DLGTEMPLATE
{
  /* 0x0000 */ unsigned long style;
  /* 0x0004 */ unsigned long dwExtendedStyle;
  /* 0x0008 */ unsigned short cdit;
  /* 0x000a */ short x;
  /* 0x000c */ short y;
  /* 0x000e */ short cx;
  /* 0x0010 */ short cy;
}; /* size: 0x0012 */

struct DLL_INSTANTIATION_PROPERTIES
{
  /* 0x0000 */ wchar_t _pzDllPath[261];
  /* 0x020c */ unsigned long _dwThreadingModel;
  /* 0x0210 */ unsigned long _dwFlags;
  /* 0x0214 */ unsigned long _dwHash;
  /* 0x0218 */ unsigned long _dwContext;
  /* 0x021c */ class CClassCache::CDllClassEntry* _pDCE;
}; /* size: 0x0220 */

enum DLL_INSTANTIATION_PROPERTIES::eFlags
{
  fSIXTEEN_BIT = 1,
  fIS_OLE32 = 8,
  fIS_COMSVCS_CLSID = 16,
};

struct DVTDINFO
{
  /* 0x0000 */ unsigned int cbConvertSize;
  /* 0x0004 */ unsigned int cchDrvName;
  /* 0x0008 */ unsigned int cchDevName;
  /* 0x000c */ unsigned int cchPortName;
}; /* size: 0x0010 */

struct DedicatedAllocator<CallFrame>
{
  union
  {
    /* 0x0000 */ class CallFrame* pNext;
    /* 0x0000 */ struct IFastStack<CallFrame>* g_pStack;
  }; /* size: 0x0004 */
}; /* size: 0x0004 */

struct DedicatedAllocator<DISPATCH_CLIENT_FRAME>
{
  union
  {
    /* 0x0000 */ struct DISPATCH_CLIENT_FRAME* pNext;
    /* 0x0000 */ struct IFastStack<DISPATCH_CLIENT_FRAME>* g_pStack;
  }; /* size: 0x0004 */
}; /* size: 0x0004 */

struct DedicatedAllocator<DISPATCH_SERVER_FRAME>
{
  union
  {
    /* 0x0000 */ struct DISPATCH_SERVER_FRAME* pNext;
    /* 0x0000 */ struct IFastStack<DISPATCH_SERVER_FRAME>* g_pStack;
  }; /* size: 0x0004 */
}; /* size: 0x0004 */

class DefaultIBindStatusCallback
{
  /* 0x0010 */ struct IBindStatusCallback* m_pibsc;
  /* 0x0014 */ long m_lRef;
  /* 0x0018 */ struct IBinding* m_pBinding;
  /* 0x001c */ struct HWND__* m_hwndParent;
  /* 0x0020 */ struct HWND__* m_hDlg;
  /* 0x0024 */ unsigned long m_ulProgress;
  /* 0x0028 */ unsigned long m_ulProgressMax;
  /* 0x002c */ wchar_t m_szStatusText[260];
  /* 0x0234 */ int m_fShown;
}; /* size: 0x0238 */

struct DelayLoadInfo
{
  /* 0x0000 */ unsigned long cb;
  /* 0x0004 */ const struct ImgDelayDescrV2* pidd;
  /* 0x0008 */ void** ppfn /* function */;
  /* 0x000c */ const char* szDll;
  /* 0x0010 */ struct DelayLoadProc dlp;
  /* 0x0018 */ struct HINSTANCE__* hmodCur;
  /* 0x001c */ void* pfnCur /* function */;
  /* 0x0020 */ unsigned long dwLastError;
}; /* size: 0x0024 */

struct DelayLoadProc
{
  /* 0x0000 */ int fImportByName;
  union
  {
    /* 0x0004 */ const char* szProcName;
    /* 0x0004 */ unsigned long dwOrdinal;
  }; /* size: 0x0004 */
}; /* size: 0x0008 */

class DeserializeHelper
{
  union
  {
    struct
    {
      /* 0x0000 */ class PMemoryAllocator* c_pMA;
      /* 0x0004 */ unsigned int m_Flags;
      /* 0x0008 */ unsigned long c_cbAlloc;
      /* 0x000c */ struct CleanupStack c_cleanupStack;
      /* 0x00bc */ int m_fIndirect;
      /* 0x00c0 */ unsigned int m_CodePage;
      union
      {
        /* 0x00c8 */ struct tagPROPVARIANT m_pvDummy;
        /* 0x00c8 */ struct tagCLIPDATA m_clipdataDummy;
      }; /* size: 0x0010 */
    }; /* size: 0x00d4 */
    /* 0x0000 */ class DeserializeHelper::SafeArrayDestroyer c_saDestroyer;
    /* 0x0000 */ class DeserializeHelper::BstrDestroyer c_bstrDestroyer;
  }; /* size: 0x00d4 */
}; /* size: 0x00d8 */

class DeserializeHelper::BstrDestroyer
{
}; /* size: 0x0004 */

class DeserializeHelper::SafeArrayDestroyer
{
}; /* size: 0x0004 */

enum EChannelState
{
  client_cs = 1,
  proxy_cs = 2,
  server_cs = 4,
  freethreaded_cs = 8,
  process_local_cs = 32,
  locked_cs = 64,
  neutral_cs = 256,
  fake_async_cs = 512,
  app_security_cs = 1024,
  thread_local_cs = 2048,
};

struct EFFICIENTOSVERSIONINFOEXW
{
  /* 0x0000 */ unsigned long dwOSVersionInfoSize;
  /* 0x0004 */ unsigned long dwMajorVersion;
  /* 0x0008 */ unsigned long dwMinorVersion;
  /* 0x000c */ unsigned long dwBuildNumber;
  /* 0x0010 */ unsigned long dwPlatformId;
  /* 0x0014 */ unsigned short wServicePackMajor;
  /* 0x0016 */ unsigned short wServicePackMinor;
  /* 0x0018 */ unsigned short wSuiteMask;
  /* 0x001a */ unsigned char wProductType;
  /* 0x001b */ unsigned char wReserved;
  /* 0x001c */ wchar_t szCSDVersion[128];
}; /* size: 0x011c */

enum EHandleState
{
  allow_hs = 1,
  deny_hs = 2,
  static_cloaking_hs = 4,
  dynamic_cloaking_hs = 8,
  any_cloaking_hs = 12,
  process_local_hs = 16,
  machine_local_hs = 32,
  app_security_hs = 64,
};

struct ENTRY
{
  /* 0x0000 */ const wchar_t* sz;
  /* 0x0004 */ const struct _GUID* pclsid;
}; /* size: 0x0008 */

enum EServerSecurity
{
  SS_PROCESS_LOCAL = 1,
  SS_CALL_DONE = 2,
  SS_WAS_IMPERSONATING = 4,
};

enum ESignalState
{
  none_ss = 0,
  pending_ss = 1,
  signaled_ss = 2,
  failed_ss = 3,
};

class EVENT
{
  /* 0x0000 */ void* m_hEvent;
}; /* size: 0x0004 */

struct EXECUTEACK
{
  /* 0x0000 */ int f;
  /* 0x0004 */ void* hdata;
  /* 0x0008 */ struct HWND__* hwndFrom;
  /* 0x000c */ struct HWND__* hwndTo;
}; /* size: 0x0010 */

class Enum
{
}; /* size: 0x0004 */

class EnumMap<MAP_KEY_GUID,INTERFACE_HELPER_CLSID *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>
{
  /* 0x0004 */ class Map<MAP_KEY_GUID,INTERFACE_HELPER_CLSID *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>* m_pmap;
  /* 0x0008 */ class CLinkable* m_pLinkable;
}; /* size: 0x000c */

class EnumMap<MAP_KEY_GUID,TYPEINFOVTBL *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>
{
  /* 0x0004 */ class Map<MAP_KEY_GUID,TYPEINFOVTBL *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>* m_pmap;
  /* 0x0008 */ class CLinkable* m_pLinkable;
}; /* size: 0x000c */

struct EnumVerbCache
{
  /* 0x0000 */ class CEnumVerb* pEnum;
}; /* size: 0x0004 */

struct ErrorObjectData
{
  /* 0x0000 */ unsigned long dwVersion;
  /* 0x0004 */ unsigned long dwHelpContext;
  /* 0x0008 */ struct _GUID iid;
}; /* size: 0x0018 */

class EventPoolEntry
{
  union
  {
    /* 0x0000 */ struct CRWLock::EventState _eventState;
    struct
    {
      /* 0x0000 */ volatile unsigned long _dwEventState;
      /* 0x0004 */ volatile int _bReaderSignaled;
      /* 0x0008 */ void* _hReaderEvent;
      /* 0x000c */ struct _SINGLE_LIST_ENTRY _listEntry;
      /* 0x0010 */ void* _hWriterEvent;
      /* 0x0014 */ volatile unsigned long _dwSpinningWriterID;
    }; /* size: 0x0018 */
    /* 0x0000 */ union _SLIST_HEADER s_eventPool;
    /* 0x0000 */ union EventPoolEntry::InitState s_initState;
  }; /* size: 0x0018 */
}; /* size: 0x0018 */

union EventPoolEntry::InitState
{
  union
  {
    /* 0x0000 */ volatile unsigned long _ulInitState;
    struct /* bitfield */
    {
      /* 0x0000 */ volatile unsigned long _ulNumInitedRWThreads : 14; /* bit position: 0 */
      /* 0x0000 */ volatile unsigned long _ulNumInitedRWLocks : 18; /* bit position: 14 */
    }; /* bitfield */
  }; /* size: 0x0004 */
}; /* size: 0x0004 */

enum EventPoolEntry::WaitForWriterEvent::__l2::AnyAbsorbtionState
{
  NONE = 0,
  ABSORBED = 1,
  RELEIVED = 2,
};

enum ExtentKeys
{
  mnk_MAC = 1,
  mnk_DFS = 2,
  mnk_UNICODE = 3,
  mnk_MacPathName = 4,
  mnk_ShellLink = 5,
  mnk_TrackingInformation = 6,
};

struct FILE_ID_DESCRIPTOR
{
  /* 0x0000 */ unsigned long dwSize;
  /* 0x0004 */ enum _FILE_ID_TYPE Type;
  union
  {
    /* 0x0008 */ union _LARGE_INTEGER FileId;
    /* 0x0008 */ struct _GUID ObjectId;
  }; /* size: 0x0010 */
}; /* size: 0x0018 */

struct FIND_BY_SID_DATA
{
  /* 0x0000 */ unsigned long Restart;
  /* 0x0004 */ struct _SID Sid;
}; /* size: 0x0010 */

struct FIND_BY_SID_OUTPUT
{
  /* 0x0000 */ unsigned long NextEntryOffset;
  /* 0x0004 */ unsigned long FileIndex;
  /* 0x0008 */ unsigned long FileNameLength;
  /* 0x000c */ wchar_t FileName[1];
  /* 0x000e */ char __PADDING__[2];
}; /* size: 0x0010 */

struct FLASHWINFO
{
  /* 0x0000 */ unsigned int cbSize;
  /* 0x0004 */ struct HWND__* hwnd;
  /* 0x0008 */ unsigned long dwFlags;
  /* 0x000c */ unsigned int uCount;
  /* 0x0010 */ unsigned long dwTimeout;
}; /* size: 0x0014 */

struct FMT
{
  /* 0x0000 */ unsigned short cf;
  /* 0x0004 */ unsigned long dw;
}; /* size: 0x0008 */

struct FMTCACHE
{
  /* 0x0000 */ struct tagFORMATETC fmt;
  /* 0x0014 */ unsigned long dwAspects;
  /* 0x0018 */ int fUseMe;
}; /* size: 0x001c */

struct FORMATETCDATA
{
  /* 0x0000 */ struct tagFORMATETC _FormatEtc;
  /* 0x0014 */ int fSaveOnFlush;
  /* 0x0018 */ unsigned long dwReserved1;
  /* 0x001c */ unsigned long dwReserved2;
}; /* size: 0x0020 */

struct FORMATETCDATA64
{
  /* 0x0000 */ struct tagFORMATETC64 _FormatEtc;
  /* 0x0020 */ int fSaveOnFlush;
  /* 0x0024 */ unsigned long dwReserved1;
  /* 0x0028 */ unsigned long dwReserved2;
  /* 0x002c */ long __PADDING__[1];
}; /* size: 0x0030 */

struct FORMATETCDATAARRAY
{
  /* 0x0000 */ unsigned long _dwSig;
  /* 0x0004 */ unsigned long _dwSize;
  /* 0x0008 */ unsigned long _cRefs;
  /* 0x000c */ unsigned long _cFormats;
  /* 0x0010 */ unsigned long _dwMiscArrayFlags;
  /* 0x0014 */ int _fIs64BitArray;
  /* 0x0018 */ struct FORMATETCDATA _FormatEtcData[1];
}; /* size: 0x0038 */

struct FORMATETCDATAARRAY64
{
  /* 0x0000 */ unsigned long _dwSig;
  /* 0x0004 */ unsigned long _dwSize;
  /* 0x0008 */ unsigned long _cRefs;
  /* 0x000c */ unsigned long _cFormats;
  /* 0x0010 */ unsigned long _dwMiscArrayFlags;
  /* 0x0014 */ int _fIs64BitArray;
  /* 0x0018 */ struct FORMATETCDATA64 _FormatEtcData[1];
}; /* size: 0x0048 */

enum FORMATTAG
{
  ftagNone = 0,
  ftagClipFormat = 1,
  ftagString = 2,
};

enum FORMAT_CHARACTER
{
  FC_ZERO = 0,
  FC_BYTE = 1,
  FC_CHAR = 2,
  FC_SMALL = 3,
  FC_USMALL = 4,
  FC_WCHAR = 5,
  FC_SHORT = 6,
  FC_USHORT = 7,
  FC_LONG = 8,
  FC_ULONG = 9,
  FC_FLOAT = 10,
  FC_HYPER = 11,
  FC_DOUBLE = 12,
  FC_ENUM16 = 13,
  FC_ENUM32 = 14,
  FC_IGNORE = 15,
  FC_ERROR_STATUS_T = 16,
  FC_RP = 17,
  FC_UP = 18,
  FC_OP = 19,
  FC_FP = 20,
  FC_STRUCT = 21,
  FC_PSTRUCT = 22,
  FC_CSTRUCT = 23,
  FC_CPSTRUCT = 24,
  FC_CVSTRUCT = 25,
  FC_BOGUS_STRUCT = 26,
  FC_CARRAY = 27,
  FC_CVARRAY = 28,
  FC_SMFARRAY = 29,
  FC_LGFARRAY = 30,
  FC_SMVARRAY = 31,
  FC_LGVARRAY = 32,
  FC_BOGUS_ARRAY = 33,
  FC_C_CSTRING = 34,
  FC_C_BSTRING = 35,
  FC_C_SSTRING = 36,
  FC_C_WSTRING = 37,
  FC_CSTRING = 38,
  FC_BSTRING = 39,
  FC_SSTRING = 40,
  FC_WSTRING = 41,
  FC_ENCAPSULATED_UNION = 42,
  FC_NON_ENCAPSULATED_UNION = 43,
  FC_BYTE_COUNT_POINTER = 44,
  FC_TRANSMIT_AS = 45,
  FC_REPRESENT_AS = 46,
  FC_IP = 47,
  FC_BIND_CONTEXT = 48,
  FC_BIND_GENERIC = 49,
  FC_BIND_PRIMITIVE = 50,
  FC_AUTO_HANDLE = 51,
  FC_CALLBACK_HANDLE = 52,
  FC_UNUSED1 = 53,
  FC_POINTER = 54,
  FC_ALIGNM2 = 55,
  FC_ALIGNM4 = 56,
  FC_ALIGNM8 = 57,
  FC_UNUSED2 = 58,
  FC_UNUSED3 = 59,
  FC_UNUSED4 = 60,
  FC_STRUCTPAD1 = 61,
  FC_STRUCTPAD2 = 62,
  FC_STRUCTPAD3 = 63,
  FC_STRUCTPAD4 = 64,
  FC_STRUCTPAD5 = 65,
  FC_STRUCTPAD6 = 66,
  FC_STRUCTPAD7 = 67,
  FC_STRING_SIZED = 68,
  FC_UNUSED5 = 69,
  FC_NO_REPEAT = 70,
  FC_FIXED_REPEAT = 71,
  FC_VARIABLE_REPEAT = 72,
  FC_FIXED_OFFSET = 73,
  FC_VARIABLE_OFFSET = 74,
  FC_PP = 75,
  FC_EMBEDDED_COMPLEX = 76,
  FC_IN_PARAM = 77,
  FC_IN_PARAM_BASETYPE = 78,
  FC_IN_PARAM_NO_FREE_INST = 79,
  FC_IN_OUT_PARAM = 80,
  FC_OUT_PARAM = 81,
  FC_RETURN_PARAM = 82,
  FC_RETURN_PARAM_BASETYPE = 83,
  FC_DEREFERENCE = 84,
  FC_DIV_2 = 85,
  FC_MULT_2 = 86,
  FC_ADD_1 = 87,
  FC_SUB_1 = 88,
  FC_CALLBACK = 89,
  FC_CONSTANT_IID = 90,
  FC_END = 91,
  FC_PAD = 92,
  FC_EXPR = 93,
  FC_PARTIAL_IGNORE_PARAM = 94,
  FC_SPLIT_DEREFERENCE = 116,
  FC_SPLIT_DIV_2 = 117,
  FC_SPLIT_MULT_2 = 118,
  FC_SPLIT_ADD_1 = 119,
  FC_SPLIT_SUB_1 = 120,
  FC_SPLIT_CALLBACK = 121,
  FC_FORCED_BOGUS_STRUCT = 177,
  FC_TRANSMIT_AS_PTR = 178,
  FC_REPRESENT_AS_PTR = 179,
  FC_USER_MARSHAL = 180,
  FC_PIPE = 181,
  FC_SUPPLEMENT = 182,
  FC_RANGE = 183,
  FC_INT3264 = 184,
  FC_UINT3264 = 185,
  FC_CSARRAY = 186,
  FC_CS_TAG = 187,
  FC_STRUCTPADN = 188,
  FC_UNUSED7 = 189,
  FC_UNUSED8 = 190,
  FC_UNUSED9 = 191,
  FC_UNUSED10 = 192,
  FC_BUFFER_ALIGN = 193,
  FC_INT128 = 194,
  FC_UINT128 = 195,
  FC_FLOAT80 = 196,
  FC_FLOAT128 = 197,
  FC_END_OF_UNIVERSE = 198,
};

struct FRAME_GetIDsOfNames
{
  /* 0x0000 */ struct IDispatch* This;
  /* 0x0004 */ const struct _GUID& riid;
  /* 0x0008 */ wchar_t** rgszNames;
  /* 0x000c */ unsigned int cNames;
  /* 0x0010 */ unsigned long lcid;
  /* 0x0014 */ long* rgDispId;
}; /* size: 0x0018 */

struct FRAME_GetTypeInfo
{
  /* 0x0000 */ struct IDispatch* This;
  /* 0x0004 */ unsigned int iTInfo;
  /* 0x0008 */ unsigned long lcid;
  /* 0x000c */ struct ITypeInfo** ppTInfo;
}; /* size: 0x0010 */

struct FRAME_GetTypeInfoCount
{
  /* 0x0000 */ struct IDispatch* This;
  /* 0x0004 */ unsigned int* pctinfo;
}; /* size: 0x0008 */

struct FRAME_Invoke
{
  /* 0x0000 */ struct IDispatch* This;
  /* 0x0004 */ long dispIdMember;
  /* 0x0008 */ struct _GUID* piid;
  /* 0x000c */ unsigned long lcid;
  /* 0x0010 */ unsigned short wFlags;
  /* 0x0014 */ struct tagDISPPARAMS* pDispParams;
  /* 0x0018 */ struct tagVARIANT* pVarResult;
  /* 0x001c */ struct tagEXCEPINFO* pExcepInfo;
  /* 0x0020 */ unsigned int* puArgErr;
}; /* size: 0x0024 */

struct FRAME_RemoteInvoke
{
  /* 0x0000 */ struct IDispatch* This;
  /* 0x0004 */ long dispIdMember;
  /* 0x0008 */ struct _GUID* piid;
  /* 0x000c */ unsigned long lcid;
  /* 0x0010 */ unsigned long dwFlags;
  /* 0x0014 */ struct tagDISPPARAMS* pDispParams;
  /* 0x0018 */ struct tagVARIANT* pVarResult;
  /* 0x001c */ struct tagEXCEPINFO* pExcepInfo;
  /* 0x0020 */ unsigned int* puArgErr;
  /* 0x0024 */ unsigned int cVarRef;
  /* 0x0028 */ unsigned int* rgVarRefIdx;
  /* 0x002c */ struct tagVARIANT* rgVarRef;
}; /* size: 0x0030 */

union FT
{
  union
  {
    /* 0x0000 */ unsigned __int64 ft_scalar;
    /* 0x0000 */ struct _FILETIME ft_struct;
  }; /* size: 0x0008 */
}; /* size: 0x0008 */

enum FormatMatchFlag
{
  FORMAT_NOTFOUND = 1,
  FORMAT_BADMATCH = 2,
  FORMAT_GOODMATCH = 4,
};

enum FreeResourcesFlags
{
  RESET_AND_FREE = 1,
  JUST_RESET = 2,
};

class GenericInstantiator<DISPATCH_INTERCEPTOR>
{
}; /* size: 0x0001 */

class GenericStream
{
  /* 0x0008 */ long _clRefs;
  /* 0x000c */ long _lOffset;
  /* 0x0010 */ long _cbDataSize;
  /* 0x0014 */ unsigned long _cbBufferSize;
  /* 0x0018 */ struct tagInterfaceData* _pifData;
  /* 0x001c */ int _fFree;
  /* 0x0020 */ unsigned long _copyAlignment;
}; /* size: 0x0024 */

struct HACCEL__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HAS_INTERFACES
{
  /* 0x0000 */ long m_cInterfaces;
}; /* size: 0x0004 */

struct HBITMAP__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HBRUSH__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HCOLORSPACE__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HCONVLIST__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HCONV__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HDC__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HDDEDATA__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HDESK__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HDROP__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HENHMETAFILE__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HFONT__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HGLRC__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HHOOK__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HICON__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HIMCC__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HIMC__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HINSTANCE__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HKEY__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HKL__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HMACSHA_CTX
{
  /* 0x0000 */ struct A_SHA_CTX context_ipad;
  /* 0x005c */ struct A_SHA_CTX context_opad;
}; /* size: 0x00b8 */

struct HMAPKEY__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HMENU__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HMETAFILE__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HMONITOR__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HPALETTE__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HPEN__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HRAWINPUT__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HREG
{
  /* 0x0000 */ void* h;
}; /* size: 0x0004 */

struct HRGN__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HRSRC__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HSPRITE__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HSTR__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HSZ__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HTASK__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HUMPD__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HWINEVENTHOOK__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HWINSTA__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HWND__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

class HashGUID
{
}; /* size: 0x0001 */

class HashInt
{
}; /* size: 0x0001 */

class HashVoidPtr
{
}; /* size: 0x0001 */

class HashWSTR
{
}; /* size: 0x0001 */

struct IAbandonmentNotification
{
}; /* size: 0x0004 */

struct IAccessControl
{
}; /* size: 0x0004 */

struct IActivationContextInfo
{
}; /* size: 0x0004 */

struct IActivationPropOutClean
{
}; /* size: 0x0004 */

struct IActivationProperties
{
}; /* size: 0x0004 */

struct IActivationPropertiesIn
{
}; /* size: 0x0004 */

struct IActivationPropertiesOut
{
}; /* size: 0x0004 */

struct IActivationSecurityInfo
{
}; /* size: 0x0004 */

struct IActivationStageInfo
{
}; /* size: 0x0004 */

struct IAddrExclusionControl
{
}; /* size: 0x0004 */

struct IAddrTrackingControl
{
}; /* size: 0x0004 */

struct IAdviseSink
{
}; /* size: 0x0004 */

struct IAdviseSink2
{
}; /* size: 0x0004 */

struct IAdviseSink2Vtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* OnDataChange /* function */;
  /* 0x0010 */ void* OnViewChange /* function */;
  /* 0x0014 */ void* OnRename /* function */;
  /* 0x0018 */ void* OnSave /* function */;
  /* 0x001c */ void* OnClose /* function */;
  /* 0x0020 */ void* OnLinkSrcChange /* function */;
}; /* size: 0x0024 */

struct IAdviseSinkEx
{
}; /* size: 0x0004 */

struct IAdviseSinkVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* OnDataChange /* function */;
  /* 0x0010 */ void* OnViewChange /* function */;
  /* 0x0014 */ void* OnRename /* function */;
  /* 0x0018 */ void* OnSave /* function */;
  /* 0x001c */ void* OnClose /* function */;
}; /* size: 0x0020 */

struct IAggregator
{
}; /* size: 0x0004 */

struct IAsyncManager
{
}; /* size: 0x0004 */

struct IAsyncRpcChannelBuffer
{
}; /* size: 0x0004 */

struct IAuthenticate
{
}; /* size: 0x0004 */

struct IBindCtx
{
}; /* size: 0x0004 */

struct IBindCtxVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* RegisterObjectBound /* function */;
  /* 0x0010 */ void* RevokeObjectBound /* function */;
  /* 0x0014 */ void* ReleaseBoundObjects /* function */;
  /* 0x0018 */ void* SetBindOptions /* function */;
  /* 0x001c */ void* GetBindOptions /* function */;
  /* 0x0020 */ void* GetRunningObjectTable /* function */;
  /* 0x0024 */ void* RegisterObjectParam /* function */;
  /* 0x0028 */ void* GetObjectParam /* function */;
  /* 0x002c */ void* EnumObjectParam /* function */;
  /* 0x0030 */ void* RevokeObjectParam /* function */;
}; /* size: 0x0034 */

struct IBindHost
{
}; /* size: 0x0004 */

struct IBindProtocol
{
}; /* size: 0x0004 */

struct IBindStatusCallback
{
}; /* size: 0x0004 */

struct IBinding
{
}; /* size: 0x0004 */

struct IBlockingLock
{
}; /* size: 0x0004 */

struct IBuffer
{
}; /* size: 0x0004 */

struct ICacheControl
{
}; /* size: 0x0004 */

struct ICacheRefresh
{
}; /* size: 0x0004 */

struct ICall
{
}; /* size: 0x0004 */

struct ICallFactory
{
}; /* size: 0x0004 */

struct ICallFactoryVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* CreateCall /* function */;
}; /* size: 0x0010 */

struct ICallFrame
{
}; /* size: 0x0004 */

struct ICallFrameEvents
{
}; /* size: 0x0004 */

struct ICallFrameInit
{
}; /* size: 0x0004 */

struct ICallFrameWalker
{
}; /* size: 0x0004 */

struct ICallIndirect
{
}; /* size: 0x0004 */

struct ICallInfo
{
}; /* size: 0x0004 */

struct ICallInterceptor
{
}; /* size: 0x0004 */

struct ICallUnmarshal
{
}; /* size: 0x0004 */

struct ICancelMethodCalls
{
}; /* size: 0x0004 */

struct ICatInformation
{
}; /* size: 0x0004 */

struct ICatRegister
{
}; /* size: 0x0004 */

struct ICatalogFileInfo
{
}; /* size: 0x0004 */

struct IChannelHook
{
}; /* size: 0x0004 */

struct IClassActivator
{
}; /* size: 0x0004 */

struct IClassClassicInfo
{
}; /* size: 0x0004 */

struct IClassClassicInfo2
{
}; /* size: 0x0004 */

struct IClassClassicInfo3
{
}; /* size: 0x0004 */

struct IClassFactory
{
}; /* size: 0x0004 */

struct IClassFactory2
{
}; /* size: 0x0004 */

struct IClassFactoryVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* CreateInstance /* function */;
  /* 0x0010 */ void* LockServer /* function */;
}; /* size: 0x0014 */

struct IClientSecurity
{
}; /* size: 0x0004 */

struct ICodeInstall
{
}; /* size: 0x0004 */

struct IComCatalog
{
}; /* size: 0x0004 */

struct IComCatalog2
{
}; /* size: 0x0004 */

struct IComCatalog2Internal
{
}; /* size: 0x0004 */

struct IComCatalogInternal
{
}; /* size: 0x0004 */

struct IComCatalogLocation
{
}; /* size: 0x0004 */

struct IComCatalogSCM
{
}; /* size: 0x0004 */

struct IComCatalogSettings
{
}; /* size: 0x0004 */

struct IComClassInfo
{
}; /* size: 0x0004 */

struct IComClassInfo2
{
}; /* size: 0x0004 */

struct IComDispatchInfo
{
}; /* size: 0x0004 */

struct IComObjIdentity
{
}; /* size: 0x0004 */

struct IComProcessInfo
{
}; /* size: 0x0004 */

struct IComProcessInfo2
{
}; /* size: 0x0004 */

struct IComProcessInfo3
{
}; /* size: 0x0004 */

struct IComServices
{
}; /* size: 0x0004 */

struct IComServices2
{
}; /* size: 0x0004 */

struct IComSxSClassInfo
{
}; /* size: 0x0004 */

struct IComThreadingInfo
{
}; /* size: 0x0004 */

struct IConnectionPoint
{
}; /* size: 0x0004 */

struct IConnectionPointContainer
{
}; /* size: 0x0004 */

struct IConnectionPointContainerVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* EnumConnectionPoints /* function */;
  /* 0x0010 */ void* FindConnectionPoint /* function */;
}; /* size: 0x0014 */

struct IConnectionPointVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* GetConnectionInterface /* function */;
  /* 0x0010 */ void* GetConnectionPointContainer /* function */;
  /* 0x0014 */ void* Advise /* function */;
  /* 0x0018 */ void* Unadvise /* function */;
  /* 0x001c */ void* EnumConnections /* function */;
}; /* size: 0x0020 */

struct IContext
{
}; /* size: 0x0004 */

struct IContextCallback
{
}; /* size: 0x0004 */

struct IContextMarshaler
{
}; /* size: 0x0004 */

struct IContinue
{
}; /* size: 0x0004 */

struct IContinueVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* FContinue /* function */;
}; /* size: 0x0010 */

struct ICreateErrorInfo
{
}; /* size: 0x0004 */

struct ICreateTypeInfo
{
}; /* size: 0x0004 */

struct ICreateTypeInfo2
{
}; /* size: 0x0004 */

struct ICreateTypeLib
{
}; /* size: 0x0004 */

struct ICreateTypeLib2
{
}; /* size: 0x0004 */

struct IDLLHost
{
}; /* size: 0x0004 */

struct IDataAdviseHolder
{
}; /* size: 0x0004 */

struct IDataFilter
{
}; /* size: 0x0004 */

struct IDataObject
{
}; /* size: 0x0004 */

struct IDataObjectVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* GetData /* function */;
  /* 0x0010 */ void* GetDataHere /* function */;
  /* 0x0014 */ void* QueryGetData /* function */;
  /* 0x0018 */ void* GetCanonicalFormatEtc /* function */;
  /* 0x001c */ void* SetData /* function */;
  /* 0x0020 */ void* EnumFormatEtc /* function */;
  /* 0x0024 */ void* DAdvise /* function */;
  /* 0x0028 */ void* DUnadvise /* function */;
  /* 0x002c */ void* EnumDAdvise /* function */;
}; /* size: 0x0030 */

struct IDebug
{
}; /* size: 0x0004 */

struct IDebugStream
{
}; /* size: 0x0004 */

struct IDestInfo
{
}; /* size: 0x0004 */

struct IDirectWriterLock
{
}; /* size: 0x0004 */

struct IDisconnectSink
{
}; /* size: 0x0004 */

struct IDispatch
{
}; /* size: 0x0004 */

struct IDispatchVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* GetTypeInfoCount /* function */;
  /* 0x0010 */ void* GetTypeInfo /* function */;
  /* 0x0014 */ void* GetIDsOfNames /* function */;
  /* 0x0018 */ void* Invoke /* function */;
}; /* size: 0x001c */

struct IDocfileAsyncConnectionPoint
{
}; /* size: 0x0004 */

struct IDragDropHelper
{
}; /* size: 0x0004 */

struct IDropSource
{
}; /* size: 0x0004 */

struct IDropSourceNotify
{
}; /* size: 0x0004 */

struct IDropSourceQueryEx
{
}; /* size: 0x0004 */

struct IDropTarget
{
}; /* size: 0x0004 */

struct IDummyHICONIncluder
{
}; /* size: 0x0004 */

struct IEncodingFilterFactory
{
}; /* size: 0x0004 */

struct IEnumCATEGORYINFO
{
}; /* size: 0x0004 */

struct IEnumCallback
{
}; /* size: 0x0004 */

struct IEnumConnectionPoints
{
}; /* size: 0x0004 */

struct IEnumConnectionPointsVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* Next /* function */;
  /* 0x0010 */ void* Skip /* function */;
  /* 0x0014 */ void* Reset /* function */;
  /* 0x0018 */ void* Clone /* function */;
}; /* size: 0x001c */

struct IEnumConnections
{
}; /* size: 0x0004 */

struct IEnumConnectionsVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* Next /* function */;
  /* 0x0010 */ void* Skip /* function */;
  /* 0x0014 */ void* Reset /* function */;
  /* 0x0018 */ void* Clone /* function */;
}; /* size: 0x001c */

struct IEnumContextProps
{
}; /* size: 0x0004 */

struct IEnumFORMATETC
{
}; /* size: 0x0004 */

struct IEnumFORMATETCVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* Next /* function */;
  /* 0x0010 */ void* Skip /* function */;
  /* 0x0014 */ void* Reset /* function */;
  /* 0x0018 */ void* Clone /* function */;
}; /* size: 0x001c */

struct IEnumGUID
{
}; /* size: 0x0004 */

struct IEnumGeneric
{
}; /* size: 0x0004 */

struct IEnumHolder
{
}; /* size: 0x0004 */

struct IEnumMoniker
{
}; /* size: 0x0004 */

struct IEnumMonikerVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* Next /* function */;
  /* 0x0010 */ void* Skip /* function */;
  /* 0x0014 */ void* Reset /* function */;
  /* 0x0018 */ void* Clone /* function */;
}; /* size: 0x001c */

struct IEnumOLEVERB
{
}; /* size: 0x0004 */

struct IEnumOLEVERBVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* Next /* function */;
  /* 0x0010 */ void* Skip /* function */;
  /* 0x0014 */ void* Reset /* function */;
  /* 0x0018 */ void* Clone /* function */;
}; /* size: 0x001c */

struct IEnumOleUndoUnits
{
}; /* size: 0x0004 */

struct IEnumSCMProcessInfo
{
}; /* size: 0x0004 */

struct IEnumSTATDATA
{
}; /* size: 0x0004 */

struct IEnumSTATDATAVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* Next /* function */;
  /* 0x0010 */ void* Skip /* function */;
  /* 0x0014 */ void* Reset /* function */;
  /* 0x0018 */ void* Clone /* function */;
}; /* size: 0x001c */

struct IEnumSTATPROPBAG
{
}; /* size: 0x0004 */

struct IEnumSTATPROPSETSTG
{
}; /* size: 0x0004 */

struct IEnumSTATPROPSETSTGVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* Next /* function */;
  /* 0x0010 */ void* Skip /* function */;
  /* 0x0014 */ void* Reset /* function */;
  /* 0x0018 */ void* Clone /* function */;
}; /* size: 0x001c */

struct IEnumSTATPROPSTG
{
}; /* size: 0x0004 */

struct IEnumSTATPROPSTGVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* Next /* function */;
  /* 0x0010 */ void* Skip /* function */;
  /* 0x0014 */ void* Reset /* function */;
  /* 0x0018 */ void* Clone /* function */;
}; /* size: 0x001c */

struct IEnumSTATSTG
{
}; /* size: 0x0004 */

struct IEnumSTATSTGVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* Next /* function */;
  /* 0x0010 */ void* Skip /* function */;
  /* 0x0014 */ void* Reset /* function */;
  /* 0x0018 */ void* Clone /* function */;
}; /* size: 0x001c */

struct IEnumString
{
}; /* size: 0x0004 */

struct IEnumStringVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* Next /* function */;
  /* 0x0010 */ void* Skip /* function */;
  /* 0x0014 */ void* Reset /* function */;
  /* 0x0018 */ void* Clone /* function */;
}; /* size: 0x001c */

struct IEnumUnknown
{
}; /* size: 0x0004 */

struct IEnumUnknownVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* Next /* function */;
  /* 0x0010 */ void* Skip /* function */;
  /* 0x0014 */ void* Reset /* function */;
  /* 0x0018 */ void* Clone /* function */;
}; /* size: 0x001c */

struct IEnumVARIANT
{
}; /* size: 0x0004 */

struct IErrorInfo
{
}; /* size: 0x0004 */

struct IErrorLog
{
}; /* size: 0x0004 */

struct IExceptionNotification
{
}; /* size: 0x0004 */

struct IExternalConnection
{
}; /* size: 0x0004 */

class IFaceEntry
{
  union
  {
    struct
    {
      /* 0x0000 */ class IFaceEntry* _pNext;
      /* 0x0004 */ void* _pProxy;
      /* 0x0008 */ struct IRpcProxyBuffer* _pRpcProxy;
      /* 0x000c */ struct IRpcStubBuffer* _pRpcStub;
      /* 0x0010 */ void* _pServer;
      /* 0x0014 */ struct _GUID _iid;
      /* 0x0024 */ class CCtxChnl* _pCtxChnl;
      /* 0x0028 */ class CtxEntry* _pHead;
      /* 0x002c */ class CtxEntry* _pFreeList;
      /* 0x0030 */ struct ICallInterceptor* _pInterceptor;
      /* 0x0034 */ struct IUnknown* _pUnkInner;
    }; /* size: 0x0038 */
    /* 0x0000 */ class CPageAllocator s_allocator;
  }; /* size: 0x0040 */
}; /* size: 0x0038 */

struct IFastStack<CallFrame>
{
}; /* size: 0x0004 */

struct IFastStack<DISPATCH_CLIENT_FRAME>
{
}; /* size: 0x0004 */

struct IFastStack<DISPATCH_SERVER_FRAME>
{
}; /* size: 0x0004 */

struct IFileLockBytes
{
}; /* size: 0x0004 */

struct IFillInfo
{
}; /* size: 0x0004 */

struct IFillLockBytes
{
  /* 0x0000 */ struct IFillLockBytesVtbl* lpVtbl;
}; /* size: 0x0004 */

struct IFillLockBytesVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* FillAppend /* function */;
  /* 0x0010 */ void* FillAt /* function */;
  /* 0x0014 */ void* SetFillSize /* function */;
  /* 0x0018 */ void* Terminate /* function */;
}; /* size: 0x001c */

class IFinish
{
}; /* size: 0x0004 */

struct IFont
{
}; /* size: 0x0004 */

struct IFontDisp
{
}; /* size: 0x0004 */

struct IFontEventsDisp
{
}; /* size: 0x0004 */

struct IForegroundTransfer
{
}; /* size: 0x0004 */

struct IGetCatalogObject
{
}; /* size: 0x0004 */

struct IGetContextId
{
}; /* size: 0x0004 */

struct IGlobalInterfaceTable
{
}; /* size: 0x0004 */

struct IGlobalOptions
{
}; /* size: 0x0004 */

struct IHookOleObject
{
}; /* size: 0x0004 */

struct IHttpNegotiate
{
}; /* size: 0x0004 */

struct IHttpNegotiate2
{
}; /* size: 0x0004 */

struct IHttpSecurity
{
}; /* size: 0x0004 */

struct IImageList
{
}; /* size: 0x0004 */

struct IInitActivationPropertiesIn
{
}; /* size: 0x0004 */

struct IInitializeSpy
{
}; /* size: 0x0004 */

struct IInstanceInfo
{
}; /* size: 0x0004 */

struct IInstantiationInfo
{
}; /* size: 0x0004 */

struct IInterceptorBase
{
}; /* size: 0x0004 */

struct IInterfaceFromWindowProp
{
}; /* size: 0x0004 */

struct IInterfaceInfo
{
}; /* size: 0x0004 */

struct IInterfaceRelated
{
}; /* size: 0x0004 */

class IInternalChannelBuffer
{
}; /* size: 0x0008 */

struct IInternalUnknown
{
}; /* size: 0x0004 */

struct IInternet
{
}; /* size: 0x0004 */

struct IInternetBindInfo
{
}; /* size: 0x0004 */

struct IInternetHostSecurityManager
{
}; /* size: 0x0004 */

struct IInternetPriority
{
}; /* size: 0x0004 */

struct IInternetProtocol
{
}; /* size: 0x0004 */

struct IInternetProtocolEx
{
}; /* size: 0x0004 */

struct IInternetProtocolInfo
{
}; /* size: 0x0004 */

struct IInternetProtocolRoot
{
}; /* size: 0x0004 */

struct IInternetProtocolSink
{
}; /* size: 0x0004 */

struct IInternetProtocolSinkStackable
{
}; /* size: 0x0004 */

struct IInternetSecurityManager
{
}; /* size: 0x0004 */

struct IInternetSecurityManagerEx
{
}; /* size: 0x0004 */

struct IInternetSecurityManagerEx2
{
}; /* size: 0x0004 */

struct IInternetSecurityMgrSite
{
}; /* size: 0x0004 */

struct IInternetSession
{
}; /* size: 0x0004 */

struct IInternetThreadSwitch
{
}; /* size: 0x0004 */

struct IInternetZoneManager
{
}; /* size: 0x0004 */

struct IInternetZoneManagerEx
{
}; /* size: 0x0004 */

struct IInternetZoneManagerEx2
{
}; /* size: 0x0004 */

struct ILayoutStorage
{
}; /* size: 0x0004 */

struct ILegacyInfo
{
}; /* size: 0x0004 */

struct ILocalMachineNames
{
}; /* size: 0x0004 */

struct ILocalSystemActivator
{
}; /* size: 0x0004 */

struct ILockBytes
{
}; /* size: 0x0004 */

struct ILockBytesVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* ReadAt /* function */;
  /* 0x0010 */ void* WriteAt /* function */;
  /* 0x0014 */ void* Flush /* function */;
  /* 0x0018 */ void* SetSize /* function */;
  /* 0x001c */ void* LockRegion /* function */;
  /* 0x0020 */ void* UnlockRegion /* function */;
  /* 0x0024 */ void* Stat /* function */;
}; /* size: 0x0028 */

struct IMAGE_AUX_SYMBOL_TOKEN_DEF
{
  /* 0x0000 */ unsigned char bAuxType;
  /* 0x0001 */ unsigned char bReserved;
  /* 0x0002 */ unsigned long SymbolTableIndex;
  /* 0x0006 */ unsigned char rgbReserved[12];
}; /* size: 0x0012 */

enum IMAGE_AUX_SYMBOL_TYPE
{
  IMAGE_AUX_SYMBOL_TYPE_TOKEN_DEF = 1,
};

struct IMAGE_COR20_HEADER
{
  /* 0x0000 */ unsigned long cb;
  /* 0x0004 */ unsigned short MajorRuntimeVersion;
  /* 0x0006 */ unsigned short MinorRuntimeVersion;
  /* 0x0008 */ struct _IMAGE_DATA_DIRECTORY MetaData;
  /* 0x0010 */ unsigned long Flags;
  union
  {
    /* 0x0014 */ unsigned long EntryPointToken;
    /* 0x0014 */ unsigned long EntryPointRVA;
  }; /* size: 0x0004 */
  /* 0x0018 */ struct _IMAGE_DATA_DIRECTORY Resources;
  /* 0x0020 */ struct _IMAGE_DATA_DIRECTORY StrongNameSignature;
  /* 0x0028 */ struct _IMAGE_DATA_DIRECTORY CodeManagerTable;
  /* 0x0030 */ struct _IMAGE_DATA_DIRECTORY VTableFixups;
  /* 0x0038 */ struct _IMAGE_DATA_DIRECTORY ExportAddressTableJumps;
  /* 0x0040 */ struct _IMAGE_DATA_DIRECTORY ManagedNativeHeader;
}; /* size: 0x0048 */

struct IMAGE_LOAD_CONFIG_DIRECTORY32
{
  /* 0x0000 */ unsigned long Size;
  /* 0x0004 */ unsigned long TimeDateStamp;
  /* 0x0008 */ unsigned short MajorVersion;
  /* 0x000a */ unsigned short MinorVersion;
  /* 0x000c */ unsigned long GlobalFlagsClear;
  /* 0x0010 */ unsigned long GlobalFlagsSet;
  /* 0x0014 */ unsigned long CriticalSectionDefaultTimeout;
  /* 0x0018 */ unsigned long DeCommitFreeBlockThreshold;
  /* 0x001c */ unsigned long DeCommitTotalFreeThreshold;
  /* 0x0020 */ unsigned long LockPrefixTable;
  /* 0x0024 */ unsigned long MaximumAllocationSize;
  /* 0x0028 */ unsigned long VirtualMemoryThreshold;
  /* 0x002c */ unsigned long ProcessHeapFlags;
  /* 0x0030 */ unsigned long ProcessAffinityMask;
  /* 0x0034 */ unsigned short CSDVersion;
  /* 0x0036 */ unsigned short Reserved1;
  /* 0x0038 */ unsigned long EditList;
  /* 0x003c */ unsigned long SecurityCookie;
  /* 0x0040 */ unsigned long SEHandlerTable;
  /* 0x0044 */ unsigned long SEHandlerCount;
}; /* size: 0x0048 */

struct IMAGE_LOAD_CONFIG_DIRECTORY64
{
  /* 0x0000 */ unsigned long Size;
  /* 0x0004 */ unsigned long TimeDateStamp;
  /* 0x0008 */ unsigned short MajorVersion;
  /* 0x000a */ unsigned short MinorVersion;
  /* 0x000c */ unsigned long GlobalFlagsClear;
  /* 0x0010 */ unsigned long GlobalFlagsSet;
  /* 0x0014 */ unsigned long CriticalSectionDefaultTimeout;
  /* 0x0018 */ unsigned __int64 DeCommitFreeBlockThreshold;
  /* 0x0020 */ unsigned __int64 DeCommitTotalFreeThreshold;
  /* 0x0028 */ unsigned __int64 LockPrefixTable;
  /* 0x0030 */ unsigned __int64 MaximumAllocationSize;
  /* 0x0038 */ unsigned __int64 VirtualMemoryThreshold;
  /* 0x0040 */ unsigned __int64 ProcessAffinityMask;
  /* 0x0048 */ unsigned long ProcessHeapFlags;
  /* 0x004c */ unsigned short CSDVersion;
  /* 0x004e */ unsigned short Reserved1;
  /* 0x0050 */ unsigned __int64 EditList;
  /* 0x0058 */ unsigned __int64 SecurityCookie;
  /* 0x0060 */ unsigned __int64 SEHandlerTable;
  /* 0x0068 */ unsigned __int64 SEHandlerCount;
}; /* size: 0x0070 */

struct IMPORT_OBJECT_HEADER
{
  /* 0x0000 */ unsigned short Sig1;
  /* 0x0002 */ unsigned short Sig2;
  /* 0x0004 */ unsigned short Version;
  /* 0x0006 */ unsigned short Machine;
  /* 0x0008 */ unsigned long TimeDateStamp;
  /* 0x000c */ unsigned long SizeOfData;
  union
  {
    /* 0x0010 */ unsigned short Ordinal;
    /* 0x0010 */ unsigned short Hint;
  }; /* size: 0x0002 */
  struct /* bitfield */
  {
    /* 0x0012 */ unsigned short Type : 2; /* bit position: 0 */
    /* 0x0012 */ unsigned short NameType : 3; /* bit position: 2 */
    /* 0x0012 */ unsigned short Reserved : 11; /* bit position: 5 */
  }; /* bitfield */
}; /* size: 0x0014 */

enum IMPORT_OBJECT_NAME_TYPE
{
  IMPORT_OBJECT_ORDINAL = 0,
  IMPORT_OBJECT_NAME = 1,
  IMPORT_OBJECT_NAME_NO_PREFIX = 2,
  IMPORT_OBJECT_NAME_UNDECORATE = 3,
};

enum IMPORT_OBJECT_TYPE
{
  IMPORT_OBJECT_CODE = 0,
  IMPORT_OBJECT_DATA = 1,
  IMPORT_OBJECT_CONST = 2,
};

struct IMalloc
{
}; /* size: 0x0004 */

struct IMallocSpy
{
}; /* size: 0x0004 */

struct IMallocVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* Alloc /* function */;
  /* 0x0010 */ void* Realloc /* function */;
  /* 0x0014 */ void* Free /* function */;
  /* 0x0018 */ void* GetSize /* function */;
  /* 0x001c */ void* DidAlloc /* function */;
  /* 0x0020 */ void* HeapMinimize /* function */;
}; /* size: 0x0024 */

class IMappedStream
{
}; /* size: 0x0004 */

struct IMarshal
{
}; /* size: 0x0004 */

struct IMarshal2
{
}; /* size: 0x0004 */

struct IMarshalEnvoy
{
}; /* size: 0x0004 */

struct IMarshalOptions
{
}; /* size: 0x0004 */

struct IMarshalSomeone
{
}; /* size: 0x0004 */

struct IMarshallingManager
{
}; /* size: 0x0004 */

struct IMessageFilter
{
}; /* size: 0x0004 */

class IMessageParam
{
  /* 0x0004 */ class IMessageParam* pNextMessage;
}; /* size: 0x0008 */

struct IMoniker
{
}; /* size: 0x0004 */

struct IMonikerProp
{
}; /* size: 0x0004 */

struct IMonikerVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* GetClassID /* function */;
  /* 0x0010 */ void* IsDirty /* function */;
  /* 0x0014 */ void* Load /* function */;
  /* 0x0018 */ void* Save /* function */;
  /* 0x001c */ void* GetSizeMax /* function */;
  /* 0x0020 */ void* BindToObject /* function */;
  /* 0x0024 */ void* BindToStorage /* function */;
  /* 0x0028 */ void* Reduce /* function */;
  /* 0x002c */ void* ComposeWith /* function */;
  /* 0x0030 */ void* Enum /* function */;
  /* 0x0034 */ void* IsEqual /* function */;
  /* 0x0038 */ void* Hash /* function */;
  /* 0x003c */ void* IsRunning /* function */;
  /* 0x0040 */ void* GetTimeOfLastChange /* function */;
  /* 0x0044 */ void* Inverse /* function */;
  /* 0x0048 */ void* CommonPrefixWith /* function */;
  /* 0x004c */ void* RelativePathTo /* function */;
  /* 0x0050 */ void* GetDisplayName /* function */;
  /* 0x0054 */ void* ParseDisplayName /* function */;
  /* 0x0058 */ void* IsSystemMoniker /* function */;
}; /* size: 0x005c */

struct IMultiQI
{
}; /* size: 0x0004 */

struct INFO
{
  /* 0x0000 */ int fUsed;
  /* 0x0004 */ unsigned long dwConnection;
  /* 0x0008 */ unsigned short cf;
  /* 0x000c */ unsigned long grfAdvf;
}; /* size: 0x0010 */

struct INTERFACE_HELPER_CLSID
{
  /* 0x0020 */ struct _GUID m_clsid;
  /* 0x0030 */ int m_fDisableTypeLib;
  /* 0x0034 */ int m_fDisableAll;
  /* 0x0038 */ int m_fFoundHelper;
}; /* size: 0x003c */

struct INTERPRETER_FLAGS
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned char FullPtrUsed : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned char RpcSsAllocUsed : 1; /* bit position: 1 */
    /* 0x0000 */ unsigned char ObjectProc : 1; /* bit position: 2 */
    /* 0x0000 */ unsigned char HasRpcFlags : 1; /* bit position: 3 */
    /* 0x0000 */ unsigned char IgnoreObjectException : 1; /* bit position: 4 */
    /* 0x0000 */ unsigned char HasCommOrFault : 1; /* bit position: 5 */
    /* 0x0000 */ unsigned char UseNewInitRoutines : 1; /* bit position: 6 */
    /* 0x0000 */ unsigned char Unused : 1; /* bit position: 7 */
  }; /* bitfield */
}; /* size: 0x0001 */

struct INTERPRETER_OPT_FLAGS
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned char ServerMustSize : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned char ClientMustSize : 1; /* bit position: 1 */
    /* 0x0000 */ unsigned char HasReturn : 1; /* bit position: 2 */
    /* 0x0000 */ unsigned char HasPipes : 1; /* bit position: 3 */
    /* 0x0000 */ unsigned char Unused : 1; /* bit position: 4 */
    /* 0x0000 */ unsigned char HasAsyncUuid : 1; /* bit position: 5 */
    /* 0x0000 */ unsigned char HasExtensions : 1; /* bit position: 6 */
    /* 0x0000 */ unsigned char HasAsyncHandle : 1; /* bit position: 7 */
  }; /* bitfield */
}; /* size: 0x0001 */

struct INTERPRETER_OPT_FLAGS2
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned char HasNewCorrDesc : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned char ClientCorrCheck : 1; /* bit position: 1 */
    /* 0x0000 */ unsigned char ServerCorrCheck : 1; /* bit position: 2 */
    /* 0x0000 */ unsigned char HasNotify : 1; /* bit position: 3 */
    /* 0x0000 */ unsigned char HasNotify2 : 1; /* bit position: 4 */
    /* 0x0000 */ unsigned char HasComplexReturn : 1; /* bit position: 5 */
    /* 0x0000 */ unsigned char HasConformanceRange : 1; /* bit position: 6 */
    /* 0x0000 */ unsigned char HasBigByValueParam : 1; /* bit position: 7 */
  }; /* bitfield */
}; /* size: 0x0001 */

struct INdrVersion
{
}; /* size: 0x0004 */

struct IObjContext
{
}; /* size: 0x0004 */

struct IObjectActivator
{
}; /* size: 0x0004 */

struct IObjectWithSite
{
}; /* size: 0x0004 */

struct IOleAdviseHolder
{
}; /* size: 0x0004 */

struct IOleCache
{
}; /* size: 0x0004 */

struct IOleCache2
{
  /* 0x0000 */ struct IOleCache2Vtbl* lpVtbl;
}; /* size: 0x0004 */

struct IOleCache2Vtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* Cache /* function */;
  /* 0x0010 */ void* Uncache /* function */;
  /* 0x0014 */ void* EnumCache /* function */;
  /* 0x0018 */ void* InitCache /* function */;
  /* 0x001c */ void* SetData /* function */;
  /* 0x0020 */ void* UpdateCache /* function */;
  /* 0x0024 */ void* DiscardCache /* function */;
}; /* size: 0x0028 */

struct IOleCacheControl
{
}; /* size: 0x0004 */

struct IOleClientSite
{
}; /* size: 0x0004 */

struct IOleContainer
{
}; /* size: 0x0004 */

struct IOleControl
{
}; /* size: 0x0004 */

struct IOleControlSite
{
}; /* size: 0x0004 */

struct IOleInPlaceActiveObject
{
  /* 0x0000 */ struct IOleInPlaceActiveObjectVtbl* lpVtbl;
}; /* size: 0x0004 */

struct IOleInPlaceActiveObjectVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* GetWindow /* function */;
  /* 0x0010 */ void* ContextSensitiveHelp /* function */;
  /* 0x0014 */ void* TranslateAcceleratorW /* function */;
  /* 0x0018 */ void* OnFrameWindowActivate /* function */;
  /* 0x001c */ void* OnDocWindowActivate /* function */;
  /* 0x0020 */ void* ResizeBorder /* function */;
  /* 0x0024 */ void* EnableModeless /* function */;
}; /* size: 0x0028 */

struct IOleInPlaceFrame
{
}; /* size: 0x0004 */

struct IOleInPlaceObject
{
}; /* size: 0x0004 */

struct IOleInPlaceObjectWindowless
{
}; /* size: 0x0004 */

struct IOleInPlaceSite
{
}; /* size: 0x0004 */

struct IOleInPlaceSiteEx
{
}; /* size: 0x0004 */

struct IOleInPlaceSiteWindowless
{
}; /* size: 0x0004 */

struct IOleInPlaceUIWindow
{
  /* 0x0000 */ struct IOleInPlaceUIWindowVtbl* lpVtbl;
}; /* size: 0x0004 */

struct IOleInPlaceUIWindowVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* GetWindow /* function */;
  /* 0x0010 */ void* ContextSensitiveHelp /* function */;
  /* 0x0014 */ void* GetBorder /* function */;
  /* 0x0018 */ void* RequestBorderSpace /* function */;
  /* 0x001c */ void* SetBorderSpace /* function */;
  /* 0x0020 */ void* SetActiveObject /* function */;
}; /* size: 0x0024 */

struct IOleItemContainer
{
}; /* size: 0x0004 */

struct IOleLink
{
}; /* size: 0x0004 */

struct IOleObject
{
}; /* size: 0x0004 */

struct IOlePackagerLinkNotify
{
}; /* size: 0x0004 */

struct IOleParentUndoUnit
{
}; /* size: 0x0004 */

struct IOlePresObj
{
}; /* size: 0x0004 */

struct IOleUndoManager
{
}; /* size: 0x0004 */

struct IOleUndoUnit
{
}; /* size: 0x0004 */

struct IOleWindow
{
}; /* size: 0x0004 */

struct IOpaqueDataInfo
{
}; /* size: 0x0004 */

struct IOplockStorage
{
}; /* size: 0x0004 */

struct IOrpcDebugNotify
{
}; /* size: 0x0004 */

struct IOrpcDebugNotifyVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* ClientGetBufferSize /* function */;
  /* 0x0010 */ void* ClientFillBuffer /* function */;
  /* 0x0014 */ void* ClientNotify /* function */;
  /* 0x0018 */ void* ServerNotify /* function */;
  /* 0x001c */ void* ServerGetBufferSize /* function */;
  /* 0x0020 */ void* ServerFillBuffer /* function */;
}; /* size: 0x0024 */

struct IOverrideTargetContext
{
}; /* size: 0x0004 */

struct IPAControl
{
}; /* size: 0x0004 */

struct IPSFactoryBuffer
{
}; /* size: 0x0004 */

struct IPSFactoryBufferVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* CreateProxy /* function */;
  /* 0x0010 */ void* CreateStub /* function */;
}; /* size: 0x0014 */

struct IParseDisplayName
{
}; /* size: 0x0004 */

struct IPartitionLookup
{
}; /* size: 0x0004 */

struct IPartitionProperty
{
}; /* size: 0x0004 */

struct IPerPropertyBrowsing
{
}; /* size: 0x0004 */

struct IPersist
{
}; /* size: 0x0004 */

struct IPersistFile
{
}; /* size: 0x0004 */

struct IPersistMemory
{
}; /* size: 0x0004 */

struct IPersistMoniker
{
}; /* size: 0x0004 */

struct IPersistPropertyBag
{
}; /* size: 0x0004 */

struct IPersistPropertyBag2
{
}; /* size: 0x0004 */

struct IPersistStorage
{
}; /* size: 0x0004 */

struct IPersistStream
{
}; /* size: 0x0004 */

struct IPersistStreamInit
{
}; /* size: 0x0004 */

struct IPicture
{
}; /* size: 0x0004 */

struct IPicture2
{
}; /* size: 0x0004 */

struct IPictureDisp
{
}; /* size: 0x0004 */

struct IPipeByte
{
}; /* size: 0x0004 */

struct IPipeDouble
{
}; /* size: 0x0004 */

struct IPipeLong
{
}; /* size: 0x0004 */

struct IPointerInactive
{
}; /* size: 0x0004 */

struct IPolicy
{
}; /* size: 0x0004 */

struct IPolicyAsync
{
}; /* size: 0x0004 */

struct IPolicyMaker
{
}; /* size: 0x0004 */

struct IPolicySet
{
}; /* size: 0x0004 */

struct IPrivActivationContextInfo
{
}; /* size: 0x0004 */

struct IPrivActivationPropertiesIn
{
}; /* size: 0x0004 */

struct IPrivActivationPropertiesOut
{
}; /* size: 0x0004 */

struct IPrivDragDrop
{
}; /* size: 0x0004 */

struct IProcessInitControl
{
}; /* size: 0x0004 */

struct IProcessLock
{
}; /* size: 0x0004 */

struct IProcessServerInfo
{
}; /* size: 0x0004 */

struct IProgressNotify
{
}; /* size: 0x0004 */

struct IPropertyBag
{
}; /* size: 0x0004 */

struct IPropertyBag2
{
}; /* size: 0x0004 */

struct IPropertyBagEx
{
}; /* size: 0x0004 */

struct IPropertyNotifySink
{
}; /* size: 0x0004 */

struct IPropertyPage
{
}; /* size: 0x0004 */

struct IPropertyPage2
{
}; /* size: 0x0004 */

struct IPropertyPageSite
{
}; /* size: 0x0004 */

struct IPropertySetStorage
{
}; /* size: 0x0004 */

struct IPropertyStorage
{
}; /* size: 0x0004 */

struct IProvideClassInfo
{
}; /* size: 0x0004 */

struct IProvideClassInfo2
{
}; /* size: 0x0004 */

struct IProvideMultipleClassInfo
{
}; /* size: 0x0004 */

struct IProxyManager
{
}; /* size: 0x0004 */

struct IQuickActivate
{
}; /* size: 0x0004 */

struct IRCEntry
{
  /* 0x0000 */ struct IRCEntry* pNext;
  /* 0x0004 */ class CRefCache* pRefCache;
  /* 0x0008 */ unsigned long cStrongUsage;
  /* 0x000c */ unsigned long cWeakUsage;
  /* 0x0010 */ unsigned long cStrongRefs;
  /* 0x0014 */ unsigned long cPrivateRefs;
  /* 0x0018 */ unsigned long cWeakRefs;
  /* 0x001c */ struct _GUID ipid;
}; /* size: 0x002c */

struct IROTData
{
}; /* size: 0x0004 */

struct IRecordInfo
{
  /* 0x0000 */ struct IRecordInfoVtbl* lpVtbl;
}; /* size: 0x0004 */

struct IRecordInfoVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* RecordInit /* function */;
  /* 0x0010 */ void* RecordClear /* function */;
  /* 0x0014 */ void* RecordCopy /* function */;
  /* 0x0018 */ void* GetGuid /* function */;
  /* 0x001c */ void* GetName /* function */;
  /* 0x0020 */ void* GetSize /* function */;
  /* 0x0024 */ void* GetTypeInfo /* function */;
  /* 0x0028 */ void* GetField /* function */;
  /* 0x002c */ void* GetFieldNoCopy /* function */;
  /* 0x0030 */ void* PutField /* function */;
  /* 0x0034 */ void* PutFieldNoCopy /* function */;
  /* 0x0038 */ void* GetFieldNames /* function */;
  /* 0x003c */ void* IsMatchingType /* function */;
  /* 0x0040 */ void* RecordCreate /* function */;
  /* 0x0044 */ void* RecordCreateCopy /* function */;
  /* 0x0048 */ void* RecordDestroy /* function */;
}; /* size: 0x004c */

struct IReleaseMarshalBuffers
{
}; /* size: 0x0004 */

struct IRemUnknown
{
}; /* size: 0x0004 */

struct IRemUnknown2
{
}; /* size: 0x0004 */

struct IRemUnknownN
{
}; /* size: 0x0004 */

struct IReplaceClassInfo
{
}; /* size: 0x0004 */

struct IResourceGates
{
}; /* size: 0x0004 */

struct IRootStorage
{
}; /* size: 0x0004 */

struct IRpcCall
{
}; /* size: 0x0004 */

struct IRpcChannelBuffer
{
}; /* size: 0x0004 */

struct IRpcChannelBuffer2
{
}; /* size: 0x0004 */

struct IRpcChannelBuffer3
{
}; /* size: 0x0004 */

struct IRpcChannelBufferVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* GetBuffer /* function */;
  /* 0x0010 */ void* SendReceive /* function */;
  /* 0x0014 */ void* FreeBuffer /* function */;
  /* 0x0018 */ void* GetDestCtx /* function */;
  /* 0x001c */ void* IsConnected /* function */;
}; /* size: 0x0020 */

struct IRpcHelper
{
}; /* size: 0x0004 */

struct IRpcOptions
{
}; /* size: 0x0004 */

struct IRpcProxyBuffer
{
}; /* size: 0x0004 */

struct IRpcProxyBufferVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* Connect /* function */;
  /* 0x0010 */ void* Disconnect /* function */;
}; /* size: 0x0014 */

struct IRpcStubBuffer
{
}; /* size: 0x0004 */

struct IRpcStubBufferVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* Connect /* function */;
  /* 0x0010 */ void* Disconnect /* function */;
  /* 0x0014 */ void* Invoke /* function */;
  /* 0x0018 */ void* IsIIDSupported /* function */;
  /* 0x001c */ void* CountRefs /* function */;
  /* 0x0020 */ void* DebugServerQueryInterface /* function */;
  /* 0x0024 */ void* DebugServerRelease /* function */;
}; /* size: 0x0028 */

struct IRpcSyntaxNegotiate
{
}; /* size: 0x0004 */

struct IRundown
{
}; /* size: 0x0004 */

struct IRunnableObject
{
  /* 0x0000 */ struct IRunnableObjectVtbl* lpVtbl;
}; /* size: 0x0004 */

struct IRunnableObjectVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* GetRunningClass /* function */;
  /* 0x0010 */ void* Run /* function */;
  /* 0x0014 */ void* IsRunning /* function */;
  /* 0x0018 */ void* LockRunning /* function */;
  /* 0x001c */ void* SetContainedObject /* function */;
}; /* size: 0x0020 */

struct IRunningObjectTable
{
}; /* size: 0x0004 */

struct IRunningObjectTableVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* Register /* function */;
  /* 0x0010 */ void* Revoke /* function */;
  /* 0x0014 */ void* IsRunning /* function */;
  /* 0x0018 */ void* GetObjectW /* function */;
  /* 0x001c */ void* NoteChangeTime /* function */;
  /* 0x0020 */ void* GetTimeOfLastChange /* function */;
  /* 0x0024 */ void* EnumRunning /* function */;
}; /* size: 0x0028 */

struct ISCMLocalActivator
{
}; /* size: 0x0004 */

struct ISCMProcessControl
{
}; /* size: 0x0004 */

struct IScmReplyInfo
{
}; /* size: 0x0004 */

struct IScmRequestInfo
{
}; /* size: 0x0004 */

struct ISecurityOptions
{
}; /* size: 0x0004 */

struct ISequentialStream
{
}; /* size: 0x0004 */

struct ISequentialStreamVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* Read /* function */;
  /* 0x0010 */ void* Write /* function */;
}; /* size: 0x0014 */

struct ISerializable
{
}; /* size: 0x0004 */

struct ISerializableParent
{
}; /* size: 0x0004 */

struct IServerLocationInfo
{
}; /* size: 0x0004 */

struct IServerSecurity
{
}; /* size: 0x0004 */

struct IServiceProvider
{
}; /* size: 0x0004 */

struct IServicesSink
{
}; /* size: 0x0004 */

struct IServicesSink2
{
}; /* size: 0x0004 */

struct IShellItem
{
}; /* size: 0x0004 */

struct IShellItem2
{
}; /* size: 0x0004 */

struct IShellLinkW
{
}; /* size: 0x0004 */

struct ISimpleFrameSite
{
}; /* size: 0x0004 */

struct ISoftDistExt
{
}; /* size: 0x0004 */

struct ISpecialSystemProperties
{
}; /* size: 0x0004 */

struct ISpecifyPropertyPages
{
}; /* size: 0x0004 */

struct IStackWalker
{
}; /* size: 0x0004 */

struct IStackWalkerStack
{
}; /* size: 0x0004 */

struct IStackWalkerSymbol
{
}; /* size: 0x0004 */

struct IStandardActivator
{
}; /* size: 0x0004 */

struct IStdMarshalInfo
{
}; /* size: 0x0004 */

struct IStorage
{
}; /* size: 0x0004 */

struct IStorageReplica
{
}; /* size: 0x0004 */

struct IStorageVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* CreateStream /* function */;
  /* 0x0010 */ void* OpenStream /* function */;
  /* 0x0014 */ void* CreateStorage /* function */;
  /* 0x0018 */ void* OpenStorage /* function */;
  /* 0x001c */ void* CopyTo /* function */;
  /* 0x0020 */ void* MoveElementTo /* function */;
  /* 0x0024 */ void* Commit /* function */;
  /* 0x0028 */ void* Revert /* function */;
  /* 0x002c */ void* EnumElements /* function */;
  /* 0x0030 */ void* DestroyElement /* function */;
  /* 0x0034 */ void* RenameElement /* function */;
  /* 0x0038 */ void* SetElementTimes /* function */;
  /* 0x003c */ void* SetClass /* function */;
  /* 0x0040 */ void* SetStateBits /* function */;
  /* 0x0044 */ void* Stat /* function */;
}; /* size: 0x0048 */

struct IStream
{
}; /* size: 0x0004 */

struct IStreamVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* Read /* function */;
  /* 0x0010 */ void* Write /* function */;
  /* 0x0014 */ void* Seek /* function */;
  /* 0x0018 */ void* SetSize /* function */;
  /* 0x001c */ void* CopyTo /* function */;
  /* 0x0020 */ void* Commit /* function */;
  /* 0x0024 */ void* Revert /* function */;
  /* 0x0028 */ void* LockRegion /* function */;
  /* 0x002c */ void* UnlockRegion /* function */;
  /* 0x0030 */ void* Stat /* function */;
  /* 0x0034 */ void* Clone /* function */;
}; /* size: 0x0038 */

struct ISupportErrorInfo
{
}; /* size: 0x0004 */

struct ISurrogate
{
}; /* size: 0x0004 */

struct ISurrogateService
{
}; /* size: 0x0004 */

struct ISynchronize
{
}; /* size: 0x0004 */

struct ISynchronizeContainer
{
}; /* size: 0x0004 */

struct ISynchronizeEvent
{
}; /* size: 0x0004 */

struct ISynchronizeHandle
{
}; /* size: 0x0004 */

struct ISynchronizeMutex
{
}; /* size: 0x0004 */

struct ISystemActivator
{
}; /* size: 0x0004 */

struct ISystemDebugEventFire
{
}; /* size: 0x0004 */

struct ISystemDebugEventShutdown
{
}; /* size: 0x0004 */

struct IThumbnailExtractor
{
}; /* size: 0x0004 */

struct IThunkManager
{
}; /* size: 0x0004 */

struct ITimeAndNoticeControl
{
}; /* size: 0x0004 */

class ITrackingMoniker
{
}; /* size: 0x0004 */

struct ITypeChangeEvents
{
}; /* size: 0x0004 */

struct ITypeComp
{
}; /* size: 0x0004 */

struct ITypeCompVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* Bind /* function */;
  /* 0x0010 */ void* BindType /* function */;
}; /* size: 0x0014 */

struct ITypeFactory
{
}; /* size: 0x0004 */

struct ITypeInfo
{
}; /* size: 0x0004 */

struct ITypeInfo2
{
}; /* size: 0x0004 */

struct ITypeInfoVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* GetTypeAttr /* function */;
  /* 0x0010 */ void* GetTypeComp /* function */;
  /* 0x0014 */ void* GetFuncDesc /* function */;
  /* 0x0018 */ void* GetVarDesc /* function */;
  /* 0x001c */ void* GetNames /* function */;
  /* 0x0020 */ void* GetRefTypeOfImplType /* function */;
  /* 0x0024 */ void* GetImplTypeFlags /* function */;
  /* 0x0028 */ void* GetIDsOfNames /* function */;
  /* 0x002c */ void* Invoke /* function */;
  /* 0x0030 */ void* GetDocumentation /* function */;
  /* 0x0034 */ void* GetDllEntry /* function */;
  /* 0x0038 */ void* GetRefTypeInfo /* function */;
  /* 0x003c */ void* AddressOfMember /* function */;
  /* 0x0040 */ void* CreateInstance /* function */;
  /* 0x0044 */ void* GetMops /* function */;
  /* 0x0048 */ void* GetContainingTypeLib /* function */;
  /* 0x004c */ void* ReleaseTypeAttr /* function */;
  /* 0x0050 */ void* ReleaseFuncDesc /* function */;
  /* 0x0054 */ void* ReleaseVarDesc /* function */;
}; /* size: 0x0058 */

struct ITypeLib
{
}; /* size: 0x0004 */

struct ITypeLib2
{
}; /* size: 0x0004 */

struct ITypeLibVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* GetTypeInfoCount /* function */;
  /* 0x0010 */ void* GetTypeInfo /* function */;
  /* 0x0014 */ void* GetTypeInfoType /* function */;
  /* 0x0018 */ void* GetTypeInfoOfGuid /* function */;
  /* 0x001c */ void* GetLibAttr /* function */;
  /* 0x0020 */ void* GetTypeComp /* function */;
  /* 0x0024 */ void* GetDocumentation /* function */;
  /* 0x0028 */ void* IsName /* function */;
  /* 0x002c */ void* FindName /* function */;
  /* 0x0030 */ void* ReleaseTLibAttr /* function */;
}; /* size: 0x0034 */

struct ITypeMarshal
{
}; /* size: 0x0004 */

struct IUnkInner
{
}; /* size: 0x0004 */

struct IUnknown
{
}; /* size: 0x0004 */

struct IUnknownVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
}; /* size: 0x000c */

struct IUri
{
}; /* size: 0x0004 */

struct IUriBuilder
{
}; /* size: 0x0004 */

struct IUriBuilderFactory
{
}; /* size: 0x0004 */

struct IUriContainer
{
}; /* size: 0x0004 */

struct IUrlMon
{
}; /* size: 0x0004 */

struct IUserToken
{
}; /* size: 0x0004 */

struct IUserTokenWithImpersonate
{
}; /* size: 0x0004 */

struct IViewObject
{
  /* 0x0000 */ struct IViewObjectVtbl* lpVtbl;
}; /* size: 0x0004 */

struct IViewObject2
{
}; /* size: 0x0004 */

struct IViewObjectEx
{
}; /* size: 0x0004 */

struct IViewObjectVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* Draw /* function */;
  /* 0x0010 */ void* GetColorSet /* function */;
  /* 0x0014 */ void* Freeze /* function */;
  /* 0x0018 */ void* Unfreeze /* function */;
  /* 0x001c */ void* SetAdvise /* function */;
  /* 0x0020 */ void* GetAdvise /* function */;
}; /* size: 0x0024 */

struct IWaitMultiple
{
}; /* size: 0x0004 */

struct IWinInetCacheHints
{
}; /* size: 0x0004 */

struct IWinInetCacheHints2
{
}; /* size: 0x0004 */

struct IWinInetFileStream
{
}; /* size: 0x0004 */

struct IWinInetHttpInfo
{
}; /* size: 0x0004 */

struct IWinInetInfo
{
}; /* size: 0x0004 */

struct IWindowForBindingUI
{
}; /* size: 0x0004 */

struct IWrappedProtocol
{
}; /* size: 0x0004 */

struct IWrapperInfo
{
}; /* size: 0x0004 */

struct IXMLAttribute
{
}; /* size: 0x0004 */

struct IXMLDOMAttribute
{
}; /* size: 0x0004 */

struct IXMLDOMCDATASection
{
}; /* size: 0x0004 */

struct IXMLDOMCharacterData
{
}; /* size: 0x0004 */

struct IXMLDOMComment
{
}; /* size: 0x0004 */

struct IXMLDOMDocument
{
}; /* size: 0x0004 */

struct IXMLDOMDocumentFragment
{
}; /* size: 0x0004 */

struct IXMLDOMDocumentType
{
}; /* size: 0x0004 */

struct IXMLDOMElement
{
}; /* size: 0x0004 */

struct IXMLDOMEntity
{
}; /* size: 0x0004 */

struct IXMLDOMEntityReference
{
}; /* size: 0x0004 */

struct IXMLDOMImplementation
{
}; /* size: 0x0004 */

struct IXMLDOMNamedNodeMap
{
}; /* size: 0x0004 */

struct IXMLDOMNode
{
}; /* size: 0x0004 */

struct IXMLDOMNodeList
{
}; /* size: 0x0004 */

struct IXMLDOMNotation
{
}; /* size: 0x0004 */

struct IXMLDOMParseError
{
}; /* size: 0x0004 */

struct IXMLDOMProcessingInstruction
{
}; /* size: 0x0004 */

struct IXMLDOMText
{
}; /* size: 0x0004 */

struct IXMLDSOControl
{
}; /* size: 0x0004 */

struct IXMLDocument
{
}; /* size: 0x0004 */

struct IXMLDocument2
{
}; /* size: 0x0004 */

struct IXMLElement
{
}; /* size: 0x0004 */

struct IXMLElement2
{
}; /* size: 0x0004 */

struct IXMLElementCollection
{
}; /* size: 0x0004 */

struct IXMLError
{
}; /* size: 0x0004 */

struct IXMLHttpRequest
{
}; /* size: 0x0004 */

struct IXTLRuntime
{
}; /* size: 0x0004 */

struct IZoneIdentifier
{
}; /* size: 0x0004 */

struct ImgDelayDescrV2
{
  /* 0x0000 */ unsigned long grAttrs;
  /* 0x0004 */ unsigned long rvaDLLName;
  /* 0x0008 */ unsigned long rvaHmod;
  /* 0x000c */ unsigned long rvaIAT;
  /* 0x0010 */ unsigned long rvaINT;
  /* 0x0014 */ unsigned long rvaBoundIAT;
  /* 0x0018 */ unsigned long rvaUnloadIAT;
  /* 0x001c */ unsigned long dwTimeStamp;
}; /* size: 0x0020 */

class InprocActpropsUnmarshaller
{
  /* 0x0000 */ class InprocActpropsUnmarshaller _InprocActUnmarshaller;
}; /* size: 0x0004 */

class InstanceInfo
{
  /* 0x0014 */ struct tagInstanceInfoData _instanceInfoData;
  /* 0x0024 */ struct IStorage* _pstg;
}; /* size: 0x0028 */

class InstantiationInfo
{
  /* 0x0014 */ struct tagInstantiationInfoData _instantiationInfoData;
  /* 0x0044 */ struct _GUID _pIIDs[10];
}; /* size: 0x00e4 */

class Interceptor
{
  /* 0x0018 */ struct ICallFrameEvents* m_pCallSink;
  /* 0x001c */ void* const* m_pvtbl /* function */;
  /* 0x0020 */ struct MD_INTERFACE* m_pmdInterface;
  /* 0x0024 */ const struct tagCInterfaceStubHeader* m_pHeader;
  /* 0x0028 */ const struct tagProxyFileInfo** m_pProxyFileList;
  /* 0x002c */ const char* m_szInterfaceName;
  /* 0x0030 */ int m_fMdOwnsHeader;
  /* 0x0034 */ int m_fUsingTypelib;
  /* 0x0038 */ struct TYPEINFOVTBL* m_ptypeinfovtbl;
  /* 0x003c */ unsigned int m_cMethodsBase;
  /* 0x0040 */ struct ICallInterceptor* m_pBaseInterceptor;
  /* 0x0044 */ struct IUnknown* m_punkBaseInterceptor;
  /* 0x0048 */ struct MD_INTERFACE* m_pmdMostDerived;
  /* 0x004c */ struct IUnknown* m_punkOuter;
  /* 0x0050 */ long m_refs;
}; /* size: 0x0054 */

struct InterfaceWalkerFree
{
  /* 0x0004 */ struct ICallFrameWalker* m_pWalker;
}; /* size: 0x0008 */

struct InterlockedStack<CallFrame>
{
  union
  {
    struct
    {
      /* 0x0000 */ class CallFrame* m_p;
      /* 0x0004 */ unsigned long m_n;
    }; /* size: 0x0008 */
    /* 0x0000 */ __int64 dummy;
  }; /* size: 0x0008 */
}; /* size: 0x0008 */

struct InterlockedStack<DISPATCH_CLIENT_FRAME>
{
  union
  {
    struct
    {
      /* 0x0000 */ struct DISPATCH_CLIENT_FRAME* m_p;
      /* 0x0004 */ unsigned long m_n;
    }; /* size: 0x0008 */
    /* 0x0000 */ __int64 dummy;
  }; /* size: 0x0008 */
}; /* size: 0x0008 */

struct InterlockedStack<DISPATCH_SERVER_FRAME>
{
  union
  {
    struct
    {
      /* 0x0000 */ struct DISPATCH_SERVER_FRAME* m_p;
      /* 0x0004 */ unsigned long m_n;
    }; /* size: 0x0008 */
    /* 0x0000 */ __int64 dummy;
  }; /* size: 0x0008 */
}; /* size: 0x0008 */

struct InterlockedStackIndirect<CallFrame>
{
  /* 0x0008 */ struct InterlockedStack<CallFrame> stack;
}; /* size: 0x0010 */

struct InterlockedStackIndirect<DISPATCH_CLIENT_FRAME>
{
  /* 0x0008 */ struct InterlockedStack<DISPATCH_CLIENT_FRAME> stack;
}; /* size: 0x0010 */

struct InterlockedStackIndirect<DISPATCH_SERVER_FRAME>
{
  /* 0x0008 */ struct InterlockedStack<DISPATCH_SERVER_FRAME> stack;
}; /* size: 0x0010 */

struct KEY_PID_ARRAY
{
  /* 0x0000 */ void* PID;
  /* 0x0004 */ struct _UNICODE_STRING KeyName;
}; /* size: 0x000c */

enum LATENCY_TIME
{
  LT_DONT_CARE = 0,
  LT_LOWEST_LATENCY = 1,
};

struct LEGACY_FRAME
{
  /* 0x0008 */ void* m_pvArgs;
  /* 0x000c */ const unsigned long m_iMethod;
  /* 0x0010 */ int m_hrReturnValue;
  /* 0x0014 */ struct LEGACY_INTERCEPTOR* m_pInterceptor;
  /* 0x0018 */ struct ICallFrame* m_premoteFrame;
  /* 0x001c */ struct ICallFrame* m_pmemoryFrame;
  /* 0x0020 */ int m_fAfterCall;
  /* 0x0024 */ struct IUnknown* m_punkOuter;
  /* 0x0028 */ long m_refs;
}; /* size: 0x002c */

struct LEGACY_INTERCEPTOR
{
  /* 0x0020 */ struct ICallFrameEvents* m_psink;
  /* 0x0024 */ struct _GUID m_iid;
  /* 0x0034 */ unsigned long m_cMethods;
  /* 0x0038 */ struct XLOCK_LEAF m_frameLock;
  /* 0x0054 */ struct ICallFrame** m_ppframeCustomer;
  /* 0x0058 */ struct ICallInterceptor* m_premoteInterceptor;
  /* 0x005c */ int m_fRegdWithRemoteInterceptor;
  /* 0x0060 */ struct ICallInterceptor* m_pmemoryInterceptor;
  /* 0x0064 */ int m_fRegdWithMemoryInterceptor;
  /* 0x0068 */ struct MD_INTERFACE* m_pmdMostDerived;
  /* 0x006c */ struct IUnknown* m_punkOuter;
  /* 0x0070 */ long m_refs;
  /* 0x0074 */ int m_fShuttingDown;
}; /* size: 0x0078 */

struct LIST_ENTRY32
{
  /* 0x0000 */ unsigned long Flink;
  /* 0x0004 */ unsigned long Blink;
}; /* size: 0x0008 */

struct LIST_ENTRY64
{
  /* 0x0000 */ unsigned __int64 Flink;
  /* 0x0008 */ unsigned __int64 Blink;
}; /* size: 0x0010 */

enum LSA_FOREST_TRUST_RECORD_TYPE
{
  ForestTrustTopLevelName = 0,
  ForestTrustTopLevelNameEx = 1,
  ForestTrustDomainInfo = 2,
  ForestTrustRecordTypeLast = 2,
};

struct LocalThis
{
  /* 0x0000 */ unsigned long flags;
  /* 0x0004 */ unsigned long client_thread;
}; /* size: 0x0008 */

struct LockCookie
{
  /* 0x0000 */ unsigned long dwFlags;
  /* 0x0004 */ unsigned long dwWriterSeqNum;
  /* 0x0008 */ unsigned short wReaderLevel;
  /* 0x000a */ unsigned short wWriterLevel;
  /* 0x000c */ unsigned long dwThreadID;
}; /* size: 0x0010 */

class LockEntry
{
  /* 0x0000 */ class LockEntry* _pNext;
  /* 0x0004 */ class LockEntry* _pPrev;
  /* 0x0008 */ class CRWLock* _pRWLock;
  /* 0x000c */ unsigned short _wReaderLevel;
}; /* size: 0x0010 */

enum MACPICTFAILUREREASONS
{
  MACPICTUNSUPPORTED = 0,
  MACPICTCONVERSIONDLLNOTFOUND = 1,
};

class MAP<XSLOCK,MAP_KEY_GUID,INTERFACE_HELPER_CLSID *>
{
  /* 0x0004 */ class XSLOCK m_lock;
  /* 0x004c */ class Map<MAP_KEY_GUID,INTERFACE_HELPER_CLSID *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow> m_map;
  /* 0x0064 */ int m_fCsInitialized;
}; /* size: 0x0068 */

class MAP<XSLOCK,MAP_KEY_GUID,INTERFACE_HELPER_CLSID *>::iterator
{
  /* 0x0000 */ class EnumMap<MAP_KEY_GUID,INTERFACE_HELPER_CLSID *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow> m_enum;
  /* 0x000c */ int m_fDone;
  /* 0x0010 */ class MAP_KEY_GUID* m_pkey;
  /* 0x0014 */ struct INTERFACE_HELPER_CLSID** m_pvalue;
  /* 0x0018 */ class Map<MAP_KEY_GUID,INTERFACE_HELPER_CLSID *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>* m_pmap;
}; /* size: 0x001c */

class MAP<XSLOCK,MAP_KEY_GUID,MD_INTERFACE *>
{
  /* 0x0004 */ class XSLOCK m_lock;
  /* 0x004c */ class Map<MAP_KEY_GUID,MD_INTERFACE *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow> m_map;
  /* 0x0064 */ int m_fCsInitialized;
}; /* size: 0x0068 */

class MAP<XSLOCK,MAP_KEY_GUID,MD_INTERFACE *>::iterator;

class MAP<XSLOCK,MAP_KEY_GUID,TYPEINFOVTBL *>
{
  /* 0x0004 */ class XSLOCK m_lock;
  /* 0x004c */ class Map<MAP_KEY_GUID,TYPEINFOVTBL *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow> m_map;
  /* 0x0064 */ int m_fCsInitialized;
}; /* size: 0x0068 */

class MAP<XSLOCK,MAP_KEY_GUID,TYPEINFOVTBL *>::iterator
{
  /* 0x0000 */ class EnumMap<MAP_KEY_GUID,TYPEINFOVTBL *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow> m_enum;
  /* 0x000c */ int m_fDone;
  /* 0x0010 */ class MAP_KEY_GUID* m_pkey;
  /* 0x0014 */ struct TYPEINFOVTBL** m_pvalue;
  /* 0x0018 */ class Map<MAP_KEY_GUID,TYPEINFOVTBL *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>* m_pmap;
}; /* size: 0x001c */

enum MAPPED_STREAM_OPTS
{
  MAPPED_STREAM_CREATE = 0,
  MAPPED_STREAM_QI = 1,
};

struct MAP_HASHER<MAP_KEY_GUID>
{
}; /* size: 0x0001 */

class MAP_KEY_GUID
{
  /* 0x0000 */ struct _GUID guid;
}; /* size: 0x0010 */

struct MAP_SHARED<MAP_KEY_GUID,INTERFACE_HELPER_CLSID *>
{
}; /* size: 0x0068 */

struct MAP_SHARED<MAP_KEY_GUID,MD_INTERFACE *>
{
}; /* size: 0x0068 */

struct MAP_SHARED<MAP_KEY_GUID,TYPEINFOVTBL *>
{
}; /* size: 0x0068 */

struct MARK_HANDLE_INFO
{
  /* 0x0000 */ unsigned long UsnSourceInfo;
  /* 0x0004 */ void* VolumeHandle;
  /* 0x0008 */ unsigned long HandleInfo;
}; /* size: 0x000c */

enum MCA_EXCEPTION_TYPE
{
  HAL_MCE_RECORD = 0,
  HAL_MCA_RECORD = 1,
};

struct MD_INTERFACE
{
  /* 0x0000 */ volatile long m_refs;
  /* 0x0004 */ unsigned long m_cMethods;
  /* 0x0008 */ unsigned long m_cMethodsInBaseInterface;
  /* 0x000c */ struct MD_METHOD* m_rgMethodsAlloc;
  /* 0x0010 */ struct MD_METHOD* m_rgMethods;
  /* 0x0014 */ struct MD_PARAM* m_rgParams;
  /* 0x0018 */ int m_fFreeInfoOnRelease;
  /* 0x001c */ int m_fDerivesFromIDispatch;
  /* 0x0020 */ const struct tagCInterfaceStubHeader* m_pHeader;
  /* 0x0024 */ const char* m_szInterfaceName;
  /* 0x0028 */ struct MD_INTERFACE_CACHE* m_pcache;
}; /* size: 0x002c */

struct MD_INTERFACE_CACHE
{
}; /* size: 0x0068 */

struct MD_METHOD
{
  /* 0x0000 */ unsigned long m_numberOfParams;
  /* 0x0004 */ struct PARAM_DESCRIPTION* m_params;
  /* 0x0008 */ struct INTERPRETER_OPT_FLAGS m_optFlags;
  /* 0x000c */ unsigned long m_rpcFlags;
  /* 0x0010 */ const struct _MIDL_STUB_DESC* m_pStubDesc;
  /* 0x0014 */ unsigned long m_cbPushedByCaller;
  /* 0x0018 */ unsigned short m_cbClientBuffer;
  /* 0x001a */ unsigned short m_cbServerBuffer;
  /* 0x001c */ unsigned long m_cbStackInclRet;
  /* 0x0020 */ struct __MIDL_ICallFrame_0001 m_info;
  /* 0x005c */ int m_fCanShareAllParameters;
  /* 0x0060 */ const struct tagCInterfaceStubHeader* m_pHeader;
  /* 0x0064 */ unsigned long m_iMethod;
  /* 0x0068 */ struct MD_INTERFACE* m_pmdInterface;
  /* 0x006c */ struct MD_PARAM* m_rgParams;
  /* 0x0070 */ wchar_t* m_wszMethodName;
  /* 0x0074 */ struct NDR_PROC_HEADER_EXTS* m_pHeaderExts;
}; /* size: 0x0078 */

struct MD_PARAM
{
  /* 0x0000 */ int m_fCanShare;
  /* 0x0004 */ int m_fMayHaveInterfacePointers;
}; /* size: 0x0008 */

struct MEMSTM
{
  /* 0x0000 */ unsigned long cb;
  /* 0x0004 */ unsigned long cRef;
  /* 0x0008 */ unsigned char* m_pBuf;
  /* 0x000c */ void* hGlobal;
  /* 0x0010 */ int fDeleteOnRelease;
}; /* size: 0x0014 */

struct MENUITEMTEMPLATE
{
  /* 0x0000 */ unsigned short mtOption;
  /* 0x0002 */ unsigned short mtID;
  /* 0x0004 */ wchar_t mtString[1];
}; /* size: 0x0006 */

struct MENUITEMTEMPLATEHEADER
{
  /* 0x0000 */ unsigned short versionNumber;
  /* 0x0002 */ unsigned short offset;
}; /* size: 0x0004 */

struct METHOD_DESCRIPTOR
{
  /* 0x0000 */ wchar_t* m_szMethodName;
  /* 0x0004 */ short m_cParams;
  /* 0x0008 */ unsigned short* m_paramVTs;
}; /* size: 0x000c */

struct MFT_ENUM_DATA
{
  /* 0x0000 */ unsigned __int64 StartFileReferenceNumber;
  /* 0x0008 */ __int64 LowUsn;
  /* 0x0010 */ __int64 HighUsn;
}; /* size: 0x0018 */

class MIDEntry
{
  /* 0x0000 */ struct SStringHashNode _Node;
  /* 0x0010 */ unsigned __int64 _mid;
  /* 0x0018 */ unsigned long _cRefs;
  /* 0x001c */ unsigned long _dwFlags;
}; /* size: 0x0020 */

enum MIDL_ES_CODE
{
  MES_ENCODE = 0,
  MES_DECODE = 1,
  MES_ENCODE_NDR64 = 2,
};

enum MIDL_ES_HANDLE_STYLE
{
  MES_INCREMENTAL_HANDLE = 0,
  MES_FIXED_BUFFER_HANDLE = 1,
  MES_DYNAMIC_BUFFER_HANDLE = 2,
};

struct MINIDUMP_EXCEPTION_STREAM
{
  /* 0x0000 */ unsigned int ThreadId;
  /* 0x0004 */ unsigned int __alignment;
  /* 0x0008 */ struct _MINIDUMP_EXCEPTION ExceptionRecord;
  /* 0x00a0 */ struct _MINIDUMP_LOCATION_DESCRIPTOR ThreadContext;
}; /* size: 0x00a8 */

struct MIPID
{
  /* 0x0000 */ unsigned __int64 mid;
  /* 0x0008 */ struct _GUID ipid;
  /* 0x0018 */ unsigned long dwApt;
  /* 0x001c */ long __PADDING__[1];
}; /* size: 0x0020 */

struct MOVE_FILE_DATA
{
  /* 0x0000 */ void* FileHandle;
  /* 0x0008 */ union _LARGE_INTEGER StartingVcn;
  /* 0x0010 */ union _LARGE_INTEGER StartingLcn;
  /* 0x0018 */ unsigned long ClusterCount;
  /* 0x001c */ long __PADDING__[1];
}; /* size: 0x0020 */

struct MOVE_FILE_RECORD_DATA
{
  /* 0x0000 */ void* FileHandle;
  /* 0x0008 */ union _LARGE_INTEGER SourceFileRecord;
  /* 0x0010 */ union _LARGE_INTEGER TargetFileRecord;
}; /* size: 0x0018 */

class Map<MAP_KEY_GUID,INTERFACE_HELPER_CLSID *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>
{
  /* 0x0000 */ class Map<MAP_KEY_GUID,INTERFACE_HELPER_CLSID *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>::Assoc** m_rgpAssoc;
  /* 0x0004 */ unsigned int m_cAssoc;
  /* 0x0008 */ unsigned int m_cPresent;
  /* 0x000c */ class Map<MAP_KEY_GUID,INTERFACE_HELPER_CLSID *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>::Assoc* m_pAssocFree;
  /* 0x0010 */ class CListHeader m_listInUse;
}; /* size: 0x0018 */

class Map<MAP_KEY_GUID,INTERFACE_HELPER_CLSID *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>::Assoc
{
  /* 0x0008 */ class Map<MAP_KEY_GUID,INTERFACE_HELPER_CLSID *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>::Assoc* m_pAssocNext;
  /* 0x000c */ long m_lcUse;
  /* 0x0010 */ class MAP_KEY_GUID m_d;
  /* 0x0020 */ struct INTERFACE_HELPER_CLSID* m_r;
}; /* size: 0x0024 */

class Map<MAP_KEY_GUID,MD_INTERFACE *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>
{
  /* 0x0000 */ class Map<MAP_KEY_GUID,MD_INTERFACE *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>::Assoc** m_rgpAssoc;
  /* 0x0004 */ unsigned int m_cAssoc;
  /* 0x0008 */ unsigned int m_cPresent;
  /* 0x000c */ class Map<MAP_KEY_GUID,MD_INTERFACE *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>::Assoc* m_pAssocFree;
  /* 0x0010 */ class CListHeader m_listInUse;
}; /* size: 0x0018 */

class Map<MAP_KEY_GUID,MD_INTERFACE *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>::Assoc
{
  /* 0x0008 */ class Map<MAP_KEY_GUID,MD_INTERFACE *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>::Assoc* m_pAssocNext;
  /* 0x000c */ long m_lcUse;
  /* 0x0010 */ class MAP_KEY_GUID m_d;
  /* 0x0020 */ struct MD_INTERFACE* m_r;
}; /* size: 0x0024 */

class Map<MAP_KEY_GUID,TYPEINFOVTBL *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>
{
  /* 0x0000 */ class Map<MAP_KEY_GUID,TYPEINFOVTBL *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>::Assoc** m_rgpAssoc;
  /* 0x0004 */ unsigned int m_cAssoc;
  /* 0x0008 */ unsigned int m_cPresent;
  /* 0x000c */ class Map<MAP_KEY_GUID,TYPEINFOVTBL *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>::Assoc* m_pAssocFree;
  /* 0x0010 */ class CListHeader m_listInUse;
}; /* size: 0x0018 */

class Map<MAP_KEY_GUID,TYPEINFOVTBL *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>::Assoc
{
  /* 0x0008 */ class Map<MAP_KEY_GUID,TYPEINFOVTBL *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>::Assoc* m_pAssocNext;
  /* 0x000c */ long m_lcUse;
  /* 0x0010 */ class MAP_KEY_GUID m_d;
  /* 0x0020 */ struct TYPEINFOVTBL* m_r;
}; /* size: 0x0024 */

class MapEnumToSQMData<enum Ole32SQMFlags>
{
}; /* size: 0x0001 */

typedef enum _TAG_UNNAMED_29
{
  DataID = 2343,
} TAG_UNNAMED_29, *PTAG_UNNAMED_29;

class MapEnumToSQMData<enum RpcssSQMFlags>
{
}; /* size: 0x0001 */

typedef enum _TAG_UNNAMED_30
{
  DataID = 2342,
} TAG_UNNAMED_30, *PTAG_UNNAMED_30;

struct MarshalParams
{
  /* 0x0000 */ struct _GUID iid;
  /* 0x0010 */ unsigned long mshlflags;
}; /* size: 0x0014 */

struct MarshallingChannel
{
  /* 0x000c */ struct IMarshallingManager* m_pMarshaller;
  /* 0x0010 */ unsigned long m_dwDestContext;
  /* 0x0014 */ void* m_pvDestContext;
  /* 0x0018 */ struct IUnknown* m_punkOuter;
  /* 0x001c */ long m_refs;
}; /* size: 0x0020 */

enum NCIFLAGS
{
  NCI_HAVECLSID = 1,
  NCI_HAVEPROGID = 2,
};

struct NCryptKeyName
{
  /* 0x0000 */ wchar_t* pszName;
  /* 0x0004 */ wchar_t* pszAlgid;
  /* 0x0008 */ unsigned long dwLegacyKeySpec;
  /* 0x000c */ unsigned long dwFlags;
}; /* size: 0x0010 */

struct NCryptProviderName
{
  /* 0x0000 */ wchar_t* pszName;
  /* 0x0004 */ wchar_t* pszComment;
}; /* size: 0x0008 */

struct NDR_ALLOC_ALL_NODES_CONTEXT;

struct NDR_POINTER_QUEUE_STATE;

struct NDR_PROC_HEADER_EXTS
{
  /* 0x0000 */ unsigned char Size;
  /* 0x0001 */ struct INTERPRETER_OPT_FLAGS2 Flags2;
  /* 0x0002 */ unsigned short ClientCorrHint;
  /* 0x0004 */ unsigned short ServerCorrHint;
  /* 0x0006 */ unsigned short NotifyIndex;
}; /* size: 0x0008 */

struct NET_ADDRESS_INFO_;

struct NOTIFY_USER_POWER_SETTING
{
  /* 0x0000 */ struct _GUID Guid;
}; /* size: 0x0010 */

struct NTFS_EXTENDED_VOLUME_DATA
{
  /* 0x0000 */ unsigned long ByteCount;
  /* 0x0004 */ unsigned short MajorVersion;
  /* 0x0006 */ unsigned short MinorVersion;
}; /* size: 0x0008 */

struct NTFS_FILE_RECORD_INPUT_BUFFER
{
  /* 0x0000 */ union _LARGE_INTEGER FileReferenceNumber;
}; /* size: 0x0008 */

struct NTFS_FILE_RECORD_OUTPUT_BUFFER
{
  /* 0x0000 */ union _LARGE_INTEGER FileReferenceNumber;
  /* 0x0008 */ unsigned long FileRecordLength;
  /* 0x000c */ unsigned char FileRecordBuffer[1];
  /* 0x000d */ char __PADDING__[3];
}; /* size: 0x0010 */

struct NTFS_VOLUME_DATA_BUFFER
{
  /* 0x0000 */ union _LARGE_INTEGER VolumeSerialNumber;
  /* 0x0008 */ union _LARGE_INTEGER NumberSectors;
  /* 0x0010 */ union _LARGE_INTEGER TotalClusters;
  /* 0x0018 */ union _LARGE_INTEGER FreeClusters;
  /* 0x0020 */ union _LARGE_INTEGER TotalReserved;
  /* 0x0028 */ unsigned long BytesPerSector;
  /* 0x002c */ unsigned long BytesPerCluster;
  /* 0x0030 */ unsigned long BytesPerFileRecordSegment;
  /* 0x0034 */ unsigned long ClustersPerFileRecordSegment;
  /* 0x0038 */ union _LARGE_INTEGER MftValidDataLength;
  /* 0x0040 */ union _LARGE_INTEGER MftStartLcn;
  /* 0x0048 */ union _LARGE_INTEGER Mft2StartLcn;
  /* 0x0050 */ union _LARGE_INTEGER MftZoneStart;
  /* 0x0058 */ union _LARGE_INTEGER MftZoneEnd;
}; /* size: 0x0060 */

struct NUMPARSE
{
  /* 0x0000 */ int cDig;
  /* 0x0004 */ unsigned long dwInFlags;
  /* 0x0008 */ unsigned long dwOutFlags;
  /* 0x000c */ int cchUsed;
  /* 0x0010 */ int nBaseShift;
  /* 0x0014 */ int nPwr10;
}; /* size: 0x0018 */

struct NdrStringHeader
{
  /* 0x0000 */ unsigned long dwMax;
  /* 0x0004 */ unsigned long dwOffset;
  /* 0x0008 */ unsigned long dwActual;
}; /* size: 0x000c */

struct NdrStringPtrHeader
{
  /* 0x0000 */ unsigned long dwUnique;
  /* 0x0004 */ unsigned long dwMax;
  /* 0x0008 */ unsigned long dwOffset;
  /* 0x000c */ unsigned long dwActual;
}; /* size: 0x0010 */

class NuSafeNtHandle
{
  /* 0x0000 */ void* _handle;
}; /* size: 0x0004 */

struct OAUTIL
{
  /* 0x0000 */ struct ICallFrameWalker* m_pWalkerCopy;
  /* 0x0004 */ struct ICallFrameWalker* m_pWalkerFree;
  /* 0x0008 */ struct ICallFrameWalker* m_pWalkerWalk;
  /* 0x000c */ int m_fWorkingOnInParam;
  /* 0x0010 */ int m_fWorkingOnOutParam;
  /* 0x0014 */ int m_fDoNotWalkInterfaces;
}; /* size: 0x0018 */

struct OLEAUTOMATION_FUNCTIONS
{
  /* 0x0000 */ struct HINSTANCE__* hOleAut32;
  /* 0x0004 */ int fProcAddressesLoaded;
  /* 0x0008 */ struct _USER_MARSHAL_ROUTINE_QUADRUPLE UserMarshalRoutines[3];
}; /* size: 0x0038 */

typedef enum _TAG_UNNAMED_31
{
  UserMarshal_Index_BSTR = 0,
  UserMarshal_Index_VARIANT = 1,
  UserMarshal_Index_SafeArray = 2,
} TAG_UNNAMED_31, *PTAG_UNNAMED_31;

struct OLEAUTOMATION_FUNCTIONS::IsEqualPfn::__l11::THUNK
{
  /* 0x0000 */ unsigned char jmp[2];
  /* 0x0002 */ void** ppfn /* function */;
}; /* size: 0x0006 */

enum OLE_NOTIFICATION
{
  OLE_CHANGED = 0,
  OLE_SAVED = 1,
  OLE_CLOSED = 2,
  OLE_RENAMED = 3,
};

enum OLE_TRISTATE
{
  triUnchecked = 0,
  triChecked = 1,
  triGray = 2,
};

class OPAQUE_HANDLE<1>
{
  /* 0x0000 */ unsigned long m_h;
}; /* size: 0x0004 */

struct ORPC_DBG_ALL
{
  /* 0x0000 */ unsigned char* pSignature;
  /* 0x0004 */ struct tagRPCOLEMESSAGE* pMessage;
  /* 0x0008 */ const struct _GUID* refiid;
  /* 0x000c */ struct IRpcChannelBuffer* pChannel;
  /* 0x0010 */ struct IUnknown* pUnkProxyMgr;
  /* 0x0014 */ void* pInterface;
  /* 0x0018 */ struct IUnknown* pUnkObject;
  /* 0x001c */ HRESULT hresult;
  /* 0x0020 */ void* pvBuffer;
  /* 0x0024 */ unsigned long cbBuffer;
  /* 0x0028 */ unsigned long* lpcbBuffer;
  /* 0x002c */ void* reserved;
}; /* size: 0x0030 */

struct ORPC_INIT_ARGS
{
  /* 0x0000 */ struct IOrpcDebugNotify* lpIntfOrpcDebug;
  /* 0x0004 */ void* pvPSN;
  /* 0x0008 */ unsigned long dwReserved1;
  /* 0x000c */ unsigned long dwReserved2;
}; /* size: 0x0010 */

class OXIDEntry
{
  union
  {
    struct
    {
      /* 0x0000 */ class OXIDEntry* _pNext;
      /* 0x0004 */ class OXIDEntry* _pPrev;
      /* 0x0008 */ unsigned long _dwPid;
      /* 0x000c */ unsigned long _dwTid;
      /* 0x0010 */ struct _GUID _moxid;
      /* 0x0020 */ unsigned __int64 _mid;
      /* 0x0028 */ struct _GUID _ipidRundown;
      /* 0x0038 */ unsigned long _dwFlags;
      /* 0x003c */ struct HWND__* _hServerSTA;
      /* 0x0040 */ class CComApartment* _pParentApt;
      /* 0x0044 */ class CChannelHandle* volatile _pRpc;
      /* 0x0048 */ void* _pAuthId;
      /* 0x004c */ struct tagDUALSTRINGARRAY* _pBinding;
      /* 0x0050 */ unsigned long _dwAuthnHint;
      /* 0x0054 */ unsigned long _dwAuthnSvc;
      /* 0x0058 */ class MIDEntry* _pMIDEntry;
      /* 0x005c */ struct IRemUnknown* _pRUSTA;
      /* 0x0060 */ long _cRefs;
      /* 0x0064 */ void* _hComplete;
      /* 0x0068 */ long _cCalls;
      /* 0x006c */ long _cResolverRef;
      /* 0x0070 */ unsigned long _dwExpiredTime;
      /* 0x0074 */ struct tagCOMVERSION _version;
      /* 0x0078 */ unsigned long _ulMarshaledTargetInfoLength;
      /* 0x007c */ unsigned char* _pMarshaledTargetInfo;
    }; /* size: 0x0080 */
    /* 0x0000 */ class CPageAllocator _palloc;
  }; /* size: 0x0080 */
}; /* size: 0x0080 */

struct ObjectSplayNode
{
  /* 0x0000 */ struct _RTL_SPLAY_LINKS SplayLinks;
  /* 0x000c */ void* pvObject;
  /* 0x0010 */ void* pvVtblTracking;
}; /* size: 0x0014 */

enum OfflineFolderStatus
{
  OFS_INACTIVE = -1,
  OFS_ONLINE = 0,
  OFS_OFFLINE = 1,
  OFS_SERVERBACK = 2,
  OFS_DIRTYCACHE = 3,
};

enum Ole32SQMFlags
{
  SixteenbitOLEUsage = 1,
  OLEDDEUsage = 2,
};

class OleThunkWOW
{
}; /* size: 0x0004 */

class OpaqueDataInfo
{
  /* 0x0014 */ unsigned long _cOpaqueData;
  /* 0x0018 */ unsigned long _dwCollSize;
  /* 0x001c */ struct tagOpaqueData* _pOpaqueData;
  /* 0x0020 */ void* _pAct;
}; /* size: 0x0024 */

struct PARAM_ATTRIBUTES
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned short MustSize : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned short MustFree : 1; /* bit position: 1 */
    /* 0x0000 */ unsigned short IsPipe : 1; /* bit position: 2 */
    /* 0x0000 */ unsigned short IsIn : 1; /* bit position: 3 */
    /* 0x0000 */ unsigned short IsOut : 1; /* bit position: 4 */
    /* 0x0000 */ unsigned short IsReturn : 1; /* bit position: 5 */
    /* 0x0000 */ unsigned short IsBasetype : 1; /* bit position: 6 */
    /* 0x0000 */ unsigned short IsByValue : 1; /* bit position: 7 */
    /* 0x0000 */ unsigned short IsSimpleRef : 1; /* bit position: 8 */
    /* 0x0000 */ unsigned short IsDontCallFreeInst : 1; /* bit position: 9 */
    /* 0x0000 */ unsigned short SaveForAsyncFinish : 1; /* bit position: 10 */
    /* 0x0000 */ unsigned short IsPartialIgnore : 1; /* bit position: 11 */
    /* 0x0000 */ unsigned short IsForceAllocate : 1; /* bit position: 12 */
    /* 0x0000 */ unsigned short ServerAllocSize : 3; /* bit position: 13 */
  }; /* bitfield */
}; /* size: 0x0002 */

struct PARAM_DESCRIPTION
{
  /* 0x0000 */ struct PARAM_ATTRIBUTES ParamAttr;
  /* 0x0002 */ unsigned short StackOffset;
  union
  {
    /* 0x0004 */ unsigned short TypeOffset;
    struct
    {
      /* 0x0004 */ unsigned char Type;
      /* 0x0005 */ unsigned char Unused;
    } /* size: 0x0002 */ SimpleType;
  }; /* size: 0x0002 */
}; /* size: 0x0006 */

enum PATH_TYPE
{
  PATH_TYPE_UNKNOWN = 0,
  PATH_TYPE_UNC_ABSOLUTE = 1,
  PATH_TYPE_LOCAL_DEVICE = 2,
  PATH_TYPE_ROOT_LOCAL_DEVICE = 3,
  PATH_TYPE_DRIVE_ABSOLUTE = 4,
  PATH_TYPE_DRIVE_RELATIVE = 5,
  PATH_TYPE_ROOTED = 6,
  PATH_TYPE_RELATIVE = 7,
};

class PBasicEntry
{
  /* 0x0000 */ unsigned long _sig;
  /* 0x0004 */ long _cReferences;
  /* 0x0008 */ const unsigned long _dl;
}; /* size: 0x000c */

class PDeSerStream;

class PDocFile
{
}; /* size: 0x000c */

struct PICTINFO
{
  /* 0x0000 */ void* hmf;
  /* 0x0004 */ struct tagRECT bbox;
  /* 0x0014 */ unsigned short inch;
  /* 0x0016 */ char __PADDING__[2];
}; /* size: 0x0018 */

enum PIDMSI_STATUS_VALUE
{
  PIDMSI_STATUS_NORMAL = 0,
  PIDMSI_STATUS_NEW = 1,
  PIDMSI_STATUS_PRELIM = 2,
  PIDMSI_STATUS_DRAFT = 3,
  PIDMSI_STATUS_INPROGRESS = 4,
  PIDMSI_STATUS_EDIT = 5,
  PIDMSI_STATUS_REVIEW = 6,
  PIDMSI_STATUS_PROOF = 7,
  PIDMSI_STATUS_FINAL = 8,
  PIDMSI_STATUS_OTHER = 32767,
};

enum PIPE_ATTRIBUTE_TYPE
{
  PipeAttribute = 0,
  PipeConnectionAttribute = 1,
  PipeHandleAttribute = 2,
};

class PMSIHANDLE
{
  /* 0x0000 */ unsigned long m_h;
}; /* size: 0x0004 */

class PMemoryAllocator
{
}; /* size: 0x0004 */

struct POSTRELRIFREF
{
  /* 0x0008 */ long cRefs;
  /* 0x000c */ class OXIDEntry* pOXIDEntry;
  /* 0x0010 */ struct IRemUnknown* pRemUnk;
  /* 0x0014 */ struct IUnknown* pAsyncRelease;
  /* 0x0018 */ unsigned short cRifRef;
  /* 0x001c */ struct tagREMINTERFACEREF arRifRef;
}; /* size: 0x0034 */

struct POWERBROADCAST_SETTING
{
  /* 0x0000 */ struct _GUID PowerSetting;
  /* 0x0010 */ unsigned long DataLength;
  /* 0x0014 */ unsigned char Data[1];
  /* 0x0015 */ char __PADDING__[3];
}; /* size: 0x0018 */

enum POWER_ACTION
{
  PowerActionNone = 0,
  PowerActionReserved = 1,
  PowerActionSleep = 2,
  PowerActionHibernate = 3,
  PowerActionShutdown = 4,
  PowerActionShutdownReset = 5,
  PowerActionShutdownOff = 6,
  PowerActionWarmEject = 7,
};

struct POWER_ACTION_POLICY
{
  /* 0x0000 */ enum POWER_ACTION Action;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ unsigned long EventCode;
}; /* size: 0x000c */

enum POWER_INFORMATION_LEVEL
{
  SystemPowerPolicyAc = 0,
  SystemPowerPolicyDc = 1,
  VerifySystemPolicyAc = 2,
  VerifySystemPolicyDc = 3,
  SystemPowerCapabilities = 4,
  SystemBatteryState = 5,
  SystemPowerStateHandler = 6,
  ProcessorStateHandler = 7,
  SystemPowerPolicyCurrent = 8,
  AdministratorPowerPolicy = 9,
  SystemReserveHiberFile = 10,
  ProcessorInformation = 11,
  SystemPowerInformation = 12,
  ProcessorStateHandler2 = 13,
  LastWakeTime = 14,
  LastSleepTime = 15,
  SystemExecutionState = 16,
  SystemPowerStateNotifyHandler = 17,
  ProcessorPowerPolicyAc = 18,
  ProcessorPowerPolicyDc = 19,
  VerifyProcessorPowerPolicyAc = 20,
  VerifyProcessorPowerPolicyDc = 21,
  ProcessorPowerPolicyCurrent = 22,
  SystemPowerStateLogging = 23,
  SystemPowerLoggingEntry = 24,
  SetPowerSettingValue = 25,
  NotifyUserPowerSetting = 26,
  GetPowerTransitionVetoes = 27,
  SetPowerTransitionVeto = 28,
  SystemVideoState = 29,
  TraceApplicationPowerMessage = 30,
  TraceApplicationPowerMessageEnd = 31,
  ProcessorPerfStates = 32,
  ProcessorIdleStates = 33,
  ProcessorThrottleStates = 34,
  SystemWakeSource = 35,
  SystemHiberFileInformation = 36,
  TraceServicePowerMessage = 37,
  ProcessorLoad = 38,
  PowerShutdownNotification = 39,
  MonitorCapabilities = 40,
};

enum POWER_PLATFORM_ROLE
{
  PlatformRoleUnspecified = 0,
  PlatformRoleDesktop = 1,
  PlatformRoleMobile = 2,
  PlatformRoleWorkstation = 3,
  PlatformRoleEnterpriseServer = 4,
  PlatformRoleSOHOServer = 5,
  PlatformRoleAppliancePC = 6,
  PlatformRolePerformanceServer = 7,
  PlatformRoleMaximum = 8,
};

struct POWER_STATE_HANDLER
{
  /* 0x0000 */ enum POWER_STATE_HANDLER_TYPE Type;
  /* 0x0004 */ unsigned char RtcWake;
  /* 0x0005 */ unsigned char Spare[3];
  /* 0x0008 */ void* Handler /* function */;
  /* 0x000c */ void* Context;
}; /* size: 0x0010 */

enum POWER_STATE_HANDLER_TYPE
{
  PowerStateSleeping1 = 0,
  PowerStateSleeping2 = 1,
  PowerStateSleeping3 = 2,
  PowerStateSleeping4 = 3,
  PowerStateShutdownOff = 4,
  PowerStateShutdownReset = 5,
  PowerStateSleeping4Firmware = 6,
  PowerStateMaximum = 7,
};

struct POWER_STATE_NOTIFY_HANDLER
{
  /* 0x0000 */ void* Handler /* function */;
  /* 0x0004 */ void* Context;
}; /* size: 0x0008 */

enum PO_FIXED_WAKE_SOURCE_TYPE
{
  FixedWakeSourcePowerButton = 0,
  FixedWakeSourceSleepButton = 1,
  FixedWakeSourceRtc = 2,
};

enum PO_WAKE_SOURCE_TYPE
{
  DeviceWakeSourceType = 0,
  FixedWakeSourceType = 1,
};

struct PPM_IDLESTATE_EVENT
{
  /* 0x0000 */ unsigned long NewState;
  /* 0x0004 */ unsigned long OldState;
  /* 0x0008 */ unsigned __int64 Processors;
}; /* size: 0x0010 */

struct PPM_IDLE_ACCOUNTING
{
  /* 0x0000 */ unsigned long StateCount;
  /* 0x0004 */ unsigned long TotalTransitions;
  /* 0x0008 */ unsigned long ResetCount;
  /* 0x0010 */ unsigned __int64 StartTime;
  /* 0x0018 */ struct PPM_IDLE_STATE_ACCOUNTING State[1];
}; /* size: 0x0048 */

struct PPM_IDLE_STATE_ACCOUNTING
{
  /* 0x0000 */ unsigned long IdleTransitions;
  /* 0x0004 */ unsigned long FailedTransitions;
  /* 0x0008 */ unsigned long InvalidBucketIndex;
  /* 0x0010 */ unsigned __int64 TotalTime;
  /* 0x0018 */ unsigned long IdleTimeBuckets[6];
}; /* size: 0x0030 */

struct PPM_PERFSTATE_DOMAIN_EVENT
{
  /* 0x0000 */ unsigned long State;
  /* 0x0004 */ unsigned long Latency;
  /* 0x0008 */ unsigned long Speed;
  /* 0x0010 */ unsigned __int64 Processors;
}; /* size: 0x0018 */

struct PPM_PERFSTATE_EVENT
{
  /* 0x0000 */ unsigned long State;
  /* 0x0004 */ unsigned long Status;
  /* 0x0008 */ unsigned long Latency;
  /* 0x000c */ unsigned long Speed;
  /* 0x0010 */ unsigned long Processor;
}; /* size: 0x0014 */

struct PPM_SIMULATED_PROCESSOR_LOAD
{
  /* 0x0000 */ unsigned char Enabled;
  /* 0x0001 */ unsigned char PercentBusy[32];
}; /* size: 0x0021 */

struct PPM_THERMALCHANGE_EVENT
{
  /* 0x0000 */ unsigned long ThermalConstraint;
  /* 0x0008 */ unsigned __int64 Processors;
}; /* size: 0x0010 */

struct PPM_THERMAL_POLICY_EVENT
{
  /* 0x0000 */ unsigned char Mode;
  /* 0x0008 */ unsigned __int64 Processors;
}; /* size: 0x0010 */

struct PPM_WMI_IDLE_STATE
{
  /* 0x0000 */ unsigned long Latency;
  /* 0x0004 */ unsigned long Power;
  /* 0x0008 */ unsigned long TimeCheck;
  /* 0x000c */ unsigned char PromotePercent;
  /* 0x000d */ unsigned char DemotePercent;
  /* 0x000e */ unsigned char StateType;
  /* 0x000f */ unsigned char Reserved;
  /* 0x0010 */ unsigned long StateFlags;
  /* 0x0014 */ unsigned long Context;
  /* 0x0018 */ unsigned long IdleHandler;
  /* 0x001c */ unsigned long Reserved1;
}; /* size: 0x0020 */

struct PPM_WMI_IDLE_STATES
{
  /* 0x0000 */ unsigned long Type;
  /* 0x0004 */ unsigned long Count;
  /* 0x0008 */ unsigned long TargetState;
  /* 0x000c */ unsigned long OldState;
  /* 0x0010 */ unsigned __int64 TargetProcessors;
  /* 0x0018 */ struct PPM_WMI_IDLE_STATE State[1];
}; /* size: 0x0038 */

struct PPM_WMI_LEGACY_PERFSTATE
{
  /* 0x0000 */ unsigned long Frequency;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ unsigned long PercentFrequency;
}; /* size: 0x000c */

struct PPM_WMI_PERF_STATE
{
  /* 0x0000 */ unsigned long Frequency;
  /* 0x0004 */ unsigned long Power;
  /* 0x0008 */ unsigned char PercentFrequency;
  /* 0x0009 */ unsigned char IncreaseLevel;
  /* 0x000a */ unsigned char DecreaseLevel;
  /* 0x000b */ unsigned char Type;
  /* 0x000c */ unsigned long IncreaseTime;
  /* 0x0010 */ unsigned long DecreaseTime;
  /* 0x0018 */ unsigned __int64 Control;
  /* 0x0020 */ unsigned __int64 Status;
  /* 0x0028 */ unsigned long HitCount;
  /* 0x002c */ unsigned long Reserved1;
  /* 0x0030 */ unsigned __int64 Reserved2;
  /* 0x0038 */ unsigned __int64 Reserved3;
}; /* size: 0x0040 */

struct PPM_WMI_PERF_STATES
{
  /* 0x0000 */ unsigned long Count;
  /* 0x0004 */ unsigned long MaxFrequency;
  /* 0x0008 */ unsigned long CurrentState;
  /* 0x000c */ unsigned long MaxPerfState;
  /* 0x0010 */ unsigned long MinPerfState;
  /* 0x0014 */ unsigned long LowestPerfState;
  /* 0x0018 */ unsigned long ThermalConstraint;
  /* 0x001c */ unsigned char BusyAdjThreshold;
  /* 0x001d */ unsigned char PolicyType;
  /* 0x001e */ unsigned char Type;
  /* 0x001f */ unsigned char Reserved;
  /* 0x0020 */ unsigned long TimerInterval;
  /* 0x0028 */ unsigned __int64 TargetProcessors;
  /* 0x0030 */ unsigned long PStateHandler;
  /* 0x0034 */ unsigned long PStateContext;
  /* 0x0038 */ unsigned long TStateHandler;
  /* 0x003c */ unsigned long TStateContext;
  /* 0x0040 */ unsigned long FeedbackHandler;
  /* 0x0044 */ unsigned long Reserved1;
  /* 0x0048 */ unsigned __int64 Reserved2;
  /* 0x0050 */ struct PPM_WMI_PERF_STATE State[1];
}; /* size: 0x0090 */

struct PROCESSOR_IDLESTATE_INFO
{
  /* 0x0000 */ unsigned long TimeCheck;
  /* 0x0004 */ unsigned char DemotePercent;
  /* 0x0005 */ unsigned char PromotePercent;
  /* 0x0006 */ unsigned char Spare[2];
}; /* size: 0x0008 */

struct PROCESSOR_IDLESTATE_POLICY
{
  /* 0x0000 */ unsigned short Revision;
  union
  {
    union
    {
      /* 0x0002 */ unsigned short AsUSHORT;
      struct /* bitfield */
      {
        /* 0x0002 */ unsigned short AllowScaling : 1; /* bit position: 0 */
        /* 0x0002 */ unsigned short Disabled : 1; /* bit position: 1 */
        /* 0x0002 */ unsigned short Reserved : 14; /* bit position: 2 */
      }; /* bitfield */
    }; /* size: 0x0002 */
  } /* size: 0x0002 */ Flags;
  /* 0x0004 */ unsigned long PolicyCount;
  /* 0x0008 */ struct PROCESSOR_IDLESTATE_INFO Policy[3];
}; /* size: 0x0020 */

struct PROCESSOR_IDLE_TIMES
{
  /* 0x0000 */ unsigned __int64 StartTime;
  /* 0x0008 */ unsigned __int64 EndTime;
  /* 0x0010 */ unsigned long Reserved[4];
}; /* size: 0x0020 */

struct PROCESSOR_PERFSTATE_POLICY
{
  /* 0x0000 */ unsigned long Revision;
  /* 0x0004 */ unsigned char MaxThrottle;
  /* 0x0005 */ unsigned char MinThrottle;
  /* 0x0006 */ unsigned char BusyAdjThreshold;
  union
  {
    /* 0x0007 */ unsigned char Spare;
    union
    {
      union
      {
        /* 0x0007 */ unsigned char AsUCHAR;
        struct /* bitfield */
        {
          /* 0x0007 */ unsigned char NoDomainAccounting : 1; /* bit position: 0 */
          /* 0x0007 */ unsigned char IncreasePolicy : 2; /* bit position: 1 */
          /* 0x0007 */ unsigned char DecreasePolicy : 2; /* bit position: 3 */
          /* 0x0007 */ unsigned char Reserved : 3; /* bit position: 5 */
        }; /* bitfield */
      }; /* size: 0x0001 */
    } /* size: 0x0001 */ Flags;
  }; /* size: 0x0001 */
  /* 0x0008 */ unsigned long TimeCheck;
  /* 0x000c */ unsigned long IncreaseTime;
  /* 0x0010 */ unsigned long DecreaseTime;
  /* 0x0014 */ unsigned long IncreasePercent;
  /* 0x0018 */ unsigned long DecreasePercent;
}; /* size: 0x001c */

struct PROCESSOR_PERF_STATE
{
  /* 0x0000 */ unsigned long Frequency;
  /* 0x0004 */ unsigned long Power;
  /* 0x0008 */ unsigned short Latency;
  /* 0x000a */ unsigned char Type;
  /* 0x000b */ unsigned char Spare;
  /* 0x0010 */ unsigned __int64 Control;
  /* 0x0018 */ unsigned __int64 Status;
}; /* size: 0x0020 */

struct PROCESSOR_PERF_STATES
{
  /* 0x0000 */ unsigned long Size;
  /* 0x0004 */ unsigned short Revision;
  /* 0x0006 */ unsigned short Type;
  /* 0x0008 */ unsigned long Count;
  /* 0x000c */ unsigned long MaxFrequency;
  /* 0x0010 */ unsigned long TargetProcessors;
  /* 0x0014 */ void* PStateHandler /* function */;
  /* 0x0018 */ unsigned long PStateContext;
  /* 0x001c */ unsigned long PStateCap;
  /* 0x0020 */ void* TStateHandler /* function */;
  /* 0x0024 */ unsigned long TStateContext;
  /* 0x0028 */ unsigned long TStateCap;
  /* 0x002c */ void* FeedbackHandler /* function */;
  /* 0x0030 */ struct PROCESSOR_PERF_STATE State[1];
}; /* size: 0x0050 */

enum PROXY_PHASE
{
  PROXY_CALCSIZE = 0,
  PROXY_GETBUFFER = 1,
  PROXY_MARSHAL = 2,
  PROXY_SENDRECEIVE = 3,
  PROXY_UNMARSHAL = 4,
};

class PRevertable
{
  /* 0x0000 */ unsigned long _sig;
  /* 0x0004 */ unsigned long _luid;
  /* 0x0008 */ unsigned long _df;
  /* 0x000c */ class CDfName _dfn;
  /* 0x0050 */ class CBasedRevertablePtr _prvNext;
}; /* size: 0x0054 */

class PSStream
{
}; /* size: 0x000c */

enum PS_CREATE_STATE
{
  PsCreateInitialState = 0,
  PsCreateFailOnFileOpen = 1,
  PsCreateFailOnSectionCreate = 2,
  PsCreateFailExeFormat = 3,
  PsCreateFailMachineMismatch = 4,
  PsCreateFailExeName = 5,
  PsCreateSuccess = 6,
  PsCreateMaximumStates = 7,
};

class PSerStream;

class PTSetMember
{
  /* 0x0008 */ unsigned long _dlTree;
  /* 0x000c */ unsigned long _dlName;
  /* 0x0010 */ unsigned long _ulLevel;
  /* 0x0014 */ class CDfName _dfnName;
  /* 0x0056 */ const unsigned short _uType;
}; /* size: 0x0058 */

class PTimeEntry
{
}; /* size: 0x000c */

enum PULLSTATE
{
  PULLSTATE0_ENTRY = 0,
  PULLSTATE1_FIRST_CALL = 1,
  PULLSTATE2_NS_RQlsRA = 2,
  PULLSTATE3_NS_RQgeRA = 3,
  PULLSTATE4_S_RQlsBS = 4,
  PULLSTATE5_S_RQgeBS = 5,
  PULLSTATE6_DONE = 6,
};

enum PUSHSTATE
{
  PUSHSTATE0_ENTRY = 0,
  PUSHSTATE1_FIRSTCALL = 1,
  PUSHSTATE2_FS_PSgeFS = 2,
  PUSHSTATE3_FS_PSltFS = 3,
  PUSHSTATE4_FS_PSZERO = 4,
  PUSHSTATE5_DONE_ERROR = 5,
};

enum QUERY_USER_NOTIFICATION_STATE
{
  QUNS_NOT_PRESENT = 1,
  QUNS_BUSY = 2,
  QUNS_RUNNING_D3D_FULL_SCREEN = 3,
  QUNS_PRESENTATION_MODE = 4,
  QUNS_ACCEPTS_NOTIFICATIONS = 5,
};

struct READ_USN_JOURNAL_DATA
{
  /* 0x0000 */ __int64 StartUsn;
  /* 0x0008 */ unsigned long ReasonMask;
  /* 0x000c */ unsigned long ReturnOnlyOnClose;
  /* 0x0010 */ unsigned __int64 Timeout;
  /* 0x0018 */ unsigned __int64 BytesToWaitFor;
  /* 0x0020 */ unsigned __int64 UsnJournalID;
}; /* size: 0x0028 */

struct REF_COUNTED_STRUCT
{
  /* 0x0004 */ long m_refs;
}; /* size: 0x0008 */

struct RETRIEVAL_POINTERS_BUFFER
{
  /* 0x0000 */ unsigned long ExtentCount;
  /* 0x0008 */ union _LARGE_INTEGER StartingVcn;
  /* 0x0010 */ struct
  {
    /* 0x0010 */ union _LARGE_INTEGER NextVcn;
    /* 0x0018 */ union _LARGE_INTEGER Lcn;
  } /* size: 0x0010 */ Extents[1];
}; /* size: 0x0020 */

enum RPC_ADDRESS_CHANGE_TYPE
{
  PROTOCOL_NOT_LOADED = 1,
  PROTOCOL_LOADED = 2,
  PROTOCOL_ADDRESS_CHANGE = 3,
};

struct RPC_CLIENT_INFORMATION1
{
  /* 0x0000 */ unsigned char* UserName;
  /* 0x0004 */ unsigned char* ComputerName;
  /* 0x0008 */ unsigned short Privilege;
  /* 0x000c */ unsigned long AuthFlags;
}; /* size: 0x0010 */

struct RPC_DISPATCH_TABLE
{
  /* 0x0000 */ unsigned int DispatchTableCount;
  /* 0x0004 */ void** DispatchTable /* function */;
  /* 0x0008 */ long Reserved;
}; /* size: 0x000c */

struct RPC_IF_ID_VECTOR
{
  /* 0x0000 */ unsigned long Count;
  /* 0x0004 */ struct _RPC_IF_ID* IfId[1];
}; /* size: 0x0008 */

struct RPC_IMPORT_CONTEXT_P
{
  /* 0x0000 */ void* LookupContext;
  /* 0x0004 */ void* ProposedHandle;
  /* 0x0008 */ struct _RPC_BINDING_VECTOR* Bindings;
}; /* size: 0x000c */

struct RPC_STATS_VECTOR
{
  /* 0x0000 */ unsigned int Count;
  /* 0x0004 */ unsigned long Stats[1];
}; /* size: 0x0008 */

struct RTL_ACE_DATA
{
  /* 0x0000 */ unsigned char AceType;
  /* 0x0001 */ unsigned char InheritFlags;
  /* 0x0002 */ unsigned char AceFlags;
  /* 0x0004 */ unsigned long Mask;
  /* 0x0008 */ void** Sid;
}; /* size: 0x000c */

enum RTL_BSD_ITEM_TYPE
{
  RtlBsdItemVersionNumber = 0,
  RtlBsdItemProductType = 1,
  RtlBsdItemAabEnabled = 2,
  RtlBsdItemAabTimeout = 3,
  RtlBsdItemBootGood = 4,
  RtlBsdItemBootShutdown = 5,
  RtlBsdSleepInProgress = 6,
  RtlBsdItemMax = 7,
};

struct RTL_FILTER_LUNICODE_STRING_CTX
{
  /* 0x0000 */ unsigned char* WriteCursor;
  /* 0x0004 */ unsigned char* WriteEnd;
}; /* size: 0x0008 */

struct RTL_FILTER_LUNICODE_STRING_FILTER
{
  /* 0x0000 */ void* Transform /* function */;
  /* 0x0004 */ void* Match /* function */;
  /* 0x0008 */ void* MatchContext;
  /* 0x000c */ unsigned char DropHighUnicodeValues;
  /* 0x000d */ unsigned char MatchFirst;
  /* 0x000e */ char __PADDING__[2];
}; /* size: 0x0010 */

struct RegistryKeyValue
{
  /* 0x0000 */ wchar_t* key;
  /* 0x0004 */ wchar_t* value;
}; /* size: 0x0008 */

enum ReplacesCorHdrNumericDefines
{
  COMIMAGE_FLAGS_ILONLY = 1,
  COMIMAGE_FLAGS_32BITREQUIRED = 2,
  COMIMAGE_FLAGS_IL_LIBRARY = 4,
  COMIMAGE_FLAGS_STRONGNAMESIGNED = 8,
  COMIMAGE_FLAGS_NATIVE_ENTRYPOINT = 16,
  COMIMAGE_FLAGS_TRACKDEBUGDATA = 0x10000,
  COR_VERSION_MAJOR_V2 = 2,
  COR_VERSION_MAJOR = 2,
  COR_VERSION_MINOR = 0,
  COR_DELETED_NAME_LENGTH = 8,
  COR_VTABLEGAP_NAME_LENGTH = 8,
  NATIVE_TYPE_MAX_CB = 1,
  COR_ILMETHOD_SECT_SMALL_MAX_DATASIZE = 255,
  IMAGE_COR_MIH_METHODRVA = 1,
  IMAGE_COR_MIH_EHRVA = 2,
  IMAGE_COR_MIH_BASICBLOCK = 8,
  COR_VTABLE_32BIT = 1,
  COR_VTABLE_64BIT = 2,
  COR_VTABLE_FROM_UNMANAGED = 4,
  COR_VTABLE_FROM_UNMANAGED_RETAIN_APPDOMAIN = 8,
  COR_VTABLE_CALL_MOST_DERIVED = 16,
  IMAGE_COR_EATJ_THUNK_SIZE = 32,
  MAX_CLASS_NAME = 1024,
  MAX_PACKAGE_NAME = 1024,
};

struct ReportedExceptions
{
  /* 0x0000 */ unsigned long dwExceptionCode;
  /* 0x0004 */ unsigned long dwReportCount;
  /* 0x0008 */ unsigned long dwMaxCount;
}; /* size: 0x000c */

enum RpcProxyPerfCounters
{
  RpcCurrentUniqueUser = 1,
  RpcBackEndConnectionAttempts = 2,
  RpcBackEndConnectionFailed = 3,
  RpcRequestsPerSecond = 4,
  RpcIncomingConnections = 5,
  RpcIncomingBandwidth = 6,
  RpcOutgoingBandwidth = 7,
  RpcAttemptedLbsDecisions = 8,
  RpcFailedLbsDecisions = 9,
  RpcAttemptedLbsMessages = 10,
  RpcFailedLbsMessages = 11,
  RpcLastCounter = 12,
};

struct SAFEARRAY_INTERNAL
{
  union
  {
    /* 0x0000 */ struct _GUID iid;
    struct
    {
      /* 0x0000 */ long __dummy0[3];
      /* 0x000c */ long vt;
    }; /* size: 0x0010 */
    struct
    {
      /* 0x0000 */ unsigned long __dummy1[3];
      /* 0x000c */ struct IRecordInfo* piri;
    }; /* size: 0x0010 */
  }; /* size: 0x0010 */
  /* 0x0010 */ struct tagSAFEARRAY array;
}; /* size: 0x0028 */

struct SAccessCache
{
  /* 0x0000 */ int fAccess;
  /* 0x0004 */ struct _LUID lClient;
}; /* size: 0x000c */

struct SBlanket
{
  /* 0x0000 */ wchar_t* _pPrincipal;
  /* 0x0004 */ unsigned long _lAuthnLevel;
  /* 0x0008 */ unsigned long _lAuthnSvc;
  /* 0x000c */ void* _pAuthId;
  /* 0x0010 */ unsigned long _lAuthzSvc;
  /* 0x0014 */ struct _RPC_SECURITY_QOS _sQos;
  /* 0x0024 */ unsigned long _lCapabilities;
  /* 0x0028 */ struct _SCHANNEL_CRED _sCred;
  /* 0x0060 */ const struct _CERT_CONTEXT* _pCert;
}; /* size: 0x0064 */

struct SC_HANDLE__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct SCacheEntry
{
  /* 0x0000 */ unsigned long ulOffset;
  /* 0x0004 */ unsigned long sect;
  /* 0x0008 */ unsigned long ulRunLength;
}; /* size: 0x000c */

struct SChannelHookCallInfo
{
  /* 0x0000 */ struct _GUID iid;
  /* 0x0010 */ unsigned long cbSize;
  /* 0x0014 */ struct _GUID uCausality;
  /* 0x0024 */ unsigned long dwServerPid;
  /* 0x0028 */ unsigned long iMethod;
  /* 0x002c */ void* pObject;
}; /* size: 0x0030 */

struct SCopyVars
{
  /* 0x0000 */ class PSStream* psstFrom;
  /* 0x0004 */ struct IStream* pstTo;
  /* 0x0008 */ class PDocFile* pdfFromChild;
  /* 0x000c */ struct IStorage* pstgToChild;
  /* 0x0010 */ unsigned long grfStateBits;
  /* 0x0014 */ struct _GUID clsid;
  /* 0x0024 */ class CDfName dfnKey;
  /* 0x0068 */ struct SIterBuffer ib;
  /* 0x00b0 */ wchar_t atcName[32];
}; /* size: 0x00f0 */

struct SDDInfo
{
  /* 0x0000 */ int fLocal;
  /* 0x0004 */ struct IPrivDragDrop* pPDP;
}; /* size: 0x0008 */

struct SDWORDHashNode
{
  /* 0x0000 */ struct SHashChain chain;
  /* 0x0008 */ unsigned long key;
}; /* size: 0x000c */

struct SDeltaBlock
{
  /* 0x0000 */ unsigned long _sect[16];
  /* 0x0040 */ unsigned short _fOwn[1];
  /* 0x0042 */ char __PADDING__[2];
}; /* size: 0x0044 */

struct SDfMarshalPacket
{
  /* 0x0000 */ class CBasedPubDocFilePtr pdf;
  /* 0x0004 */ class CBasedPubStreamPtr pst;
  /* 0x0008 */ class CBasedSeekPointerPtr psp;
  /* 0x000c */ class CBasedMarshalListPtr pml;
  /* 0x0010 */ class CBasedDFBasisPtr pdfb;
  /* 0x0014 */ class CBasedGlobalContextPtr pgc;
  /* 0x0018 */ class CBasedGlobalFileStreamPtr fsBase;
  /* 0x001c */ class CBasedGlobalFileStreamPtr fsDirty;
  /* 0x0020 */ class CBasedGlobalFileStreamPtr fsOriginal;
  /* 0x0024 */ unsigned long ulHeapName;
  /* 0x0028 */ unsigned long cntxid;
  /* 0x002c */ class CPerContext* ppc;
  /* 0x0030 */ void* hMem;
}; /* size: 0x0034 */

class SEMAPHORE
{
  /* 0x0000 */ void* m_hSem;
}; /* size: 0x0004 */

enum SEMRESULT
{
  SEMSUCCESS = 0,
  SEMTIMEOUT = 1,
  SEMNOBLOCK = 2,
  SEMERROR = 3,
};

enum SEMSTATE
{
  SEMSHARED = 0,
  SEMSHAREDOWNED = 1,
};

struct SERVICE_STATUS_HANDLE__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct SET_POWER_SETTING_VALUE
{
  /* 0x0000 */ unsigned long Version;
  /* 0x0004 */ struct _GUID Guid;
  /* 0x0014 */ enum SYSTEM_POWER_CONDITION PowerCondition;
  /* 0x0018 */ unsigned long DataLength;
  /* 0x001c */ unsigned char Data[1];
  /* 0x001d */ char __PADDING__[3];
}; /* size: 0x0020 */

struct SEntryBuffer
{
  /* 0x0000 */ unsigned long luid;
  /* 0x0004 */ unsigned long dwType;
  /* 0x0008 */ unsigned long sid;
}; /* size: 0x000c */

struct SExtHashNode
{
  /* 0x0000 */ struct SHashChain chain;
  /* 0x0008 */ const wchar_t* pwszExt;
}; /* size: 0x000c */

struct SFreeBlock
{
  /* 0x0000 */ class CBasedFreeBlockPtr pfbNext;
}; /* size: 0x0004 */

struct SGetFreeStruct
{
  /* 0x0000 */ struct CVectBits* pfb;
  /* 0x0004 */ unsigned long sect;
  /* 0x0008 */ class CFatSect* pfs;
  /* 0x000c */ unsigned short isect;
  /* 0x0010 */ unsigned long ipfs;
  /* 0x0014 */ unsigned long sectLast;
  /* 0x0018 */ unsigned long ipfsLast;
  /* 0x001c */ unsigned short isectLast;
  /* 0x0020 */ class CFatSect* pfsNoScratch;
  /* 0x0024 */ unsigned long ipfsNoScratch;
}; /* size: 0x0028 */

struct SHA256_CTX
{
  /* 0x0000 */ unsigned long state[8];
  /* 0x0020 */ unsigned long count[2];
  /* 0x0028 */ unsigned char buffer[64];
}; /* size: 0x0068 */

struct SHA512_CTX
{
  /* 0x0000 */ unsigned __int64 state[8];
  /* 0x0040 */ unsigned __int64 count[2];
  /* 0x0050 */ unsigned char buffer[128];
}; /* size: 0x00d0 */

struct SHELLHOOKINFO
{
  /* 0x0000 */ struct HWND__* hwnd;
  /* 0x0004 */ struct tagRECT rc;
}; /* size: 0x0014 */

enum SHSTOCKICONID
{
  SIID_DOCNOASSOC = 0,
  SIID_DOCASSOC = 1,
  SIID_APPLICATION = 2,
  SIID_FOLDER = 3,
  SIID_FOLDEROPEN = 4,
  SIID_DRIVE525 = 5,
  SIID_DRIVE35 = 6,
  SIID_DRIVEREMOVE = 7,
  SIID_DRIVEFIXED = 8,
  SIID_DRIVENET = 9,
  SIID_DRIVENETDISABLED = 10,
  SIID_DRIVECD = 11,
  SIID_DRIVERAM = 12,
  SIID_WORLD = 13,
  SIID_SERVER = 15,
  SIID_PRINTER = 16,
  SIID_MYNETWORK = 17,
  SIID_FIND = 22,
  SIID_HELP = 23,
  SIID_SHARE = 28,
  SIID_LINK = 29,
  SIID_SLOWFILE = 30,
  SIID_RECYCLER = 31,
  SIID_RECYCLERFULL = 32,
  SIID_MEDIACDAUDIO = 40,
  SIID_LOCK = 47,
  SIID_AUTOLIST = 49,
  SIID_PRINTERNET = 50,
  SIID_SERVERSHARE = 51,
  SIID_PRINTERFAX = 52,
  SIID_PRINTERFAXNET = 53,
  SIID_PRINTERFILE = 54,
  SIID_STACK = 55,
  SIID_MEDIASVCD = 56,
  SIID_STUFFEDFOLDER = 57,
  SIID_DRIVEUNKNOWN = 58,
  SIID_DRIVEDVD = 59,
  SIID_MEDIADVD = 60,
  SIID_MEDIADVDRAM = 61,
  SIID_MEDIADVDRW = 62,
  SIID_MEDIADVDR = 63,
  SIID_MEDIADVDROM = 64,
  SIID_MEDIACDAUDIOPLUS = 65,
  SIID_MEDIACDRW = 66,
  SIID_MEDIACDR = 67,
  SIID_MEDIACDBURN = 68,
  SIID_MEDIABLANKCD = 69,
  SIID_MEDIACDROM = 70,
  SIID_AUDIOFILES = 71,
  SIID_IMAGEFILES = 72,
  SIID_VIDEOFILES = 73,
  SIID_MIXEDFILES = 74,
  SIID_FOLDERBACK = 75,
  SIID_FOLDERFRONT = 76,
  SIID_SHIELD = 77,
  SIID_WARNING = 78,
  SIID_INFO = 79,
  SIID_ERROR = 80,
  SIID_KEY = 81,
  SIID_SOFTWARE = 82,
  SIID_RENAME = 83,
  SIID_DELETE = 84,
  SIID_MEDIAAUDIODVD = 85,
  SIID_MEDIAMOVIEDVD = 86,
  SIID_MEDIAENHANCEDCD = 87,
  SIID_MEDIAENHANCEDDVD = 88,
  SIID_MEDIAHDDVD = 89,
  SIID_MEDIABLURAY = 90,
  SIID_MEDIAVCD = 91,
  SIID_MEDIADVDPLUSR = 92,
  SIID_MEDIADVDPLUSRW = 93,
  SIID_DESKTOPPC = 94,
  SIID_MOBILEPC = 95,
  SIID_USERS = 96,
  SIID_MEDIASMARTMEDIA = 97,
  SIID_MEDIACOMPACTFLASH = 98,
  SIID_DEVICECELLPHONE = 99,
  SIID_DEVICECAMERA = 100,
  SIID_DEVICEVIDEOCAMERA = 101,
  SIID_DEVICEAUDIOPLAYER = 102,
  SIID_NETWORKCONNECT = 103,
  SIID_INTERNET = 104,
  SIID_ZIPFILE = 105,
  SIID_SETTINGS = 106,
  SIID_DRIVEHDDVD = 132,
  SIID_DRIVEBD = 133,
  SIID_MEDIAHDDVDROM = 134,
  SIID_MEDIAHDDVDR = 135,
  SIID_MEDIAHDDVDRAM = 136,
  SIID_MEDIABDROM = 137,
  SIID_MEDIABDR = 138,
  SIID_MEDIABDRE = 139,
  SIID_CLUSTEREDDRIVE = 140,
  SIID_MAX_ICONS = 141,
};

struct SHashChain
{
  /* 0x0000 */ struct SHashChain* pNext;
  /* 0x0004 */ struct SHashChain* pPrev;
}; /* size: 0x0008 */

struct SHookList
{
  /* 0x0000 */ struct SHookList* pNext;
  /* 0x0004 */ struct IChannelHook* pHook;
  /* 0x0008 */ struct _GUID uExtension;
}; /* size: 0x0018 */

struct SIP_DISPATCH_INFO_;

struct SIP_INDIRECT_DATA_;

struct SIP_SUBJECTINFO_;

struct SIterBuffer
{
  /* 0x0000 */ class CDfName dfnName;
  /* 0x0044 */ unsigned long type;
}; /* size: 0x0048 */

struct SMIPIDHashNode
{
  /* 0x0000 */ struct SHashChain chain;
  /* 0x0008 */ struct MIPID mipid;
}; /* size: 0x0028 */

struct SMultiGUIDHashNode
{
  /* 0x0000 */ struct SHashChain chain;
  /* 0x0008 */ struct SMultiGUIDKey key;
}; /* size: 0x0010 */

struct SMultiGUIDKey
{
  /* 0x0000 */ int cGUID;
  /* 0x0004 */ struct _GUID* aGUID;
}; /* size: 0x0008 */

struct SNameHashNode
{
  /* 0x0000 */ struct SHashChain chain;
  /* 0x0008 */ unsigned long dwHash;
  /* 0x000c */ unsigned long cRef;
  /* 0x0010 */ struct _GUID ipid;
  /* 0x0020 */ struct tagSECURITYBINDING sName;
  /* 0x0026 */ char __PADDING__[2];
}; /* size: 0x0028 */

struct SNameKey
{
  /* 0x0000 */ const struct _GUID* pIpid;
  /* 0x0004 */ struct tagSECURITYBINDING* pName;
}; /* size: 0x0008 */

struct SOIDRegistration
{
  /* 0x0000 */ struct SUUIDHashNode Node;
  /* 0x0018 */ unsigned short cRefs;
  /* 0x001a */ unsigned short flags;
  /* 0x0020 */ unsigned __int64 mid;
  /* 0x0028 */ unsigned __int64 oxid;
  /* 0x0030 */ struct SOIDRegistration* pPrevList;
  /* 0x0034 */ struct SOIDRegistration* pNextList;
  /* 0x0038 */ class CRefCache* pRefCache;
  /* 0x003c */ long __PADDING__[1];
}; /* size: 0x0040 */

struct SPC_LINK_
{
  /* 0x0000 */ unsigned long dwLinkChoice;
  union
  {
    /* 0x0004 */ wchar_t* pwszUrl;
    /* 0x0004 */ struct _SPC_SERIALIZED_OBJECT Moniker;
    struct
    {
      /* 0x0004 */ wchar_t* pwszFile;
      /* 0x0008 */ long __PADDING__[5];
    }; /* size: 0x0018 */
  }; /* size: 0x0018 */
}; /* size: 0x001c */

struct SPC_SIGINFO_
{
  /* 0x0000 */ unsigned long dwSipVersion;
  /* 0x0004 */ struct _GUID gSIPGuid;
  /* 0x0014 */ unsigned long dwReserved1;
  /* 0x0018 */ unsigned long dwReserved2;
  /* 0x001c */ unsigned long dwReserved3;
  /* 0x0020 */ unsigned long dwReserved4;
  /* 0x0024 */ unsigned long dwReserved5;
}; /* size: 0x0028 */

struct SPatternEntry
{
  /* 0x0000 */ struct _GUID clsid;
  /* 0x0010 */ unsigned long ulEntryLen;
  /* 0x0014 */ long lFileOffset;
  /* 0x0018 */ unsigned long ulCb;
  /* 0x001c */ unsigned char abData[4];
}; /* size: 0x0020 */

struct SPendingCall
{
  /* 0x0000 */ struct SPendingCall* pNext;
  /* 0x0004 */ struct SPendingCall* pPrev;
  /* 0x0008 */ class CChannelObject* pChnlObj;
}; /* size: 0x000c */

struct SPermissionHeader
{
  /* 0x0000 */ unsigned short wVersion;
  /* 0x0002 */ unsigned short wPad;
  /* 0x0004 */ struct _GUID gClass;
}; /* size: 0x0014 */

struct SPointerHashNode
{
  /* 0x0000 */ struct SHashChain chain;
  /* 0x0008 */ void* key;
}; /* size: 0x000c */

struct SPreDirEntry
{
  /* 0x0000 */ class CDfName _dfn;
  /* 0x0042 */ unsigned char _mse;
  /* 0x0043 */ unsigned char _bflags;
  /* 0x0044 */ unsigned long _sidLeftSib;
  /* 0x0048 */ unsigned long _sidRightSib;
  /* 0x004c */ unsigned long _sidChild;
  /* 0x0050 */ struct _GUID _clsId;
  /* 0x0060 */ unsigned long _dwUserFlags;
  /* 0x0064 */ struct _FILETIME _time[2];
  /* 0x0074 */ unsigned long _sectStart;
  /* 0x0078 */ union _ULARGE_INTEGER _ulSize;
}; /* size: 0x0080 */

struct SPreHeader
{
  /* 0x0018 */ unsigned short _uMinorVersion;
  /* 0x001a */ unsigned short _uDllVersion;
  /* 0x001c */ unsigned short _uByteOrder;
  /* 0x001e */ unsigned short _uSectorShift;
  /* 0x0020 */ unsigned short _uMiniSectorShift;
  /* 0x0022 */ unsigned short _usReserved;
  /* 0x0024 */ unsigned long _ulReserved1;
  /* 0x0028 */ unsigned long _csectDir;
  /* 0x002c */ unsigned long _csectFat;
  /* 0x0030 */ unsigned long _sectDirStart;
  /* 0x0034 */ unsigned long _signature;
  /* 0x0038 */ unsigned long _ulMiniSectorCutoff;
  /* 0x003c */ unsigned long _sectMiniFatStart;
  /* 0x0040 */ unsigned long _csectMiniFat;
  /* 0x0044 */ unsigned long _sectDifStart;
  /* 0x0048 */ unsigned long _csectDif;
}; /* size: 0x004c */

enum SQM_TYPE
{
  SQM_TYPE_NONE = 0,
  SQM_TYPE_DWORD = 1,
  SQM_TYPE_STRING = 2,
};

struct SSegment
{
  /* 0x0000 */ unsigned long ulOffset;
  /* 0x0004 */ unsigned long sectStart;
  /* 0x0008 */ unsigned long cSect;
}; /* size: 0x000c */

struct SSimpleWalker
{
  /* 0x0004 */ unsigned long _cItfs;
  /* 0x0008 */ struct IUnknown* _arpUnk[10];
  /* 0x0030 */ struct IUnknown** _ppUnk;
}; /* size: 0x0034 */

struct SStorageFile
{
  /* 0x0000 */ unsigned char abSig[8];
  /* 0x0008 */ struct _GUID _clid;
}; /* size: 0x0018 */

struct SStringHashNode
{
  /* 0x0000 */ struct SHashChain chain;
  /* 0x0008 */ unsigned long dwHash;
  /* 0x000c */ struct tagDUALSTRINGARRAY* psaKey;
}; /* size: 0x0010 */

struct STARTING_LCN_INPUT_BUFFER
{
  /* 0x0000 */ union _LARGE_INTEGER StartingLcn;
}; /* size: 0x0008 */

struct STARTING_VCN_INPUT_BUFFER
{
  /* 0x0000 */ union _LARGE_INTEGER StartingVcn;
}; /* size: 0x0008 */

enum STUB_PHASE
{
  STUB_UNMARSHAL = 0,
  STUB_CALL_SERVER = 1,
  STUB_MARSHAL = 2,
  STUB_CALL_SERVER_NO_HRESULT = 3,
};

struct STblHdr
{
  /* 0x0000 */ unsigned long ulSize;
  /* 0x0004 */ unsigned long cbLargest;
  /* 0x0008 */ unsigned long OffsStart;
  /* 0x000c */ unsigned long OffsEnd;
}; /* size: 0x0010 */

struct STwoBits
{
  /* 0x0000 */ void* _hEvent;
  /* 0x0004 */ unsigned long _dwCookie;
}; /* size: 0x0008 */

struct SUUIDHashNode
{
  /* 0x0000 */ struct SHashChain chain;
  /* 0x0008 */ struct _GUID key;
}; /* size: 0x0018 */

struct SYMSRV_INDEX_INFO
{
  /* 0x0000 */ unsigned long sizeofstruct;
  /* 0x0004 */ char file[261];
  /* 0x010c */ int stripped;
  /* 0x0110 */ unsigned long timestamp;
  /* 0x0114 */ unsigned long size;
  /* 0x0118 */ char dbgfile[261];
  /* 0x021d */ char pdbfile[261];
  /* 0x0324 */ struct _GUID guid;
  /* 0x0334 */ unsigned long sig;
  /* 0x0338 */ unsigned long age;
}; /* size: 0x033c */

struct SYMSRV_INDEX_INFOW
{
  /* 0x0000 */ unsigned long sizeofstruct;
  /* 0x0004 */ wchar_t file[261];
  /* 0x0210 */ int stripped;
  /* 0x0214 */ unsigned long timestamp;
  /* 0x0218 */ unsigned long size;
  /* 0x021c */ wchar_t dbgfile[261];
  /* 0x0426 */ wchar_t pdbfile[261];
  /* 0x0630 */ struct _GUID guid;
  /* 0x0640 */ unsigned long sig;
  /* 0x0644 */ unsigned long age;
}; /* size: 0x0648 */

enum SYM_TYPE
{
  SymNone = 0,
  SymCoff = 1,
  SymCv = 2,
  SymPdb = 3,
  SymExport = 4,
  SymDeferred = 5,
  SymSym = 6,
  SymDia = 7,
  SymVirtual = 8,
  NumSymTypes = 9,
};

enum SYNCMGR_CANCEL_REQUEST
{
  SYNCMGR_CR_NONE = 0,
  SYNCMGR_CR_CANCEL_ITEM = 1,
  SYNCMGR_CR_CANCEL_ALL = 2,
  SYNCMGR_CR_MAX = 2,
};

enum SYNCMGR_CONFLICT_ITEM_TYPE
{
};

enum SYNCMGR_EVENT_LEVEL
{
  SYNCMGR_EL_INFORMATION = 1,
  SYNCMGR_EL_WARNING = 2,
  SYNCMGR_EL_ERROR = 3,
  SYNCMGR_EL_MAX = 3,
};

enum SYNCMGR_HANDLER_POLICIES
{
  SYNCMGR_HPM_NONE = 0,
  SYNCMGR_HPM_PREVENT_ACTIVATE = 1,
  SYNCMGR_HPM_PREVENT_DEACTIVATE = 2,
  SYNCMGR_HPM_PREVENT_ENABLE = 4,
  SYNCMGR_HPM_PREVENT_DISABLE = 8,
  SYNCMGR_HPM_PREVENT_START_SYNC = 16,
  SYNCMGR_HPM_PREVENT_STOP_SYNC = 32,
  SYNCMGR_HPM_DISABLE_ENABLE = 256,
  SYNCMGR_HPM_DISABLE_DISABLE = 512,
  SYNCMGR_HPM_DISABLE_START_SYNC = 1024,
  SYNCMGR_HPM_DISABLE_STOP_SYNC = 2048,
  SYNCMGR_HPM_DISABLE_BROWSE = 4096,
  SYNCMGR_HPM_DISABLE_SCHEDULE = 8192,
  SYNCMGR_HPM_HIDDEN_BY_DEFAULT = 0x10000,
  SYNCMGR_HPM_BACKGROUND_SYNC_ONLY = 48,
  SYNCMGR_HPM_VALID_MASK = 0x12f3f,
};

enum SYNCMGR_HANDLER_TYPE
{
  SYNCMGR_HT_UNSPECIFIED = 0,
  SYNCMGR_HT_APPLICATION = 1,
  SYNCMGR_HT_DEVICE = 2,
  SYNCMGR_HT_FOLDER = 3,
  SYNCMGR_HT_SERVICE = 4,
  SYNCMGR_HT_COMPUTER = 5,
  SYNCMGR_HT_MIN = 0,
  SYNCMGR_HT_MAX = 5,
};

enum SYNCMGR_PRESENTER_CHOICE
{
  SYNCMGR_PC_NO_CHOICE = 0,
  SYNCMGR_PC_KEEP_ONE = 1,
  SYNCMGR_PC_KEEP_MULTIPLE = 2,
  SYNCMGR_PC_KEEP_RECENT = 3,
  SYNCMGR_PC_REMOVE_FROM_SYNC_SET = 4,
  SYNCMGR_PC_SKIP = 5,
};

enum SYNCMGR_PRESENTER_NEXT_STEP
{
  SYNCMGR_PNS_CONTINUE = 0,
  SYNCMGR_PNS_DEFAULT = 1,
  SYNCMGR_PNS_CANCEL = 2,
};

enum SYNCMGR_PROGRESS_STATUS
{
  SYNCMGR_PS_UPDATING = 1,
  SYNCMGR_PS_UPDATING_INDETERMINATE = 2,
  SYNCMGR_PS_SUCCEEDED = 3,
  SYNCMGR_PS_FAILED = 4,
  SYNCMGR_PS_CANCELED = 5,
  SYNCMGR_PS_DISCONNECTED = 6,
  SYNCMGR_PS_MAX = 6,
};

enum SYNCMGR_RESOLUTION_FEEDBACK
{
  SYNCMGR_RF_CONTINUE = 0,
  SYNCMGR_RF_REFRESH = 1,
  SYNCMGR_RF_CANCEL = 2,
};

enum SYNCMGR_UPDATE_REASON
{
  SYNCMGR_UR_ADDED = 0,
  SYNCMGR_UR_CHANGED = 1,
  SYNCMGR_UR_REMOVED = 2,
  SYNCMGR_UR_MAX = 2,
};

struct SYNTHESIZED_MAP
{
  /* 0x0000 */ unsigned short cfSynthesized;
  /* 0x0002 */ unsigned short cfOrig;
}; /* size: 0x0004 */

enum SYSGEOCLASS
{
  GEOCLASS_NATION = 16,
  GEOCLASS_REGION = 14,
};

enum SYSGEOTYPE
{
  GEO_NATION = 1,
  GEO_LATITUDE = 2,
  GEO_LONGITUDE = 3,
  GEO_ISO2 = 4,
  GEO_ISO3 = 5,
  GEO_RFC1766 = 6,
  GEO_LCID = 7,
  GEO_FRIENDLYNAME = 8,
  GEO_OFFICIALNAME = 9,
  GEO_TIMEZONES = 10,
  GEO_OFFICIALLANGUAGES = 11,
};

enum SYSNLS_FUNCTION
{
  COMPARE_STRING = 1,
};

struct SYSTEM_BATTERY_STATE
{
  /* 0x0000 */ unsigned char AcOnLine;
  /* 0x0001 */ unsigned char BatteryPresent;
  /* 0x0002 */ unsigned char Charging;
  /* 0x0003 */ unsigned char Discharging;
  /* 0x0004 */ unsigned char Spare1[4];
  /* 0x0008 */ unsigned long MaxCapacity;
  /* 0x000c */ unsigned long RemainingCapacity;
  /* 0x0010 */ unsigned long Rate;
  /* 0x0014 */ unsigned long EstimatedTime;
  /* 0x0018 */ unsigned long DefaultAlert1;
  /* 0x001c */ unsigned long DefaultAlert2;
}; /* size: 0x0020 */

struct SYSTEM_POWER_CAPABILITIES
{
  /* 0x0000 */ unsigned char PowerButtonPresent;
  /* 0x0001 */ unsigned char SleepButtonPresent;
  /* 0x0002 */ unsigned char LidPresent;
  /* 0x0003 */ unsigned char SystemS1;
  /* 0x0004 */ unsigned char SystemS2;
  /* 0x0005 */ unsigned char SystemS3;
  /* 0x0006 */ unsigned char SystemS4;
  /* 0x0007 */ unsigned char SystemS5;
  /* 0x0008 */ unsigned char HiberFilePresent;
  /* 0x0009 */ unsigned char FullWake;
  /* 0x000a */ unsigned char VideoDimPresent;
  /* 0x000b */ unsigned char ApmPresent;
  /* 0x000c */ unsigned char UpsPresent;
  /* 0x000d */ unsigned char ThermalControl;
  /* 0x000e */ unsigned char ProcessorThrottle;
  /* 0x000f */ unsigned char ProcessorMinThrottle;
  /* 0x0010 */ unsigned char ProcessorMaxThrottle;
  /* 0x0011 */ unsigned char FastSystemS4;
  /* 0x0012 */ unsigned char spare2[3];
