enum BUS_QUERY_ID_TYPE;
struct CO_ADDRESS_FAMILY;
struct CO_SAP;
enum DEVICE_TEXT_TYPE;
enum DL_ADDRESS_TYPE;
struct KSALLOCATOR_FRAMING;
struct KSALLOCATOR_FRAMING_EX;
struct KSATTRIBUTE;
struct KSATTRIBUTE_LIST;
struct KSAUTOMATION_TABLE_;
struct KSBUFFER_ITEM;
struct KSCOMPONENTID;
union KSDATAFORMAT;
struct KSDPC_ITEM;
struct KSEVENTDATA;
struct KSEVENT_ITEM;
struct KSEVENT_SET;
struct KSFASTMETHOD_ITEM;
struct KSFASTPROPERTY_ITEM;
struct KSIDENTIFIER;
struct KSMETHOD_ITEM;
struct KSMETHOD_SET;
struct KSMULTIPLE_ITEM;
enum KSPIN_COMMUNICATION;
enum KSPIN_DATAFLOW;
struct KSPIN_DESCRIPTOR;
struct KSPRIORITY;
struct KSPROPERTY_ITEM;
struct KSPROPERTY_MEMBERSHEADER;
struct KSPROPERTY_MEMBERSLIST;
struct KSPROPERTY_SET;
struct KSPROPERTY_VALUES;
struct KSP_PIN;
enum KSRESET;
struct KSRESOLUTION;
enum KSSTATE;
struct KSSTREAM_HEADER;
struct KSTIME;
struct KSTOPOLOGY_CONNECTION;
struct KS_COMPRESSION;
struct KS_FRAMING_ITEM;
struct KS_FRAMING_RANGE;
struct KS_FRAMING_RANGE_WEIGHTED;
struct LIST_ENTRY32;
struct LIST_ENTRY64;
struct MSIX_TABLE_POINTER;
enum NL_ADDRESS_TYPE;
enum NetDmaEventTypes;
struct PCI_MSIX_CAPABILITY;
struct PCI_MSI_CAPABILITY;
enum POWER_ACTION;
enum PS_CREATE_STATE;
enum ReplacesCorHdrNumericDefines;
struct SCOPE_ID;
enum SCOPE_LEVEL;
struct _ACCESS_REASONS;
struct _ACCESS_STATE;
struct _ACTIVATION_CONTEXT;
struct _ACTIVATION_CONTEXT_DATA;
struct _ACTIVATION_CONTEXT_STACK;
enum _ALTERNATIVE_ARCHITECTURE_TYPE;
struct _ASSEMBLY_STORAGE_MAP;

union _PCW_CALLBACK_INFORMATION;
enum _PCW_CALLBACK_TYPE;
struct _PCW_COUNTER_DESCRIPTOR;
struct _PCW_COUNTER_INFORMATION;
struct _PCW_DATA;
struct _PCW_INSTANCE;
struct _PCW_MASK_INFORMATION;
struct _PCW_REGISTRATION;
struct _PCW_REGISTRATION_INFORMATION;
struct _PEB;
struct _PEB_LDR_DATA;
struct _PERFINFO_GROUPMASK;
enum _PKG_TYPE;
enum _POOL_BLOCK_TYPE;
enum _POOL_TYPE;
struct _POWER_SEQUENCE;
union _POWER_STATE;
enum _POWER_STATE_TYPE;
struct _PRIVILEGE_SET;
struct _PROCESSOR_NUMBER;
enum _PS_ATTRIBUTE_NUM;
enum _PS_IFEO_KEY_STATE;
enum _PS_STD_HANDLE_STATE;
struct _QUAD;
struct _QUERY;
struct _QUERY_INFORMATION;
struct _QUEUED_CLOSE;
struct _REFERENCE;
union _REFERENCE_OBJECT;
enum _REG_NOTIFY_CLASS;
union _REQUEST_DATA;
union _RESULT_VALUE;
struct _RTL_ACTIVATION_CONTEXT_STACK_FRAME;
struct _RTL_BITMAP;
struct _RTL_CRITICAL_SECTION;
struct _RTL_DRIVE_LETTER_CURDIR;
struct _RTL_DYNAMIC_HASH_TABLE;
struct _RTL_DYNAMIC_HASH_TABLE_CONTEXT;
struct _RTL_DYNAMIC_HASH_TABLE_ENTRY;
struct _RTL_DYNAMIC_HASH_TABLE_ENUMERATOR;
struct _RTL_USER_PROCESS_PARAMETERS;
struct _SCATTER_GATHER_ELEMENT;
struct _SCATTER_GATHER_LIST;
struct _SCSI_REQUEST_BLOCK;
struct _SECTION_OBJECT_POINTERS;
enum _SECURITY_IMPERSONATION_LEVEL;
enum _SECURITY_OPERATION_CODE;
struct _SECURITY_QUALITY_OF_SERVICE;
struct _SECURITY_SUBJECT_CONTEXT;
struct _SET;
struct _SET_INFORMATION;
struct _SID;
struct _SID_IDENTIFIER_AUTHORITY;
struct _SINGLE_LIST_ENTRY;
struct _SLIST_ENTRY;
union _SLIST_HEADER;
struct _STACK_INDEX;
struct _STRING;
enum _SYSTEM_POWER_STATE;
struct _SYSTEM_POWER_STATE_CONTEXT;
struct _TEB;
struct _TEB_ACTIVE_FRAME;
struct _TEB_ACTIVE_FRAME_CONTEXT;
struct _TP_CALLBACK_ENVIRON_V3;
struct _TP_CALLBACK_INSTANCE;
enum _TP_CALLBACK_PRIORITY;
struct _TP_CLEANUP_GROUP;
struct _TP_DIRECT;
struct _TP_NBQ_GUARD;
struct _TP_POOL;
struct _TP_TASK;
struct _TP_TASK_CALLBACKS;
struct _TXN_PARAMETER_BLOCK;
union _ULARGE_INTEGER;
struct _ULONG_REFERENCE;
struct _UNICODE_STRING;
struct _VPB;
struct _WAIT_CONTEXT_BLOCK;
enum _WHEA_ERROR_PACKET_DATA_FORMAT;
union _WHEA_ERROR_PACKET_FLAGS;
struct _WHEA_ERROR_PACKET_V2;
struct _WHEA_ERROR_RECORD;
struct _WHEA_ERROR_RECORD_HEADER;
union _WHEA_ERROR_RECORD_HEADER_FLAGS;
union _WHEA_ERROR_RECORD_HEADER_VALIDBITS;
struct _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR;
union _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_FLAGS;
union _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_VALIDBITS;
enum _WHEA_ERROR_SEVERITY;
enum _WHEA_ERROR_SOURCE_TYPE;
enum _WHEA_ERROR_TYPE;
union _WHEA_PERSISTENCE_INFO;
union _WHEA_REVISION;
union _WHEA_TIMESTAMP;
struct _WORK_QUEUE_ITEM;
enum _WORK_QUEUE_TYPE;
struct _XSAVE_FORMAT;
struct _XSTATE_CONFIGURATION;
struct _XSTATE_FEATURE;
struct _X_FILTER;
struct _flowspec;
struct in6_addr;
struct in_addr;
struct sockaddr;
struct sockaddr_in;
struct sockaddr_in6;

enum BUS_QUERY_ID_TYPE
{
  BusQueryDeviceID = 0,
  BusQueryHardwareIDs = 1,
  BusQueryCompatibleIDs = 2,
  BusQueryInstanceID = 3,
  BusQueryDeviceSerialNumber = 4,
  BusQueryContainerID = 5,
};

struct CO_ADDRESS_FAMILY
{
  /* 0x0000 */ unsigned long AddressFamily;
  /* 0x0004 */ unsigned long MajorVersion;
  /* 0x0008 */ unsigned long MinorVersion;
}; /* size: 0x000c */

struct CO_SAP
{
  /* 0x0000 */ unsigned long SapType;
  /* 0x0004 */ unsigned long SapLength;
  /* 0x0008 */ unsigned char Sap[1];
  /* 0x0009 */ char __PADDING__[3];
}; /* size: 0x000c */

enum DEVICE_TEXT_TYPE
{
  DeviceTextDescription = 0,
  DeviceTextLocationInformation = 1,
};

enum DL_ADDRESS_TYPE
{
  DlUnicast = 0,
  DlMulticast = 1,
  DlBroadcast = 2,
};

struct KSALLOCATOR_FRAMING
{
  union
  {
    /* 0x0000 */ unsigned long OptionsFlags;
    /* 0x0000 */ unsigned long RequirementsFlags;
  }; /* size: 0x0004 */
  /* 0x0004 */ enum _POOL_TYPE PoolType;
  /* 0x0008 */ unsigned long Frames;
  /* 0x000c */ unsigned long FrameSize;
  /* 0x0010 */ unsigned long FileAlignment;
  /* 0x0014 */ unsigned long Reserved;
}; /* size: 0x0018 */

struct KSALLOCATOR_FRAMING_EX
{
  /* 0x0000 */ unsigned long CountItems;
  /* 0x0004 */ unsigned long PinFlags;
  /* 0x0008 */ struct KS_COMPRESSION OutputCompression;
  /* 0x0014 */ unsigned long PinWeight;
  /* 0x0018 */ struct KS_FRAMING_ITEM FramingItem[1];
}; /* size: 0x0070 */

struct KSATTRIBUTE
{
  /* 0x0000 */ unsigned long Size;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ struct _GUID Attribute;
}; /* size: 0x0018 */

struct KSATTRIBUTE_LIST
{
  /* 0x0000 */ unsigned long Count;
  /* 0x0008 */ struct KSATTRIBUTE** Attributes;
}; /* size: 0x0010 */

struct KSAUTOMATION_TABLE_
{
  /* 0x0000 */ unsigned long PropertySetsCount;
  /* 0x0004 */ unsigned long PropertyItemSize;
  /* 0x0008 */ const struct KSPROPERTY_SET* PropertySets;
  /* 0x0010 */ unsigned long MethodSetsCount;
  /* 0x0014 */ unsigned long MethodItemSize;
  /* 0x0018 */ const struct KSMETHOD_SET* MethodSets;
  /* 0x0020 */ unsigned long EventSetsCount;
  /* 0x0024 */ unsigned long EventItemSize;
  /* 0x0028 */ const struct KSEVENT_SET* EventSets;
}; /* size: 0x0030 */

struct KSBUFFER_ITEM
{
  /* 0x0000 */ struct KSDPC_ITEM DpcItem;
  /* 0x0050 */ struct _LIST_ENTRY BufferList;
}; /* size: 0x0060 */

struct KSCOMPONENTID
{
  /* 0x0000 */ struct _GUID Manufacturer;
  /* 0x0010 */ struct _GUID Product;
  /* 0x0020 */ struct _GUID Component;
  /* 0x0030 */ struct _GUID Name;
  /* 0x0040 */ unsigned long Version;
  /* 0x0044 */ unsigned long Revision;
}; /* size: 0x0048 */

union KSDATAFORMAT
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned long FormatSize;
      /* 0x0004 */ unsigned long Flags;
      /* 0x0008 */ unsigned long SampleSize;
      /* 0x000c */ unsigned long Reserved;
      /* 0x0010 */ struct _GUID MajorFormat;
      /* 0x0020 */ struct _GUID SubFormat;
      /* 0x0030 */ struct _GUID Specifier;
    }; /* size: 0x0040 */
    /* 0x0000 */ __int64 Alignment;
  }; /* size: 0x0040 */
}; /* size: 0x0040 */

struct KSDPC_ITEM
{
  /* 0x0000 */ struct _KDPC Dpc;
  /* 0x0040 */ unsigned long ReferenceCount;
  /* 0x0048 */ unsigned __int64 AccessLock;
}; /* size: 0x0050 */

struct KSEVENTDATA
{
  /* 0x0000 */ unsigned long NotificationType;
  union
  {
    struct
    {
      /* 0x0008 */ void* Event;
      /* 0x0010 */ unsigned __int64 Reserved[2];
    } /* size: 0x0018 */ EventHandle;
    struct
    {
      /* 0x0008 */ void* Semaphore;
      /* 0x0010 */ unsigned long Reserved;
      /* 0x0014 */ long Adjustment;
    } /* size: 0x0010 */ SemaphoreHandle;
    struct
    {
      /* 0x0008 */ void* Event;
      /* 0x0010 */ long Increment;
      /* 0x0018 */ unsigned __int64 Reserved;
    } /* size: 0x0018 */ EventObject;
    struct
    {
      /* 0x0008 */ void* Semaphore;
      /* 0x0010 */ long Increment;
      /* 0x0014 */ long Adjustment;
    } /* size: 0x0010 */ SemaphoreObject;
    struct
    {
      /* 0x0008 */ struct _KDPC* Dpc;
      /* 0x0010 */ unsigned long ReferenceCount;
      /* 0x0018 */ unsigned __int64 Reserved;
    } /* size: 0x0018 */ Dpc;
    struct
    {
      /* 0x0008 */ struct _WORK_QUEUE_ITEM* WorkQueueItem;
      /* 0x0010 */ enum _WORK_QUEUE_TYPE WorkQueueType;
      /* 0x0018 */ unsigned __int64 Reserved;
    } /* size: 0x0018 */ WorkItem;
    struct
    {
      /* 0x0008 */ struct _WORK_QUEUE_ITEM* WorkQueueItem;
      /* 0x0010 */ void* KsWorkerObject;
      /* 0x0018 */ unsigned __int64 Reserved;
    } /* size: 0x0018 */ KsWorkItem;
    struct
    {
      /* 0x0008 */ struct _KSFILTER* Filter;
      /* 0x0010 */ unsigned __int64 Reserved[2];
    } /* size: 0x0018 */ KsFilterProcessing;
    struct
    {
      /* 0x0008 */ struct _KSPIN* Pin;
      /* 0x0010 */ unsigned __int64 Reserved[2];
    } /* size: 0x0018 */ KsPinProcessing;
    struct
    {
      /* 0x0008 */ void* Unused;
      /* 0x0010 */ __int64 Alignment[2];
    } /* size: 0x0018 */ Alignment;
  }; /* size: 0x0018 */
}; /* size: 0x0020 */

struct KSEVENT_ITEM
{
  /* 0x0000 */ unsigned long EventId;
  /* 0x0004 */ unsigned long DataInput;
  /* 0x0008 */ unsigned long ExtraEntryData;
  /* 0x0010 */ void* AddHandler /* function */;
  /* 0x0018 */ void* RemoveHandler /* function */;
  /* 0x0020 */ void* SupportHandler /* function */;
}; /* size: 0x0028 */

struct KSEVENT_SET
{
  /* 0x0000 */ const struct _GUID* Set;
  /* 0x0008 */ unsigned long EventsCount;
  /* 0x0010 */ const struct KSEVENT_ITEM* EventItem;
}; /* size: 0x0018 */

struct KSFASTMETHOD_ITEM
{
  /* 0x0000 */ unsigned long MethodId;
  union
  {
    /* 0x0008 */ void* MethodHandler /* function */;
    struct
    {
      /* 0x0008 */ unsigned char MethodSupported;
      /* 0x0009 */ char __PADDING__[7];
    }; /* size: 0x0008 */
  }; /* size: 0x0008 */
}; /* size: 0x0010 */

struct KSFASTPROPERTY_ITEM
{
  /* 0x0000 */ unsigned long PropertyId;
  union
  {
    /* 0x0008 */ void* GetPropertyHandler /* function */;
    /* 0x0008 */ unsigned char GetSupported;
  }; /* size: 0x0008 */
  union
  {
    /* 0x0010 */ void* SetPropertyHandler /* function */;
    /* 0x0010 */ unsigned char SetSupported;
  }; /* size: 0x0008 */
  /* 0x0018 */ unsigned long Reserved;
  /* 0x001c */ long __PADDING__[1];
}; /* size: 0x0020 */

struct KSIDENTIFIER
{
  union
  {
    struct
    {
      /* 0x0000 */ struct _GUID Set;
      /* 0x0010 */ unsigned long Id;
      /* 0x0014 */ unsigned long Flags;
    }; /* size: 0x0018 */
    struct
    {
      /* 0x0000 */ __int64 Alignment;
      /* 0x0008 */ long __PADDING__[4];
    }; /* size: 0x0018 */
  }; /* size: 0x0018 */
}; /* size: 0x0018 */

struct KSMETHOD_ITEM
{
  /* 0x0000 */ unsigned long MethodId;
  union
  {
    /* 0x0008 */ void* MethodHandler /* function */;
    /* 0x0008 */ unsigned char MethodSupported;
  }; /* size: 0x0008 */
  /* 0x0010 */ unsigned long MinMethod;
  /* 0x0014 */ unsigned long MinData;
  /* 0x0018 */ void* SupportHandler /* function */;
  /* 0x0020 */ unsigned long Flags;
  /* 0x0024 */ long __PADDING__[1];
}; /* size: 0x0028 */

struct KSMETHOD_SET
{
  /* 0x0000 */ const struct _GUID* Set;
  /* 0x0008 */ unsigned long MethodsCount;
  /* 0x0010 */ const struct KSMETHOD_ITEM* MethodItem;
  /* 0x0018 */ unsigned long FastIoCount;
  /* 0x0020 */ const struct KSFASTMETHOD_ITEM* FastIoTable;
}; /* size: 0x0028 */

struct KSMULTIPLE_ITEM
{
  /* 0x0000 */ unsigned long Size;
  /* 0x0004 */ unsigned long Count;
}; /* size: 0x0008 */

enum KSPIN_COMMUNICATION
{
  KSPIN_COMMUNICATION_NONE = 0,
  KSPIN_COMMUNICATION_SINK = 1,
  KSPIN_COMMUNICATION_SOURCE = 2,
  KSPIN_COMMUNICATION_BOTH = 3,
  KSPIN_COMMUNICATION_BRIDGE = 4,
};

enum KSPIN_DATAFLOW
{
  KSPIN_DATAFLOW_IN = 1,
  KSPIN_DATAFLOW_OUT = 2,
};

struct KSPIN_DESCRIPTOR
{
  /* 0x0000 */ unsigned long InterfacesCount;
  /* 0x0008 */ const struct KSIDENTIFIER* Interfaces;
  /* 0x0010 */ unsigned long MediumsCount;
  /* 0x0018 */ const struct KSIDENTIFIER* Mediums;
  /* 0x0020 */ unsigned long DataRangesCount;
  /* 0x0028 */ union KSDATAFORMAT* const* DataRanges;
  /* 0x0030 */ enum KSPIN_DATAFLOW DataFlow;
  /* 0x0034 */ enum KSPIN_COMMUNICATION Communication;
  /* 0x0038 */ const struct _GUID* Category;
  /* 0x0040 */ const struct _GUID* Name;
  union
  {
    /* 0x0048 */ __int64 Reserved;
    /* 0x0048 */ unsigned long ConstrainedDataRangesCount;
  }; /* size: 0x0008 */
  /* 0x0050 */ union KSDATAFORMAT** ConstrainedDataRanges;
}; /* size: 0x0058 */

struct KSPRIORITY
{
  /* 0x0000 */ unsigned long PriorityClass;
  /* 0x0004 */ unsigned long PrioritySubClass;
}; /* size: 0x0008 */

struct KSPROPERTY_ITEM
{
  /* 0x0000 */ unsigned long PropertyId;
  union
  {
    /* 0x0008 */ void* GetPropertyHandler /* function */;
    /* 0x0008 */ unsigned char GetSupported;
  }; /* size: 0x0008 */
  /* 0x0010 */ unsigned long MinProperty;
  /* 0x0014 */ unsigned long MinData;
  union
  {
    /* 0x0018 */ void* SetPropertyHandler /* function */;
    /* 0x0018 */ unsigned char SetSupported;
  }; /* size: 0x0008 */
  /* 0x0020 */ const struct KSPROPERTY_VALUES* Values;
  /* 0x0028 */ unsigned long RelationsCount;
  /* 0x0030 */ const struct KSIDENTIFIER* Relations;
  /* 0x0038 */ void* SupportHandler /* function */;
  /* 0x0040 */ unsigned long SerializedSize;
  /* 0x0044 */ long __PADDING__[1];
}; /* size: 0x0048 */

struct KSPROPERTY_MEMBERSHEADER
{
  /* 0x0000 */ unsigned long MembersFlags;
  /* 0x0004 */ unsigned long MembersSize;
  /* 0x0008 */ unsigned long MembersCount;
  /* 0x000c */ unsigned long Flags;
}; /* size: 0x0010 */

struct KSPROPERTY_MEMBERSLIST
{
  /* 0x0000 */ struct KSPROPERTY_MEMBERSHEADER MembersHeader;
  /* 0x0010 */ const void* Members;
}; /* size: 0x0018 */

struct KSPROPERTY_SET
{
  /* 0x0000 */ const struct _GUID* Set;
  /* 0x0008 */ unsigned long PropertiesCount;
  /* 0x0010 */ const struct KSPROPERTY_ITEM* PropertyItem;
  /* 0x0018 */ unsigned long FastIoCount;
  /* 0x0020 */ const struct KSFASTPROPERTY_ITEM* FastIoTable;
}; /* size: 0x0028 */

struct KSPROPERTY_VALUES
{
  /* 0x0000 */ struct KSIDENTIFIER PropTypeSet;
  /* 0x0018 */ unsigned long MembersListCount;
  /* 0x0020 */ const struct KSPROPERTY_MEMBERSLIST* MembersList;
}; /* size: 0x0028 */

struct KSP_PIN
{
  /* 0x0000 */ struct KSIDENTIFIER Property;
  /* 0x0018 */ unsigned long PinId;
  /* 0x001c */ unsigned long Reserved;
}; /* size: 0x0020 */

enum KSRESET
{
  KSRESET_BEGIN = 0,
  KSRESET_END = 1,
};

struct KSRESOLUTION
{
  /* 0x0000 */ __int64 Granularity;
  /* 0x0008 */ __int64 Error;
}; /* size: 0x0010 */

enum KSSTATE
{
  KSSTATE_STOP = 0,
  KSSTATE_ACQUIRE = 1,
  KSSTATE_PAUSE = 2,
  KSSTATE_RUN = 3,
};

struct KSSTREAM_HEADER
{
  /* 0x0000 */ unsigned long Size;
  /* 0x0004 */ unsigned long TypeSpecificFlags;
  /* 0x0008 */ struct KSTIME PresentationTime;
  /* 0x0018 */ __int64 Duration;
  /* 0x0020 */ unsigned long FrameExtent;
  /* 0x0024 */ unsigned long DataUsed;
  /* 0x0028 */ void* Data;
  /* 0x0030 */ unsigned long OptionsFlags;
  /* 0x0034 */ unsigned long Reserved;
}; /* size: 0x0038 */

struct KSTIME
{
  /* 0x0000 */ __int64 Time;
  /* 0x0008 */ unsigned long Numerator;
  /* 0x000c */ unsigned long Denominator;
}; /* size: 0x0010 */

struct KSTOPOLOGY_CONNECTION
{
  /* 0x0000 */ unsigned long FromNode;
  /* 0x0004 */ unsigned long FromNodePin;
  /* 0x0008 */ unsigned long ToNode;
  /* 0x000c */ unsigned long ToNodePin;
}; /* size: 0x0010 */

struct KS_COMPRESSION
{
  /* 0x0000 */ unsigned long RatioNumerator;
  /* 0x0004 */ unsigned long RatioDenominator;
  /* 0x0008 */ unsigned long RatioConstantMargin;
}; /* size: 0x000c */

struct KS_FRAMING_ITEM
{
  /* 0x0000 */ struct _GUID MemoryType;
  /* 0x0010 */ struct _GUID BusType;
  /* 0x0020 */ unsigned long MemoryFlags;
  /* 0x0024 */ unsigned long BusFlags;
  /* 0x0028 */ unsigned long Flags;
  /* 0x002c */ unsigned long Frames;
  /* 0x0030 */ unsigned long FileAlignment;
  /* 0x0034 */ unsigned long MemoryTypeWeight;
  /* 0x0038 */ struct KS_FRAMING_RANGE PhysicalRange;
  /* 0x0044 */ struct KS_FRAMING_RANGE_WEIGHTED FramingRange;
}; /* size: 0x0058 */

struct KS_FRAMING_RANGE
{
  /* 0x0000 */ unsigned long MinFrameSize;
  /* 0x0004 */ unsigned long MaxFrameSize;
  /* 0x0008 */ unsigned long Stepping;
}; /* size: 0x000c */

struct KS_FRAMING_RANGE_WEIGHTED
{
  /* 0x0000 */ struct KS_FRAMING_RANGE Range;
  /* 0x000c */ unsigned long InPlaceWeight;
  /* 0x0010 */ unsigned long NotInPlaceWeight;
}; /* size: 0x0014 */

struct LIST_ENTRY32
{
  /* 0x0000 */ unsigned long Flink;
  /* 0x0004 */ unsigned long Blink;
}; /* size: 0x0008 */

struct LIST_ENTRY64
{
  /* 0x0000 */ unsigned __int64 Flink;
  /* 0x0008 */ unsigned __int64 Blink;
}; /* size: 0x0010 */

struct MSIX_TABLE_POINTER
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long BaseIndexRegister : 3; /* bit position: 0 */
      /* 0x0000 */ unsigned long Reserved : 29; /* bit position: 3 */
    }; /* bitfield */
    /* 0x0000 */ unsigned long TableOffset;
  }; /* size: 0x0004 */
}; /* size: 0x0004 */

enum NL_ADDRESS_TYPE
{
  NlatUnspecified = 0,
  NlatUnicast = 1,
  NlatAnycast = 2,
  NlatMulticast = 3,
  NlatBroadcast = 4,
  NlatInvalid = 5,
};

enum NetDmaEventTypes
{
  NdisMIndicateRecvEvent = 0,
  NdisPIndicateRecvEvent = 1,
  NdisPIndicateRecvCompleteEvent = 2,
  NdisPReturnPacketsExEvent = 3,
  NdisMReturnPacketsExEvent = 4,
  NdisPReturnPacketEvent = 5,
  NdisMReturnPacketEvent = 6,
  NdisMReturnPacketInRecvEvent = 7,
  DmaCopyV2VEvent = 8,
  DmaChainV2VNoCopyEvent = 9,
  DmaChainV2VCopyEvent = 10,
  DmaCopyP2VEvent = 11,
  DmaChainP2VNoCopyEvent = 12,
  DmaChainP2VCopyEvent = 13,
  DmaCopyFlushEvent = 14,
  DmaCopyAppendEvent = 15,
  DmaChainCopyAppendEvent = 16,
  DmaCopyFlushAppendEvent = 17,
  DmaCopyCheckForCompletionEvent = 18,
  DmaCopyGetPhysicalAddressEvent = 19,
  DmaCopyNullXferEvent = 20,
  DmaCopyDummyEvent = 21,
  TotalEventTypes = 22,
};

struct PCI_MSIX_CAPABILITY
{
  /* 0x0000 */ struct _PCI_CAPABILITIES_HEADER Header;
  struct
  {
    struct /* bitfield */
    {
      /* 0x0002 */ unsigned short TableSize : 11; /* bit position: 0 */
      /* 0x0002 */ unsigned short Reserved : 3; /* bit position: 11 */
      /* 0x0002 */ unsigned short FunctionMask : 1; /* bit position: 14 */
      /* 0x0002 */ unsigned short MSIXEnable : 1; /* bit position: 15 */
    }; /* bitfield */
  } /* size: 0x0002 */ MessageControl;
  /* 0x0004 */ struct MSIX_TABLE_POINTER MessageTable;
  /* 0x0008 */ struct MSIX_TABLE_POINTER PBATable;
}; /* size: 0x000c */

struct PCI_MSI_CAPABILITY
{
  /* 0x0000 */ struct _PCI_CAPABILITIES_HEADER Header;
  /* 0x0002 */ struct _PCI_MSI_MESSAGE_CONTROL MessageControl;
  union
  {
    union
    {
      /* 0x0004 */ struct _PCI_MSI_MESSAGE_ADDRESS Register;
      /* 0x0004 */ unsigned long Raw;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ MessageAddressLower;
  union
  {
    struct
    {
      /* 0x0008 */ unsigned short MessageData;
      /* 0x000a */ unsigned short Reserved;
      /* 0x000c */ unsigned long MaskBits;
      /* 0x0010 */ unsigned long PendingBits;
    } /* size: 0x000c */ Option32Bit;
    struct
    {
      /* 0x0008 */ unsigned long MessageAddressUpper;
      /* 0x000c */ unsigned short MessageData;
      /* 0x000e */ unsigned short Reserved;
      /* 0x0010 */ unsigned long MaskBits;
      /* 0x0014 */ unsigned long PendingBits;
    } /* size: 0x0010 */ Option64Bit;
  }; /* size: 0x0010 */
}; /* size: 0x0018 */

enum POWER_ACTION
{
  PowerActionNone = 0,
  PowerActionReserved = 1,
  PowerActionSleep = 2,
  PowerActionHibernate = 3,
  PowerActionShutdown = 4,
  PowerActionShutdownReset = 5,
  PowerActionShutdownOff = 6,
  PowerActionWarmEject = 7,
};

enum PS_CREATE_STATE
{
  PsCreateInitialState = 0,
  PsCreateFailOnFileOpen = 1,
  PsCreateFailOnSectionCreate = 2,
  PsCreateFailExeFormat = 3,
  PsCreateFailMachineMismatch = 4,
  PsCreateFailExeName = 5,
  PsCreateSuccess = 6,
  PsCreateMaximumStates = 7,
};

enum ReplacesCorHdrNumericDefines
{
  COMIMAGE_FLAGS_ILONLY = 1,
  COMIMAGE_FLAGS_32BITREQUIRED = 2,
  COMIMAGE_FLAGS_IL_LIBRARY = 4,
  COMIMAGE_FLAGS_STRONGNAMESIGNED = 8,
  COMIMAGE_FLAGS_NATIVE_ENTRYPOINT = 16,
  COMIMAGE_FLAGS_TRACKDEBUGDATA = 0x10000,
  COR_VERSION_MAJOR_V2 = 2,
  COR_VERSION_MAJOR = 2,
  COR_VERSION_MINOR = 0,
  COR_DELETED_NAME_LENGTH = 8,
  COR_VTABLEGAP_NAME_LENGTH = 8,
  NATIVE_TYPE_MAX_CB = 1,
  COR_ILMETHOD_SECT_SMALL_MAX_DATASIZE = 255,
  IMAGE_COR_MIH_METHODRVA = 1,
  IMAGE_COR_MIH_EHRVA = 2,
  IMAGE_COR_MIH_BASICBLOCK = 8,
  COR_VTABLE_32BIT = 1,
  COR_VTABLE_64BIT = 2,
  COR_VTABLE_FROM_UNMANAGED = 4,
  COR_VTABLE_FROM_UNMANAGED_RETAIN_APPDOMAIN = 8,
  COR_VTABLE_CALL_MOST_DERIVED = 16,
  IMAGE_COR_EATJ_THUNK_SIZE = 32,
  MAX_CLASS_NAME = 1024,
  MAX_PACKAGE_NAME = 1024,
};

struct SCOPE_ID
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long Zone : 28; /* bit position: 0 */
      /* 0x0000 */ unsigned long Level : 4; /* bit position: 28 */
    }; /* bitfield */
    /* 0x0000 */ unsigned long Value;
  }; /* size: 0x0004 */
}; /* size: 0x0004 */

enum SCOPE_LEVEL
{
  ScopeLevelInterface = 1,
  ScopeLevelLink = 2,
  ScopeLevelSubnet = 3,
  ScopeLevelAdmin = 4,
  ScopeLevelSite = 5,
  ScopeLevelOrganization = 8,
  ScopeLevelGlobal = 14,
  ScopeLevelCount = 16,
};

typedef struct _ACCESS_REASONS
{
  /* 0x0000 */ unsigned long Data[32];
} ACCESS_REASONS, *PACCESS_REASONS; /* size: 0x0080 */

typedef struct _ACCESS_STATE
{
  /* 0x0000 */ struct _LUID OperationID;
  /* 0x0008 */ unsigned char SecurityEvaluated;
  /* 0x0009 */ unsigned char GenerateAudit;
  /* 0x000a */ unsigned char GenerateOnClose;
  /* 0x000b */ unsigned char PrivilegesAllocated;
  /* 0x000c */ unsigned long Flags;
  /* 0x0010 */ unsigned long RemainingDesiredAccess;
  /* 0x0014 */ unsigned long PreviouslyGrantedAccess;
  /* 0x0018 */ unsigned long OriginalDesiredAccess;
  /* 0x0020 */ struct _SECURITY_SUBJECT_CONTEXT SubjectSecurityContext;
  /* 0x0040 */ void* SecurityDescriptor;
  /* 0x0048 */ void* AuxData;
  union
  {
    union
    {
      /* 0x0050 */ struct _INITIAL_PRIVILEGE_SET InitialPrivilegeSet;
      /* 0x0050 */ struct _PRIVILEGE_SET PrivilegeSet;
    }; /* size: 0x002c */
  } /* size: 0x002c */ Privileges;
  /* 0x007c */ unsigned char AuditPrivileges;
  /* 0x0080 */ struct _UNICODE_STRING ObjectName;
  /* 0x0090 */ struct _UNICODE_STRING ObjectTypeName;
} ACCESS_STATE, *PACCESS_STATE; /* size: 0x00a0 */

struct _ACTIVATION_CONTEXT;

struct _ACTIVATION_CONTEXT_DATA;

typedef struct _ACTIVATION_CONTEXT_STACK
{
  /* 0x0000 */ struct _RTL_ACTIVATION_CONTEXT_STACK_FRAME* ActiveFrame;
  /* 0x0008 */ struct _LIST_ENTRY FrameListCache;
  /* 0x0018 */ unsigned long Flags;
  /* 0x001c */ unsigned long NextCookieSequenceNumber;
  /* 0x0020 */ unsigned long StackId;
  /* 0x0024 */ long __PADDING__[1];
} ACTIVATION_CONTEXT_STACK, *PACTIVATION_CONTEXT_STACK; /* size: 0x0028 */

typedef enum _ALTERNATIVE_ARCHITECTURE_TYPE
{
  StandardDesign = 0,
  NEC98x86 = 1,
  EndAlternatives = 2,
} ALTERNATIVE_ARCHITECTURE_TYPE, *PALTERNATIVE_ARCHITECTURE_TYPE;

struct _ASSEMBLY_STORAGE_MAP;

typedef struct _AUX_ACCESS_DATA
{
  /* 0x0000 */ struct _PRIVILEGE_SET* PrivilegesUsed;
  /* 0x0008 */ struct _GENERIC_MAPPING GenericMapping;
  /* 0x0018 */ unsigned long AccessesToAudit;
  /* 0x001c */ unsigned long MaximumAuditMask;
  /* 0x0020 */ struct _GUID TransactionId;
  /* 0x0030 */ void* NewSecurityDescriptor;
  /* 0x0038 */ void* ExistingSecurityDescriptor;
  /* 0x0040 */ void* ParentSecurityDescriptor;
  /* 0x0048 */ void* DeRefSecurityDescriptor /* function */;
  /* 0x0050 */ void* SDLock;
  /* 0x0058 */ struct _ACCESS_REASONS AccessReasons;
} AUX_ACCESS_DATA, *PAUX_ACCESS_DATA; /* size: 0x00d8 */

typedef struct _CLIENT_ID
{
  /* 0x0000 */ void* UniqueProcess;
  /* 0x0008 */ void* UniqueThread;
} CLIENT_ID, *PCLIENT_ID; /* size: 0x0010 */

typedef struct _CM_FULL_RESOURCE_DESCRIPTOR
{
  /* 0x0000 */ enum _INTERFACE_TYPE InterfaceType;
  /* 0x0004 */ unsigned long BusNumber;
  /* 0x0008 */ struct _CM_PARTIAL_RESOURCE_LIST PartialResourceList;
} CM_FULL_RESOURCE_DESCRIPTOR, *PCM_FULL_RESOURCE_DESCRIPTOR; /* size: 0x0024 */

typedef struct _CM_PARTIAL_RESOURCE_DESCRIPTOR
{
  /* 0x0000 */ unsigned char Type;
  /* 0x0001 */ unsigned char ShareDisposition;
  /* 0x0002 */ unsigned short Flags;
  union
  {
    union
    {
      struct
      {
        /* 0x0004 */ union _LARGE_INTEGER Start;
        /* 0x000c */ unsigned long Length;
      } /* size: 0x000c */ Generic;
      struct
      {
        /* 0x0004 */ union _LARGE_INTEGER Start;
        /* 0x000c */ unsigned long Length;
      } /* size: 0x000c */ Port;
      struct
      {
        /* 0x0004 */ unsigned short Level;
        /* 0x0006 */ unsigned short Group;
        /* 0x0008 */ unsigned long Vector;
        /* 0x000c */ unsigned __int64 Affinity;
      } /* size: 0x0010 */ Interrupt;
      struct
      {
        union
        {
          struct
          {
            /* 0x0004 */ unsigned short Group;
            /* 0x0006 */ unsigned short MessageCount;
            /* 0x0008 */ unsigned long Vector;
            /* 0x000c */ unsigned __int64 Affinity;
          } /* size: 0x0010 */ Raw;
          struct
          {
            /* 0x0004 */ unsigned short Level;
            /* 0x0006 */ unsigned short Group;
            /* 0x0008 */ unsigned long Vector;
            /* 0x000c */ unsigned __int64 Affinity;
          } /* size: 0x0010 */ Translated;
        }; /* size: 0x0010 */
      } /* size: 0x0010 */ MessageInterrupt;
      struct
      {
        /* 0x0004 */ union _LARGE_INTEGER Start;
        /* 0x000c */ unsigned long Length;
      } /* size: 0x000c */ Memory;
      struct
      {
        /* 0x0004 */ unsigned long Channel;
        /* 0x0008 */ unsigned long Port;
        /* 0x000c */ unsigned long Reserved1;
      } /* size: 0x000c */ Dma;
      struct
      {
        /* 0x0004 */ unsigned long Data[3];
      } /* size: 0x000c */ DevicePrivate;
      struct
      {
        /* 0x0004 */ unsigned long Start;
        /* 0x0008 */ unsigned long Length;
        /* 0x000c */ unsigned long Reserved;
      } /* size: 0x000c */ BusNumber;
      struct
      {
        /* 0x0004 */ unsigned long DataSize;
        /* 0x0008 */ unsigned long Reserved1;
        /* 0x000c */ unsigned long Reserved2;
      } /* size: 0x000c */ DeviceSpecificData;
      struct
      {
        /* 0x0004 */ union _LARGE_INTEGER Start;
        /* 0x000c */ unsigned long Length40;
      } /* size: 0x000c */ Memory40;
      struct
      {
        /* 0x0004 */ union _LARGE_INTEGER Start;
        /* 0x000c */ unsigned long Length48;
      } /* size: 0x000c */ Memory48;
      struct
      {
        /* 0x0004 */ union _LARGE_INTEGER Start;
        /* 0x000c */ unsigned long Length64;
      } /* size: 0x000c */ Memory64;
    }; /* size: 0x0010 */
  } /* size: 0x0010 */ u;
} CM_PARTIAL_RESOURCE_DESCRIPTOR, *PCM_PARTIAL_RESOURCE_DESCRIPTOR; /* size: 0x0014 */

typedef struct _CM_PARTIAL_RESOURCE_LIST
{
  /* 0x0000 */ unsigned short Version;
  /* 0x0002 */ unsigned short Revision;
  /* 0x0004 */ unsigned long Count;
  /* 0x0008 */ struct _CM_PARTIAL_RESOURCE_DESCRIPTOR PartialDescriptors[1];
} CM_PARTIAL_RESOURCE_LIST, *PCM_PARTIAL_RESOURCE_LIST; /* size: 0x001c */

typedef struct _CM_RESOURCE_LIST
{
  /* 0x0000 */ unsigned long Count;
  /* 0x0004 */ struct _CM_FULL_RESOURCE_DESCRIPTOR List[1];
} CM_RESOURCE_LIST, *PCM_RESOURCE_LIST; /* size: 0x0028 */

typedef struct _COMPRESSED_DATA_INFO
{
  /* 0x0000 */ unsigned short CompressionFormatAndEngine;
  /* 0x0002 */ unsigned char CompressionUnitShift;
  /* 0x0003 */ unsigned char ChunkShift;
  /* 0x0004 */ unsigned char ClusterShift;
  /* 0x0005 */ unsigned char Reserved;
  /* 0x0006 */ unsigned short NumberOfChunks;
  /* 0x0008 */ unsigned long CompressedChunkSizes[1];
} COMPRESSED_DATA_INFO, *PCOMPRESSED_DATA_INFO; /* size: 0x000c */

typedef struct _CONTEXT
{
  /* 0x0000 */ unsigned __int64 P1Home;
  /* 0x0008 */ unsigned __int64 P2Home;
  /* 0x0010 */ unsigned __int64 P3Home;
  /* 0x0018 */ unsigned __int64 P4Home;
  /* 0x0020 */ unsigned __int64 P5Home;
  /* 0x0028 */ unsigned __int64 P6Home;
  /* 0x0030 */ unsigned long ContextFlags;
  /* 0x0034 */ unsigned long MxCsr;
  /* 0x0038 */ unsigned short SegCs;
  /* 0x003a */ unsigned short SegDs;
  /* 0x003c */ unsigned short SegEs;
  /* 0x003e */ unsigned short SegFs;
  /* 0x0040 */ unsigned short SegGs;
  /* 0x0042 */ unsigned short SegSs;
  /* 0x0044 */ unsigned long EFlags;
  /* 0x0048 */ unsigned __int64 Dr0;
  /* 0x0050 */ unsigned __int64 Dr1;
  /* 0x0058 */ unsigned __int64 Dr2;
  /* 0x0060 */ unsigned __int64 Dr3;
  /* 0x0068 */ unsigned __int64 Dr6;
  /* 0x0070 */ unsigned __int64 Dr7;
  /* 0x0078 */ unsigned __int64 Rax;
  /* 0x0080 */ unsigned __int64 Rcx;
  /* 0x0088 */ unsigned __int64 Rdx;
  /* 0x0090 */ unsigned __int64 Rbx;
  /* 0x0098 */ unsigned __int64 Rsp;
  /* 0x00a0 */ unsigned __int64 Rbp;
  /* 0x00a8 */ unsigned __int64 Rsi;
  /* 0x00b0 */ unsigned __int64 Rdi;
  /* 0x00b8 */ unsigned __int64 R8;
  /* 0x00c0 */ unsigned __int64 R9;
  /* 0x00c8 */ unsigned __int64 R10;
  /* 0x00d0 */ unsigned __int64 R11;
  /* 0x00d8 */ unsigned __int64 R12;
  /* 0x00e0 */ unsigned __int64 R13;
  /* 0x00e8 */ unsigned __int64 R14;
  /* 0x00f0 */ unsigned __int64 R15;
  /* 0x00f8 */ unsigned __int64 Rip;
  union
  {
    /* 0x0100 */ struct _XSAVE_FORMAT FltSave;
    struct
    {
      /* 0x0100 */ struct _M128A Header[2];
      /* 0x0120 */ struct _M128A Legacy[8];
      /* 0x01a0 */ struct _M128A Xmm0;
      /* 0x01b0 */ struct _M128A Xmm1;
      /* 0x01c0 */ struct _M128A Xmm2;
      /* 0x01d0 */ struct _M128A Xmm3;
      /* 0x01e0 */ struct _M128A Xmm4;
      /* 0x01f0 */ struct _M128A Xmm5;
      /* 0x0200 */ struct _M128A Xmm6;
      /* 0x0210 */ struct _M128A Xmm7;
      /* 0x0220 */ struct _M128A Xmm8;
      /* 0x0230 */ struct _M128A Xmm9;
      /* 0x0240 */ struct _M128A Xmm10;
      /* 0x0250 */ struct _M128A Xmm11;
      /* 0x0260 */ struct _M128A Xmm12;
      /* 0x0270 */ struct _M128A Xmm13;
      /* 0x0280 */ struct _M128A Xmm14;
      /* 0x0290 */ struct _M128A Xmm15;
    }; /* size: 0x01a0 */
  }; /* size: 0x0200 */
  /* 0x0300 */ struct _M128A VectorRegister[26];
  /* 0x04a0 */ unsigned __int64 VectorControl;
  /* 0x04a8 */ unsigned __int64 DebugControl;
  /* 0x04b0 */ unsigned __int64 LastBranchToRip;
  /* 0x04b8 */ unsigned __int64 LastBranchFromRip;
  /* 0x04c0 */ unsigned __int64 LastExceptionToRip;
  /* 0x04c8 */ unsigned __int64 LastExceptionFromRip;
} CONTEXT, *PCONTEXT; /* size: 0x04d0 */

typedef struct _CO_CALL_MANAGER_PARAMETERS
{
  /* 0x0000 */ struct _flowspec Transmit;
  /* 0x0020 */ struct _flowspec Receive;
  /* 0x0040 */ struct _CO_SPECIFIC_PARAMETERS CallMgrSpecific;
} CO_CALL_MANAGER_PARAMETERS, *PCO_CALL_MANAGER_PARAMETERS; /* size: 0x004c */

typedef struct _CO_CALL_PARAMETERS
{
  /* 0x0000 */ unsigned long Flags;
  /* 0x0008 */ struct _CO_CALL_MANAGER_PARAMETERS* CallMgrParameters;
  /* 0x0010 */ struct _CO_MEDIA_PARAMETERS* MediaParameters;
} CO_CALL_PARAMETERS, *PCO_CALL_PARAMETERS; /* size: 0x0018 */

typedef struct _CO_MEDIA_PARAMETERS
{
  /* 0x0000 */ unsigned long Flags;
  /* 0x0004 */ unsigned long ReceivePriority;
  /* 0x0008 */ unsigned long ReceiveSizeHint;
  /* 0x0010 */ struct _CO_SPECIFIC_PARAMETERS MediaSpecific;
  /* 0x001c */ long __PADDING__[1];
} CO_MEDIA_PARAMETERS, *PCO_MEDIA_PARAMETERS; /* size: 0x0020 */

typedef struct _CO_SPECIFIC_PARAMETERS
{
  /* 0x0000 */ unsigned long ParamType;
  /* 0x0004 */ unsigned long Length;
  /* 0x0008 */ unsigned char Parameters[1];
  /* 0x0009 */ char __PADDING__[3];
} CO_SPECIFIC_PARAMETERS, *PCO_SPECIFIC_PARAMETERS; /* size: 0x000c */

typedef struct _CURDIR
{
  /* 0x0000 */ struct _UNICODE_STRING DosPath;
  /* 0x0010 */ void* Handle;
} CURDIR, *PCURDIR; /* size: 0x0018 */

typedef union _DATA
{
  union
  {
    /* 0x0000 */ struct _QUERY_INFORMATION QUERY_INFORMATION;
    /* 0x0000 */ struct _SET_INFORMATION SET_INFORMATION;
  }; /* size: 0x0020 */
} DATA, *PDATA; /* size: 0x0020 */

typedef struct _DEVICE_CAPABILITIES
{
  /* 0x0000 */ unsigned short Size;
  /* 0x0002 */ unsigned short Version;
  struct /* bitfield */
  {
    /* 0x0004 */ unsigned long DeviceD1 : 1; /* bit position: 0 */
    /* 0x0004 */ unsigned long DeviceD2 : 1; /* bit position: 1 */
    /* 0x0004 */ unsigned long LockSupported : 1; /* bit position: 2 */
    /* 0x0004 */ unsigned long EjectSupported : 1; /* bit position: 3 */
    /* 0x0004 */ unsigned long Removable : 1; /* bit position: 4 */
    /* 0x0004 */ unsigned long DockDevice : 1; /* bit position: 5 */
    /* 0x0004 */ unsigned long UniqueID : 1; /* bit position: 6 */
    /* 0x0004 */ unsigned long SilentInstall : 1; /* bit position: 7 */
    /* 0x0004 */ unsigned long RawDeviceOK : 1; /* bit position: 8 */
    /* 0x0004 */ unsigned long SurpriseRemovalOK : 1; /* bit position: 9 */
    /* 0x0004 */ unsigned long WakeFromD0 : 1; /* bit position: 10 */
    /* 0x0004 */ unsigned long WakeFromD1 : 1; /* bit position: 11 */
    /* 0x0004 */ unsigned long WakeFromD2 : 1; /* bit position: 12 */
    /* 0x0004 */ unsigned long WakeFromD3 : 1; /* bit position: 13 */
    /* 0x0004 */ unsigned long HardwareDisabled : 1; /* bit position: 14 */
    /* 0x0004 */ unsigned long NonDynamic : 1; /* bit position: 15 */
    /* 0x0004 */ unsigned long WarmEjectSupported : 1; /* bit position: 16 */
    /* 0x0004 */ unsigned long NoDisplayInUI : 1; /* bit position: 17 */
    /* 0x0004 */ unsigned long Reserved1 : 1; /* bit position: 18 */
    /* 0x0004 */ unsigned long Reserved : 13; /* bit position: 19 */
  }; /* bitfield */
  /* 0x0008 */ unsigned long Address;
  /* 0x000c */ unsigned long UINumber;
  /* 0x0010 */ enum _DEVICE_POWER_STATE DeviceState[7];
  /* 0x002c */ enum _SYSTEM_POWER_STATE SystemWake;
  /* 0x0030 */ enum _DEVICE_POWER_STATE DeviceWake;
  /* 0x0034 */ unsigned long D1Latency;
  /* 0x0038 */ unsigned long D2Latency;
  /* 0x003c */ unsigned long D3Latency;
} DEVICE_CAPABILITIES, *PDEVICE_CAPABILITIES; /* size: 0x0040 */

typedef struct _DEVICE_OBJECT
{
  /* 0x0000 */ short Type;
  /* 0x0002 */ unsigned short Size;
  /* 0x0004 */ long ReferenceCount;
  /* 0x0008 */ struct _DRIVER_OBJECT* DriverObject;
  /* 0x0010 */ struct _DEVICE_OBJECT* NextDevice;
  /* 0x0018 */ struct _DEVICE_OBJECT* AttachedDevice;
  /* 0x0020 */ struct _IRP* CurrentIrp;
  /* 0x0028 */ struct _IO_TIMER* Timer;
  /* 0x0030 */ unsigned long Flags;
  /* 0x0034 */ unsigned long Characteristics;
  /* 0x0038 */ struct _VPB* Vpb;
  /* 0x0040 */ void* DeviceExtension;
  /* 0x0048 */ unsigned long DeviceType;
  /* 0x004c */ char StackSize;
  union
  {
    union
    {
      /* 0x0050 */ struct _LIST_ENTRY ListEntry;
      /* 0x0050 */ struct _WAIT_CONTEXT_BLOCK Wcb;
    }; /* size: 0x0048 */
  } /* size: 0x0048 */ Queue;
  /* 0x0098 */ unsigned long AlignmentRequirement;
  /* 0x00a0 */ struct _KDEVICE_QUEUE DeviceQueue;
  /* 0x00c8 */ struct _KDPC Dpc;
  /* 0x0108 */ unsigned long ActiveThreadCount;
  /* 0x0110 */ void* SecurityDescriptor;
  /* 0x0118 */ struct _KEVENT DeviceLock;
  /* 0x0130 */ unsigned short SectorSize;
  /* 0x0132 */ unsigned short Spare1;
  /* 0x0138 */ struct _DEVOBJ_EXTENSION* DeviceObjectExtension;
  /* 0x0140 */ void* Reserved;
  /* 0x0148 */ long __PADDING__[2];
} DEVICE_OBJECT, *PDEVICE_OBJECT; /* size: 0x0150 */

struct _DEVICE_OBJECT_POWER_EXTENSION;

typedef enum _DEVICE_POWER_STATE
{
  PowerDeviceUnspecified = 0,
  PowerDeviceD0 = 1,
  PowerDeviceD1 = 2,
  PowerDeviceD2 = 3,
  PowerDeviceD3 = 4,
  PowerDeviceMaximum = 5,
} DEVICE_POWER_STATE, *PDEVICE_POWER_STATE;

typedef enum _DEVICE_RELATION_TYPE
{
  BusRelations = 0,
  EjectionRelations = 1,
  PowerRelations = 2,
  RemovalRelations = 3,
  TargetDeviceRelation = 4,
  SingleBusRelations = 5,
  TransportRelations = 6,
} DEVICE_RELATION_TYPE, *PDEVICE_RELATION_TYPE;

typedef enum _DEVICE_USAGE_NOTIFICATION_TYPE
{
  DeviceUsageTypeUndefined = 0,
  DeviceUsageTypePaging = 1,
  DeviceUsageTypeHibernation = 2,
  DeviceUsageTypeDumpFile = 3,
} DEVICE_USAGE_NOTIFICATION_TYPE, *PDEVICE_USAGE_NOTIFICATION_TYPE;

typedef struct _DEVOBJ_EXTENSION
{
  /* 0x0000 */ short Type;
  /* 0x0002 */ unsigned short Size;
  /* 0x0008 */ struct _DEVICE_OBJECT* DeviceObject;
  /* 0x0010 */ unsigned long PowerFlags;
  /* 0x0018 */ struct _DEVICE_OBJECT_POWER_EXTENSION* Dope;
  /* 0x0020 */ unsigned long ExtensionFlags;
  /* 0x0028 */ void* DeviceNode;
  /* 0x0030 */ struct _DEVICE_OBJECT* AttachedTo;
  /* 0x0038 */ long StartIoCount;
  /* 0x003c */ long StartIoKey;
  /* 0x0040 */ unsigned long StartIoFlags;
  /* 0x0048 */ struct _VPB* Vpb;
  /* 0x0050 */ struct _LIST_ENTRY DependentList;
  /* 0x0060 */ struct _LIST_ENTRY ProviderList;
} DEVOBJ_EXTENSION, *PDEVOBJ_EXTENSION; /* size: 0x0070 */

typedef struct _DEVPROPKEY
{
  /* 0x0000 */ struct _GUID fmtid;
  /* 0x0010 */ unsigned long pid;
} DEVPROPKEY, *PDEVPROPKEY; /* size: 0x0014 */

typedef struct _DISPATCHER_HEADER
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned char Type;
      union
      {
        /* 0x0001 */ unsigned char TimerControlFlags;
        struct /* bitfield */
        {
          /* 0x0001 */ unsigned char Absolute : 1; /* bit position: 0 */
          /* 0x0001 */ unsigned char Coalescable : 1; /* bit position: 1 */
          /* 0x0001 */ unsigned char KeepShifting : 1; /* bit position: 2 */
          /* 0x0001 */ unsigned char EncodedTolerableDelay : 5; /* bit position: 3 */
        }; /* bitfield */
        /* 0x0001 */ unsigned char Abandoned;
        struct
        {
          /* 0x0001 */ unsigned char Signalling;
          union
          {
            /* 0x0002 */ unsigned char ThreadControlFlags;
            struct /* bitfield */
            {
              /* 0x0002 */ unsigned char CpuThrottled : 1; /* bit position: 0 */
              /* 0x0002 */ unsigned char CycleProfiling : 1; /* bit position: 1 */
              /* 0x0002 */ unsigned char CounterProfiling : 1; /* bit position: 2 */
              /* 0x0002 */ unsigned char Reserved : 5; /* bit position: 3 */
            }; /* bitfield */
            /* 0x0002 */ unsigned char Hand;
            struct
            {
              /* 0x0002 */ unsigned char Size;
              union
              {
                /* 0x0003 */ unsigned char TimerMiscFlags;
                struct /* bitfield */
                {
                  /* 0x0003 */ unsigned char Index : 6; /* bit position: 0 */
                  /* 0x0003 */ unsigned char Inserted : 1; /* bit position: 6 */
                  /* 0x0003 */ volatile unsigned char Expired : 1; /* bit position: 7 */
                }; /* bitfield */
                /* 0x0003 */ unsigned char DebugActive;
                struct /* bitfield */
                {
                  /* 0x0003 */ unsigned char ActiveDR7 : 1; /* bit position: 0 */
                  /* 0x0003 */ unsigned char Instrumented : 1; /* bit position: 1 */
                  /* 0x0003 */ unsigned char Reserved2 : 4; /* bit position: 2 */
                  /* 0x0003 */ unsigned char UmsScheduled : 1; /* bit position: 6 */
                  /* 0x0003 */ unsigned char UmsPrimary : 1; /* bit position: 7 */
                }; /* bitfield */
                /* 0x0003 */ unsigned char DpcActive;
              }; /* size: 0x0001 */
            }; /* size: 0x0002 */
          }; /* size: 0x0002 */
        }; /* size: 0x0003 */
      }; /* size: 0x0003 */
    }; /* size: 0x0004 */
    /* 0x0000 */ volatile long Lock;
  }; /* size: 0x0004 */
  /* 0x0004 */ long SignalState;
  /* 0x0008 */ struct _LIST_ENTRY WaitListHead;
} DISPATCHER_HEADER, *PDISPATCHER_HEADER; /* size: 0x0018 */

typedef union _DL_EI48
{
  /* 0x0000 */ unsigned char Byte[3];
} DL_EI48, *PDL_EI48; /* size: 0x0003 */

typedef union _DL_EUI48
{
  union
  {
    /* 0x0000 */ unsigned char Byte[6];
    struct
    {
      /* 0x0000 */ union _DL_OUI Oui;
      /* 0x0003 */ union _DL_EI48 Ei48;
    }; /* size: 0x0006 */
  }; /* size: 0x0006 */
} DL_EUI48, *PDL_EUI48; /* size: 0x0006 */

typedef union _DL_OUI
{
  union
  {
    /* 0x0000 */ unsigned char Byte[3];
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned char Group : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned char Local : 1; /* bit position: 1 */
    }; /* bitfield */
  }; /* size: 0x0003 */
} DL_OUI, *PDL_OUI; /* size: 0x0003 */

typedef struct _DMA_ADAPTER
{
  /* 0x0000 */ unsigned short Version;
  /* 0x0002 */ unsigned short Size;
  /* 0x0008 */ struct _DMA_OPERATIONS* DmaOperations;
} DMA_ADAPTER, *PDMA_ADAPTER; /* size: 0x0010 */

typedef struct _DMA_OPERATIONS
{
  /* 0x0000 */ unsigned long Size;
  /* 0x0008 */ void* PutDmaAdapter /* function */;
  /* 0x0010 */ void* AllocateCommonBuffer /* function */;
  /* 0x0018 */ void* FreeCommonBuffer /* function */;
  /* 0x0020 */ void* AllocateAdapterChannel /* function */;
  /* 0x0028 */ void* FlushAdapterBuffers /* function */;
  /* 0x0030 */ void* FreeAdapterChannel /* function */;
  /* 0x0038 */ void* FreeMapRegisters /* function */;
  /* 0x0040 */ void* MapTransfer /* function */;
  /* 0x0048 */ void* GetDmaAlignment /* function */;
  /* 0x0050 */ void* ReadDmaCounter /* function */;
  /* 0x0058 */ void* GetScatterGatherList /* function */;
  /* 0x0060 */ void* PutScatterGatherList /* function */;
  /* 0x0068 */ void* CalculateScatterGatherList /* function */;
  /* 0x0070 */ void* BuildScatterGatherList /* function */;
  /* 0x0078 */ void* BuildMdlFromScatterGatherList /* function */;
} DMA_OPERATIONS, *PDMA_OPERATIONS; /* size: 0x0080 */

typedef enum _DOT11_PHY_TYPE
{
  dot11_phy_type_unknown = 0,
  dot11_phy_type_any = 0,
  dot11_phy_type_fhss = 1,
  dot11_phy_type_dsss = 2,
  dot11_phy_type_irbaseband = 3,
  dot11_phy_type_ofdm = 4,
  dot11_phy_type_hrdsss = 5,
  dot11_phy_type_erp = 6,
  dot11_phy_type_ht = 7,
  dot11_phy_type_IHV_start = -2147483648,
  dot11_phy_type_IHV_end = -1,
} DOT11_PHY_TYPE, *PDOT11_PHY_TYPE;

typedef struct _DRIVER_EXTENSION
{
  /* 0x0000 */ struct _DRIVER_OBJECT* DriverObject;
  /* 0x0008 */ void* AddDevice /* function */;
  /* 0x0010 */ unsigned long Count;
  /* 0x0018 */ struct _UNICODE_STRING ServiceKeyName;
} DRIVER_EXTENSION, *PDRIVER_EXTENSION; /* size: 0x0028 */

typedef struct _DRIVER_OBJECT
{
  /* 0x0000 */ short Type;
  /* 0x0002 */ short Size;
  /* 0x0008 */ struct _DEVICE_OBJECT* DeviceObject;
  /* 0x0010 */ unsigned long Flags;
  /* 0x0018 */ void* DriverStart;
  /* 0x0020 */ unsigned long DriverSize;
  /* 0x0028 */ void* DriverSection;
  /* 0x0030 */ struct _DRIVER_EXTENSION* DriverExtension;
  /* 0x0038 */ struct _UNICODE_STRING DriverName;
  /* 0x0048 */ struct _UNICODE_STRING* HardwareDatabase;
  /* 0x0050 */ struct _FAST_IO_DISPATCH* FastIoDispatch;
  /* 0x0058 */ void* DriverInit /* function */;
  /* 0x0060 */ void* DriverStartIo /* function */;
  /* 0x0068 */ void* DriverUnload /* function */;
  /* 0x0070 */ void* MajorFunction[28] /* function */;
} DRIVER_OBJECT, *PDRIVER_OBJECT; /* size: 0x0150 */

struct _ECP_LIST;

struct _EPROCESS;

typedef struct _ERESOURCE
{
  /* 0x0000 */ struct _LIST_ENTRY SystemResourcesList;
  /* 0x0010 */ struct _OWNER_ENTRY* OwnerTable;
  /* 0x0018 */ short ActiveCount;
  /* 0x001a */ unsigned short Flag;
  /* 0x0020 */ struct _KSEMAPHORE* SharedWaiters;
  /* 0x0028 */ struct _KEVENT* ExclusiveWaiters;
  /* 0x0030 */ struct _OWNER_ENTRY OwnerEntry;
  /* 0x0040 */ unsigned long ActiveEntries;
  /* 0x0044 */ unsigned long ContentionCount;
  /* 0x0048 */ unsigned long NumberOfSharedWaiters;
  /* 0x004c */ unsigned long NumberOfExclusiveWaiters;
  /* 0x0050 */ void* Reserved2;
  union
  {
    /* 0x0058 */ void* Address;
    /* 0x0058 */ unsigned __int64 CreatorBackTraceIndex;
  }; /* size: 0x0008 */
  /* 0x0060 */ unsigned __int64 SpinLock;
} ERESOURCE, *PERESOURCE; /* size: 0x0068 */

struct _ETHREAD;

typedef struct _ETH_MULTICAST_WRAPPER
{
  /* 0x0000 */ unsigned long RefCount;
  /* 0x0004 */ unsigned char MCastAddress[6];
  /* 0x000a */ char __PADDING__[2];
} ETH_MULTICAST_WRAPPER, *PETH_MULTICAST_WRAPPER; /* size: 0x000c */

typedef struct _EVENT_DATA_DESCRIPTOR
{
  /* 0x0000 */ unsigned __int64 Ptr;
  /* 0x0008 */ unsigned long Size;
  /* 0x000c */ unsigned long Reserved;
} EVENT_DATA_DESCRIPTOR, *PEVENT_DATA_DESCRIPTOR; /* size: 0x0010 */

typedef struct _EVENT_DESCRIPTOR
{
  /* 0x0000 */ unsigned short Id;
  /* 0x0002 */ unsigned char Version;
  /* 0x0003 */ unsigned char Channel;
  /* 0x0004 */ unsigned char Level;
  /* 0x0005 */ unsigned char Opcode;
  /* 0x0006 */ unsigned short Task;
  /* 0x0008 */ unsigned __int64 Keyword;
} EVENT_DESCRIPTOR, *PEVENT_DESCRIPTOR; /* size: 0x0010 */

typedef struct _EVENT_FILTER_DESCRIPTOR
{
  /* 0x0000 */ unsigned __int64 Ptr;
  /* 0x0008 */ unsigned long Size;
  /* 0x000c */ unsigned long Type;
} EVENT_FILTER_DESCRIPTOR, *PEVENT_FILTER_DESCRIPTOR; /* size: 0x0010 */

typedef enum _EVENT_TYPE
{
  NotificationEvent = 0,
  SynchronizationEvent = 1,
} EVENT_TYPE, *PEVENT_TYPE;

typedef enum _EXCEPTION_DISPOSITION
{
  ExceptionContinueExecution = 0,
  ExceptionContinueSearch = 1,
  ExceptionNestedException = 2,
  ExceptionCollidedUnwind = 3,
} EXCEPTION_DISPOSITION, *PEXCEPTION_DISPOSITION;

typedef struct _EXCEPTION_RECORD
{
  /* 0x0000 */ long ExceptionCode;
  /* 0x0004 */ unsigned long ExceptionFlags;
  /* 0x0008 */ struct _EXCEPTION_RECORD* ExceptionRecord;
  /* 0x0010 */ void* ExceptionAddress;
  /* 0x0018 */ unsigned long NumberParameters;
  /* 0x0020 */ unsigned __int64 ExceptionInformation[15];
} EXCEPTION_RECORD, *PEXCEPTION_RECORD; /* size: 0x0098 */

typedef struct _EXCEPTION_REGISTRATION_RECORD
{
  /* 0x0000 */ struct _EXCEPTION_REGISTRATION_RECORD* Next;
  /* 0x0008 */ void* Handler /* function */;
} EXCEPTION_REGISTRATION_RECORD, *PEXCEPTION_REGISTRATION_RECORD; /* size: 0x0010 */

typedef struct _EX_PUSH_LOCK
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned __int64 Locked : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned __int64 Waiting : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned __int64 Waking : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned __int64 MultipleShared : 1; /* bit position: 3 */
      /* 0x0000 */ unsigned __int64 Shared : 60; /* bit position: 4 */
    }; /* bitfield */
    /* 0x0000 */ unsigned __int64 Value;
    /* 0x0000 */ void* Ptr;
  }; /* size: 0x0008 */
} EX_PUSH_LOCK, *PEX_PUSH_LOCK; /* size: 0x0008 */

typedef struct _EX_PUSH_LOCK_CACHE_AWARE
{
  /* 0x0000 */ struct _EX_PUSH_LOCK* Locks[32];
} EX_PUSH_LOCK_CACHE_AWARE, *PEX_PUSH_LOCK_CACHE_AWARE; /* size: 0x0100 */

typedef struct _FAST_IO_DISPATCH
{
  /* 0x0000 */ unsigned long SizeOfFastIoDispatch;
  /* 0x0008 */ void* FastIoCheckIfPossible /* function */;
  /* 0x0010 */ void* FastIoRead /* function */;
  /* 0x0018 */ void* FastIoWrite /* function */;
  /* 0x0020 */ void* FastIoQueryBasicInfo /* function */;
  /* 0x0028 */ void* FastIoQueryStandardInfo /* function */;
  /* 0x0030 */ void* FastIoLock /* function */;
  /* 0x0038 */ void* FastIoUnlockSingle /* function */;
  /* 0x0040 */ void* FastIoUnlockAll /* function */;
  /* 0x0048 */ void* FastIoUnlockAllByKey /* function */;
  /* 0x0050 */ void* FastIoDeviceControl /* function */;
  /* 0x0058 */ void* AcquireFileForNtCreateSection /* function */;
  /* 0x0060 */ void* ReleaseFileForNtCreateSection /* function */;
  /* 0x0068 */ void* FastIoDetachDevice /* function */;
  /* 0x0070 */ void* FastIoQueryNetworkOpenInfo /* function */;
  /* 0x0078 */ void* AcquireForModWrite /* function */;
  /* 0x0080 */ void* MdlRead /* function */;
  /* 0x0088 */ void* MdlReadComplete /* function */;
  /* 0x0090 */ void* PrepareMdlWrite /* function */;
  /* 0x0098 */ void* MdlWriteComplete /* function */;
  /* 0x00a0 */ void* FastIoReadCompressed /* function */;
  /* 0x00a8 */ void* FastIoWriteCompressed /* function */;
  /* 0x00b0 */ void* MdlReadCompleteCompressed /* function */;
  /* 0x00b8 */ void* MdlWriteCompleteCompressed /* function */;
  /* 0x00c0 */ void* FastIoQueryOpen /* function */;
  /* 0x00c8 */ void* ReleaseForModWrite /* function */;
  /* 0x00d0 */ void* AcquireForCcFlush /* function */;
  /* 0x00d8 */ void* ReleaseForCcFlush /* function */;
} FAST_IO_DISPATCH, *PFAST_IO_DISPATCH; /* size: 0x00e0 */

typedef struct _FAST_MUTEX
{
  /* 0x0000 */ volatile long Count;
  /* 0x0008 */ struct _KTHREAD* Owner;
  /* 0x0010 */ unsigned long Contention;
  /* 0x0018 */ struct _KEVENT Event;
  /* 0x0030 */ unsigned long OldIrql;
  /* 0x0034 */ long __PADDING__[1];
} FAST_MUTEX, *PFAST_MUTEX; /* size: 0x0038 */

typedef union _FIELD_VALUE
{
  union
  {
    /* 0x0000 */ unsigned char FieldByteValue;
    /* 0x0000 */ unsigned short FieldShortValue;
    /* 0x0000 */ unsigned long FieldLongValue;
    /* 0x0000 */ unsigned __int64 FieldLong64Value;
    /* 0x0000 */ unsigned char FieldByteArrayValue[16];
  }; /* size: 0x0010 */
} FIELD_VALUE, *PFIELD_VALUE; /* size: 0x0010 */

typedef struct _FILE_BASIC_INFORMATION
{
  /* 0x0000 */ union _LARGE_INTEGER CreationTime;
  /* 0x0008 */ union _LARGE_INTEGER LastAccessTime;
  /* 0x0010 */ union _LARGE_INTEGER LastWriteTime;
  /* 0x0018 */ union _LARGE_INTEGER ChangeTime;
  /* 0x0020 */ unsigned long FileAttributes;
  /* 0x0024 */ long __PADDING__[1];
} FILE_BASIC_INFORMATION, *PFILE_BASIC_INFORMATION; /* size: 0x0028 */

typedef enum _FILE_INFORMATION_CLASS
{
  FileDirectoryInformation = 1,
  FileFullDirectoryInformation = 2,
  FileBothDirectoryInformation = 3,
  FileBasicInformation = 4,
  FileStandardInformation = 5,
  FileInternalInformation = 6,
  FileEaInformation = 7,
  FileAccessInformation = 8,
  FileNameInformation = 9,
  FileRenameInformation = 10,
  FileLinkInformation = 11,
  FileNamesInformation = 12,
  FileDispositionInformation = 13,
  FilePositionInformation = 14,
  FileFullEaInformation = 15,
  FileModeInformation = 16,
  FileAlignmentInformation = 17,
  FileAllInformation = 18,
  FileAllocationInformation = 19,
  FileEndOfFileInformation = 20,
  FileAlternateNameInformation = 21,
  FileStreamInformation = 22,
  FilePipeInformation = 23,
  FilePipeLocalInformation = 24,
  FilePipeRemoteInformation = 25,
  FileMailslotQueryInformation = 26,
  FileMailslotSetInformation = 27,
  FileCompressionInformation = 28,
  FileObjectIdInformation = 29,
  FileCompletionInformation = 30,
  FileMoveClusterInformation = 31,
  FileQuotaInformation = 32,
  FileReparsePointInformation = 33,
  FileNetworkOpenInformation = 34,
  FileAttributeTagInformation = 35,
  FileTrackingInformation = 36,
  FileIdBothDirectoryInformation = 37,
  FileIdFullDirectoryInformation = 38,
  FileValidDataLengthInformation = 39,
  FileShortNameInformation = 40,
  FileIoCompletionNotificationInformation = 41,
  FileIoStatusBlockRangeInformation = 42,
  FileIoPriorityHintInformation = 43,
  FileSfioReserveInformation = 44,
  FileSfioVolumeInformation = 45,
  FileHardLinkInformation = 46,
  FileProcessIdsUsingFileInformation = 47,
  FileNormalizedNameInformation = 48,
  FileNetworkPhysicalNameInformation = 49,
  FileIdGlobalTxDirectoryInformation = 50,
  FileIsRemoteDeviceInformation = 51,
  FileAttributeCacheInformation = 52,
  FileNumaNodeInformation = 53,
  FileStandardLinkInformation = 54,
  FileRemoteProtocolInformation = 55,
  FileMaximumInformation = 56,
} FILE_INFORMATION_CLASS, *PFILE_INFORMATION_CLASS;

typedef struct _FILE_NETWORK_OPEN_INFORMATION
{
  /* 0x0000 */ union _LARGE_INTEGER CreationTime;
  /* 0x0008 */ union _LARGE_INTEGER LastAccessTime;
  /* 0x0010 */ union _LARGE_INTEGER LastWriteTime;
  /* 0x0018 */ union _LARGE_INTEGER ChangeTime;
  /* 0x0020 */ union _LARGE_INTEGER AllocationSize;
  /* 0x0028 */ union _LARGE_INTEGER EndOfFile;
  /* 0x0030 */ unsigned long FileAttributes;
  /* 0x0034 */ long __PADDING__[1];
} FILE_NETWORK_OPEN_INFORMATION, *PFILE_NETWORK_OPEN_INFORMATION; /* size: 0x0038 */

typedef struct _FILE_OBJECT
{
  /* 0x0000 */ short Type;
  /* 0x0002 */ short Size;
  /* 0x0008 */ struct _DEVICE_OBJECT* DeviceObject;
  /* 0x0010 */ struct _VPB* Vpb;
  /* 0x0018 */ void* FsContext;
  /* 0x0020 */ void* FsContext2;
  /* 0x0028 */ struct _SECTION_OBJECT_POINTERS* SectionObjectPointer;
  /* 0x0030 */ void* PrivateCacheMap;
  /* 0x0038 */ long FinalStatus;
  /* 0x0040 */ struct _FILE_OBJECT* RelatedFileObject;
  /* 0x0048 */ unsigned char LockOperation;
  /* 0x0049 */ unsigned char DeletePending;
  /* 0x004a */ unsigned char ReadAccess;
  /* 0x004b */ unsigned char WriteAccess;
  /* 0x004c */ unsigned char DeleteAccess;
  /* 0x004d */ unsigned char SharedRead;
  /* 0x004e */ unsigned char SharedWrite;
  /* 0x004f */ unsigned char SharedDelete;
  /* 0x0050 */ unsigned long Flags;
  /* 0x0058 */ struct _UNICODE_STRING FileName;
  /* 0x0068 */ union _LARGE_INTEGER CurrentByteOffset;
  /* 0x0070 */ unsigned long Waiters;
  /* 0x0074 */ unsigned long Busy;
  /* 0x0078 */ void* LastLock;
  /* 0x0080 */ struct _KEVENT Lock;
  /* 0x0098 */ struct _KEVENT Event;
  /* 0x00b0 */ struct _IO_COMPLETION_CONTEXT* CompletionContext;
  /* 0x00b8 */ unsigned __int64 IrpListLock;
  /* 0x00c0 */ struct _LIST_ENTRY IrpList;
  /* 0x00d0 */ void* FileObjectExtension;
} FILE_OBJECT, *PFILE_OBJECT; /* size: 0x00d8 */

typedef struct _FILE_STANDARD_INFORMATION
{
  /* 0x0000 */ union _LARGE_INTEGER AllocationSize;
  /* 0x0008 */ union _LARGE_INTEGER EndOfFile;
  /* 0x0010 */ unsigned long NumberOfLinks;
  /* 0x0014 */ unsigned char DeletePending;
  /* 0x0015 */ unsigned char Directory;
  /* 0x0016 */ char __PADDING__[2];
} FILE_STANDARD_INFORMATION, *PFILE_STANDARD_INFORMATION; /* size: 0x0018 */

typedef struct _FILTER_PAUSE_RESTART_CONTEXT
{
  /* 0x0000 */ struct _NDIS_FILTER_BLOCK* Filter;
  /* 0x0008 */ int Status;
  /* 0x0010 */ struct _KEVENT Event;
} FILTER_PAUSE_RESTART_CONTEXT, *PFILTER_PAUSE_RESTART_CONTEXT; /* size: 0x0028 */

struct _FLS_CALLBACK_INFO;

typedef enum _FSINFOCLASS
{
  FileFsVolumeInformation = 1,
  FileFsLabelInformation = 2,
  FileFsSizeInformation = 3,
  FileFsDeviceInformation = 4,
  FileFsAttributeInformation = 5,
  FileFsControlInformation = 6,
  FileFsFullSizeInformation = 7,
  FileFsObjectIdInformation = 8,
  FileFsDriverPathInformation = 9,
  FileFsVolumeFlagsInformation = 10,
  FileFsMaximumInformation = 11,
} FSINFOCLASS, *PFSINFOCLASS;

typedef struct _GDI_TEB_BATCH
{
  /* 0x0000 */ unsigned long Offset;
  /* 0x0008 */ unsigned __int64 HDC;
  /* 0x0010 */ unsigned long Buffer[310];
} GDI_TEB_BATCH, *PGDI_TEB_BATCH; /* size: 0x04e8 */

typedef struct _GENERAL_LOOKASIDE
{
  union
  {
    /* 0x0000 */ union _SLIST_HEADER ListHead;
    /* 0x0000 */ struct _SINGLE_LIST_ENTRY SingleListHead;
  }; /* size: 0x0010 */
  /* 0x0010 */ unsigned short Depth;
  /* 0x0012 */ unsigned short MaximumDepth;
  /* 0x0014 */ unsigned long TotalAllocates;
  union
  {
    /* 0x0018 */ unsigned long AllocateMisses;
    /* 0x0018 */ unsigned long AllocateHits;
  }; /* size: 0x0004 */
  /* 0x001c */ unsigned long TotalFrees;
  union
  {
    /* 0x0020 */ unsigned long FreeMisses;
    /* 0x0020 */ unsigned long FreeHits;
  }; /* size: 0x0004 */
  /* 0x0024 */ enum _POOL_TYPE Type;
  /* 0x0028 */ unsigned long Tag;
  /* 0x002c */ unsigned long Size;
  union
  {
    /* 0x0030 */ void* AllocateEx /* function */;
    /* 0x0030 */ void* Allocate /* function */;
  }; /* size: 0x0008 */
  union
  {
    /* 0x0038 */ void* FreeEx /* function */;
    /* 0x0038 */ void* Free /* function */;
  }; /* size: 0x0008 */
  /* 0x0040 */ struct _LIST_ENTRY ListEntry;
  /* 0x0050 */ unsigned long LastTotalAllocates;
  union
  {
    /* 0x0054 */ unsigned long LastAllocateMisses;
    /* 0x0054 */ unsigned long LastAllocateHits;
  }; /* size: 0x0004 */
  /* 0x0058 */ unsigned long Future[2];
  /* 0x0060 */ long __PADDING__[8];
} GENERAL_LOOKASIDE, *PGENERAL_LOOKASIDE; /* size: 0x0080 */

typedef struct _GENERAL_LOOKASIDE_POOL
{
  union
  {
    /* 0x0000 */ union _SLIST_HEADER ListHead;
    /* 0x0000 */ struct _SINGLE_LIST_ENTRY SingleListHead;
  }; /* size: 0x0010 */
  /* 0x0010 */ unsigned short Depth;
  /* 0x0012 */ unsigned short MaximumDepth;
  /* 0x0014 */ unsigned long TotalAllocates;
  union
  {
    /* 0x0018 */ unsigned long AllocateMisses;
    /* 0x0018 */ unsigned long AllocateHits;
  }; /* size: 0x0004 */
  /* 0x001c */ unsigned long TotalFrees;
  union
  {
    /* 0x0020 */ unsigned long FreeMisses;
    /* 0x0020 */ unsigned long FreeHits;
  }; /* size: 0x0004 */
  /* 0x0024 */ enum _POOL_TYPE Type;
  /* 0x0028 */ unsigned long Tag;
  /* 0x002c */ unsigned long Size;
  union
  {
    /* 0x0030 */ void* AllocateEx /* function */;
    /* 0x0030 */ void* Allocate /* function */;
  }; /* size: 0x0008 */
  union
  {
    /* 0x0038 */ void* FreeEx /* function */;
    /* 0x0038 */ void* Free /* function */;
  }; /* size: 0x0008 */
  /* 0x0040 */ struct _LIST_ENTRY ListEntry;
  /* 0x0050 */ unsigned long LastTotalAllocates;
  union
  {
    /* 0x0054 */ unsigned long LastAllocateMisses;
    /* 0x0054 */ unsigned long LastAllocateHits;
  }; /* size: 0x0004 */
  /* 0x0058 */ unsigned long Future[2];
} GENERAL_LOOKASIDE_POOL, *PGENERAL_LOOKASIDE_POOL; /* size: 0x0060 */

typedef struct _GENERIC_MAPPING
{
  /* 0x0000 */ unsigned long GenericRead;
  /* 0x0004 */ unsigned long GenericWrite;
  /* 0x0008 */ unsigned long GenericExecute;
  /* 0x000c */ unsigned long GenericAll;
} GENERIC_MAPPING, *PGENERIC_MAPPING; /* size: 0x0010 */

typedef struct _GROUP_AFFINITY
{
  /* 0x0000 */ unsigned __int64 Mask;
  /* 0x0008 */ unsigned short Group;
  /* 0x000a */ unsigned short Reserved[3];
} GROUP_AFFINITY, *PGROUP_AFFINITY; /* size: 0x0010 */

typedef struct _GUID
{
  /* 0x0000 */ unsigned long Data1;
  /* 0x0004 */ unsigned short Data2;
  /* 0x0006 */ unsigned short Data3;
  /* 0x0008 */ unsigned char Data4[8];
} GUID, *PGUID; /* size: 0x0010 */

typedef union _HEADER_FIELD
{
  /* 0x0000 */ enum _NDIS_MAC_HEADER_FIELD MacHeaderField;
} HEADER_FIELD, *PHEADER_FIELD; /* size: 0x0004 */

typedef struct _IF_COUNTED_STRING_LH
{
  /* 0x0000 */ unsigned short Length;
  /* 0x0002 */ wchar_t String[257];
} IF_COUNTED_STRING_LH, *PIF_COUNTED_STRING_LH; /* size: 0x0204 */

typedef struct _IF_PHYSICAL_ADDRESS_LH
{
  /* 0x0000 */ unsigned short Length;
  /* 0x0002 */ unsigned char Address[32];
} IF_PHYSICAL_ADDRESS_LH, *PIF_PHYSICAL_ADDRESS_LH; /* size: 0x0022 */

typedef struct _IMAGE_DATA_DIRECTORY
{
  /* 0x0000 */ unsigned long VirtualAddress;
  /* 0x0004 */ unsigned long Size;
} IMAGE_DATA_DIRECTORY, *PIMAGE_DATA_DIRECTORY; /* size: 0x0008 */

typedef struct _IMAGE_DOS_HEADER
{
  /* 0x0000 */ unsigned short e_magic;
  /* 0x0002 */ unsigned short e_cblp;
  /* 0x0004 */ unsigned short e_cp;
  /* 0x0006 */ unsigned short e_crlc;
  /* 0x0008 */ unsigned short e_cparhdr;
  /* 0x000a */ unsigned short e_minalloc;
  /* 0x000c */ unsigned short e_maxalloc;
  /* 0x000e */ unsigned short e_ss;
  /* 0x0010 */ unsigned short e_sp;
  /* 0x0012 */ unsigned short e_csum;
  /* 0x0014 */ unsigned short e_ip;
  /* 0x0016 */ unsigned short e_cs;
  /* 0x0018 */ unsigned short e_lfarlc;
  /* 0x001a */ unsigned short e_ovno;
  /* 0x001c */ unsigned short e_res[4];
  /* 0x0024 */ unsigned short e_oemid;
  /* 0x0026 */ unsigned short e_oeminfo;
  /* 0x0028 */ unsigned short e_res2[10];
  /* 0x003c */ long e_lfanew;
} IMAGE_DOS_HEADER, *PIMAGE_DOS_HEADER; /* size: 0x0040 */

typedef struct _IMAGE_FILE_HEADER
{
  /* 0x0000 */ unsigned short Machine;
  /* 0x0002 */ unsigned short NumberOfSections;
  /* 0x0004 */ unsigned long TimeDateStamp;
  /* 0x0008 */ unsigned long PointerToSymbolTable;
  /* 0x000c */ unsigned long NumberOfSymbols;
  /* 0x0010 */ unsigned short SizeOfOptionalHeader;
  /* 0x0012 */ unsigned short Characteristics;
} IMAGE_FILE_HEADER, *PIMAGE_FILE_HEADER; /* size: 0x0014 */

typedef struct _IMAGE_NT_HEADERS64
{
  /* 0x0000 */ unsigned long Signature;
  /* 0x0004 */ struct _IMAGE_FILE_HEADER FileHeader;
  /* 0x0018 */ struct _IMAGE_OPTIONAL_HEADER64 OptionalHeader;
} IMAGE_NT_HEADERS64, *PIMAGE_NT_HEADERS64; /* size: 0x0108 */

typedef struct _IMAGE_OPTIONAL_HEADER64
{
  /* 0x0000 */ unsigned short Magic;
  /* 0x0002 */ unsigned char MajorLinkerVersion;
  /* 0x0003 */ unsigned char MinorLinkerVersion;
  /* 0x0004 */ unsigned long SizeOfCode;
  /* 0x0008 */ unsigned long SizeOfInitializedData;
  /* 0x000c */ unsigned long SizeOfUninitializedData;
  /* 0x0010 */ unsigned long AddressOfEntryPoint;
  /* 0x0014 */ unsigned long BaseOfCode;
  /* 0x0018 */ unsigned __int64 ImageBase;
  /* 0x0020 */ unsigned long SectionAlignment;
  /* 0x0024 */ unsigned long FileAlignment;
  /* 0x0028 */ unsigned short MajorOperatingSystemVersion;
  /* 0x002a */ unsigned short MinorOperatingSystemVersion;
  /* 0x002c */ unsigned short MajorImageVersion;
  /* 0x002e */ unsigned short MinorImageVersion;
  /* 0x0030 */ unsigned short MajorSubsystemVersion;
  /* 0x0032 */ unsigned short MinorSubsystemVersion;
  /* 0x0034 */ unsigned long Win32VersionValue;
  /* 0x0038 */ unsigned long SizeOfImage;
  /* 0x003c */ unsigned long SizeOfHeaders;
  /* 0x0040 */ unsigned long CheckSum;
  /* 0x0044 */ unsigned short Subsystem;
  /* 0x0046 */ unsigned short DllCharacteristics;
  /* 0x0048 */ unsigned __int64 SizeOfStackReserve;
  /* 0x0050 */ unsigned __int64 SizeOfStackCommit;
  /* 0x0058 */ unsigned __int64 SizeOfHeapReserve;
  /* 0x0060 */ unsigned __int64 SizeOfHeapCommit;
  /* 0x0068 */ unsigned long LoaderFlags;
  /* 0x006c */ unsigned long NumberOfRvaAndSizes;
  /* 0x0070 */ struct _IMAGE_DATA_DIRECTORY DataDirectory[16];
} IMAGE_OPTIONAL_HEADER64, *PIMAGE_OPTIONAL_HEADER64; /* size: 0x00f0 */

typedef struct _INITIAL_PRIVILEGE_SET
{
  /* 0x0000 */ unsigned long PrivilegeCount;
  /* 0x0004 */ unsigned long Control;
  /* 0x0008 */ struct _LUID_AND_ATTRIBUTES Privilege[3];
} INITIAL_PRIVILEGE_SET, *PINITIAL_PRIVILEGE_SET; /* size: 0x002c */

typedef struct _INTERFACE
{
  /* 0x0000 */ unsigned short Size;
  /* 0x0002 */ unsigned short Version;
  /* 0x0008 */ void* Context;
  /* 0x0010 */ void* InterfaceReference /* function */;
  /* 0x0018 */ void* InterfaceDereference /* function */;
} INTERFACE, *PINTERFACE; /* size: 0x0020 */

typedef enum _INTERFACE_TYPE
{
  InterfaceTypeUndefined = -1,
  Internal = 0,
  Isa = 1,
  Eisa = 2,
  MicroChannel = 3,
  TurboChannel = 4,
  PCIBus = 5,
  VMEBus = 6,
  NuBus = 7,
  PCMCIABus = 8,
  CBus = 9,
  MPIBus = 10,
  MPSABus = 11,
  ProcessorInternal = 12,
  InternalPowerBus = 13,
  PNPISABus = 14,
  PNPBus = 15,
  Vmcs = 16,
  MaximumInterfaceType = 17,
} INTERFACE_TYPE, *PINTERFACE_TYPE;

typedef enum _INTERLOCKED_RESULT
{
  ResultNegative = 1,
  ResultZero = 0,
  ResultPositive = 2,
} INTERLOCKED_RESULT, *PINTERLOCKED_RESULT;

typedef enum _IO_ALLOCATION_ACTION
{
  KeepObject = 1,
  DeallocateObject = 2,
  DeallocateObjectKeepRegisters = 3,
} IO_ALLOCATION_ACTION, *PIO_ALLOCATION_ACTION;

typedef struct _IO_COMPLETION_CONTEXT
{
  /* 0x0000 */ void* Port;
  /* 0x0008 */ void* Key;
} IO_COMPLETION_CONTEXT, *PIO_COMPLETION_CONTEXT; /* size: 0x0010 */

typedef struct _IO_DRIVER_CREATE_CONTEXT
{
  /* 0x0000 */ short Size;
  /* 0x0008 */ struct _ECP_LIST* ExtraCreateParameter;
  /* 0x0010 */ void* DeviceObjectHint;
  /* 0x0018 */ struct _TXN_PARAMETER_BLOCK* TxnParameters;
} IO_DRIVER_CREATE_CONTEXT, *PIO_DRIVER_CREATE_CONTEXT; /* size: 0x0020 */

typedef struct _IO_INTERRUPT_MESSAGE_INFO
{
  /* 0x0000 */ unsigned char UnifiedIrql;
  /* 0x0004 */ unsigned long MessageCount;
  /* 0x0008 */ struct _IO_INTERRUPT_MESSAGE_INFO_ENTRY MessageInfo[1];
} IO_INTERRUPT_MESSAGE_INFO, *PIO_INTERRUPT_MESSAGE_INFO; /* size: 0x0038 */

typedef struct _IO_INTERRUPT_MESSAGE_INFO_ENTRY
{
  /* 0x0000 */ union _LARGE_INTEGER MessageAddress;
  /* 0x0008 */ unsigned __int64 TargetProcessorSet;
  /* 0x0010 */ struct _KINTERRUPT* InterruptObject;
  /* 0x0018 */ unsigned long MessageData;
  /* 0x001c */ unsigned long Vector;
  /* 0x0020 */ unsigned char Irql;
  /* 0x0024 */ enum _KINTERRUPT_MODE Mode;
  /* 0x0028 */ enum _KINTERRUPT_POLARITY Polarity;
  /* 0x002c */ long __PADDING__[1];
} IO_INTERRUPT_MESSAGE_INFO_ENTRY, *PIO_INTERRUPT_MESSAGE_INFO_ENTRY; /* size: 0x0030 */

typedef struct _IO_REMOVE_LOCK
{
  /* 0x0000 */ struct _IO_REMOVE_LOCK_COMMON_BLOCK Common;
} IO_REMOVE_LOCK, *PIO_REMOVE_LOCK; /* size: 0x0020 */

typedef struct _IO_REMOVE_LOCK_COMMON_BLOCK
{
  /* 0x0000 */ unsigned char Removed;
  /* 0x0001 */ unsigned char Reserved[3];
  /* 0x0004 */ long IoCount;
  /* 0x0008 */ struct _KEVENT RemoveEvent;
} IO_REMOVE_LOCK_COMMON_BLOCK, *PIO_REMOVE_LOCK_COMMON_BLOCK; /* size: 0x0020 */

typedef struct _IO_RESOURCE_DESCRIPTOR
{
  /* 0x0000 */ unsigned char Option;
  /* 0x0001 */ unsigned char Type;
  /* 0x0002 */ unsigned char ShareDisposition;
  /* 0x0003 */ unsigned char Spare1;
  /* 0x0004 */ unsigned short Flags;
  /* 0x0006 */ unsigned short Spare2;
  union
  {
    union
    {
      struct
      {
        /* 0x0008 */ unsigned long Length;
        /* 0x000c */ unsigned long Alignment;
        /* 0x0010 */ union _LARGE_INTEGER MinimumAddress;
        /* 0x0018 */ union _LARGE_INTEGER MaximumAddress;
      } /* size: 0x0018 */ Port;
      struct
      {
        /* 0x0008 */ unsigned long Length;
        /* 0x000c */ unsigned long Alignment;
        /* 0x0010 */ union _LARGE_INTEGER MinimumAddress;
        /* 0x0018 */ union _LARGE_INTEGER MaximumAddress;
      } /* size: 0x0018 */ Memory;
      struct
      {
        /* 0x0008 */ unsigned long MinimumVector;
        /* 0x000c */ unsigned long MaximumVector;
        /* 0x0010 */ unsigned short AffinityPolicy;
        /* 0x0012 */ unsigned short Group;
        /* 0x0014 */ enum _IRQ_PRIORITY PriorityPolicy;
        /* 0x0018 */ unsigned __int64 TargetedProcessors;
      } /* size: 0x0018 */ Interrupt;
      struct
      {
        /* 0x0008 */ unsigned long MinimumChannel;
        /* 0x000c */ unsigned long MaximumChannel;
      } /* size: 0x0008 */ Dma;
      struct
      {
        /* 0x0008 */ unsigned long Length;
        /* 0x000c */ unsigned long Alignment;
        /* 0x0010 */ union _LARGE_INTEGER MinimumAddress;
        /* 0x0018 */ union _LARGE_INTEGER MaximumAddress;
      } /* size: 0x0018 */ Generic;
      struct
      {
        /* 0x0008 */ unsigned long Data[3];
      } /* size: 0x000c */ DevicePrivate;
      struct
      {
        /* 0x0008 */ unsigned long Length;
        /* 0x000c */ unsigned long MinBusNumber;
        /* 0x0010 */ unsigned long MaxBusNumber;
        /* 0x0014 */ unsigned long Reserved;
      } /* size: 0x0010 */ BusNumber;
      struct
      {
        /* 0x0008 */ unsigned long Priority;
        /* 0x000c */ unsigned long Reserved1;
        /* 0x0010 */ unsigned long Reserved2;
      } /* size: 0x000c */ ConfigData;
      struct
      {
        /* 0x0008 */ unsigned long Length40;
        /* 0x000c */ unsigned long Alignment40;
        /* 0x0010 */ union _LARGE_INTEGER MinimumAddress;
        /* 0x0018 */ union _LARGE_INTEGER MaximumAddress;
      } /* size: 0x0018 */ Memory40;
      struct
      {
        /* 0x0008 */ unsigned long Length48;
        /* 0x000c */ unsigned long Alignment48;
        /* 0x0010 */ union _LARGE_INTEGER MinimumAddress;
        /* 0x0018 */ union _LARGE_INTEGER MaximumAddress;
      } /* size: 0x0018 */ Memory48;
      struct
      {
        /* 0x0008 */ unsigned long Length64;
        /* 0x000c */ unsigned long Alignment64;
        /* 0x0010 */ union _LARGE_INTEGER MinimumAddress;
        /* 0x0018 */ union _LARGE_INTEGER MaximumAddress;
      } /* size: 0x0018 */ Memory64;
    }; /* size: 0x0018 */
  } /* size: 0x0018 */ u;
} IO_RESOURCE_DESCRIPTOR, *PIO_RESOURCE_DESCRIPTOR; /* size: 0x0020 */

typedef struct _IO_RESOURCE_LIST
{
  /* 0x0000 */ unsigned short Version;
  /* 0x0002 */ unsigned short Revision;
  /* 0x0004 */ unsigned long Count;
  /* 0x0008 */ struct _IO_RESOURCE_DESCRIPTOR Descriptors[1];
} IO_RESOURCE_LIST, *PIO_RESOURCE_LIST; /* size: 0x0028 */

typedef struct _IO_RESOURCE_REQUIREMENTS_LIST
{
  /* 0x0000 */ unsigned long ListSize;
  /* 0x0004 */ enum _INTERFACE_TYPE InterfaceType;
  /* 0x0008 */ unsigned long BusNumber;
  /* 0x000c */ unsigned long SlotNumber;
  /* 0x0010 */ unsigned long Reserved[3];
  /* 0x001c */ unsigned long AlternativeLists;
  /* 0x0020 */ struct _IO_RESOURCE_LIST List[1];
} IO_RESOURCE_REQUIREMENTS_LIST, *PIO_RESOURCE_REQUIREMENTS_LIST; /* size: 0x0048 */

typedef struct _IO_SECURITY_CONTEXT
{
  /* 0x0000 */ struct _SECURITY_QUALITY_OF_SERVICE* SecurityQos;
  /* 0x0008 */ struct _ACCESS_STATE* AccessState;
  /* 0x0010 */ unsigned long DesiredAccess;
  /* 0x0014 */ unsigned long FullCreateOptions;
} IO_SECURITY_CONTEXT, *PIO_SECURITY_CONTEXT; /* size: 0x0018 */

typedef struct _IO_STACK_LOCATION
{
  /* 0x0000 */ unsigned char MajorFunction;
  /* 0x0001 */ unsigned char MinorFunction;
  /* 0x0002 */ unsigned char Flags;
  /* 0x0003 */ unsigned char Control;
  union
  {
    union
    {
      struct
      {
        /* 0x0008 */ struct _IO_SECURITY_CONTEXT* SecurityContext;
        /* 0x0010 */ unsigned long Options;
        /* 0x0018 */ unsigned short FileAttributes;
        /* 0x001a */ unsigned short ShareAccess;
        /* 0x0020 */ unsigned long EaLength;
        /* 0x0024 */ long __PADDING__[1];
      } /* size: 0x0020 */ Create;
      struct
      {
        /* 0x0008 */ struct _IO_SECURITY_CONTEXT* SecurityContext;
        /* 0x0010 */ unsigned long Options;
        /* 0x0018 */ unsigned short Reserved;
        /* 0x001a */ unsigned short ShareAccess;
        /* 0x0020 */ struct _NAMED_PIPE_CREATE_PARAMETERS* Parameters;
      } /* size: 0x0020 */ CreatePipe;
      struct
      {
        /* 0x0008 */ struct _IO_SECURITY_CONTEXT* SecurityContext;
        /* 0x0010 */ unsigned long Options;
        /* 0x0018 */ unsigned short Reserved;
        /* 0x001a */ unsigned short ShareAccess;
        /* 0x0020 */ struct _MAILSLOT_CREATE_PARAMETERS* Parameters;
      } /* size: 0x0020 */ CreateMailslot;
      struct
      {
        /* 0x0008 */ unsigned long Length;
        /* 0x0010 */ unsigned long Key;
        /* 0x0018 */ union _LARGE_INTEGER ByteOffset;
      } /* size: 0x0018 */ Read;
      struct
      {
        /* 0x0008 */ unsigned long Length;
        /* 0x0010 */ unsigned long Key;
        /* 0x0018 */ union _LARGE_INTEGER ByteOffset;
      } /* size: 0x0018 */ Write;
      struct
      {
        /* 0x0008 */ unsigned long Length;
        /* 0x0010 */ struct _UNICODE_STRING* FileName;
        /* 0x0018 */ enum _FILE_INFORMATION_CLASS FileInformationClass;
        /* 0x0020 */ unsigned long FileIndex;
        /* 0x0024 */ long __PADDING__[1];
      } /* size: 0x0020 */ QueryDirectory;
      struct
      {
        /* 0x0008 */ unsigned long Length;
        /* 0x0010 */ unsigned long CompletionFilter;
        /* 0x0014 */ long __PADDING__[1];
      } /* size: 0x0010 */ NotifyDirectory;
      struct
      {
        /* 0x0008 */ unsigned long Length;
        /* 0x0010 */ enum _FILE_INFORMATION_CLASS FileInformationClass;
        /* 0x0014 */ long __PADDING__[1];
      } /* size: 0x0010 */ QueryFile;
      struct
      {
        /* 0x0008 */ unsigned long Length;
        /* 0x0010 */ enum _FILE_INFORMATION_CLASS FileInformationClass;
        /* 0x0018 */ struct _FILE_OBJECT* FileObject;
        union
        {
          struct
          {
            /* 0x0020 */ unsigned char ReplaceIfExists;
            /* 0x0021 */ unsigned char AdvanceOnly;
          }; /* size: 0x0002 */
          /* 0x0020 */ unsigned long ClusterCount;
          /* 0x0020 */ void* DeleteHandle;
        }; /* size: 0x0008 */
      } /* size: 0x0020 */ SetFile;
      struct
      {
        /* 0x0008 */ unsigned long Length;
        /* 0x0010 */ enum _FSINFOCLASS FsInformationClass;
        /* 0x0014 */ long __PADDING__[1];
      } /* size: 0x0010 */ QueryVolume;
      struct
      {
        /* 0x0008 */ unsigned long OutputBufferLength;
        /* 0x0010 */ unsigned long InputBufferLength;
        /* 0x0018 */ unsigned long FsControlCode;
        /* 0x0020 */ void* Type3InputBuffer;
      } /* size: 0x0020 */ FileSystemControl;
      struct
      {
        /* 0x0008 */ union _LARGE_INTEGER* Length;
        /* 0x0010 */ unsigned long Key;
        /* 0x0018 */ union _LARGE_INTEGER ByteOffset;
      } /* size: 0x0018 */ LockControl;
      struct
      {
        /* 0x0008 */ unsigned long OutputBufferLength;
        /* 0x0010 */ unsigned long InputBufferLength;
        /* 0x0018 */ unsigned long IoControlCode;
        /* 0x0020 */ void* Type3InputBuffer;
      } /* size: 0x0020 */ DeviceIoControl;
      struct
      {
        /* 0x0008 */ unsigned long SecurityInformation;
        /* 0x0010 */ unsigned long Length;
        /* 0x0014 */ long __PADDING__[1];
      } /* size: 0x0010 */ QuerySecurity;
      struct
      {
        /* 0x0008 */ unsigned long SecurityInformation;
        /* 0x0010 */ void* SecurityDescriptor;
      } /* size: 0x0010 */ SetSecurity;
      struct
      {
        /* 0x0008 */ struct _VPB* Vpb;
        /* 0x0010 */ struct _DEVICE_OBJECT* DeviceObject;
      } /* size: 0x0010 */ MountVolume;
      struct
      {
        /* 0x0008 */ struct _VPB* Vpb;
        /* 0x0010 */ struct _DEVICE_OBJECT* DeviceObject;
      } /* size: 0x0010 */ VerifyVolume;
      struct
      {
        /* 0x0008 */ struct _SCSI_REQUEST_BLOCK* Srb;
      } /* size: 0x0008 */ Scsi;
      struct
      {
        /* 0x0008 */ enum _DEVICE_RELATION_TYPE Type;
      } /* size: 0x0004 */ QueryDeviceRelations;
      struct
      {
        /* 0x0008 */ const struct _GUID* InterfaceType;
        /* 0x0010 */ unsigned short Size;
        /* 0x0012 */ unsigned short Version;
        /* 0x0018 */ struct _INTERFACE* Interface;
        /* 0x0020 */ void* InterfaceSpecificData;
      } /* size: 0x0020 */ QueryInterface;
      struct
      {
        /* 0x0008 */ struct _DEVICE_CAPABILITIES* Capabilities;
      } /* size: 0x0008 */ DeviceCapabilities;
      struct
      {
        /* 0x0008 */ struct _IO_RESOURCE_REQUIREMENTS_LIST* IoResourceRequirementList;
      } /* size: 0x0008 */ FilterResourceRequirements;
      struct
      {
        /* 0x0008 */ unsigned long WhichSpace;
        /* 0x0010 */ void* Buffer;
        /* 0x0018 */ unsigned long Offset;
        /* 0x0020 */ unsigned long Length;
        /* 0x0024 */ long __PADDING__[1];
      } /* size: 0x0020 */ ReadWriteConfig;
      struct
      {
        /* 0x0008 */ unsigned char Lock;
      } /* size: 0x0001 */ SetLock;
      struct
      {
        /* 0x0008 */ enum BUS_QUERY_ID_TYPE IdType;
      } /* size: 0x0004 */ QueryId;
      struct
      {
        /* 0x0008 */ enum DEVICE_TEXT_TYPE DeviceTextType;
        /* 0x0010 */ unsigned long LocaleId;
        /* 0x0014 */ long __PADDING__[1];
      } /* size: 0x0010 */ QueryDeviceText;
      struct
      {
        /* 0x0008 */ unsigned char InPath;
        /* 0x0009 */ unsigned char Reserved[3];
        /* 0x0010 */ enum _DEVICE_USAGE_NOTIFICATION_TYPE Type;
        /* 0x0014 */ long __PADDING__[1];
      } /* size: 0x0010 */ UsageNotification;
      struct
      {
        /* 0x0008 */ enum _SYSTEM_POWER_STATE PowerState;
      } /* size: 0x0004 */ WaitWake;
      struct
      {
        /* 0x0008 */ struct _POWER_SEQUENCE* PowerSequence;
      } /* size: 0x0008 */ PowerSequence;
      struct
      {
        union
        {
          /* 0x0008 */ unsigned long SystemContext;
          /* 0x0008 */ struct _SYSTEM_POWER_STATE_CONTEXT SystemPowerStateContext;
        }; /* size: 0x0004 */
        /* 0x0010 */ enum _POWER_STATE_TYPE Type;
        /* 0x0018 */ union _POWER_STATE State;
        /* 0x0020 */ enum POWER_ACTION ShutdownType;
        /* 0x0024 */ long __PADDING__[1];
      } /* size: 0x0020 */ Power;
      struct
      {
        /* 0x0008 */ struct _CM_RESOURCE_LIST* AllocatedResources;
        /* 0x0010 */ struct _CM_RESOURCE_LIST* AllocatedResourcesTranslated;
      } /* size: 0x0010 */ StartDevice;
      struct
      {
        /* 0x0008 */ unsigned __int64 ProviderId;
        /* 0x0010 */ void* DataPath;
        /* 0x0018 */ unsigned long BufferSize;
        /* 0x0020 */ void* Buffer;
      } /* size: 0x0020 */ WMI;
      struct
      {
        /* 0x0008 */ void* Argument1;
        /* 0x0010 */ void* Argument2;
        /* 0x0018 */ void* Argument3;
        /* 0x0020 */ void* Argument4;
      } /* size: 0x0020 */ Others;
    }; /* size: 0x0020 */
  } /* size: 0x0020 */ Parameters;
  /* 0x0028 */ struct _DEVICE_OBJECT* DeviceObject;
  /* 0x0030 */ struct _FILE_OBJECT* FileObject;
  /* 0x0038 */ void* CompletionRoutine /* function */;
  /* 0x0040 */ void* Context;
} IO_STACK_LOCATION, *PIO_STACK_LOCATION; /* size: 0x0048 */

typedef struct _IO_STATUS_BLOCK
{
  union
  {
    /* 0x0000 */ long Status;
    /* 0x0000 */ void* Pointer;
  }; /* size: 0x0008 */
  /* 0x0008 */ unsigned __int64 Information;
} IO_STATUS_BLOCK, *PIO_STATUS_BLOCK; /* size: 0x0010 */

typedef struct _IO_STATUS_BLOCK32
{
  /* 0x0000 */ long Status;
  /* 0x0004 */ unsigned long Information;
} IO_STATUS_BLOCK32, *PIO_STATUS_BLOCK32; /* size: 0x0008 */

struct _IO_TIMER;

typedef struct _IPV4_HEADER
{
  union
  {
    /* 0x0000 */ unsigned char VersionAndHeaderLength;
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned char HeaderLength : 4; /* bit position: 0 */
      /* 0x0000 */ unsigned char Version : 4; /* bit position: 4 */
    }; /* bitfield */
  }; /* size: 0x0001 */
  union
  {
    /* 0x0001 */ unsigned char TypeOfServiceAndEcnField;
    struct /* bitfield */
    {
      /* 0x0001 */ unsigned char EcnField : 2; /* bit position: 0 */
      /* 0x0001 */ unsigned char TypeOfService : 6; /* bit position: 2 */
    }; /* bitfield */
  }; /* size: 0x0001 */
  /* 0x0002 */ unsigned short TotalLength;
  /* 0x0004 */ unsigned short Identification;
  union
  {
    /* 0x0006 */ unsigned short FlagsAndOffset;
    struct /* bitfield */
    {
      /* 0x0006 */ unsigned short DontUse1 : 5; /* bit position: 0 */
      /* 0x0006 */ unsigned short MoreFragments : 1; /* bit position: 5 */
      /* 0x0006 */ unsigned short DontFragment : 1; /* bit position: 6 */
      /* 0x0006 */ unsigned short Reserved : 1; /* bit position: 7 */
      /* 0x0006 */ unsigned short DontUse2 : 8; /* bit position: 8 */
    }; /* bitfield */
  }; /* size: 0x0002 */
  /* 0x0008 */ unsigned char TimeToLive;
  /* 0x0009 */ unsigned char Protocol;
  /* 0x000a */ unsigned short HeaderChecksum;
  /* 0x000c */ struct in_addr SourceAddress;
  /* 0x0010 */ struct in_addr DestinationAddress;
} IPV4_HEADER, *PIPV4_HEADER; /* size: 0x0014 */

typedef struct _IPV6_FRAGMENT_HEADER
{
  /* 0x0000 */ unsigned char NextHeader;
  /* 0x0001 */ unsigned char Reserved;
  union
  {
    struct /* bitfield */
    {
      /* 0x0002 */ unsigned short DontUse1 : 8; /* bit position: 0 */
      /* 0x0002 */ unsigned short MoreFragments : 1; /* bit position: 8 */
      /* 0x0002 */ unsigned short ReservedBits : 2; /* bit position: 9 */
      /* 0x0002 */ unsigned short DontUse2 : 5; /* bit position: 11 */
    }; /* bitfield */
    /* 0x0002 */ unsigned short OffsetAndFlags;
  }; /* size: 0x0002 */
  /* 0x0004 */ unsigned int Id;
} IPV6_FRAGMENT_HEADER, *PIPV6_FRAGMENT_HEADER; /* size: 0x0008 */

typedef struct _IRP
{
  /* 0x0000 */ short Type;
  /* 0x0002 */ unsigned short Size;
  /* 0x0008 */ struct _MDL* MdlAddress;
  /* 0x0010 */ unsigned long Flags;
  union
  {
    union
    {
      /* 0x0018 */ struct _IRP* MasterIrp;
      /* 0x0018 */ long IrpCount;
      /* 0x0018 */ void* SystemBuffer;
    }; /* size: 0x0008 */
  } /* size: 0x0008 */ AssociatedIrp;
  /* 0x0020 */ struct _LIST_ENTRY ThreadListEntry;
  /* 0x0030 */ struct _IO_STATUS_BLOCK IoStatus;
  /* 0x0040 */ char RequestorMode;
  /* 0x0041 */ unsigned char PendingReturned;
  /* 0x0042 */ char StackCount;
  /* 0x0043 */ char CurrentLocation;
  /* 0x0044 */ unsigned char Cancel;
  /* 0x0045 */ unsigned char CancelIrql;
  /* 0x0046 */ char ApcEnvironment;
  /* 0x0047 */ unsigned char AllocationFlags;
  /* 0x0048 */ struct _IO_STATUS_BLOCK* UserIosb;
  /* 0x0050 */ struct _KEVENT* UserEvent;
  union
  {
    union
    {
      struct
      {
        union
        {
          /* 0x0058 */ void* UserApcRoutine /* function */;
          /* 0x0058 */ void* IssuingProcess;
        }; /* size: 0x0008 */
        /* 0x0060 */ void* UserApcContext;
      } /* size: 0x0010 */ AsynchronousParameters;
      /* 0x0058 */ union _LARGE_INTEGER AllocationSize;
    }; /* size: 0x0010 */
  } /* size: 0x0010 */ Overlay;
  /* 0x0068 */ void* CancelRoutine /* function */;
  /* 0x0070 */ void* UserBuffer;
  union
  {
    union
    {
      struct
      {
        union
        {
          /* 0x0078 */ struct _KDEVICE_QUEUE_ENTRY DeviceQueueEntry;
          /* 0x0078 */ void* DriverContext[4];
        }; /* size: 0x0020 */
        /* 0x0098 */ struct _ETHREAD* Thread;
        /* 0x00a0 */ char* AuxiliaryBuffer;
        /* 0x00a8 */ struct _LIST_ENTRY ListEntry;
        union
        {
          /* 0x00b8 */ struct _IO_STACK_LOCATION* CurrentStackLocation;
          /* 0x00b8 */ unsigned long PacketType;
        }; /* size: 0x0008 */
        /* 0x00c0 */ struct _FILE_OBJECT* OriginalFileObject;
      } /* size: 0x0050 */ Overlay;
      /* 0x0078 */ struct _KAPC Apc;
      /* 0x0078 */ void* CompletionKey;
    }; /* size: 0x0058 */
  } /* size: 0x0058 */ Tail;
} IRP, *PIRP; /* size: 0x00d0 */

typedef enum _IRQ_PRIORITY
{
  IrqPriorityUndefined = 0,
  IrqPriorityLow = 1,
  IrqPriorityNormal = 2,
  IrqPriorityHigh = 3,
} IRQ_PRIORITY, *PIRQ_PRIORITY;

typedef struct _KAPC
{
  /* 0x0000 */ unsigned char Type;
  /* 0x0001 */ unsigned char SpareByte0;
  /* 0x0002 */ unsigned char Size;
  /* 0x0003 */ unsigned char SpareByte1;
  /* 0x0004 */ unsigned long SpareLong0;
  /* 0x0008 */ struct _KTHREAD* Thread;
  /* 0x0010 */ struct _LIST_ENTRY ApcListEntry;
  /* 0x0020 */ void* KernelRoutine /* function */;
  /* 0x0028 */ void* RundownRoutine /* function */;
  /* 0x0030 */ void* NormalRoutine /* function */;
  /* 0x0038 */ void* NormalContext;
  /* 0x0040 */ void* SystemArgument1;
  /* 0x0048 */ void* SystemArgument2;
  /* 0x0050 */ char ApcStateIndex;
  /* 0x0051 */ char ApcMode;
  /* 0x0052 */ unsigned char Inserted;
  /* 0x0053 */ char __PADDING__[5];
} KAPC, *PKAPC; /* size: 0x0058 */

typedef struct _KBUGCHECK_CALLBACK_RECORD
{
  /* 0x0000 */ struct _LIST_ENTRY Entry;
  /* 0x0010 */ void* CallbackRoutine /* function */;
  /* 0x0018 */ void* Buffer;
  /* 0x0020 */ unsigned long Length;
  /* 0x0028 */ unsigned char* Component;
  /* 0x0030 */ unsigned __int64 Checksum;
  /* 0x0038 */ unsigned char State;
  /* 0x0039 */ char __PADDING__[7];
} KBUGCHECK_CALLBACK_RECORD, *PKBUGCHECK_CALLBACK_RECORD; /* size: 0x0040 */

typedef struct _KDESCRIPTOR
{
  /* 0x0000 */ unsigned short Pad[3];
  /* 0x0006 */ unsigned short Limit;
  /* 0x0008 */ void* Base;
} KDESCRIPTOR, *PKDESCRIPTOR; /* size: 0x0010 */

typedef struct _KDEVICE_QUEUE
{
  /* 0x0000 */ short Type;
  /* 0x0002 */ short Size;
  /* 0x0008 */ struct _LIST_ENTRY DeviceListHead;
  /* 0x0018 */ unsigned __int64 Lock;
  union
  {
    /* 0x0020 */ unsigned char Busy;
    struct /* bitfield */
    {
      /* 0x0020 */ __int64 Reserved : 8; /* bit position: 0 */
      /* 0x0020 */ __int64 Hint : 56; /* bit position: 8 */
    }; /* bitfield */
  }; /* size: 0x0008 */
} KDEVICE_QUEUE, *PKDEVICE_QUEUE; /* size: 0x0028 */

typedef struct _KDEVICE_QUEUE_ENTRY
{
  /* 0x0000 */ struct _LIST_ENTRY DeviceListEntry;
  /* 0x0010 */ unsigned long SortKey;
  /* 0x0014 */ unsigned char Inserted;
  /* 0x0015 */ char __PADDING__[3];
} KDEVICE_QUEUE_ENTRY, *PKDEVICE_QUEUE_ENTRY; /* size: 0x0018 */

typedef struct _KDPC
{
  /* 0x0000 */ unsigned char Type;
  /* 0x0001 */ unsigned char Importance;
  /* 0x0002 */ volatile unsigned short Number;
  /* 0x0008 */ struct _LIST_ENTRY DpcListEntry;
  /* 0x0018 */ void* DeferredRoutine /* function */;
  /* 0x0020 */ void* DeferredContext;
  /* 0x0028 */ void* SystemArgument1;
  /* 0x0030 */ void* SystemArgument2;
  /* 0x0038 */ void* DpcData;
} KDPC, *PKDPC; /* size: 0x0040 */

typedef struct _KEVENT
{
  /* 0x0000 */ struct _DISPATCHER_HEADER Header;
} KEVENT, *PKEVENT; /* size: 0x0018 */

typedef union _KGDTENTRY64
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned short LimitLow;
      /* 0x0002 */ unsigned short BaseLow;
      union
      {
        struct
        {
          /* 0x0004 */ unsigned char BaseMiddle;
          /* 0x0005 */ unsigned char Flags1;
          /* 0x0006 */ unsigned char Flags2;
          /* 0x0007 */ unsigned char BaseHigh;
        } /* size: 0x0004 */ Bytes;
        struct
        {
          struct
          {
            struct /* bitfield */
            {
              /* 0x0004 */ unsigned long BaseMiddle : 8; /* bit position: 0 */
              /* 0x0004 */ unsigned long Type : 5; /* bit position: 8 */
              /* 0x0004 */ unsigned long Dpl : 2; /* bit position: 13 */
              /* 0x0004 */ unsigned long Present : 1; /* bit position: 15 */
              /* 0x0004 */ unsigned long LimitHigh : 4; /* bit position: 16 */
              /* 0x0004 */ unsigned long System : 1; /* bit position: 20 */
              /* 0x0004 */ unsigned long LongMode : 1; /* bit position: 21 */
              /* 0x0004 */ unsigned long DefaultBig : 1; /* bit position: 22 */
              /* 0x0004 */ unsigned long Granularity : 1; /* bit position: 23 */
              /* 0x0004 */ unsigned long BaseHigh : 8; /* bit position: 24 */
            }; /* bitfield */
          } /* size: 0x0004 */ Bits;
          /* 0x0008 */ unsigned long BaseUpper;
          /* 0x000c */ unsigned long MustBeZero;
        }; /* size: 0x000c */
      }; /* size: 0x000c */
    }; /* size: 0x0010 */
    /* 0x0000 */ unsigned __int64 Alignment;
  }; /* size: 0x0010 */
} KGDTENTRY64, *PKGDTENTRY64; /* size: 0x0010 */

typedef union _KIDTENTRY64
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned short OffsetLow;
      /* 0x0002 */ unsigned short Selector;
      struct /* bitfield */
      {
        /* 0x0004 */ unsigned short IstIndex : 3; /* bit position: 0 */
        /* 0x0004 */ unsigned short Reserved0 : 5; /* bit position: 3 */
        /* 0x0004 */ unsigned short Type : 5; /* bit position: 8 */
        /* 0x0004 */ unsigned short Dpl : 2; /* bit position: 13 */
        /* 0x0004 */ unsigned short Present : 1; /* bit position: 15 */
      }; /* bitfield */
      /* 0x0006 */ unsigned short OffsetMiddle;
      /* 0x0008 */ unsigned long OffsetHigh;
      /* 0x000c */ unsigned long Reserved1;
    }; /* size: 0x0010 */
    /* 0x0000 */ unsigned __int64 Alignment;
  }; /* size: 0x0010 */
} KIDTENTRY64, *PKIDTENTRY64; /* size: 0x0010 */

struct _KINTERRUPT;

typedef enum _KINTERRUPT_MODE
{
  LevelSensitive = 0,
  Latched = 1,
} KINTERRUPT_MODE, *PKINTERRUPT_MODE;

typedef enum _KINTERRUPT_POLARITY
{
  InterruptPolarityUnknown = 0,
  InterruptActiveHigh = 1,
  InterruptActiveLow = 2,
} KINTERRUPT_POLARITY, *PKINTERRUPT_POLARITY;

typedef struct _KMUTANT
{
  /* 0x0000 */ struct _DISPATCHER_HEADER Header;
  /* 0x0018 */ struct _LIST_ENTRY MutantListEntry;
  /* 0x0028 */ struct _KTHREAD* OwnerThread;
  /* 0x0030 */ unsigned char Abandoned;
  /* 0x0031 */ unsigned char ApcDisable;
  /* 0x0032 */ char __PADDING__[6];
} KMUTANT, *PKMUTANT; /* size: 0x0038 */

typedef struct _KPCR
{
  union
  {
    /* 0x0000 */ struct _NT_TIB NtTib;
    struct
    {
      /* 0x0000 */ union _KGDTENTRY64* GdtBase;
      /* 0x0008 */ struct _KTSS64* TssBase;
      /* 0x0010 */ unsigned __int64 UserRsp;
      /* 0x0018 */ struct _KPCR* Self;
      /* 0x0020 */ struct _KPRCB* CurrentPrcb;
      /* 0x0028 */ struct _KSPIN_LOCK_QUEUE* LockArray;
      /* 0x0030 */ void* Used_Self;
    }; /* size: 0x0038 */
  }; /* size: 0x0038 */
  /* 0x0038 */ union _KIDTENTRY64* IdtBase;
  /* 0x0040 */ unsigned __int64 Unused[2];
  /* 0x0050 */ unsigned char Irql;
  /* 0x0051 */ unsigned char SecondLevelCacheAssociativity;
  /* 0x0052 */ unsigned char ObsoleteNumber;
  /* 0x0053 */ unsigned char Fill0;
  /* 0x0054 */ unsigned long Unused0[3];
  /* 0x0060 */ unsigned short MajorVersion;
  /* 0x0062 */ unsigned short MinorVersion;
  /* 0x0064 */ unsigned long StallScaleFactor;
  /* 0x0068 */ void* Unused1[3];
  /* 0x0080 */ unsigned long KernelReserved[15];
  /* 0x00bc */ unsigned long SecondLevelCacheSize;
  /* 0x00c0 */ unsigned long HalReserved[16];
  /* 0x0100 */ unsigned long Unused2;
  /* 0x0108 */ void* KdVersionBlock;
  /* 0x0110 */ void* Unused3;
  /* 0x0118 */ unsigned long PcrAlign1[24];
  /* 0x0180 */ struct _KPRCB Prcb;
} KPCR, *PKPCR; /* size: 0x07f0 */

typedef struct _KPRCB
{
  /* 0x0000 */ unsigned long MxCsr;
  /* 0x0004 */ unsigned char LegacyNumber;
  /* 0x0005 */ unsigned char ReservedMustBeZero;
  /* 0x0006 */ unsigned char InterruptRequest;
  /* 0x0007 */ unsigned char IdleHalt;
  /* 0x0008 */ struct _KTHREAD* CurrentThread;
  /* 0x0010 */ struct _KTHREAD* NextThread;
  /* 0x0018 */ struct _KTHREAD* IdleThread;
  /* 0x0020 */ unsigned char NestingLevel;
  /* 0x0021 */ unsigned char PrcbPad00[3];
  /* 0x0024 */ unsigned long Number;
  /* 0x0028 */ unsigned __int64 RspBase;
  /* 0x0030 */ unsigned __int64 PrcbLock;
  /* 0x0038 */ unsigned __int64 PrcbPad01;
  /* 0x0040 */ struct _KPROCESSOR_STATE ProcessorState;
  /* 0x05f0 */ char CpuType;
  /* 0x05f1 */ char CpuID;
  union
  {
    /* 0x05f2 */ unsigned short CpuStep;
    struct
    {
      /* 0x05f2 */ unsigned char CpuStepping;
      /* 0x05f3 */ unsigned char CpuModel;
    }; /* size: 0x0002 */
  }; /* size: 0x0002 */
  /* 0x05f4 */ unsigned long MHz;
  /* 0x05f8 */ unsigned __int64 HalReserved[8];
  /* 0x0638 */ unsigned short MinorVersion;
  /* 0x063a */ unsigned short MajorVersion;
  /* 0x063c */ unsigned char BuildType;
  /* 0x063d */ unsigned char CpuVendor;
  /* 0x063e */ unsigned char CoresPerPhysicalProcessor;
  /* 0x063f */ unsigned char LogicalProcessorsPerCore;
  /* 0x0640 */ unsigned long ApicMask;
  /* 0x0644 */ unsigned long CFlushSize;
  /* 0x0648 */ void* AcpiReserved;
  /* 0x0650 */ unsigned long InitialApicId;
  /* 0x0654 */ unsigned long Stride;
  /* 0x0658 */ unsigned short Group;
  /* 0x0660 */ unsigned __int64 GroupSetMember;
  /* 0x0668 */ unsigned char GroupIndex;
  /* 0x0669 */ char __PADDING__[7];
} KPRCB, *PKPRCB; /* size: 0x0670 */

struct _KPROCESS;

typedef struct _KPROCESSOR_STATE
{
  /* 0x0000 */ struct _KSPECIAL_REGISTERS SpecialRegisters;
  /* 0x00e0 */ struct _CONTEXT ContextFrame;
} KPROCESSOR_STATE, *PKPROCESSOR_STATE; /* size: 0x05b0 */

typedef struct _KSALLOCATOR_DISPATCH
{
  /* 0x0000 */ void* InitializeAllocator /* function */;
  /* 0x0008 */ void* DeleteAllocator /* function */;
  /* 0x0010 */ void* Allocate /* function */;
  /* 0x0018 */ void* Free /* function */;
} KSALLOCATOR_DISPATCH, *PKSALLOCATOR_DISPATCH; /* size: 0x0020 */

typedef struct _KSCLOCK_DISPATCH
{
  /* 0x0000 */ void* SetTimer /* function */;
  /* 0x0008 */ void* CancelTimer /* function */;
  /* 0x0010 */ void* CorrelatedTime /* function */;
  /* 0x0018 */ void* Resolution /* function */;
} KSCLOCK_DISPATCH, *PKSCLOCK_DISPATCH; /* size: 0x0020 */

typedef struct _KSDEVICE
{
  /* 0x0000 */ const struct _KSDEVICE_DESCRIPTOR* Descriptor;
  /* 0x0008 */ void* Bag;
  /* 0x0010 */ void* Context;
  /* 0x0018 */ struct _DEVICE_OBJECT* FunctionalDeviceObject;
  /* 0x0020 */ struct _DEVICE_OBJECT* PhysicalDeviceObject;
  /* 0x0028 */ struct _DEVICE_OBJECT* NextDeviceObject;
  /* 0x0030 */ unsigned char Started;
  /* 0x0034 */ enum _SYSTEM_POWER_STATE SystemPowerState;
  /* 0x0038 */ enum _DEVICE_POWER_STATE DevicePowerState;
  /* 0x003c */ long __PADDING__[1];
} KSDEVICE, *PKSDEVICE; /* size: 0x0040 */

typedef struct _KSDEVICE_DESCRIPTOR
{
  /* 0x0000 */ const struct _KSDEVICE_DISPATCH* Dispatch;
  /* 0x0008 */ unsigned long FilterDescriptorsCount;
  /* 0x0010 */ const struct _KSFILTER_DESCRIPTOR* const* FilterDescriptors;
  /* 0x0018 */ unsigned long Version;
  /* 0x001c */ unsigned long Flags;
} KSDEVICE_DESCRIPTOR, *PKSDEVICE_DESCRIPTOR; /* size: 0x0020 */

typedef struct _KSDEVICE_DISPATCH
{
  /* 0x0000 */ void* Add /* function */;
  /* 0x0008 */ void* Start /* function */;
  /* 0x0010 */ void* PostStart /* function */;
  /* 0x0018 */ void* QueryStop /* function */;
  /* 0x0020 */ void* CancelStop /* function */;
  /* 0x0028 */ void* Stop /* function */;
  /* 0x0030 */ void* QueryRemove /* function */;
  /* 0x0038 */ void* CancelRemove /* function */;
  /* 0x0040 */ void* Remove /* function */;
  /* 0x0048 */ void* QueryCapabilities /* function */;
  /* 0x0050 */ void* SurpriseRemoval /* function */;
  /* 0x0058 */ void* QueryPower /* function */;
  /* 0x0060 */ void* SetPower /* function */;
  /* 0x0068 */ void* QueryInterface /* function */;
} KSDEVICE_DISPATCH, *PKSDEVICE_DISPATCH; /* size: 0x0070 */

typedef struct _KSEMAPHORE
{
  /* 0x0000 */ struct _DISPATCHER_HEADER Header;
  /* 0x0018 */ long Limit;
  /* 0x001c */ long __PADDING__[1];
} KSEMAPHORE, *PKSEMAPHORE; /* size: 0x0020 */

typedef struct _KSEVENT_ENTRY
{
  /* 0x0000 */ struct _LIST_ENTRY ListEntry;
  /* 0x0010 */ void* Object;
  union
  {
    /* 0x0018 */ struct KSDPC_ITEM* DpcItem;
    /* 0x0018 */ struct KSBUFFER_ITEM* BufferItem;
  }; /* size: 0x0008 */
  /* 0x0020 */ struct KSEVENTDATA* EventData;
  /* 0x0028 */ unsigned long NotificationType;
  /* 0x0030 */ const struct KSEVENT_SET* EventSet;
  /* 0x0038 */ const struct KSEVENT_ITEM* EventItem;
  /* 0x0040 */ struct _FILE_OBJECT* FileObject;
  /* 0x0048 */ unsigned long SemaphoreAdjustment;
  /* 0x004c */ unsigned long Reserved;
  /* 0x0050 */ unsigned long Flags;
  /* 0x0054 */ long __PADDING__[1];
} KSEVENT_ENTRY, *PKSEVENT_ENTRY; /* size: 0x0058 */

typedef struct _KSFILTER
{
  /* 0x0000 */ const struct _KSFILTER_DESCRIPTOR* Descriptor;
  /* 0x0008 */ void* Bag;
  /* 0x0010 */ void* Context;
} KSFILTER, *PKSFILTER; /* size: 0x0018 */

typedef struct _KSFILTERFACTORY
{
  /* 0x0000 */ const struct _KSFILTER_DESCRIPTOR* FilterDescriptor;
  /* 0x0008 */ void* Bag;
  /* 0x0010 */ void* Context;
} KSFILTERFACTORY, *PKSFILTERFACTORY; /* size: 0x0018 */

typedef struct _KSFILTER_DESCRIPTOR
{
  /* 0x0000 */ const struct _KSFILTER_DISPATCH* Dispatch;
  /* 0x0008 */ const struct KSAUTOMATION_TABLE_* AutomationTable;
  /* 0x0010 */ unsigned long Version;
  /* 0x0014 */ unsigned long Flags;
  /* 0x0018 */ const struct _GUID* ReferenceGuid;
  /* 0x0020 */ unsigned long PinDescriptorsCount;
  /* 0x0024 */ unsigned long PinDescriptorSize;
  /* 0x0028 */ const struct _KSPIN_DESCRIPTOR_EX* PinDescriptors;
  /* 0x0030 */ unsigned long CategoriesCount;
  /* 0x0038 */ const struct _GUID* Categories;
  /* 0x0040 */ unsigned long NodeDescriptorsCount;
  /* 0x0044 */ unsigned long NodeDescriptorSize;
  /* 0x0048 */ const struct _KSNODE_DESCRIPTOR* NodeDescriptors;
  /* 0x0050 */ unsigned long ConnectionsCount;
  /* 0x0058 */ const struct KSTOPOLOGY_CONNECTION* Connections;
  /* 0x0060 */ const struct KSCOMPONENTID* ComponentId;
} KSFILTER_DESCRIPTOR, *PKSFILTER_DESCRIPTOR; /* size: 0x0068 */

typedef struct _KSFILTER_DISPATCH
{
  /* 0x0000 */ void* Create /* function */;
  /* 0x0008 */ void* Close /* function */;
  /* 0x0010 */ void* Process /* function */;
  /* 0x0018 */ void* Reset /* function */;
} KSFILTER_DISPATCH, *PKSFILTER_DISPATCH; /* size: 0x0020 */

typedef struct _KSGATE
{
  /* 0x0000 */ long Count;
  /* 0x0008 */ struct _KSGATE* NextGate;
} KSGATE, *PKSGATE; /* size: 0x0010 */

typedef struct _KSMAPPING
{
  /* 0x0000 */ union _LARGE_INTEGER PhysicalAddress;
  /* 0x0008 */ unsigned long ByteCount;
  /* 0x000c */ unsigned long Alignment;
} KSMAPPING, *PKSMAPPING; /* size: 0x0010 */

typedef struct _KSNODE_DESCRIPTOR
{
  /* 0x0000 */ const struct KSAUTOMATION_TABLE_* AutomationTable;
  /* 0x0008 */ const struct _GUID* Type;
  /* 0x0010 */ const struct _GUID* Name;
} KSNODE_DESCRIPTOR, *PKSNODE_DESCRIPTOR; /* size: 0x0018 */

typedef struct _KSPECIAL_REGISTERS
{
  /* 0x0000 */ unsigned __int64 Cr0;
  /* 0x0008 */ unsigned __int64 Cr2;
  /* 0x0010 */ unsigned __int64 Cr3;
  /* 0x0018 */ unsigned __int64 Cr4;
  /* 0x0020 */ unsigned __int64 KernelDr0;
  /* 0x0028 */ unsigned __int64 KernelDr1;
  /* 0x0030 */ unsigned __int64 KernelDr2;
  /* 0x0038 */ unsigned __int64 KernelDr3;
  /* 0x0040 */ unsigned __int64 KernelDr6;
  /* 0x0048 */ unsigned __int64 KernelDr7;
  /* 0x0050 */ struct _KDESCRIPTOR Gdtr;
  /* 0x0060 */ struct _KDESCRIPTOR Idtr;
  /* 0x0070 */ unsigned short Tr;
  /* 0x0072 */ unsigned short Ldtr;
  /* 0x0074 */ unsigned long MxCsr;
  /* 0x0078 */ unsigned __int64 DebugControl;
  /* 0x0080 */ unsigned __int64 LastBranchToRip;
  /* 0x0088 */ unsigned __int64 LastBranchFromRip;
  /* 0x0090 */ unsigned __int64 LastExceptionToRip;
  /* 0x0098 */ unsigned __int64 LastExceptionFromRip;
  /* 0x00a0 */ unsigned __int64 Cr8;
  /* 0x00a8 */ unsigned __int64 MsrGsBase;
  /* 0x00b0 */ unsigned __int64 MsrGsSwap;
  /* 0x00b8 */ unsigned __int64 MsrStar;
  /* 0x00c0 */ unsigned __int64 MsrLStar;
  /* 0x00c8 */ unsigned __int64 MsrCStar;
  /* 0x00d0 */ unsigned __int64 MsrSyscallMask;
} KSPECIAL_REGISTERS, *PKSPECIAL_REGISTERS; /* size: 0x00d8 */

typedef struct _KSPIN
{
  /* 0x0000 */ const struct _KSPIN_DESCRIPTOR_EX* Descriptor;
  /* 0x0008 */ void* Bag;
  /* 0x0010 */ void* Context;
  /* 0x0018 */ unsigned long Id;
  /* 0x001c */ enum KSPIN_COMMUNICATION Communication;
  /* 0x0020 */ unsigned char ConnectionIsExternal;
  /* 0x0028 */ struct KSIDENTIFIER ConnectionInterface;
  /* 0x0040 */ struct KSIDENTIFIER ConnectionMedium;
  /* 0x0058 */ struct KSPRIORITY ConnectionPriority;
  /* 0x0060 */ union KSDATAFORMAT* ConnectionFormat;
  /* 0x0068 */ struct KSMULTIPLE_ITEM* AttributeList;
  /* 0x0070 */ unsigned long StreamHeaderSize;
  /* 0x0074 */ enum KSPIN_DATAFLOW DataFlow;
  /* 0x0078 */ enum KSSTATE DeviceState;
  /* 0x007c */ enum KSRESET ResetState;
  /* 0x0080 */ enum KSSTATE ClientState;
  /* 0x0084 */ long __PADDING__[1];
} KSPIN, *PKSPIN; /* size: 0x0088 */

typedef struct _KSPIN_DESCRIPTOR_EX
{
  /* 0x0000 */ const struct _KSPIN_DISPATCH* Dispatch;
  /* 0x0008 */ const struct KSAUTOMATION_TABLE_* AutomationTable;
  /* 0x0010 */ struct KSPIN_DESCRIPTOR PinDescriptor;
  /* 0x0068 */ unsigned long Flags;
  /* 0x006c */ unsigned long InstancesPossible;
  /* 0x0070 */ unsigned long InstancesNecessary;
  /* 0x0078 */ const struct KSALLOCATOR_FRAMING_EX* AllocatorFraming;
  /* 0x0080 */ void* IntersectHandler /* function */;
} KSPIN_DESCRIPTOR_EX, *PKSPIN_DESCRIPTOR_EX; /* size: 0x0088 */

typedef struct _KSPIN_DISPATCH
{
  /* 0x0000 */ void* Create /* function */;
  /* 0x0008 */ void* Close /* function */;
  /* 0x0010 */ void* Process /* function */;
  /* 0x0018 */ void* Reset /* function */;
  /* 0x0020 */ void* SetDataFormat /* function */;
  /* 0x0028 */ void* SetDeviceState /* function */;
  /* 0x0030 */ void* Connect /* function */;
  /* 0x0038 */ void* Disconnect /* function */;
  /* 0x0040 */ const struct _KSCLOCK_DISPATCH* Clock;
  /* 0x0048 */ const struct _KSALLOCATOR_DISPATCH* Allocator;
} KSPIN_DISPATCH, *PKSPIN_DISPATCH; /* size: 0x0050 */

typedef struct _KSPIN_LOCK_QUEUE
{
  /* 0x0000 */ struct _KSPIN_LOCK_QUEUE* volatile Next;
  /* 0x0008 */ unsigned __int64* volatile Lock;
} KSPIN_LOCK_QUEUE, *PKSPIN_LOCK_QUEUE; /* size: 0x0010 */

typedef struct _KSPROCESSPIN
{
  /* 0x0000 */ struct _KSPIN* Pin;
  /* 0x0008 */ struct _KSSTREAM_POINTER* StreamPointer;
  /* 0x0010 */ struct _KSPROCESSPIN* InPlaceCounterpart;
  /* 0x0018 */ struct _KSPROCESSPIN* DelegateBranch;
  /* 0x0020 */ struct _KSPROCESSPIN* CopySource;
  /* 0x0028 */ void* Data;
  /* 0x0030 */ unsigned long BytesAvailable;
  /* 0x0034 */ unsigned long BytesUsed;
  /* 0x0038 */ unsigned long Flags;
  /* 0x003c */ unsigned char Terminate;
  /* 0x003d */ char __PADDING__[3];
} KSPROCESSPIN, *PKSPROCESSPIN; /* size: 0x0040 */

typedef struct _KSPROCESSPIN_INDEXENTRY
{
  /* 0x0000 */ struct _KSPROCESSPIN** Pins;
  /* 0x0008 */ unsigned long Count;
  /* 0x000c */ long __PADDING__[1];
} KSPROCESSPIN_INDEXENTRY, *PKSPROCESSPIN_INDEXENTRY; /* size: 0x0010 */

typedef struct _KSSTREAM_POINTER
{
  /* 0x0000 */ void* Context;
  /* 0x0008 */ struct _KSPIN* Pin;
  /* 0x0010 */ struct KSSTREAM_HEADER* StreamHeader;
  /* 0x0018 */ struct _KSSTREAM_POINTER_OFFSET* Offset;
  /* 0x0020 */ struct _KSSTREAM_POINTER_OFFSET OffsetIn;
  /* 0x0030 */ struct _KSSTREAM_POINTER_OFFSET OffsetOut;
} KSSTREAM_POINTER, *PKSSTREAM_POINTER; /* size: 0x0040 */

typedef struct _KSSTREAM_POINTER_OFFSET
{
  union
  {
    /* 0x0000 */ unsigned char* Data;
    /* 0x0000 */ struct _KSMAPPING* Mappings;
  }; /* size: 0x0008 */
  /* 0x0008 */ unsigned long Count;
  /* 0x000c */ unsigned long Remaining;
} KSSTREAM_POINTER_OFFSET, *PKSSTREAM_POINTER_OFFSET; /* size: 0x0010 */

typedef struct _KSYSTEM_TIME
{
  /* 0x0000 */ unsigned long LowPart;
  /* 0x0004 */ long High1Time;
  /* 0x0008 */ long High2Time;
} KSYSTEM_TIME, *PKSYSTEM_TIME; /* size: 0x000c */

struct _KTHREAD;

typedef struct _KTIMER
{
  /* 0x0000 */ struct _DISPATCHER_HEADER Header;
  /* 0x0018 */ union _ULARGE_INTEGER DueTime;
  /* 0x0020 */ struct _LIST_ENTRY TimerListEntry;
  /* 0x0030 */ struct _KDPC* Dpc;
  /* 0x0038 */ unsigned long Processor;
  /* 0x003c */ unsigned long Period;
} KTIMER, *PKTIMER; /* size: 0x0040 */

typedef struct _KTSS64
{
  /* 0x0000 */ unsigned long Reserved0;
  /* 0x0004 */ unsigned __int64 Rsp0;
  /* 0x000c */ unsigned __int64 Rsp1;
  /* 0x0014 */ unsigned __int64 Rsp2;
  /* 0x001c */ unsigned __int64 Ist[8];
  /* 0x005c */ unsigned __int64 Reserved1;
  /* 0x0064 */ unsigned short Reserved2;
  /* 0x0066 */ unsigned short IoMapBase;
} KTSS64, *PKTSS64; /* size: 0x0068 */

typedef struct _KUSER_SHARED_DATA
{
  /* 0x0000 */ unsigned long TickCountLowDeprecated;
  /* 0x0004 */ unsigned long TickCountMultiplier;
  /* 0x0008 */ volatile struct _KSYSTEM_TIME InterruptTime;
  /* 0x0014 */ volatile struct _KSYSTEM_TIME SystemTime;
  /* 0x0020 */ volatile struct _KSYSTEM_TIME TimeZoneBias;
  /* 0x002c */ unsigned short ImageNumberLow;
  /* 0x002e */ unsigned short ImageNumberHigh;
  /* 0x0030 */ wchar_t NtSystemRoot[260];
  /* 0x0238 */ unsigned long MaxStackTraceDepth;
  /* 0x023c */ unsigned long CryptoExponent;
  /* 0x0240 */ unsigned long TimeZoneId;
  /* 0x0244 */ unsigned long LargePageMinimum;
  /* 0x0248 */ unsigned long Reserved2[7];
  /* 0x0264 */ enum _NT_PRODUCT_TYPE NtProductType;
  /* 0x0268 */ unsigned char ProductTypeIsValid;
  /* 0x026c */ unsigned long NtMajorVersion;
  /* 0x0270 */ unsigned long NtMinorVersion;
  /* 0x0274 */ unsigned char ProcessorFeatures[64];
  /* 0x02b4 */ unsigned long Reserved1;
  /* 0x02b8 */ unsigned long Reserved3;
  /* 0x02bc */ volatile unsigned long TimeSlip;
  /* 0x02c0 */ enum _ALTERNATIVE_ARCHITECTURE_TYPE AlternativeArchitecture;
  /* 0x02c4 */ unsigned long AltArchitecturePad[1];
  /* 0x02c8 */ union _LARGE_INTEGER SystemExpirationDate;
  /* 0x02d0 */ unsigned long SuiteMask;
  /* 0x02d4 */ unsigned char KdDebuggerEnabled;
  /* 0x02d5 */ unsigned char NXSupportPolicy;
  /* 0x02d8 */ volatile unsigned long ActiveConsoleId;
  /* 0x02dc */ volatile unsigned long DismountCount;
  /* 0x02e0 */ unsigned long ComPlusPackage;
  /* 0x02e4 */ unsigned long LastSystemRITEventTickCount;
  /* 0x02e8 */ unsigned long NumberOfPhysicalPages;
  /* 0x02ec */ unsigned char SafeBootMode;
  union
  {
    /* 0x02ed */ unsigned char TscQpcData;
    struct /* bitfield */
    {
      /* 0x02ed */ unsigned char TscQpcEnabled : 1; /* bit position: 0 */
      /* 0x02ed */ unsigned char TscQpcSpareFlag : 1; /* bit position: 1 */
      /* 0x02ed */ unsigned char TscQpcShift : 6; /* bit position: 2 */
    }; /* bitfield */
  }; /* size: 0x0001 */
  /* 0x02ee */ unsigned char TscQpcPad[2];
  union
  {
    /* 0x02f0 */ unsigned long SharedDataFlags;
    struct /* bitfield */
    {
      /* 0x02f0 */ unsigned long DbgErrorPortPresent : 1; /* bit position: 0 */
      /* 0x02f0 */ unsigned long DbgElevationEnabled : 1; /* bit position: 1 */
      /* 0x02f0 */ unsigned long DbgVirtEnabled : 1; /* bit position: 2 */
      /* 0x02f0 */ unsigned long DbgInstallerDetectEnabled : 1; /* bit position: 3 */
      /* 0x02f0 */ unsigned long DbgSystemDllRelocated : 1; /* bit position: 4 */
      /* 0x02f0 */ unsigned long DbgDynProcessorEnabled : 1; /* bit position: 5 */
      /* 0x02f0 */ unsigned long DbgSEHValidationEnabled : 1; /* bit position: 6 */
      /* 0x02f0 */ unsigned long SpareBits : 25; /* bit position: 7 */
    }; /* bitfield */
  }; /* size: 0x0004 */
  /* 0x02f4 */ unsigned long DataFlagsPad[1];
  /* 0x02f8 */ unsigned __int64 TestRetInstruction;
  /* 0x0300 */ unsigned long SystemCall;
  /* 0x0304 */ unsigned long SystemCallReturn;
  /* 0x0308 */ unsigned __int64 SystemCallPad[3];
  union
  {
    /* 0x0320 */ volatile struct _KSYSTEM_TIME TickCount;
    /* 0x0320 */ volatile unsigned __int64 TickCountQuad;
    /* 0x0320 */ unsigned long ReservedTickCountOverlay[3];
  }; /* size: 0x000c */
  /* 0x032c */ unsigned long TickCountPad[1];
  /* 0x0330 */ unsigned long Cookie;
  /* 0x0334 */ unsigned long CookiePad[1];
  /* 0x0338 */ __int64 ConsoleSessionForegroundProcessId;
  /* 0x0340 */ unsigned long Wow64SharedInformation[16];
  /* 0x0380 */ unsigned short UserModeGlobalLogger[16];
  /* 0x03a0 */ unsigned long ImageFileExecutionOptions;
  /* 0x03a4 */ unsigned long LangGenerationCount;
  /* 0x03a8 */ unsigned __int64 Reserved5;
  /* 0x03b0 */ volatile unsigned __int64 InterruptTimeBias;
  /* 0x03b8 */ volatile unsigned __int64 TscQpcBias;
  /* 0x03c0 */ volatile unsigned long ActiveProcessorCount;
  /* 0x03c4 */ volatile unsigned short ActiveGroupCount;
  /* 0x03c6 */ unsigned short Reserved4;
  /* 0x03c8 */ volatile unsigned long AitSamplingValue;
  /* 0x03cc */ volatile unsigned long AppCompatFlag;
  /* 0x03d0 */ unsigned __int64 SystemDllNativeRelocation;
  /* 0x03d8 */ unsigned long SystemDllWowRelocation;
  /* 0x03dc */ unsigned long XStatePad[1];
  /* 0x03e0 */ struct _XSTATE_CONFIGURATION XState;
} KUSER_SHARED_DATA, *PKUSER_SHARED_DATA; /* size: 0x05f0 */

typedef union _LARGE_INTEGER
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned long LowPart;
      /* 0x0004 */ long HighPart;
    }; /* size: 0x0008 */
    struct
    {
      /* 0x0000 */ unsigned long LowPart;
      /* 0x0004 */ long HighPart;
    } /* size: 0x0008 */ u;
    /* 0x0000 */ __int64 QuadPart;
  }; /* size: 0x0008 */
} LARGE_INTEGER, *PLARGE_INTEGER; /* size: 0x0008 */

typedef struct _LIST_ENTRY
{
  /* 0x0000 */ struct _LIST_ENTRY* Flink;
  /* 0x0008 */ struct _LIST_ENTRY* Blink;
} LIST_ENTRY, *PLIST_ENTRY; /* size: 0x0010 */

typedef struct _LOOKASIDE_LIST_EX
{
  /* 0x0000 */ struct _GENERAL_LOOKASIDE_POOL L;
} LOOKASIDE_LIST_EX, *PLOOKASIDE_LIST_EX; /* size: 0x0060 */

typedef struct _LUID
{
  /* 0x0000 */ unsigned long LowPart;
  /* 0x0004 */ long HighPart;
} LUID, *PLUID; /* size: 0x0008 */

typedef struct _LUID_AND_ATTRIBUTES
{
  /* 0x0000 */ struct _LUID Luid;
  /* 0x0008 */ unsigned long Attributes;
} LUID_AND_ATTRIBUTES, *PLUID_AND_ATTRIBUTES; /* size: 0x000c */

typedef struct _M128A
{
  /* 0x0000 */ unsigned __int64 Low;
  /* 0x0008 */ __int64 High;
} M128A, *PM128A; /* size: 0x0010 */

typedef struct _MAILSLOT_CREATE_PARAMETERS
{
  /* 0x0000 */ unsigned long MailslotQuota;
  /* 0x0004 */ unsigned long MaximumMessageSize;
  /* 0x0008 */ union _LARGE_INTEGER ReadTimeout;
  /* 0x0010 */ unsigned char TimeoutSpecified;
  /* 0x0011 */ char __PADDING__[7];
} MAILSLOT_CREATE_PARAMETERS, *PMAILSLOT_CREATE_PARAMETERS; /* size: 0x0018 */

typedef struct _MAP_REGISTER_ENTRY
{
  /* 0x0000 */ void* MapRegister;
  /* 0x0008 */ unsigned char WriteToDevice;
  /* 0x0009 */ char __PADDING__[7];
} MAP_REGISTER_ENTRY, *PMAP_REGISTER_ENTRY; /* size: 0x0010 */

typedef struct _MCGEN_TRACE_CONTEXT
{
  /* 0x0000 */ unsigned __int64 RegistrationHandle;
  /* 0x0008 */ unsigned __int64 Logger;
  /* 0x0010 */ unsigned __int64 MatchAnyKeyword;
  /* 0x0018 */ unsigned __int64 MatchAllKeyword;
  /* 0x0020 */ unsigned long Flags;
  /* 0x0024 */ unsigned long IsEnabled;
  /* 0x0028 */ unsigned char Level;
  /* 0x0029 */ unsigned char Reserve;
  /* 0x002a */ char __PADDING__[6];
} MCGEN_TRACE_CONTEXT, *PMCGEN_TRACE_CONTEXT; /* size: 0x0030 */

typedef struct _MDL
{
  /* 0x0000 */ struct _MDL* Next;
  /* 0x0008 */ short Size;
  /* 0x000a */ short MdlFlags;
  /* 0x0010 */ struct _EPROCESS* Process;
  /* 0x0018 */ void* MappedSystemVa;
  /* 0x0020 */ void* StartVa;
  /* 0x0028 */ unsigned long ByteCount;
  /* 0x002c */ unsigned long ByteOffset;
} MDL, *PMDL; /* size: 0x0030 */

typedef enum _MEMORY_CACHING_TYPE
{
  MmNonCached = 0,
  MmCached = 1,
  MmWriteCombined = 2,
  MmHardwareCoherentCached = 3,
  MmNonCachedUnordered = 4,
  MmUSWCCached = 5,
  MmMaximumCacheType = 6,
} MEMORY_CACHING_TYPE, *PMEMORY_CACHING_TYPE;

typedef enum _MEMORY_CACHING_TYPE_ORIG
{
  MmFrameBufferCached = 2,
} MEMORY_CACHING_TYPE_ORIG, *PMEMORY_CACHING_TYPE_ORIG;

typedef struct _METHOD
{
  /* 0x0000 */ unsigned long Oid;
  /* 0x0008 */ void* InformationBuffer;
  /* 0x0010 */ unsigned long InputBufferLength;
  /* 0x0014 */ unsigned long OutputBufferLength;
  /* 0x0018 */ unsigned long MethodId;
  /* 0x001c */ unsigned int BytesWritten;
  /* 0x0020 */ unsigned int BytesRead;
  /* 0x0024 */ unsigned int BytesNeeded;
} METHOD, *PMETHOD; /* size: 0x0028 */

typedef enum _MM_PAGE_PRIORITY
{
  LowPagePriority = 0,
  NormalPagePriority = 16,
  HighPagePriority = 32,
} MM_PAGE_PRIORITY, *PMM_PAGE_PRIORITY;

typedef enum _MODE
{
  KernelMode = 0,
  UserMode = 1,
  MaximumMode = 2,
} MODE, *PMODE;

typedef struct _NAMED_PIPE_CREATE_PARAMETERS
{
  /* 0x0000 */ unsigned long NamedPipeType;
  /* 0x0004 */ unsigned long ReadMode;
  /* 0x0008 */ unsigned long CompletionMode;
  /* 0x000c */ unsigned long MaximumInstances;
  /* 0x0010 */ unsigned long InboundQuota;
  /* 0x0014 */ unsigned long OutboundQuota;
  /* 0x0018 */ union _LARGE_INTEGER DefaultTimeout;
  /* 0x0020 */ unsigned char TimeoutSpecified;
  /* 0x0021 */ char __PADDING__[7];
} NAMED_PIPE_CREATE_PARAMETERS, *PNAMED_PIPE_CREATE_PARAMETERS; /* size: 0x0028 */

typedef struct _NDIS50_PROTOCOL_CHARACTERISTICS
{
  /* 0x0000 */ unsigned char MajorNdisVersion;
  /* 0x0001 */ unsigned char MinorNdisVersion;
  /* 0x0002 */ unsigned short Filler;
  union
  {
    /* 0x0004 */ unsigned int Reserved;
    /* 0x0004 */ unsigned int Flags;
  }; /* size: 0x0004 */
  /* 0x0008 */ void* OpenAdapterCompleteHandler /* function */;
  /* 0x0010 */ void* CloseAdapterCompleteHandler /* function */;
  union
  {
    /* 0x0018 */ void* SendCompleteHandler /* function */;
    /* 0x0018 */ void* WanSendCompleteHandler /* function */;
  }; /* size: 0x0008 */
  union
  {
    /* 0x0020 */ void* TransferDataCompleteHandler /* function */;
    /* 0x0020 */ void* WanTransferDataCompleteHandler /* function */;
  }; /* size: 0x0008 */
  /* 0x0028 */ void* ResetCompleteHandler /* function */;
  /* 0x0030 */ void* RequestCompleteHandler /* function */;
  union
  {
    /* 0x0038 */ void* ReceiveHandler /* function */;
    /* 0x0038 */ void* WanReceiveHandler /* function */;
  }; /* size: 0x0008 */
  /* 0x0040 */ void* ReceiveCompleteHandler /* function */;
  /* 0x0048 */ void* StatusHandler /* function */;
  /* 0x0050 */ void* StatusCompleteHandler /* function */;
  /* 0x0058 */ struct _UNICODE_STRING Name;
  /* 0x0068 */ void* ReceivePacketHandler /* function */;
  /* 0x0070 */ void* BindAdapterHandler /* function */;
  /* 0x0078 */ void* UnbindAdapterHandler /* function */;
  /* 0x0080 */ void* PnPEventHandler /* function */;
  /* 0x0088 */ void* UnloadHandler /* function */;
  /* 0x0090 */ void* ReservedHandlers[4];
  /* 0x00b0 */ void* CoSendCompleteHandler /* function */;
  /* 0x00b8 */ void* CoStatusHandler /* function */;
  /* 0x00c0 */ void* CoReceivePacketHandler /* function */;
  /* 0x00c8 */ void* CoAfRegisterNotifyHandler /* function */;
} NDIS50_PROTOCOL_CHARACTERISTICS, *PNDIS50_PROTOCOL_CHARACTERISTICS; /* size: 0x00d0 */

typedef struct _NDIS51_MINIPORT_CHARACTERISTICS
{
  /* 0x0000 */ unsigned char MajorNdisVersion;
  /* 0x0001 */ unsigned char MinorNdisVersion;
  /* 0x0002 */ unsigned short Filler;
  /* 0x0004 */ unsigned int Reserved;
  /* 0x0008 */ void* CheckForHangHandler /* function */;
  /* 0x0010 */ void* DisableInterruptHandler /* function */;
  /* 0x0018 */ void* EnableInterruptHandler /* function */;
  /* 0x0020 */ void* HaltHandler /* function */;
  /* 0x0028 */ void* HandleInterruptHandler /* function */;
  /* 0x0030 */ void* InitializeHandler /* function */;
  /* 0x0038 */ void* ISRHandler /* function */;
  /* 0x0040 */ void* QueryInformationHandler /* function */;
  /* 0x0048 */ void* ReconfigureHandler /* function */;
  /* 0x0050 */ void* ResetHandler /* function */;
  union
  {
    /* 0x0058 */ void* SendHandler /* function */;
    /* 0x0058 */ void* WanSendHandler /* function */;
  }; /* size: 0x0008 */
  /* 0x0060 */ void* SetInformationHandler /* function */;
  union
  {
    /* 0x0068 */ void* TransferDataHandler /* function */;
    /* 0x0068 */ void* WanTransferDataHandler /* function */;
  }; /* size: 0x0008 */
  /* 0x0070 */ void* ReturnPacketHandler /* function */;
  /* 0x0078 */ void* SendPacketsHandler /* function */;
  /* 0x0080 */ void* AllocateCompleteHandler /* function */;
  /* 0x0088 */ void* CoCreateVcHandler /* function */;
  /* 0x0090 */ void* CoDeleteVcHandler /* function */;
  /* 0x0098 */ void* CoActivateVcHandler /* function */;
  /* 0x00a0 */ void* CoDeactivateVcHandler /* function */;
  /* 0x00a8 */ void* CoSendPacketsHandler /* function */;
  /* 0x00b0 */ void* CoRequestHandler /* function */;
  /* 0x00b8 */ void* CancelSendPacketsHandler /* function */;
  /* 0x00c0 */ void* PnPEventNotifyHandler /* function */;
  /* 0x00c8 */ void* AdapterShutdownHandler /* function */;
  /* 0x00d0 */ void* Reserved1;
  /* 0x00d8 */ void* Reserved2;
  /* 0x00e0 */ void* Reserved3;
  /* 0x00e8 */ void* Reserved4;
} NDIS51_MINIPORT_CHARACTERISTICS, *PNDIS51_MINIPORT_CHARACTERISTICS; /* size: 0x00f0 */

typedef enum _NDIS_802_11_WEP_STATUS
{
  Ndis802_11WEPEnabled = 0,
  Ndis802_11Encryption1Enabled = 0,
  Ndis802_11WEPDisabled = 1,
  Ndis802_11EncryptionDisabled = 1,
  Ndis802_11WEPKeyAbsent = 2,
  Ndis802_11Encryption1KeyAbsent = 2,
  Ndis802_11WEPNotSupported = 3,
  Ndis802_11EncryptionNotSupported = 3,
  Ndis802_11Encryption2Enabled = 4,
  Ndis802_11Encryption2KeyAbsent = 5,
  Ndis802_11Encryption3Enabled = 6,
  Ndis802_11Encryption3KeyAbsent = 7,
} NDIS_802_11_WEP_STATUS, *PNDIS_802_11_WEP_STATUS;

typedef struct _NDIS_AF_LIST
{
  /* 0x0000 */ struct _NDIS_AF_LIST* NextAf;
  /* 0x0008 */ struct _NDIS_OPEN_BLOCK* Open;
  /* 0x0010 */ struct CO_ADDRESS_FAMILY AddressFamily;
  /* 0x0020 */ struct _NDIS_CALL_MANAGER_CHARACTERISTICS CmChars;
  /* 0x00a8 */ struct _NDIS_CO_CALL_MANAGER_OPTIONAL_HANDLERS CallMgrChars;
  /* 0x0138 */ unsigned long NdisMajorVersion;
  /* 0x013c */ long __PADDING__[1];
} NDIS_AF_LIST, *PNDIS_AF_LIST; /* size: 0x0140 */

typedef struct _NDIS_BIND_PARAMETERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0008 */ struct _UNICODE_STRING* ProtocolSection;
  /* 0x0010 */ struct _UNICODE_STRING* AdapterName;
  /* 0x0018 */ struct _DEVICE_OBJECT* PhysicalDeviceObject;
  /* 0x0020 */ enum _NDIS_MEDIUM MediaType;
  /* 0x0024 */ unsigned long MtuSize;
  /* 0x0028 */ unsigned __int64 MaxXmitLinkSpeed;
  /* 0x0030 */ unsigned __int64 XmitLinkSpeed;
  /* 0x0038 */ unsigned __int64 MaxRcvLinkSpeed;
  /* 0x0040 */ unsigned __int64 RcvLinkSpeed;
  /* 0x0048 */ enum _NET_IF_MEDIA_CONNECT_STATE MediaConnectState;
  /* 0x004c */ enum _NET_IF_MEDIA_DUPLEX_STATE MediaDuplexState;
  /* 0x0050 */ unsigned long LookaheadSize;
  /* 0x0058 */ struct _NDIS_PNP_CAPABILITIES* PowerManagementCapabilities;
  /* 0x0060 */ unsigned long SupportedPacketFilters;
  /* 0x0064 */ unsigned long MaxMulticastListSize;
  /* 0x0068 */ unsigned short MacAddressLength;
  /* 0x006a */ unsigned char CurrentMacAddress[32];
  /* 0x008c */ enum _NDIS_PHYSICAL_MEDIUM PhysicalMediumType;
  /* 0x0090 */ struct _NDIS_RECEIVE_SCALE_CAPABILITIES* RcvScaleCapabilities;
  /* 0x0098 */ union _NET_LUID_LH BoundIfNetluid;
  /* 0x00a0 */ unsigned long BoundIfIndex;
  /* 0x00a8 */ union _NET_LUID_LH LowestIfNetluid;
  /* 0x00b0 */ unsigned long LowestIfIndex;
  /* 0x00b4 */ enum _NET_IF_ACCESS_TYPE AccessType;
  /* 0x00b8 */ enum _NET_IF_DIRECTION_TYPE DirectionType;
  /* 0x00bc */ enum _NET_IF_CONNECTION_TYPE ConnectionType;
  /* 0x00c0 */ unsigned short IfType;
  /* 0x00c2 */ unsigned char IfConnectorPresent;
  /* 0x00c8 */ struct _NDIS_PORT* ActivePorts;
  /* 0x00d0 */ unsigned long DataBackFillSize;
  /* 0x00d4 */ unsigned long ContextBackFillSize;
  /* 0x00d8 */ unsigned long MacOptions;
  /* 0x00dc */ unsigned int CompartmentId;
  /* 0x00e0 */ struct _NDIS_OFFLOAD* DefaultOffloadConfiguration;
  /* 0x00e8 */ struct _NDIS_TCP_CONNECTION_OFFLOAD* TcpConnectionOffloadCapabilities;
  /* 0x00f0 */ struct _UNICODE_STRING* BoundAdapterName;
  /* 0x00f8 */ struct _NDIS_HD_SPLIT_CURRENT_CONFIG* HDSplitCurrentConfig;
  /* 0x0100 */ struct _NDIS_RECEIVE_FILTER_CAPABILITIES* ReceiveFilterCapabilities;
  /* 0x0108 */ struct _NDIS_PM_CAPABILITIES* PowerManagementCapabilitiesEx;
  /* 0x0110 */ struct _NDIS_NIC_SWITCH_CAPABILITIES* NicSwitchCapabilities;
} NDIS_BIND_PARAMETERS, *PNDIS_BIND_PARAMETERS; /* size: 0x0118 */

typedef struct _NDIS_BIND_PATHS
{
  /* 0x0000 */ unsigned int Number;
  /* 0x0008 */ struct _UNICODE_STRING Paths[1];
} NDIS_BIND_PATHS, *PNDIS_BIND_PATHS; /* size: 0x0018 */

typedef struct _NDIS_CALL_MANAGER_CHARACTERISTICS
{
  /* 0x0000 */ unsigned char MajorVersion;
  /* 0x0001 */ unsigned char MinorVersion;
  /* 0x0002 */ unsigned short Filler;
  /* 0x0004 */ unsigned int Reserved;
  /* 0x0008 */ void* CmCreateVcHandler /* function */;
  /* 0x0010 */ void* CmDeleteVcHandler /* function */;
  /* 0x0018 */ void* CmOpenAfHandler /* function */;
  /* 0x0020 */ void* CmCloseAfHandler /* function */;
  /* 0x0028 */ void* CmRegisterSapHandler /* function */;
  /* 0x0030 */ void* CmDeregisterSapHandler /* function */;
  /* 0x0038 */ void* CmMakeCallHandler /* function */;
  /* 0x0040 */ void* CmCloseCallHandler /* function */;
  /* 0x0048 */ void* CmIncomingCallCompleteHandler /* function */;
  /* 0x0050 */ void* CmAddPartyHandler /* function */;
  /* 0x0058 */ void* CmDropPartyHandler /* function */;
  /* 0x0060 */ void* CmActivateVcCompleteHandler /* function */;
  /* 0x0068 */ void* CmDeactivateVcCompleteHandler /* function */;
  /* 0x0070 */ void* CmModifyCallQoSHandler /* function */;
  /* 0x0078 */ void* CmRequestHandler /* function */;
  /* 0x0080 */ void* CmRequestCompleteHandler /* function */;
} NDIS_CALL_MANAGER_CHARACTERISTICS, *PNDIS_CALL_MANAGER_CHARACTERISTICS; /* size: 0x0088 */

typedef struct _NDIS_CLIENT_CHARACTERISTICS
{
  /* 0x0000 */ unsigned char MajorVersion;
  /* 0x0001 */ unsigned char MinorVersion;
  /* 0x0002 */ unsigned short Filler;
  /* 0x0004 */ unsigned int Reserved;
  /* 0x0008 */ void* ClCreateVcHandler /* function */;
  /* 0x0010 */ void* ClDeleteVcHandler /* function */;
  /* 0x0018 */ void* ClRequestHandler /* function */;
  /* 0x0020 */ void* ClRequestCompleteHandler /* function */;
  /* 0x0028 */ void* ClOpenAfCompleteHandler /* function */;
  /* 0x0030 */ void* ClCloseAfCompleteHandler /* function */;
  /* 0x0038 */ void* ClRegisterSapCompleteHandler /* function */;
  /* 0x0040 */ void* ClDeregisterSapCompleteHandler /* function */;
  /* 0x0048 */ void* ClMakeCallCompleteHandler /* function */;
  /* 0x0050 */ void* ClModifyCallQoSCompleteHandler /* function */;
  /* 0x0058 */ void* ClCloseCallCompleteHandler /* function */;
  /* 0x0060 */ void* ClAddPartyCompleteHandler /* function */;
  /* 0x0068 */ void* ClDropPartyCompleteHandler /* function */;
  /* 0x0070 */ void* ClIncomingCallHandler /* function */;
  /* 0x0078 */ void* ClIncomingCallQoSChangeHandler /* function */;
  /* 0x0080 */ void* ClIncomingCloseCallHandler /* function */;
  /* 0x0088 */ void* ClIncomingDropPartyHandler /* function */;
  /* 0x0090 */ void* ClCallConnectedHandler /* function */;
} NDIS_CLIENT_CHARACTERISTICS, *PNDIS_CLIENT_CHARACTERISTICS; /* size: 0x0098 */

typedef struct _NDIS_COMMON_OPEN_BLOCK
{
  union
  {
    /* 0x0000 */ void* MacHandle;
    /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  }; /* size: 0x0008 */
  /* 0x0008 */ void* BindingHandle;
  /* 0x0010 */ struct _NDIS_MINIPORT_BLOCK* MiniportHandle;
  /* 0x0018 */ struct _NDIS_PROTOCOL_BLOCK* ProtocolHandle;
  /* 0x0020 */ void* ProtocolBindingContext;
  /* 0x0028 */ void* NextSendHandler /* function */;
  /* 0x0030 */ void* NextSendContext;
  /* 0x0038 */ void* MiniportAdapterContext;
  /* 0x0040 */ unsigned char Reserved1;
  /* 0x0041 */ unsigned char CallingFromNdis6Protocol;
  /* 0x0042 */ unsigned char Reserved3;
  /* 0x0043 */ unsigned char Reserved4;
  /* 0x0048 */ void* NextReturnNetBufferListsHandler /* function */;
  /* 0x0050 */ unsigned __int64 Reserved5;
  /* 0x0058 */ void* NextReturnNetBufferListsContext;
  union
  {
    /* 0x0060 */ void* SendHandler /* function */;
    /* 0x0060 */ void* WanSendHandler /* function */;
  }; /* size: 0x0008 */
  /* 0x0068 */ void* TransferDataHandler /* function */;
  /* 0x0070 */ void* SendCompleteHandler /* function */;
  /* 0x0078 */ void* TransferDataCompleteHandler /* function */;
  /* 0x0080 */ void* ReceiveHandler /* function */;
  /* 0x0088 */ void* ReceiveCompleteHandler /* function */;
  /* 0x0090 */ void* WanReceiveHandler /* function */;
  /* 0x0098 */ void* RequestCompleteHandler /* function */;
  /* 0x00a0 */ void* ReceivePacketHandler /* function */;
  /* 0x00a8 */ void* SendPacketsHandler /* function */;
  /* 0x00b0 */ void* ResetHandler /* function */;
  /* 0x00b8 */ void* RequestHandler /* function */;
  /* 0x00c0 */ void* OidRequestHandler /* function */;
  /* 0x00c8 */ void* ResetCompleteHandler /* function */;
  union
  {
    /* 0x00d0 */ void* StatusHandler /* function */;
    /* 0x00d0 */ void* StatusHandlerEx /* function */;
  }; /* size: 0x0008 */
  /* 0x00d8 */ void* StatusCompleteHandler /* function */;
  /* 0x00e0 */ unsigned long Flags;
  /* 0x00e4 */ long References;
  /* 0x00e8 */ unsigned __int64 SpinLock;
  /* 0x00f0 */ void* FilterHandle;
  /* 0x00f8 */ unsigned int FrameTypeArraySize;
  /* 0x00fc */ unsigned short FrameTypeArray[4];
  /* 0x0104 */ unsigned long ProtocolOptions;
  /* 0x0108 */ unsigned long CurrentLookahead;
  /* 0x0110 */ void* WSendHandler /* function */;
  /* 0x0118 */ void* WTransferDataHandler /* function */;
  /* 0x0120 */ void* WSendPacketsHandler /* function */;
  /* 0x0128 */ void* CancelSendPacketsHandler /* function */;
  /* 0x0130 */ unsigned long WakeUpEnable;
  /* 0x0134 */ struct _NDIS_PM_PARAMETERS PMCurrentParameters;
  /* 0x0148 */ struct _KEVENT* CloseCompleteEvent;
  /* 0x0150 */ struct _QUEUED_CLOSE QC;
  /* 0x0178 */ long AfReferences;
  /* 0x0180 */ struct _NDIS_OPEN_BLOCK* NextGlobalOpen;
  /* 0x0188 */ struct _NDIS_OPEN_BLOCK* MiniportNextOpen;
  /* 0x0190 */ struct _NDIS_OPEN_BLOCK* ProtocolNextOpen;
  /* 0x0198 */ struct _UNICODE_STRING* BindDeviceName;
  /* 0x01a0 */ struct _UNICODE_STRING* RootDeviceName;
  /* 0x01a8 */ struct _NDIS_OPEN_BLOCK* FilterNextOpen;
  /* 0x01b0 */ unsigned int PacketFilters;
  /* 0x01b4 */ unsigned int OldPacketFilters;
  union
  {
    struct
    {
      /* 0x01b8 */ unsigned int MaxMulticastAddresses;
      /* 0x01c0 */ struct _ETH_MULTICAST_WRAPPER* MCastAddressBuf;
      /* 0x01c8 */ unsigned int NumAddresses;
      /* 0x01d0 */ struct _ETH_MULTICAST_WRAPPER* OldMCastAddressBuf;
      /* 0x01d8 */ unsigned int OldNumAddresses;
    }; /* size: 0x001c */
    struct
    {
      /* 0x01b8 */ unsigned long FunctionalAddress;
      /* 0x01bc */ unsigned long OldFunctionalAddress;
      /* 0x01c0 */ unsigned char UsingGroupAddress;
      /* 0x01c1 */ unsigned char OldUsingGroupAddress;
      /* 0x01c4 */ unsigned long FARefCount[32];
      /* 0x0244 */ unsigned long OldFARefCount[32];
      /* 0x02d0 */ unsigned char RSSParametersBuf[656];
      /* 0x0560 */ struct _NDIS_RECEIVE_SCALE_PARAMETERS* NdisRSSParameters;
      /* 0x0568 */ struct _SINGLE_LIST_ENTRY PatternList;
      /* 0x0570 */ struct _SINGLE_LIST_ENTRY WOLPatternList;
      /* 0x0578 */ struct _SINGLE_LIST_ENTRY PMProtocolOffloadList;
      /* 0x0580 */ void* ProtSendNetBufferListsComplete /* function */;
      /* 0x0588 */ void* SendCompleteNdisPacketContext;
      /* 0x0590 */ void* SendCompleteNetBufferListsContext;
      /* 0x0598 */ void* ReceiveNetBufferLists /* function */;
      /* 0x05a0 */ void* ReceiveNetBufferListsContext;
      /* 0x05a8 */ void* SavedSendNBLHandler /* function */;
      /* 0x05b0 */ void* SavedSendPacketsHandler /* function */;
      /* 0x05b8 */ void* SavedCancelSendPacketsHandler /* function */;
      union
      {
        /* 0x05c0 */ void* SavedSendHandler /* function */;
        /* 0x05c0 */ void* SavedWanSendHandler /* function */;
      }; /* size: 0x0008 */
      /* 0x05c8 */ void* InitiateOffloadCompleteHandler /* function */;
      /* 0x05d0 */ void* TerminateOffloadCompleteHandler /* function */;
      /* 0x05d8 */ void* UpdateOffloadCompleteHandler /* function */;
      /* 0x05e0 */ void* InvalidateOffloadCompleteHandler /* function */;
      /* 0x05e8 */ void* QueryOffloadCompleteHandler /* function */;
      /* 0x05f0 */ void* IndicateOffloadEventHandler /* function */;
      /* 0x05f8 */ void* TcpOffloadSendCompleteHandler /* function */;
      /* 0x0600 */ void* TcpOffloadReceiveCompleteHandler /* function */;
      /* 0x0608 */ void* TcpOffloadDisconnectCompleteHandler /* function */;
      /* 0x0610 */ void* TcpOffloadForwardCompleteHandler /* function */;
      /* 0x0618 */ void* TcpOffloadEventHandler /* function */;
      /* 0x0620 */ void* TcpOffloadReceiveIndicateHandler /* function */;
      /* 0x0628 */ unsigned long ProtocolMajorVersion;
      /* 0x0630 */ void** IfBlock;
      /* 0x0638 */ struct _NDIS_SPIN_LOCK PnPStateLock;
      /* 0x0648 */ enum _NDIS_NDIS5_DRIVER_STATE PnPState;
      /* 0x064c */ enum _NDIS_OPEN_TRANSLATION_STATE TranslationState;
      /* 0x0650 */ int OutstandingSends;
      /* 0x0658 */ struct _NDIS_EVENT PauseEvent;
      /* 0x0670 */ void* Ndis5WanSendHandler /* function */;
      /* 0x0678 */ void* ProtSendCompleteHandler /* function */;
      /* 0x0680 */ void* OidRequestCompleteHandler /* function */;
      /* 0x0688 */ void* OidRequestCompleteContext;
      /* 0x0690 */ long NumOfPauseRestartRequests;
      /* 0x0694 */ enum _NDIS_OPEN_STATE State;
      /* 0x0698 */ struct _NDIS_OPEN_OFFLOAD* Offload;
      /* 0x06a0 */ struct _NDIS_STATUS_UNBIND_WORKITEM* StatusUnbindWorkItem;
      /* 0x06a8 */ unsigned __int64 DpcStartCycle;
      /* 0x06b0 */ unsigned long NumberOfNetBufferLists;
      /* 0x06b8 */ unsigned char* ReceivedAPacket;
      /* 0x06c0 */ void* DirectOidRequestCompleteHandler /* function */;
      /* 0x06c8 */ void* DirectOidRequestHandler /* function */;
      /* 0x06d0 */ void* DirectOidRequestCompleteContext;
      /* 0x06d8 */ struct _LIST_ENTRY ReceiveQueueList;
      /* 0x06e8 */ unsigned long NumReceiveQueues;
      /* 0x06f0 */ struct _LIST_ENTRY SharedMemoryBlockList;
      /* 0x0700 */ void* AllocateSharedMemoryHandler /* function */;
      /* 0x0708 */ void* FreeSharedMemoryHandler /* function */;
      /* 0x0710 */ void* AllocateSharedMemoryContext;
      /* 0x0718 */ long __PADDING__[2];
    }; /* size: 0x054a */
  }; /* size: 0x054a */
} NDIS_COMMON_OPEN_BLOCK, *PNDIS_COMMON_OPEN_BLOCK; /* size: 0x0720 */

typedef struct _NDIS_CONNECTION_INFO
{
  /* 0x0000 */ unsigned char MacAddress[6];
  union
  {
    struct
    {
      /* 0x0008 */ unsigned long SourceIPv4Address;
      /* 0x000c */ unsigned long DestinationIPv4Address;
      /* 0x0010 */ unsigned char Protocol;
      /* 0x0011 */ char __PADDING__[3];
    } /* size: 0x000c */ IPv4Info;
    struct
    {
      /* 0x0008 */ unsigned char SourceIPv6Address[16];
      /* 0x0018 */ unsigned char DestinationIPv6Address[16];
      /* 0x0028 */ unsigned char Protocol;
    } /* size: 0x0021 */ IPv6Info;
  }; /* size: 0x0021 */
  union
  {
    struct
    {
      /* 0x002c */ unsigned short SourceTcpPort;
      /* 0x002e */ unsigned short DestinationTcpPort;
    } /* size: 0x0004 */ TcpPortInfo;
    struct
    {
      /* 0x002c */ unsigned short SourceUdpPort;
      /* 0x002e */ unsigned short DestinationUdpPort;
    } /* size: 0x0004 */ UdpPortInfo;
  }; /* size: 0x0004 */
} NDIS_CONNECTION_INFO, *PNDIS_CONNECTION_INFO; /* size: 0x0030 */

typedef struct _NDIS_CO_AF_BLOCK
{
  /* 0x0000 */ struct _NDIS_CO_AF_BLOCK* NextAf;
  /* 0x0008 */ unsigned long Flags;
  /* 0x000c */ long References;
  /* 0x0010 */ struct _NDIS_MINIPORT_BLOCK* Miniport;
  /* 0x0018 */ struct _NDIS_CALL_MANAGER_CHARACTERISTICS* CallMgrEntries;
  /* 0x0020 */ struct _NDIS_CO_CALL_MANAGER_OPTIONAL_HANDLERS* CallMgrChars;
  /* 0x0028 */ struct _NDIS_OPEN_BLOCK* CallMgrOpen;
  /* 0x0030 */ void* CallMgrContext;
  /* 0x0038 */ struct _NDIS_CLIENT_CHARACTERISTICS ClientEntries;
  /* 0x00d0 */ struct _NDIS_CO_CLIENT_OPTIONAL_HANDLERS ClientChars;
  /* 0x0170 */ struct _NDIS_OPEN_BLOCK* ClientOpen;
  /* 0x0178 */ void* ClientContext;
  /* 0x0180 */ unsigned __int64 Lock;
  /* 0x0188 */ unsigned long CmMajorNdisVersion;
  /* 0x018c */ unsigned long ClMajorNdisVersion;
  /* 0x0190 */ struct _NDIS_REQUEST* Ndis5CmRequest;
  /* 0x0198 */ struct _NDIS_REQUEST Request;
  /* 0x0248 */ struct _NDIS_REQUEST* CloseAfNdisRequest;
  /* 0x0250 */ unsigned char CloseAfRequested;
  /* 0x0251 */ char __PADDING__[7];
} NDIS_CO_AF_BLOCK, *PNDIS_CO_AF_BLOCK; /* size: 0x0258 */

typedef struct _NDIS_CO_CALL_MANAGER_OPTIONAL_HANDLERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Reserved;
  /* 0x0008 */ void* CmCreateVcHandler /* function */;
  /* 0x0010 */ void* CmDeleteVcHandler /* function */;
  /* 0x0018 */ void* CmOpenAfHandler /* function */;
  /* 0x0020 */ void* CmCloseAfHandler /* function */;
  /* 0x0028 */ void* CmRegisterSapHandler /* function */;
  /* 0x0030 */ void* CmDeregisterSapHandler /* function */;
  /* 0x0038 */ void* CmMakeCallHandler /* function */;
  /* 0x0040 */ void* CmCloseCallHandler /* function */;
  /* 0x0048 */ void* CmIncomingCallCompleteHandler /* function */;
  /* 0x0050 */ void* CmAddPartyHandler /* function */;
  /* 0x0058 */ void* CmDropPartyHandler /* function */;
  /* 0x0060 */ void* CmActivateVcCompleteHandler /* function */;
  /* 0x0068 */ void* CmDeactivateVcCompleteHandler /* function */;
  /* 0x0070 */ void* CmModifyCallQoSHandler /* function */;
  /* 0x0078 */ void* CmOidRequestHandler /* function */;
  /* 0x0080 */ void* CmOidRequestCompleteHandler /* function */;
  /* 0x0088 */ void* CmNotifyCloseAfCompleteHandler /* function */;
} NDIS_CO_CALL_MANAGER_OPTIONAL_HANDLERS, *PNDIS_CO_CALL_MANAGER_OPTIONAL_HANDLERS; /* size: 0x0090 */

typedef struct _NDIS_CO_CLIENT_OPTIONAL_HANDLERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Reserved;
  /* 0x0008 */ void* ClCreateVcHandler /* function */;
  /* 0x0010 */ void* ClDeleteVcHandler /* function */;
  /* 0x0018 */ void* ClOidRequestHandler /* function */;
  /* 0x0020 */ void* ClOidRequestCompleteHandler /* function */;
  /* 0x0028 */ void* ClOpenAfCompleteHandlerEx /* function */;
  /* 0x0030 */ void* ClCloseAfCompleteHandler /* function */;
  /* 0x0038 */ void* ClRegisterSapCompleteHandler /* function */;
  /* 0x0040 */ void* ClDeregisterSapCompleteHandler /* function */;
  /* 0x0048 */ void* ClMakeCallCompleteHandler /* function */;
  /* 0x0050 */ void* ClModifyCallQoSCompleteHandler /* function */;
  /* 0x0058 */ void* ClCloseCallCompleteHandler /* function */;
  /* 0x0060 */ void* ClAddPartyCompleteHandler /* function */;
  /* 0x0068 */ void* ClDropPartyCompleteHandler /* function */;
  /* 0x0070 */ void* ClIncomingCallHandler /* function */;
  /* 0x0078 */ void* ClIncomingCallQoSChangeHandler /* function */;
  /* 0x0080 */ void* ClIncomingCloseCallHandler /* function */;
  /* 0x0088 */ void* ClIncomingDropPartyHandler /* function */;
  /* 0x0090 */ void* ClCallConnectedHandler /* function */;
  /* 0x0098 */ void* ClNotifyCloseAfHandler /* function */;
} NDIS_CO_CLIENT_OPTIONAL_HANDLERS, *PNDIS_CO_CLIENT_OPTIONAL_HANDLERS; /* size: 0x00a0 */

typedef struct _NDIS_CO_VC_BLOCK
{
  /* 0x0000 */ unsigned long References;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ unsigned __int64 Lock;
  /* 0x0010 */ struct _NDIS_OPEN_BLOCK* ClientOpen;
  /* 0x0018 */ void* ClientContext;
  /* 0x0020 */ struct _NDIS_CO_VC_PTR_BLOCK* pProxyVcPtr;
  /* 0x0028 */ struct _NDIS_CO_VC_PTR_BLOCK* pClientVcPtr;
  /* 0x0030 */ void* CoSendCompleteHandler /* function */;
  /* 0x0038 */ void* CoReceivePacketHandler /* function */;
  /* 0x0040 */ void* CoSendNetBufferListsCompleteHandler /* function */;
  /* 0x0048 */ void* CoReceiveNetBufferListsHandler /* function */;
  /* 0x0050 */ struct _NDIS_OPEN_BLOCK* CallMgrOpen;
  /* 0x0058 */ void* CallMgrContext;
  /* 0x0060 */ void* CmActivateVcCompleteHandler /* function */;
  /* 0x0068 */ void* CmDeactivateVcCompleteHandler /* function */;
  /* 0x0070 */ void* CmModifyCallQoSHandler /* function */;
  /* 0x0078 */ struct _NDIS_MINIPORT_BLOCK* Miniport;
  /* 0x0080 */ void* MiniportContext;
  /* 0x0088 */ unsigned __int64 VcId;
} NDIS_CO_VC_BLOCK, *PNDIS_CO_VC_BLOCK; /* size: 0x0090 */

typedef struct _NDIS_CO_VC_PTR_BLOCK
{
  /* 0x0000 */ long References;
  /* 0x0004 */ unsigned long CallFlags;
  /* 0x0008 */ unsigned long* pVcFlags;
  /* 0x0010 */ unsigned __int64 Lock;
  /* 0x0018 */ void* ClientContext;
  /* 0x0020 */ struct _LIST_ENTRY ClientLink;
  /* 0x0030 */ struct _LIST_ENTRY VcLink;
  /* 0x0040 */ struct _NDIS_CO_AF_BLOCK* AfBlock;
  /* 0x0048 */ struct _NDIS_CO_VC_BLOCK* VcBlock;
  /* 0x0050 */ struct _NDIS_OPEN_BLOCK* ClientOpen;
  /* 0x0058 */ long OwnsVcBlock;
  /* 0x0060 */ void* CoDeleteVcHandler /* function */;
  /* 0x0068 */ void* DeleteVcContext;
  /* 0x0070 */ void* ClModifyCallQoSCompleteHandler /* function */;
  /* 0x0078 */ void* ClIncomingCallQoSChangeHandler /* function */;
  /* 0x0080 */ void* ClCallConnectedHandler /* function */;
  /* 0x0088 */ struct _NDIS_OPEN_BLOCK* CallMgrOpen;
  /* 0x0090 */ void* CallMgrContext;
  /* 0x0098 */ struct _LIST_ENTRY CallMgrLink;
  /* 0x00a8 */ void* CmActivateVcCompleteHandler /* function */;
  /* 0x00b0 */ void* CmDeactivateVcCompleteHandler /* function */;
  /* 0x00b8 */ void* CmModifyCallQoSHandler /* function */;
  /* 0x00c0 */ struct _NDIS_MINIPORT_BLOCK* Miniport;
  /* 0x00c8 */ void* MiniportContext;
  /* 0x00d0 */ void* WCoSendPacketsHandler /* function */;
  /* 0x00d8 */ void* WCoDeleteVcHandler /* function */;
  /* 0x00e0 */ void* WCoActivateVcHandler /* function */;
  /* 0x00e8 */ void* WCoDeactivateVcHandler /* function */;
  /* 0x00f0 */ void* WCoSendNetBufferListsHandler /* function */;
  /* 0x00f8 */ void* CoSendNetBufferListsHandler /* function */;
  /* 0x0100 */ void* CoSendNetBufferListsCompleteHandler /* function */;
  /* 0x0108 */ void* CoSendPacketHandler /* function */;
  /* 0x0110 */ void* CoSendPacketCompleteHandler /* function */;
  /* 0x0118 */ void* CoIndicateReceivePacketHandler /* function */;
  /* 0x0120 */ void* CoIndicateReceiveNetBufferListsHandler /* function */;
  /* 0x0128 */ struct _UNICODE_STRING VcInstanceName;
  /* 0x0138 */ union _LARGE_INTEGER VcIndex;
  /* 0x0140 */ struct _LIST_ENTRY WmiLink;
  /* 0x0150 */ unsigned char CallMiniportDeleteVc;
  /* 0x0151 */ char __PADDING__[7];
} NDIS_CO_VC_PTR_BLOCK, *PNDIS_CO_VC_PTR_BLOCK; /* size: 0x0158 */

typedef enum _NDIS_DEVICE_PNP_EVENT
{
  NdisDevicePnPEventQueryRemoved = 0,
  NdisDevicePnPEventRemoved = 1,
  NdisDevicePnPEventSurpriseRemoved = 2,
  NdisDevicePnPEventQueryStopped = 3,
  NdisDevicePnPEventStopped = 4,
  NdisDevicePnPEventPowerProfileChanged = 5,
  NdisDevicePnPEventFilterListChanged = 6,
  NdisDevicePnPEventMaximum = 7,
} NDIS_DEVICE_PNP_EVENT, *PNDIS_DEVICE_PNP_EVENT;

typedef enum _NDIS_DEVICE_POWER_STATE
{
  NdisDeviceStateUnspecified = 0,
  NdisDeviceStateD0 = 1,
  NdisDeviceStateD1 = 2,
  NdisDeviceStateD2 = 3,
  NdisDeviceStateD3 = 4,
  NdisDeviceStateMaximum = 5,
} NDIS_DEVICE_POWER_STATE, *PNDIS_DEVICE_POWER_STATE;

typedef struct _NDIS_DPC_TRACKER
{
  /* 0x0000 */ unsigned __int64 TotalCycleInRcvTranslation;
  /* 0x0008 */ unsigned __int64 TotalCycleInReturnTranslation;
  /* 0x0010 */ unsigned __int64 TotalCycleInReturn;
  /* 0x0018 */ unsigned __int64 TotalCycleInMiniportReturn;
  /* 0x0020 */ unsigned __int64 TotalCycleSendComplete;
  /* 0x0028 */ unsigned __int64 TotalCycleInNdis;
  /* 0x0030 */ unsigned __int64 TotalCycleInTransfer;
  /* 0x0038 */ unsigned long TotalNumInRcvTranslation;
  /* 0x003c */ unsigned long TotalNumInReturnTranslation;
  /* 0x0040 */ unsigned long TotalNumInReturn;
  /* 0x0044 */ unsigned long TotalNumInMiniportReturn;
  /* 0x0048 */ unsigned long TotalNumSendComplete;
  /* 0x004c */ unsigned long TotalNumInNdis;
  /* 0x0050 */ unsigned long TotalNumInTransfer;
  /* 0x0058 */ unsigned __int64 DpcStartCycle;
  /* 0x0060 */ unsigned __int64 DpcStopCycle;
  /* 0x0068 */ unsigned __int64 RcvTranslationTrace[256];
  /* 0x0868 */ unsigned __int64 ReturnTranslationTrace[256];
  /* 0x1068 */ unsigned __int64 ReturnTrace[256];
  /* 0x1868 */ unsigned __int64 NdisTrace[256];
  /* 0x2068 */ unsigned __int64 SendCompleteTrace[256];
  /* 0x2868 */ unsigned __int64 MiniportReturnTrace[256];
  /* 0x3068 */ unsigned __int64 ProtocolRcvTrace[256];
  /* 0x3868 */ unsigned __int64 MiniportTransferTrace[256];
  /* 0x4068 */ unsigned char RcvTranslationTraceIndex;
  /* 0x4069 */ unsigned char ReturnTranslationTraceIndex;
  /* 0x406a */ unsigned char NdisTraceIndex;
  /* 0x406b */ unsigned char ReturnTraceIndex;
  /* 0x406c */ unsigned char SendCompleteTraceIndex;
  /* 0x406d */ unsigned char MiniportReturnTraceIndex;
  /* 0x406e */ unsigned char ProtocolRcvTraceIndex;
  /* 0x406f */ unsigned char MiniportTransferTraceIndex;
} NDIS_DPC_TRACKER, *PNDIS_DPC_TRACKER; /* size: 0x4070 */

typedef struct _NDIS_DPC_WORK_ITEM
{
  /* 0x0000 */ struct _WORK_QUEUE_ITEM WorkItem;
  /* 0x0020 */ struct _KDPC* Dpc;
  /* 0x0028 */ void* InterruptContext;
  /* 0x0030 */ void* SystemArgument1;
  /* 0x0038 */ void* SystemArgument2;
  /* 0x0040 */ unsigned long TargetCpu;
  /* 0x0044 */ unsigned long Flags;
  /* 0x0048 */ unsigned __int64 Lock;
} NDIS_DPC_WORK_ITEM, *PNDIS_DPC_WORK_ITEM; /* size: 0x0050 */

typedef struct _NDIS_EVENT
{
  /* 0x0000 */ struct _KEVENT Event;
} NDIS_EVENT, *PNDIS_EVENT; /* size: 0x0018 */

typedef struct _NDIS_FILTER_ATTACH_LIST
{
  /* 0x0000 */ struct _UNICODE_STRING* FilterInstanceName;
  /* 0x0008 */ unsigned long Flags;
  /* 0x000c */ long __PADDING__[1];
} NDIS_FILTER_ATTACH_LIST, *PNDIS_FILTER_ATTACH_LIST; /* size: 0x0010 */

typedef struct _NDIS_FILTER_ATTACH_PARAMETERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long IfIndex;
  /* 0x0008 */ union _NET_LUID_LH NetLuid;
  /* 0x0010 */ struct _UNICODE_STRING* FilterModuleGuidName;
  /* 0x0018 */ unsigned long BaseMiniportIfIndex;
  /* 0x0020 */ struct _UNICODE_STRING* BaseMiniportInstanceName;
  /* 0x0028 */ struct _UNICODE_STRING* BaseMiniportName;
  /* 0x0030 */ enum _NET_IF_MEDIA_CONNECT_STATE MediaConnectState;
  /* 0x0034 */ enum _NET_IF_MEDIA_DUPLEX_STATE MediaDuplexState;
  /* 0x0038 */ unsigned __int64 XmitLinkSpeed;
  /* 0x0040 */ unsigned __int64 RcvLinkSpeed;
  /* 0x0048 */ enum _NDIS_MEDIUM MiniportMediaType;
  /* 0x004c */ enum _NDIS_PHYSICAL_MEDIUM MiniportPhysicalMediaType;
  /* 0x0050 */ void* MiniportMediaSpecificAttributes;
  /* 0x0058 */ struct _NDIS_OFFLOAD* DefaultOffloadConfiguration;
  /* 0x0060 */ unsigned short MacAddressLength;
  /* 0x0062 */ unsigned char CurrentMacAddress[32];
  /* 0x0088 */ union _NET_LUID_LH BaseMiniportNetLuid;
  /* 0x0090 */ unsigned long LowerIfIndex;
  /* 0x0098 */ union _NET_LUID_LH LowerIfNetLuid;
  /* 0x00a0 */ unsigned long Flags;
  /* 0x00a8 */ struct _NDIS_HD_SPLIT_CURRENT_CONFIG* HDSplitCurrentConfig;
  /* 0x00b0 */ struct _NDIS_RECEIVE_FILTER_CAPABILITIES* ReceiveFilterCapabilities;
  /* 0x00b8 */ struct _DEVICE_OBJECT* MiniportPhysicalDeviceObject;
  /* 0x00c0 */ struct _NDIS_NIC_SWITCH_CAPABILITIES* NicSwitchCapabilities;
} NDIS_FILTER_ATTACH_PARAMETERS, *PNDIS_FILTER_ATTACH_PARAMETERS; /* size: 0x00c8 */

typedef struct _NDIS_FILTER_BLOCK
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0008 */ struct _NDIS_FILTER_BLOCK* NextFilter;
  /* 0x0010 */ struct _NDIS_FILTER_DRIVER_BLOCK* FilterDriver;
  /* 0x0018 */ void* FilterModuleContext;
  /* 0x0020 */ struct _NDIS_MINIPORT_BLOCK* Miniport;
  /* 0x0028 */ struct _UNICODE_STRING* FilterInstanceName;
  /* 0x0030 */ struct _UNICODE_STRING* FilterFriendlyName;
  /* 0x0038 */ unsigned long Flags;
  /* 0x003c */ enum _NDIS_FILTER_STATE State;
  /* 0x0040 */ struct _REFERENCE Ref;
  /* 0x0050 */ int FakeStatus;
  /* 0x0058 */ struct _NDIS_FILTER_BLOCK* NextGlobalFilter;
  /* 0x0060 */ struct _NDIS_FILTER_BLOCK* LowerFilter;
  /* 0x0068 */ struct _NDIS_FILTER_BLOCK* HigherFilter;
  /* 0x0070 */ struct _FILTER_PAUSE_RESTART_CONTEXT* AsyncOpContext;
  /* 0x0078 */ long NumOfPauseRestartRequests;
  /* 0x0080 */ unsigned __int64 Lock;
  /* 0x0088 */ void* LockThread;
  /* 0x0090 */ unsigned long LockDbg;
  /* 0x0098 */ struct _LIST_ENTRY OidRequestList;
  /* 0x00a8 */ struct _NDIS_OID_REQUEST* PendingOidRequest;
  /* 0x00b0 */ struct _REFERENCE PnPRef;
  /* 0x00c0 */ enum _NDIS_MEDIUM MediaType;
  /* 0x00c4 */ enum _NDIS_PHYSICAL_MEDIUM PhysicalMediaType;
  /* 0x00c8 */ enum _NET_IF_MEDIA_CONNECT_STATE MediaConnectState;
  /* 0x00cc */ enum _NET_IF_MEDIA_DUPLEX_STATE MediaDuplexState;
  /* 0x00d0 */ unsigned __int64 XmitLinkSpeed;
  /* 0x00d8 */ unsigned __int64 RcvLinkSpeed;
  /* 0x00e0 */ enum _NDIS_SUPPORTED_PAUSE_FUNCTIONS PauseFunctions;
  /* 0x00e4 */ unsigned long AutoNegotiationFlags;
  /* 0x00e8 */ unsigned char XState;
  /* 0x00e9 */ unsigned char Reserved1;
  /* 0x00ea */ unsigned char Reserved2;
  /* 0x00eb */ unsigned char Reserved3;
  /* 0x00ec */ enum _NET_IF_MEDIA_CONNECT_STATE MediaConnectStateIndicateUp;
  /* 0x00f0 */ enum _NET_IF_MEDIA_DUPLEX_STATE MediaDuplexStateIndicateUp;
  /* 0x00f8 */ unsigned __int64 XmitLinkSpeedIndicateUp;
  /* 0x0100 */ unsigned __int64 RcvLinkSpeedIndicateUp;
  /* 0x0108 */ enum _NDIS_SUPPORTED_PAUSE_FUNCTIONS PauseFunctionsIndicateUp;
  /* 0x010c */ unsigned long AutoNegotiationFlagsIndicateUp;
  /* 0x0110 */ void* NextRequestHandle;
  /* 0x0118 */ void* NextSendNetBufferListsHandler /* function */;
  /* 0x0120 */ void* NextSendNetBufferListsContext;
  /* 0x0128 */ void* NextSendNetBufferListsObject;
  /* 0x0130 */ void* NextSendNetBufferListsCompleteHandler /* function */;
  /* 0x0138 */ void* NextSendNetBufferListsCompleteContext;
  /* 0x0140 */ void* NextSendNetBufferListsCompleteObject;
  /* 0x0148 */ void* NextIndicateReceiveNetBufferListsHandler /* function */;
  /* 0x0150 */ void* NextIndicateReceiveNetBufferListsContext;
  /* 0x0158 */ void* NextIndicateReceiveNetBufferListsObject;
  /* 0x0160 */ void* NextReturnNetBufferListsHandler /* function */;
  /* 0x0168 */ void* NextReturnNetBufferListsContext;
  /* 0x0170 */ void* NextReturnNetBufferListsObject;
  /* 0x0178 */ void* NextIndicateStatusHandle;
  /* 0x0180 */ void* NextDevicePnPEventNotifyHandle;
  /* 0x0188 */ void* NextNetPnPEventHandle;
  /* 0x0190 */ void* NextCancelSendNetBufferListsHandler /* function */;
  /* 0x0198 */ void* NextCancelSendNetBufferListsContext;
  /* 0x01a0 */ void* SetFilterModuleOptionalHandlers /* function */;
  /* 0x01a8 */ struct _NDIS_FILTER_PARTIAL_CHARACTERISTICS Characteristics;
  /* 0x01d8 */ struct _NDIS_FILTER_PARTIAL_CHARACTERISTICS SavedCharacteristics;
  /* 0x0208 */ void* OidRequestHandler /* function */;
  /* 0x0210 */ void* OidRequestCompleteHandler /* function */;
  /* 0x0218 */ void* CancelRequestHandler /* function */;
  /* 0x0220 */ void* DevicePnPEventNotifyHandler /* function */;
  /* 0x0228 */ void* NetPnPEventHandler /* function */;
  /* 0x0230 */ void* StatusHandler /* function */;
  /* 0x0238 */ void* FilterSendNetBufferListsHandler /* function */;
  /* 0x0240 */ void* FilterIndicateReceiveNetBufferListsHandler /* function */;
  /* 0x0248 */ void* FilterCancelSendNetBufferListsHandler /* function */;
  /* 0x0250 */ void* InitiateOffloadCompleteHandler /* function */;
  /* 0x0258 */ void* TerminateOffloadCompleteHandler /* function */;
  /* 0x0260 */ void* UpdateOffloadCompleteHandler /* function */;
  /* 0x0268 */ void* InvalidateOffloadCompleteHandler /* function */;
  /* 0x0270 */ void* QueryOffloadCompleteHandler /* function */;
  /* 0x0278 */ void* IndicateOffloadEventHandler /* function */;
  /* 0x0280 */ void* TcpOffloadSendCompleteHandler /* function */;
  /* 0x0288 */ void* TcpOffloadReceiveCompleteHandler /* function */;
  /* 0x0290 */ void* TcpOffloadDisconnectCompleteHandler /* function */;
  /* 0x0298 */ void* TcpOffloadForwardCompleteHandler /* function */;
  /* 0x02a0 */ void* TcpOffloadEventHandler /* function */;
  /* 0x02a8 */ void* TcpOffloadReceiveIndicateHandler /* function */;
  /* 0x02b0 */ void* InitiateOffloadHandler /* function */;
  /* 0x02b8 */ void* TerminateOffloadHandler /* function */;
  /* 0x02c0 */ void* UpdateOffloadHandler /* function */;
  /* 0x02c8 */ void* InvalidateOffloadHandler /* function */;
  /* 0x02d0 */ void* QueryOffloadHandler /* function */;
  /* 0x02d8 */ void* TcpOffloadSendHandler /* function */;
  /* 0x02e0 */ void* TcpOffloadReceiveHandler /* function */;
  /* 0x02e8 */ void* TcpOffloadDisconnectHandler /* function */;
  /* 0x02f0 */ void* TcpOffloadForwardHandler /* function */;
  /* 0x02f8 */ void* TcpOffloadReceiveReturnHandler /* function */;
  /* 0x0300 */ struct _NDIS_FILTER_TASK_OFFLOAD* Offload;
  /* 0x0308 */ struct _GUID InterfaceGuid;
  /* 0x0318 */ unsigned long IfIndex;
  /* 0x0320 */ struct _NDIS_IF_BLOCK* IfBlock;
  /* 0x0328 */ void* DirectOidRequestHandler /* function */;
  /* 0x0330 */ void* DirectOidRequestCompleteHandler /* function */;
  /* 0x0338 */ void* NextDirectRequestHandle;
  /* 0x0340 */ unsigned long DirectOidRequestCount;
  /* 0x0348 */ void* CancelDirectOidRequestHandler /* function */;
  /* 0x0350 */ struct _SINGLE_LIST_ENTRY WOLPatternList;
  /* 0x0358 */ struct _SINGLE_LIST_ENTRY PMProtocolOffloadList;
  /* 0x0360 */ struct _NDIS_PM_PARAMETERS PMCurrentParameters;
} NDIS_FILTER_BLOCK, *PNDIS_FILTER_BLOCK; /* size: 0x0370 */

typedef struct _NDIS_FILTER_DRIVER_BLOCK
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0008 */ struct _NDIS_FILTER_DRIVER_BLOCK* NextFilterDriver;
  /* 0x0010 */ struct _DRIVER_OBJECT* DriverObject;
  /* 0x0018 */ struct _NDIS_FILTER_BLOCK* FilterQueue;
  /* 0x0020 */ void* FilterDriverContext;
  /* 0x0028 */ unsigned __int64 Lock;
  /* 0x0030 */ unsigned long Flags;
  /* 0x0038 */ struct _LIST_ENTRY DeviceList;
  /* 0x0048 */ struct _REFERENCE Ref;
  /* 0x0058 */ struct _NDIS_FILTER_DRIVER_CHARACTERISTICS DefaultFilterCharacteristics;
  /* 0x0138 */ void* InitiateOffloadCompleteHandler /* function */;
  /* 0x0140 */ void* TerminateOffloadCompleteHandler /* function */;
  /* 0x0148 */ void* UpdateOffloadCompleteHandler /* function */;
  /* 0x0150 */ void* InvalidateOffloadCompleteHandler /* function */;
  /* 0x0158 */ void* QueryOffloadCompleteHandler /* function */;
  /* 0x0160 */ void* IndicateOffloadEventHandler /* function */;
  /* 0x0168 */ void* TcpOffloadSendCompleteHandler /* function */;
  /* 0x0170 */ void* TcpOffloadReceiveCompleteHandler /* function */;
  /* 0x0178 */ void* TcpOffloadDisconnectCompleteHandler /* function */;
  /* 0x0180 */ void* TcpOffloadForwardCompleteHandler /* function */;
  /* 0x0188 */ void* TcpOffloadEventHandler /* function */;
  /* 0x0190 */ void* TcpOffloadReceiveIndicateHandler /* function */;
  /* 0x0198 */ void* InitiateOffloadHandler /* function */;
  /* 0x01a0 */ void* TerminateOffloadHandler /* function */;
  /* 0x01a8 */ void* UpdateOffloadHandler /* function */;
  /* 0x01b0 */ void* InvalidateOffloadHandler /* function */;
  /* 0x01b8 */ void* QueryOffloadHandler /* function */;
  /* 0x01c0 */ void* TcpOffloadSendHandler /* function */;
  /* 0x01c8 */ void* TcpOffloadReceiveHandler /* function */;
  /* 0x01d0 */ void* TcpOffloadDisconnectHandler /* function */;
  /* 0x01d8 */ void* TcpOffloadForwardHandler /* function */;
  /* 0x01e0 */ void* TcpOffloadReceiveReturnHandler /* function */;
  /* 0x01e8 */ enum _NDIS_FILTER_TYPE FilterType;
  /* 0x01ec */ enum _NDIS_FILTER_RUN_TYPE FilterRunType;
  /* 0x01f0 */ struct _UNICODE_STRING FilterClass;
} NDIS_FILTER_DRIVER_BLOCK, *PNDIS_FILTER_DRIVER_BLOCK; /* size: 0x0200 */

typedef struct _NDIS_FILTER_DRIVER_CHARACTERISTICS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned char MajorNdisVersion;
  /* 0x0005 */ unsigned char MinorNdisVersion;
  /* 0x0006 */ unsigned char MajorDriverVersion;
  /* 0x0007 */ unsigned char MinorDriverVersion;
  /* 0x0008 */ unsigned long Flags;
  /* 0x0010 */ struct _UNICODE_STRING FriendlyName;
  /* 0x0020 */ struct _UNICODE_STRING UniqueName;
  /* 0x0030 */ struct _UNICODE_STRING ServiceName;
  /* 0x0040 */ void* SetOptionsHandler /* function */;
  /* 0x0048 */ void* SetFilterModuleOptionsHandler /* function */;
  /* 0x0050 */ void* AttachHandler /* function */;
  /* 0x0058 */ void* DetachHandler /* function */;
  /* 0x0060 */ void* RestartHandler /* function */;
  /* 0x0068 */ void* PauseHandler /* function */;
  /* 0x0070 */ void* SendNetBufferListsHandler /* function */;
  /* 0x0078 */ void* SendNetBufferListsCompleteHandler /* function */;
  /* 0x0080 */ void* CancelSendNetBufferListsHandler /* function */;
  /* 0x0088 */ void* ReceiveNetBufferListsHandler /* function */;
  /* 0x0090 */ void* ReturnNetBufferListsHandler /* function */;
  /* 0x0098 */ void* OidRequestHandler /* function */;
  /* 0x00a0 */ void* OidRequestCompleteHandler /* function */;
  /* 0x00a8 */ void* CancelOidRequestHandler /* function */;
  /* 0x00b0 */ void* DevicePnPEventNotifyHandler /* function */;
  /* 0x00b8 */ void* NetPnPEventHandler /* function */;
  /* 0x00c0 */ void* StatusHandler /* function */;
  /* 0x00c8 */ void* DirectOidRequestHandler /* function */;
  /* 0x00d0 */ void* DirectOidRequestCompleteHandler /* function */;
  /* 0x00d8 */ void* CancelDirectOidRequestHandler /* function */;
} NDIS_FILTER_DRIVER_CHARACTERISTICS, *PNDIS_FILTER_DRIVER_CHARACTERISTICS; /* size: 0x00e0 */

typedef struct _NDIS_FILTER_PARTIAL_CHARACTERISTICS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ void* SendNetBufferListsHandler /* function */;
  /* 0x0010 */ void* SendNetBufferListsCompleteHandler /* function */;
  /* 0x0018 */ void* CancelSendNetBufferListsHandler /* function */;
  /* 0x0020 */ void* ReceiveNetBufferListsHandler /* function */;
  /* 0x0028 */ void* ReturnNetBufferListsHandler /* function */;
} NDIS_FILTER_PARTIAL_CHARACTERISTICS, *PNDIS_FILTER_PARTIAL_CHARACTERISTICS; /* size: 0x0030 */

typedef struct _NDIS_FILTER_PAUSE_PARAMETERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ unsigned long PauseReason;
} NDIS_FILTER_PAUSE_PARAMETERS, *PNDIS_FILTER_PAUSE_PARAMETERS; /* size: 0x000c */

typedef struct _NDIS_FILTER_RESTART_PARAMETERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ enum _NDIS_MEDIUM MiniportMediaType;
  /* 0x0008 */ enum _NDIS_PHYSICAL_MEDIUM MiniportPhysicalMediaType;
  /* 0x0010 */ struct _NDIS_RESTART_ATTRIBUTES* RestartAttributes;
  /* 0x0018 */ unsigned long LowerIfIndex;
  /* 0x0020 */ union _NET_LUID_LH LowerIfNetLuid;
  /* 0x0028 */ unsigned long Flags;
  /* 0x002c */ long __PADDING__[1];
} NDIS_FILTER_RESTART_PARAMETERS, *PNDIS_FILTER_RESTART_PARAMETERS; /* size: 0x0030 */

typedef enum _NDIS_FILTER_RUN_TYPE
{
  NdisFilterRunTypeMandatory = 1,
  NdisFilterRunTypeOptional = 2,
} NDIS_FILTER_RUN_TYPE, *PNDIS_FILTER_RUN_TYPE;

typedef enum _NDIS_FILTER_STATE
{
  NdisFilterDetached = 0,
  NdisFilterAttaching = 1,
  NdisFilterPaused = 2,
  NdisFilterRestarting = 3,
  NdisFilterRunning = 4,
  NdisFilterPausing = 5,
  NdisFilterDetaching = 6,
} NDIS_FILTER_STATE, *PNDIS_FILTER_STATE;

typedef struct _NDIS_FILTER_TASK_OFFLOAD
{
  /* 0x0000 */ struct _NDIS_OFFLOAD OffloadCaps;
} NDIS_FILTER_TASK_OFFLOAD, *PNDIS_FILTER_TASK_OFFLOAD; /* size: 0x0090 */

typedef enum _NDIS_FILTER_TYPE
{
  NdisFilterTypeMonitoring = 1,
  NdisFilterTypeModifying = 2,
} NDIS_FILTER_TYPE, *PNDIS_FILTER_TYPE;

typedef enum _NDIS_FRAME_HEADER
{
  NdisFrameHeaderUndefined = 0,
  NdisFrameHeaderMac = 1,
  NdisFrameHeaderMaximum = 2,
} NDIS_FRAME_HEADER, *PNDIS_FRAME_HEADER;

typedef struct _NDIS_FRAME_TYPE_AND_OPEN
{
  /* 0x0000 */ unsigned short Type;
  /* 0x0008 */ struct _NDIS_OPEN_BLOCK* Open;
} NDIS_FRAME_TYPE_AND_OPEN, *PNDIS_FRAME_TYPE_AND_OPEN; /* size: 0x0010 */

typedef struct _NDIS_FRAME_TYPE_RECORD
{
  /* 0x0000 */ unsigned int NumEntries;
  /* 0x0008 */ struct _NDIS_FRAME_TYPE_AND_OPEN Entry[16];
} NDIS_FRAME_TYPE_RECORD, *PNDIS_FRAME_TYPE_RECORD; /* size: 0x0108 */

typedef struct _NDIS_GUID
{
  /* 0x0000 */ struct _GUID Guid;
  union
  {
    /* 0x0010 */ unsigned long Oid;
    /* 0x0010 */ int Status;
  }; /* size: 0x0004 */
  /* 0x0014 */ unsigned long Size;
  /* 0x0018 */ unsigned long Flags;
} NDIS_GUID, *PNDIS_GUID; /* size: 0x001c */

typedef enum _NDIS_HALT_ACTION
{
  NdisHaltDeviceDisabled = 0,
  NdisHaltDeviceInstanceDeInitialized = 1,
  NdisHaltDevicePoweredDown = 2,
  NdisHaltDeviceSurpriseRemoved = 3,
  NdisHaltDeviceFailed = 4,
  NdisHaltDeviceInitializationFailed = 5,
  NdisHaltDeviceStopped = 6,
} NDIS_HALT_ACTION, *PNDIS_HALT_ACTION;

typedef struct _NDIS_HD_SPLIT_CURRENT_CONFIG
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long HardwareCapabilities;
  /* 0x0008 */ unsigned long CurrentCapabilities;
  /* 0x000c */ unsigned long HDSplitFlags;
  /* 0x0010 */ unsigned long HDSplitCombineFlags;
  /* 0x0014 */ unsigned long BackfillSize;
  /* 0x0018 */ unsigned long MaxHeaderSize;
} NDIS_HD_SPLIT_CURRENT_CONFIG, *PNDIS_HD_SPLIT_CURRENT_CONFIG; /* size: 0x001c */

typedef struct _NDIS_IF_BLOCK
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0008 */ struct _LIST_ENTRY Link;
  /* 0x0018 */ struct _LIST_ENTRY ProviderLink;
  /* 0x0028 */ struct _LIST_ENTRY NetworkLink;
  /* 0x0038 */ struct _NDIS_IF_RCV_ADDRESS* ifRcvAddressTable;
  /* 0x0040 */ unsigned long ifRcvAddressCount;
  /* 0x0044 */ unsigned long ifMaxRcvAddressCount;
  /* 0x0048 */ unsigned long LowerLayerIfCount;
  /* 0x004c */ unsigned long HigherLayerIfCount;
  /* 0x0050 */ long Ref;
  /* 0x0054 */ long MiniportRef;
  /* 0x0058 */ union _NET_LUID_LH NetLuid;
  /* 0x0060 */ void* ProviderIfContext;
  /* 0x0068 */ struct _NDIS_IF_PROVIDER_BLOCK* ProviderHandle;
  /* 0x0070 */ unsigned long Flags;
  /* 0x0074 */ struct _NET_PHYSICAL_LOCATION_LH PhysicalLocation;
  /* 0x0080 */ unsigned long WanTunnelType;
  /* 0x0084 */ unsigned long PortNumber;
  /* 0x0088 */ unsigned __int64 ifLastChange;
  /* 0x0090 */ unsigned __int64 ifCounterDiscontinuityTime;
  union
  {
    /* 0x0098 */ unsigned char RosInfo;
    /* 0x0098 */ unsigned long ifIndex;
  }; /* size: 0x0004 */
  /* 0x009c */ struct _IF_COUNTED_STRING_LH ifDescr;
  /* 0x02a0 */ unsigned short ifType;
  /* 0x02a4 */ enum _NET_IF_ACCESS_TYPE AccessType;
  /* 0x02a8 */ enum _NET_IF_DIRECTION_TYPE DirectionType;
  /* 0x02ac */ enum _NET_IF_CONNECTION_TYPE ConnectionType;
  /* 0x02b0 */ struct _GUID InterfaceGuid;
  /* 0x02c0 */ unsigned char ifConnectorPresent;
  /* 0x02c4 */ unsigned long ifFlags;
  /* 0x02c8 */ enum _NDIS_MEDIUM MediaType;
  /* 0x02cc */ enum _NDIS_PHYSICAL_MEDIUM PhysicalMediumType;
  union
  {
    /* 0x02d0 */ unsigned char RodInfo;
    /* 0x02d0 */ unsigned int CompartmentId;
  }; /* size: 0x0004 */
  /* 0x02d4 */ struct _GUID NetworkGuid;
  /* 0x02e4 */ struct _IF_COUNTED_STRING_LH ifAlias;
  /* 0x04e8 */ enum _NET_IF_OPER_STATUS ifOperStatus;
  /* 0x04ec */ unsigned long ifOperStatusFlags;
  /* 0x04f0 */ unsigned long ifMtu;
  /* 0x04f4 */ struct _IF_PHYSICAL_ADDRESS_LH ifPhysAddress;
  /* 0x0516 */ struct _IF_PHYSICAL_ADDRESS_LH PermanentPhysAddress;
  /* 0x0538 */ enum _NET_IF_ADMIN_STATUS ifAdminStatus;
  /* 0x0540 */ unsigned __int64 XmitLinkSpeed;
  /* 0x0548 */ unsigned __int64 RcvLinkSpeed;
  /* 0x0550 */ unsigned char ifPromiscuousMode;
  /* 0x0551 */ unsigned char ifDeviceWakeUpEnable;
  /* 0x0554 */ enum _NET_IF_MEDIA_CONNECT_STATE MediaConnectState;
  /* 0x0558 */ enum _NET_IF_MEDIA_DUPLEX_STATE MediaDuplexState;
  /* 0x0560 */ struct _NDIS_IF_NETWORK_BLOCK* Network;
  /* 0x0568 */ struct _NDIS_IF_COMPARTMENT_BLOCK* Compartment;
  /* 0x0570 */ struct _KEVENT* AsyncEvent;
  /* 0x0578 */ struct _KEVENT* MiniportAsyncEvent;
  /* 0x0580 */ unsigned char bNdisIsProvider;
  /* 0x0581 */ unsigned char MiniportPresent;
  /* 0x0584 */ unsigned long SupportedStatistics;
  /* 0x0588 */ struct _IF_COUNTED_STRING_LH ifL2NetworkInfo;
  /* 0x078c */ long __PADDING__[1];
} NDIS_IF_BLOCK, *PNDIS_IF_BLOCK; /* size: 0x0790 */

typedef struct _NDIS_IF_COMPARTMENT_BLOCK
{
  /* 0x0000 */ struct _LIST_ENTRY Link;
  /* 0x0010 */ unsigned int CompartmentId;
  /* 0x0018 */ struct _LIST_ENTRY NetworkLink;
  /* 0x0028 */ unsigned long Flags;
  /* 0x002c */ long Ref;
  /* 0x0030 */ struct _NDIS_IF_NETWORK_BLOCK* LoopbackNetwork;
  /* 0x0038 */ struct _NDIS_NSI_COMPARTMENT_RW LoopbackInfo;
  /* 0x0480 */ struct _NDIS_IF_BLOCK* LoopbackIf;
  /* 0x0488 */ struct _KEVENT* AsyncEvent;
} NDIS_IF_COMPARTMENT_BLOCK, *PNDIS_IF_COMPARTMENT_BLOCK; /* size: 0x0490 */

typedef struct _NDIS_IF_NETWORK_BLOCK
{
  /* 0x0000 */ struct _LIST_ENTRY Link;
  /* 0x0010 */ struct _LIST_ENTRY CompartmentLink;
  /* 0x0020 */ struct _GUID NetworkGuid;
  /* 0x0030 */ struct _NDIS_IF_COMPARTMENT_BLOCK* Compartment;
  /* 0x0038 */ struct _LIST_ENTRY InterfaceLink;
  /* 0x0048 */ unsigned long Flags;
  /* 0x004c */ long Ref;
  /* 0x0050 */ struct _NDIS_NSI_NETWORK_RW NetworkInfo;
  /* 0x0260 */ struct _KEVENT* AsyncEvent;
} NDIS_IF_NETWORK_BLOCK, *PNDIS_IF_NETWORK_BLOCK; /* size: 0x0268 */

typedef struct _NDIS_IF_PROVIDER_BLOCK
{
  /* 0x0000 */ struct _LIST_ENTRY Link;
  /* 0x0010 */ struct _LIST_ENTRY IfList;
  /* 0x0020 */ void* IfProviderContext;
  /* 0x0028 */ struct _NDIS_IF_PROVIDER_CHARACTERISTICS ProviderCharacteristics;
} NDIS_IF_PROVIDER_BLOCK, *PNDIS_IF_PROVIDER_BLOCK; /* size: 0x0050 */

typedef struct _NDIS_IF_PROVIDER_CHARACTERISTICS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0008 */ void* QueryObjectHandler /* function */;
  /* 0x0010 */ void* SetObjectHandler /* function */;
  /* 0x0018 */ void* Reserved1;
  /* 0x0020 */ void* Reserved2;
} NDIS_IF_PROVIDER_CHARACTERISTICS, *PNDIS_IF_PROVIDER_CHARACTERISTICS; /* size: 0x0028 */

typedef struct _NDIS_IF_RCV_ADDRESS
{
  union
  {
    /* 0x0000 */ unsigned char RodInfo;
    /* 0x0000 */ enum _NET_IF_RCV_ADDRESS_TYPE ifRcvAddressType;
  }; /* size: 0x0004 */
  /* 0x0004 */ unsigned short ifRcvAddressLength;
  /* 0x0008 */ unsigned char ifRcvAddress[32];
} NDIS_IF_RCV_ADDRESS, *PNDIS_IF_RCV_ADDRESS; /* size: 0x0028 */

typedef enum _NDIS_INTERFACE_TYPE
{
  NdisInterfaceInternal = 0,
  NdisInterfaceIsa = 1,
  NdisInterfaceEisa = 2,
  NdisInterfaceMca = 3,
  NdisInterfaceTurboChannel = 4,
  NdisInterfacePci = 5,
  NdisInterfacePcMcia = 8,
  NdisInterfaceCBus = 9,
  NdisInterfaceMPIBus = 10,
  NdisInterfaceMPSABus = 11,
  NdisInterfaceProcessorInternal = 12,
  NdisInterfaceInternalPowerBus = 13,
  NdisInterfacePNPISABus = 14,
  NdisInterfacePNPBus = 15,
  NdisInterfaceUSB = 16,
  NdisInterfaceIrda = 17,
  NdisInterface1394 = 18,
  NdisMaximumInterfaceType = 19,
} NDIS_INTERFACE_TYPE, *PNDIS_INTERFACE_TYPE;

typedef struct _NDIS_INTERRUPT_BLOCK
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0008 */ unsigned __int64 DpcCountLock;
  /* 0x0010 */ void* MiniportInterruptContext;
  /* 0x0018 */ void* MiniportIsr /* function */;
  /* 0x0020 */ void* MiniportDpc /* function */;
  /* 0x0028 */ struct _KDPC InterruptDpc;
  /* 0x0068 */ struct _NDIS_MINIPORT_BLOCK* Miniport;
  /* 0x0070 */ unsigned char DpcCount;
  /* 0x0078 */ void* MiniportEnableInterrupt /* function */;
  /* 0x0080 */ void* MiniportDisableInterrupt /* function */;
  /* 0x0088 */ struct _KDPC* Dpc;
  union
  {
    /* 0x0090 */ void* Generic;
    /* 0x0090 */ struct _KINTERRUPT* InterruptObject;
    /* 0x0090 */ struct _IO_INTERRUPT_MESSAGE_INFO* MessageInfoTable;
  }; /* size: 0x0008 */
  /* 0x0098 */ struct _KEVENT DpcsCompletedEvent;
  /* 0x00b0 */ unsigned char SharedInterrupt;
  /* 0x00b1 */ unsigned char IsrRequested;
  /* 0x00b8 */ struct _NDIS_INTERRUPT_BLOCK* NextInterrupt;
  /* 0x00c0 */ unsigned int InterruptVector;
  /* 0x00c4 */ unsigned int InterruptLevel;
  /* 0x00c8 */ enum _KINTERRUPT_MODE InterruptMode;
  /* 0x00d0 */ void* MiniportMessageIsr /* function */;
  /* 0x00d8 */ void* MiniportMessageInterruptDpc /* function */;
  /* 0x00e0 */ void* MiniportDisableMessageInterrupt /* function */;
  /* 0x00e8 */ void* MiniportEnableMessageInterrupt /* function */;
  /* 0x00f0 */ unsigned char MsiSupported;
  /* 0x00f1 */ unsigned char MessageUsed;
  /* 0x00f8 */ unsigned __int64 MessagesSyncLock;
  /* 0x0100 */ struct _IO_INTERRUPT_MESSAGE_INFO* NdisMessageInfoTable;
  /* 0x0108 */ struct _NDIS_DPC_WORK_ITEM* DpcWorkItems;
  /* 0x0110 */ struct _KDPC* MsgDpc;
} NDIS_INTERRUPT_BLOCK, *PNDIS_INTERRUPT_BLOCK; /* size: 0x0118 */

typedef struct _NDIS_IPSEC_OFFLOAD_V1
{
  struct
  {
    /* 0x0000 */ unsigned long Encapsulation;
    /* 0x0004 */ unsigned long AhEspCombined;
    /* 0x0008 */ unsigned long TransportTunnelCombined;
    /* 0x000c */ unsigned long IPv4Options;
    /* 0x0010 */ unsigned long Flags;
  } /* size: 0x0014 */ Supported;
  struct
  {
    struct /* bitfield */
    {
      /* 0x0014 */ unsigned long Md5 : 2; /* bit position: 0 */
      /* 0x0014 */ unsigned long Sha_1 : 2; /* bit position: 2 */
      /* 0x0014 */ unsigned long Transport : 2; /* bit position: 4 */
      /* 0x0014 */ unsigned long Tunnel : 2; /* bit position: 6 */
      /* 0x0014 */ unsigned long Send : 2; /* bit position: 8 */
      /* 0x0014 */ unsigned long Receive : 2; /* bit position: 10 */
    }; /* bitfield */
  } /* size: 0x0004 */ IPv4AH;
  struct
  {
    struct /* bitfield */
    {
      /* 0x0018 */ unsigned long Des : 2; /* bit position: 0 */
      /* 0x0018 */ unsigned long Reserved : 2; /* bit position: 2 */
      /* 0x0018 */ unsigned long TripleDes : 2; /* bit position: 4 */
      /* 0x0018 */ unsigned long NullEsp : 2; /* bit position: 6 */
      /* 0x0018 */ unsigned long Transport : 2; /* bit position: 8 */
      /* 0x0018 */ unsigned long Tunnel : 2; /* bit position: 10 */
      /* 0x0018 */ unsigned long Send : 2; /* bit position: 12 */
      /* 0x0018 */ unsigned long Receive : 2; /* bit position: 14 */
    }; /* bitfield */
  } /* size: 0x0004 */ IPv4ESP;
} NDIS_IPSEC_OFFLOAD_V1, *PNDIS_IPSEC_OFFLOAD_V1; /* size: 0x001c */

typedef struct _NDIS_IPSEC_OFFLOAD_V1_NET_BUFFER_LIST_INFO
{
  union
  {
    struct
    {
      /* 0x0000 */ void* OffloadHandle;
    } /* size: 0x0008 */ Transmit;
    struct
    {
      struct
      {
        struct /* bitfield */
        {
          /* 0x0000 */ unsigned short SaDeleteReq : 1; /* bit position: 0 */
          /* 0x0000 */ unsigned short CryptoDone : 1; /* bit position: 1 */
          /* 0x0000 */ unsigned short NextCryptoDone : 1; /* bit position: 2 */
          /* 0x0000 */ unsigned short Pad : 13; /* bit position: 3 */
        }; /* bitfield */
        /* 0x0002 */ unsigned short CryptoStatus;
      } /* size: 0x0004 */ Receive;
      /* 0x0004 */ long __PADDING__[1];
    }; /* size: 0x0008 */
  }; /* size: 0x0008 */
} NDIS_IPSEC_OFFLOAD_V1_NET_BUFFER_LIST_INFO, *PNDIS_IPSEC_OFFLOAD_V1_NET_BUFFER_LIST_INFO; /* size: 0x0008 */

typedef struct _NDIS_IPSEC_OFFLOAD_V2
{
  /* 0x0000 */ unsigned long Encapsulation;
  /* 0x0004 */ unsigned char IPv6Supported;
  /* 0x0005 */ unsigned char IPv4Options;
  /* 0x0006 */ unsigned char IPv6NonIPsecExtensionHeaders;
  /* 0x0007 */ unsigned char Ah;
  /* 0x0008 */ unsigned char Esp;
  /* 0x0009 */ unsigned char AhEspCombined;
  /* 0x000a */ unsigned char Transport;
  /* 0x000b */ unsigned char Tunnel;
  /* 0x000c */ unsigned char TransportTunnelCombined;
  /* 0x000d */ unsigned char LsoSupported;
  /* 0x000e */ unsigned char ExtendedSequenceNumbers;
  /* 0x0010 */ unsigned long UdpEsp;
  /* 0x0014 */ unsigned long AuthenticationAlgorithms;
  /* 0x0018 */ unsigned long EncryptionAlgorithms;
  /* 0x001c */ unsigned long SaOffloadCapacity;
} NDIS_IPSEC_OFFLOAD_V2, *PNDIS_IPSEC_OFFLOAD_V2; /* size: 0x0020 */

typedef struct _NDIS_IPSEC_PACKET_INFO
{
  union
  {
    struct
    {
      /* 0x0000 */ void* OffloadHandle;
      /* 0x0008 */ void* NextOffloadHandle;
    } /* size: 0x0010 */ Transmit;
    struct
    {
      struct
      {
        struct /* bitfield */
        {
          /* 0x0000 */ unsigned long SA_DELETE_REQ : 1; /* bit position: 0 */
          /* 0x0000 */ unsigned long CRYPTO_DONE : 1; /* bit position: 1 */
          /* 0x0000 */ unsigned long NEXT_CRYPTO_DONE : 1; /* bit position: 2 */
        }; /* bitfield */
        /* 0x0004 */ unsigned long CryptoStatus;
      } /* size: 0x0008 */ Receive;
      /* 0x0008 */ long __PADDING__[2];
    }; /* size: 0x0010 */
  }; /* size: 0x0010 */
} NDIS_IPSEC_PACKET_INFO, *PNDIS_IPSEC_PACKET_INFO; /* size: 0x0010 */

typedef struct _NDIS_LOG
{
  /* 0x0000 */ struct _NDIS_MINIPORT_BLOCK* Miniport;
  /* 0x0008 */ unsigned __int64 LogLock;
  /* 0x0010 */ struct _IRP* Irp;
  /* 0x0018 */ unsigned int TotalSize;
  /* 0x001c */ unsigned int CurrentSize;
  /* 0x0020 */ unsigned int InPtr;
  /* 0x0024 */ unsigned int OutPtr;
  /* 0x0028 */ unsigned char LogBuf[1];
  /* 0x0029 */ char __PADDING__[7];
} NDIS_LOG, *PNDIS_LOG; /* size: 0x0030 */

typedef enum _NDIS_MAC_HEADER_FIELD
{
  NdisMacHeaderFieldUndefined = 0,
  NdisMacHeaderFieldDestinationAddress = 1,
  NdisMacHeaderFieldSourceAddress = 2,
  NdisMacHeaderFieldProtocol = 3,
  NdisMacHeaderFieldVlanId = 4,
  NdisMacHeaderFieldPriority = 5,
  NdisMacHeaderFieldMaximum = 6,
} NDIS_MAC_HEADER_FIELD, *PNDIS_MAC_HEADER_FIELD;

typedef enum _NDIS_MEDIUM
{
  NdisMedium802_3 = 0,
  NdisMedium802_5 = 1,
  NdisMediumFddi = 2,
  NdisMediumWan = 3,
  NdisMediumLocalTalk = 4,
  NdisMediumDix = 5,
  NdisMediumArcnetRaw = 6,
  NdisMediumArcnet878_2 = 7,
  NdisMediumAtm = 8,
  NdisMediumWirelessWan = 9,
  NdisMediumIrda = 10,
  NdisMediumBpc = 11,
  NdisMediumCoWan = 12,
  NdisMedium1394 = 13,
  NdisMediumInfiniBand = 14,
  NdisMediumTunnel = 15,
  NdisMediumNative802_11 = 16,
  NdisMediumLoopback = 17,
  NdisMediumWiMAX = 18,
  NdisMediumIP = 19,
  NdisMediumMax = 20,
} NDIS_MEDIUM, *PNDIS_MEDIUM;

typedef struct _NDIS_MINIPORT_ADAPTER_GENERAL_ATTRIBUTES
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ enum _NDIS_MEDIUM MediaType;
  /* 0x000c */ enum _NDIS_PHYSICAL_MEDIUM PhysicalMediumType;
  /* 0x0010 */ unsigned long MtuSize;
  /* 0x0018 */ unsigned __int64 MaxXmitLinkSpeed;
  /* 0x0020 */ unsigned __int64 XmitLinkSpeed;
  /* 0x0028 */ unsigned __int64 MaxRcvLinkSpeed;
  /* 0x0030 */ unsigned __int64 RcvLinkSpeed;
  /* 0x0038 */ enum _NET_IF_MEDIA_CONNECT_STATE MediaConnectState;
  /* 0x003c */ enum _NET_IF_MEDIA_DUPLEX_STATE MediaDuplexState;
  /* 0x0040 */ unsigned long LookaheadSize;
  /* 0x0048 */ struct _NDIS_PNP_CAPABILITIES* PowerManagementCapabilities;
  /* 0x0050 */ unsigned long MacOptions;
  /* 0x0054 */ unsigned long SupportedPacketFilters;
  /* 0x0058 */ unsigned long MaxMulticastListSize;
  /* 0x005c */ unsigned short MacAddressLength;
  /* 0x005e */ unsigned char PermanentMacAddress[32];
  /* 0x007e */ unsigned char CurrentMacAddress[32];
  /* 0x00a0 */ struct _NDIS_RECEIVE_SCALE_CAPABILITIES* RecvScaleCapabilities;
  /* 0x00a8 */ enum _NET_IF_ACCESS_TYPE AccessType;
  /* 0x00ac */ enum _NET_IF_DIRECTION_TYPE DirectionType;
  /* 0x00b0 */ enum _NET_IF_CONNECTION_TYPE ConnectionType;
  /* 0x00b4 */ unsigned short IfType;
  /* 0x00b6 */ unsigned char IfConnectorPresent;
  /* 0x00b8 */ unsigned long SupportedStatistics;
  /* 0x00bc */ unsigned long SupportedPauseFunctions;
  /* 0x00c0 */ unsigned long DataBackFillSize;
  /* 0x00c4 */ unsigned long ContextBackFillSize;
  /* 0x00c8 */ unsigned long* SupportedOidList;
  /* 0x00d0 */ unsigned long SupportedOidListLength;
  /* 0x00d4 */ unsigned long AutoNegotiationFlags;
  /* 0x00d8 */ struct _NDIS_PM_CAPABILITIES* PowerManagementCapabilitiesEx;
} NDIS_MINIPORT_ADAPTER_GENERAL_ATTRIBUTES, *PNDIS_MINIPORT_ADAPTER_GENERAL_ATTRIBUTES; /* size: 0x00e0 */

typedef struct _NDIS_MINIPORT_BLOCK
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0008 */ struct _NDIS_MINIPORT_BLOCK* NextMiniport;
  /* 0x0010 */ struct _NDIS_MINIPORT_BLOCK* BaseMiniport;
  /* 0x0018 */ void* MiniportAdapterContext;
  union
  {
    /* 0x0020 */ struct _UNICODE_STRING Reserved4;
    struct
    {
      /* 0x0020 */ unsigned char MajorNdisVersion;
      /* 0x0021 */ unsigned char MinorNdisVersion;
      /* 0x0028 */ struct _NDIS_PER_PROC_COUNTERS* PerProcCounters;
    }; /* size: 0x000a */
  }; /* size: 0x0010 */
  union
  {
    /* 0x0030 */ unsigned long EnabledPerformanceCounters;
    /* 0x0030 */ void* pvoidEnabledPerformanceCounters;
  }; /* size: 0x0008 */
  /* 0x0038 */ void* OpenQueue;
  /* 0x0040 */ struct _REFERENCE ShortRef;
  union
  {
    /* 0x0050 */ unsigned long EnabledPerformanceCountersEx;
    /* 0x0050 */ void* pvoidEnabledPerformanceCountersEx;
  }; /* size: 0x0008 */
  /* 0x0058 */ unsigned char LinkStateIndicationFlags;
  /* 0x0059 */ unsigned char LockAcquired;
  /* 0x005a */ unsigned char PmodeOpens;
  /* 0x005b */ unsigned char Reserved23;
  /* 0x0060 */ unsigned __int64 Lock;
  /* 0x0068 */ struct _NDIS_REQUEST* MediaRequest;
  /* 0x0070 */ struct _NDIS_MINIPORT_INTERRUPT* Interrupt;
  /* 0x0078 */ unsigned long Flags;
  /* 0x007c */ unsigned long PnPFlags;
  /* 0x0080 */ struct _LIST_ENTRY PacketList;
  /* 0x0090 */ struct _NDIS_PACKET* FirstPendingPacket;
  /* 0x0098 */ struct _NDIS_PACKET* ReturnPacketsQueue;
  /* 0x00a0 */ unsigned long RequestBuffer;
  /* 0x00a8 */ void* SetMCastBuffer;
  /* 0x00b0 */ struct _NDIS_MINIPORT_BLOCK* PrimaryMiniport;
  /* 0x00b8 */ void* NextCancelSendNetBufferListsHandler /* function */;
  /* 0x00c0 */ void* OidContext;
  /* 0x00c8 */ unsigned long SupportedOidListLength;
  /* 0x00d0 */ struct _CM_RESOURCE_LIST* Resources;
  /* 0x00d8 */ struct _NDIS_TIMER WakeUpDpcTimer;
  union
  {
    /* 0x0158 */ struct _UNICODE_STRING Reserved20;
    struct
    {
      /* 0x0158 */ enum _NET_IF_MEDIA_CONNECT_STATE MiniportMediaConnectState;
      /* 0x015c */ enum _NET_IF_MEDIA_DUPLEX_STATE MiniportMediaDuplexState;
    }; /* size: 0x0008 */
  }; /* size: 0x0010 */
  /* 0x0168 */ struct _UNICODE_STRING SymbolicLinkName;
  /* 0x0178 */ unsigned long CheckForHangSeconds;
  /* 0x017c */ unsigned short CFHangTicks;
  /* 0x017e */ unsigned short CFHangCurrentTick;
  /* 0x0180 */ int ResetStatus;
  /* 0x0188 */ void* ResetOpen;
  union
  {
    /* 0x0190 */ struct _X_FILTER* EthDB;
    /* 0x0190 */ struct _X_FILTER* NullDB;
  }; /* size: 0x0008 */
  /* 0x0198 */ struct _X_FILTER* TrDB;
  /* 0x01a0 */ void* YYYDB;
  /* 0x01a8 */ void* XXXDB;
  /* 0x01b0 */ void* PacketIndicateHandler /* function */;
  /* 0x01b8 */ void* SendCompleteHandler /* function */;
  /* 0x01c0 */ void* SendResourcesHandler /* function */;
  /* 0x01c8 */ void* ResetCompleteHandler /* function */;
  /* 0x01d0 */ enum _NDIS_MEDIUM MediaType;
  /* 0x01d4 */ unsigned long AutoNegotiationFlags;
  /* 0x01d8 */ enum _NDIS_INTERFACE_TYPE Reserved5;
  /* 0x01dc */ enum _NDIS_INTERFACE_TYPE AdapterType;
  union
  {
    /* 0x01e0 */ struct _DEVICE_OBJECT* Reserved6;
    /* 0x01e0 */ enum _NET_IF_MEDIA_CONNECT_STATE MediaConnectState;
  }; /* size: 0x0008 */
  union
  {
    /* 0x01e8 */ struct _DEVICE_OBJECT* Reserved7;
    /* 0x01e8 */ enum _NET_IF_MEDIA_DUPLEX_STATE MediaDuplexState;
  }; /* size: 0x0008 */
  /* 0x01f0 */ unsigned long* SupportedOidList;
  /* 0x01f8 */ struct _NDIS_SG_DMA_BLOCK* MiniportSGDmaBlock;
  /* 0x0200 */ struct _NDIS_AF_LIST* CallMgrAfList;
  /* 0x0208 */ void* MiniportThread;
  /* 0x0210 */ void* SetInfoBuf;
  /* 0x0218 */ unsigned short SetInfoBufLen;
  /* 0x021a */ unsigned short MaxSendPackets;
  /* 0x021c */ int FakeStatus;
  /* 0x0220 */ void* Reserved24;
  /* 0x0228 */ struct _NDIS_RECEIVE_SCALE_PARAMETERS* CombinedNdisRSSParameters;
  union
  {
    /* 0x0230 */ struct _NDIS_MINIPORT_TIMER* TimerQueue;
    /* 0x0230 */ struct _NDIS_TIMER_ENTRY* TimerObjectQueue;
  }; /* size: 0x0008 */
  /* 0x0238 */ unsigned int MacOptions;
  /* 0x0240 */ struct _NDIS_REQUEST* PendingRequest;
  /* 0x0248 */ unsigned int MaximumLongAddresses;
  /* 0x024c */ unsigned int MaximumShortAddresses;
  /* 0x0250 */ unsigned int MiniportCurrentLookahead;
  /* 0x0254 */ unsigned int MiniportMaximumLookahead;
  union
  {
    /* 0x0258 */ unsigned __int64 Reserved1;
    /* 0x0258 */ struct _X_FILTER* NullMediaFilter;
  }; /* size: 0x0008 */
  /* 0x0260 */ void* DisableInterruptHandler /* function */;
  /* 0x0268 */ void* EnableInterruptHandler /* function */;
  /* 0x0270 */ void* SendPacketsHandler /* function */;
  /* 0x0278 */ void* DeferredSendHandler /* function */;
  /* 0x0280 */ void* EthRxIndicateHandler /* function */;
  /* 0x0288 */ void* TrRxIndicateHandler /* function */;
  /* 0x0290 */ void* NextSendNetBufferListsHandler /* function */;
  /* 0x0298 */ void* EthRxCompleteHandler /* function */;
  /* 0x02a0 */ void* TrRxCompleteHandler /* function */;
  /* 0x02a8 */ void* SavedNextSendNetBufferListsHandler /* function */;
  /* 0x02b0 */ void* StatusHandler /* function */;
  /* 0x02b8 */ void* StatusCompleteHandler /* function */;
  /* 0x02c0 */ void* TDCompleteHandler /* function */;
  /* 0x02c8 */ void* QueryCompleteHandler /* function */;
  /* 0x02d0 */ void* SetCompleteHandler /* function */;
  /* 0x02d8 */ void* WanSendCompleteHandler /* function */;
  /* 0x02e0 */ void* WanRcvHandler /* function */;
  /* 0x02e8 */ void* WanRcvCompleteHandler /* function */;
  /* 0x02f0 */ void* IndicateNetBufferListsHandler /* function */;
  /* 0x02f8 */ void* IndicateNetBufferListsContext;
  /* 0x0300 */ void* SendNetBufferListsCompleteHandler /* function */;
  /* 0x0308 */ void* NextReturnNetBufferLists /* function */;
  /* 0x0310 */ void* NextReturnNetBufferListsContext;
  /* 0x0318 */ struct _KEVENT* PnPEventLockEvent;
  /* 0x0320 */ struct _NDIS_OBJECT_HEADER* MediaSpecificAttributes;
  /* 0x0328 */ struct _IRP* PendingQueryPowerIrp;
  /* 0x0330 */ void* UnalignedPerProcCounters;
  /* 0x0338 */ struct _NDIS_INTERRUPT_BLOCK* InterruptEx;
  /* 0x0340 */ unsigned __int64 XmitLinkSpeed;
  /* 0x0348 */ unsigned __int64 RcvLinkSpeed;
  /* 0x0350 */ enum _NDIS_SUPPORTED_PAUSE_FUNCTIONS PauseFunctions;
  /* 0x0354 */ struct _PROCESSOR_NUMBER AssignedProcessor;
  /* 0x0358 */ enum _NDIS_SUPPORTED_PAUSE_FUNCTIONS MiniportPauseFunctions;
  /* 0x035c */ unsigned long MiniportAutoNegotiationFlags;
  /* 0x0360 */ struct _SINGLE_LIST_ENTRY WorkQueue[7];
  /* 0x0398 */ struct _SINGLE_LIST_ENTRY SingleWorkItems[6];
  /* 0x03c8 */ unsigned char SendFlags;
  /* 0x03c9 */ unsigned char TrResetRing;
  /* 0x03ca */ unsigned char MP6SupportPM;
  /* 0x03cb */ unsigned char XState;
  /* 0x03d0 */ struct _NDIS_LOG* Log;
  /* 0x03d8 */ struct _CM_RESOURCE_LIST* AllocatedResources;
  /* 0x03e0 */ struct _CM_RESOURCE_LIST* AllocatedResourcesTranslated;
  /* 0x03e8 */ struct _SINGLE_LIST_ENTRY PatternList;
  /* 0x03f0 */ struct _SINGLE_LIST_ENTRY WOLPatternList;
  /* 0x03f8 */ struct _SINGLE_LIST_ENTRY PMProtocolOffloadList;
  /* 0x0400 */ struct _NDIS_PNP_CAPABILITIES PMCapabilities61;
  /* 0x0410 */ struct _NDIS_PM_CAPABILITIES PMHardwareCapabilities;
  /* 0x0444 */ struct _NDIS_PM_CAPABILITIES PMAdvertisedCapabilities;
  /* 0x0478 */ struct _NDIS_PM_PARAMETERS PMCurrentParameters;
  /* 0x0488 */ struct _DEVICE_CAPABILITIES DeviceCaps;
  /* 0x04c8 */ unsigned char S0WakeupSupported;
  /* 0x04cc */ unsigned long CombinedWakeUpEnable;
  /* 0x04d0 */ unsigned long WakeUpEnable;
  /* 0x04d8 */ struct _IRP* pIrpWaitWake;
  /* 0x04e0 */ enum _SYSTEM_POWER_STATE WaitWakeSystemState;
  /* 0x04e8 */ union _LARGE_INTEGER VcIndex;
  /* 0x04f0 */ unsigned __int64 VcCountLock;
  /* 0x04f8 */ struct _LIST_ENTRY WmiEnabledVcs;
  /* 0x0508 */ struct _NDIS_GUID* pNdisGuidMap;
  /* 0x0510 */ struct _NDIS_GUID* pCustomGuidMap;
  /* 0x0518 */ unsigned short VcCount;
  /* 0x051a */ unsigned short cNdisGuidMap;
  /* 0x051c */ unsigned short cCustomGuidMap;
  /* 0x0520 */ struct _NDIS_TIMER MediaDisconnectTimer;
  /* 0x05a0 */ enum _NDIS_PNP_DEVICE_STATE PnPDeviceState;
  /* 0x05a4 */ enum _NDIS_PNP_DEVICE_STATE OldPnPDeviceState;
  /* 0x05a8 */ struct _KDPC DeferredDpc;
  /* 0x05e8 */ union _LARGE_INTEGER StartTicks;
  /* 0x05f0 */ struct _NDIS_PACKET** IndicatedPacket;
  /* 0x05f8 */ struct _KEVENT* RemoveReadyEvent;
  /* 0x0600 */ struct _KEVENT* AllOpensClosedEvent;
  /* 0x0608 */ struct _KEVENT* AllRequestsCompletedEvent;
  /* 0x0610 */ unsigned long InitTimeMs;
  /* 0x0618 */ struct _NDIS_MINIPORT_WORK_ITEM WorkItemBuffer[6];
  /* 0x06a8 */ struct _OID_LIST* OidList;
  /* 0x06b0 */ unsigned short InternalResetCount;
  /* 0x06b2 */ unsigned short MiniportResetCount;
  /* 0x06b4 */ unsigned short MediaSenseConnectCount;
  /* 0x06b6 */ unsigned short MediaSenseDisconnectCount;
  /* 0x06b8 */ struct _NDIS_PACKET** xPackets;
  /* 0x06c0 */ unsigned long UserModeOpenReferences;
  /* 0x06c8 */ void* SavedIndicateNetBufferListsHandler /* function */;
  /* 0x06d0 */ void* SavedIndicateNetBufferListsContext;
  /* 0x06d8 */ void* WSendPacketsHandler /* function */;
  /* 0x06e0 */ unsigned long MiniportAttributes;
  /* 0x06e4 */ unsigned short NumOpens;
  /* 0x06e6 */ unsigned short CFHangXTicks;
  /* 0x06e8 */ unsigned long RequestCount;
  /* 0x06ec */ unsigned long IndicatedPacketsCount;
  /* 0x06f0 */ unsigned long PhysicalMediumType;
  /* 0x06f4 */ enum _NDIS_MEDIUM MiniportMediaType;
  /* 0x06f8 */ struct _NDIS_REQUEST* LastRequest;
  /* 0x0700 */ void* FakeMac;
  /* 0x0708 */ unsigned long LockDbg;
  /* 0x070c */ unsigned long LockDbgX;
  /* 0x0710 */ void* LockThread;
  /* 0x0718 */ unsigned long InfoFlags;
  /* 0x0720 */ unsigned __int64 TimerQueueLock;
  /* 0x0728 */ struct _KEVENT* ResetCompletedEvent;
  /* 0x0730 */ struct _KEVENT* QueuedBindingCompletedEvent;
  /* 0x0738 */ void* SavedPacketIndicateHandler /* function */;
  /* 0x0740 */ unsigned long RegisteredInterrupts;
  /* 0x0744 */ unsigned long SetOid;
  /* 0x0748 */ struct _KEVENT* WakeUpTimerEvent;
  /* 0x0750 */ void* DeviceContext;
  /* 0x0760 */ unsigned char CombinedRSSParametersBuf[656];
  /* 0x09f0 */ unsigned char RSSParametersBuf[656];
  /* 0x0c80 */ unsigned char UsingMSIX;
  /* 0x0c81 */ unsigned char Miniport5InNdis6Mode;
  /* 0x0c82 */ unsigned char Miniport5HasNdis6Component;
  /* 0x0c83 */ unsigned char RestoreStackNeeded;
  /* 0x0c84 */ char MediaChangeFilters;
  /* 0x0c85 */ unsigned char FilterPnPLockAcquired;
  /* 0x0c86 */ unsigned char LWFilterAllLoaded;
  /* 0x0c87 */ unsigned char CheckPacketFilters;
  /* 0x0c88 */ unsigned char ReceiveFilters;
  /* 0x0c90 */ void* FilterPnPLockThread;
  /* 0x0c98 */ unsigned long FilterPnPLockDbgX;
  /* 0x0ca0 */ unsigned __int64 RecvLock;
  /* 0x0ca8 */ enum _NDIS_MINIPORT_STATE RecvState;
  /* 0x0cac */ unsigned long OutstandingReceives;
  /* 0x0cb0 */ void* MiniportRecvLockThread;
  /* 0x0cb8 */ unsigned long RecvLockDbg;
  /* 0x0cc0 */ void* NextSendPacketsHandler /* function */;
  /* 0x0cc8 */ void* FinalSendPacketsHandler /* function */;
  /* 0x0cd0 */ void* LWFilterMutexOwnerThread;
  /* 0x0cd8 */ unsigned long LWFilterMutexOwner;
  /* 0x0cdc */ unsigned long LWFilterMutexOwnerCount;
  /* 0x0ce0 */ struct _NDIS_FILTER_BLOCK* LowestFilter;
  /* 0x0ce8 */ struct _NDIS_FILTER_BLOCK* HighestFilter;
  /* 0x0cf0 */ void* ShutdownContext;
  union
  {
    /* 0x0cf8 */ void* ShutdownHandler /* function */;
    /* 0x0cf8 */ void* ShutdownHandlerEx /* function */;
  }; /* size: 0x0008 */
  /* 0x0d00 */ struct _KBUGCHECK_CALLBACK_RECORD BugcheckCallbackRecord;
  /* 0x0d40 */ void* TopIndicateNetBufferListsHandler /* function */;
  /* 0x0d48 */ void* TopIndicateLoopbackNetBufferListsHandler /* function */;
  /* 0x0d50 */ void* Ndis5PacketIndicateHandler /* function */;
  /* 0x0d58 */ void* MiniportReturnPacketHandler /* function */;
  /* 0x0d60 */ void* MiniportReturnPacketContext;
  /* 0x0d68 */ void* SynchronousReturnPacketHandler /* function */;
  /* 0x0d70 */ void* SynchronousReturnPacketContext;
  /* 0x0d78 */ void* NextRequestHandler /* function */;
  /* 0x0d80 */ void* NextRequestContext;
  /* 0x0d88 */ struct _LIST_ENTRY OidRequestList;
  /* 0x0d98 */ struct _NDIS_OID_REQUEST* PendingOidRequest;
  /* 0x0da0 */ void* NextCoOidRequestHandle;
  /* 0x0da8 */ unsigned long Ndis6ProtocolsBound;
  /* 0x0dac */ unsigned long PmodeOpen6;
  /* 0x0db0 */ enum _NDIS_MINIPORT_STATE State;
  /* 0x0db8 */ struct _KEVENT* AsyncOpCompletionEvent;
  /* 0x0dc0 */ int AsyncOpCompletionStatus;
  /* 0x0dc8 */ struct _ULONG_REFERENCE Ref;
  /* 0x0dd8 */ unsigned __int64 MaxXmitLinkSpeed;
  /* 0x0de0 */ unsigned __int64 MaxRcvLinkSpeed;
  /* 0x0de8 */ unsigned long SupportedPacketFilters;
  /* 0x0df0 */ struct _NDIS_MINIPORT_HANDLERS NoFilter;
  /* 0x0ea0 */ struct _NDIS_MINIPORT_HANDLERS Next;
  /* 0x0f50 */ long NumOfPauseRestartRequests;
  /* 0x0f54 */ unsigned long FilterPnPFlags;
  /* 0x0f58 */ unsigned long SupportedStatistics;
  /* 0x0f5c */ unsigned long cDpcSendCompletes;
  /* 0x0f60 */ unsigned long cDpcRcvIndications;
  /* 0x0f64 */ unsigned long cDpcRcvIndicationCalls;
  /* 0x0f68 */ unsigned long cDpcNbSendCompletes;
  /* 0x0f6c */ unsigned long cDpcNblSendCompletes;
  /* 0x0f70 */ unsigned long cDpcNblIndications;
  /* 0x0f74 */ unsigned long cDpcMaxPacketsIndicated;
  /* 0x0f78 */ unsigned long cDpcTotalDpcCount;
  /* 0x0f7c */ struct _NDIS_RECEIVE_SCALE_CAPABILITIES RecvScaleCapabilities;
  /* 0x0f90 */ struct _NDIS_MINIPORT_ADAPTER_GENERAL_ATTRIBUTES* GeneralAttributes;
  /* 0x0f98 */ struct _LIST_ENTRY PortList;
  /* 0x0fa8 */ unsigned char* AllocatedPortIndices;
  /* 0x0fb0 */ unsigned long AllocatedPortIndicesLength;
  /* 0x0fb4 */ unsigned long NumberOfPorts;
  /* 0x0fb8 */ unsigned long NumberOfActivePorts;
  /* 0x0fc0 */ unsigned __int64 MiniportXmitLinkSpeed;
  /* 0x0fc8 */ unsigned __int64 MiniportRcvLinkSpeed;
  /* 0x0fd0 */ struct _KEVENT RestoreStackTimerEvent;
  /* 0x0fe8 */ struct _NDIS_TIMER RestoreStackTimer;
  /* 0x1068 */ struct _NDIS_WORK_ITEM RestoreStackWorkItem;
  /* 0x10b8 */ unsigned long RestoreStackBindRefCount;
  /* 0x10bc */ unsigned long ProtocolsToBind;
  /* 0x10c0 */ struct _NDIS_DPC_TRACKER* DpcTrackers;
  /* 0x10c8 */ struct _NDIS_DPC_TRACKER* CurrentDpcTracker;
  /* 0x10d0 */ unsigned char DpcTrackerIndex;
  /* 0x10d1 */ unsigned char SupportedRss;
  /* 0x10d8 */ unsigned __int64 DpcWatchDogCycleCount;
  /* 0x10e0 */ unsigned long DataBackFillSize;
  /* 0x10e4 */ unsigned long ContextBackFillSize;
  /* 0x10e8 */ unsigned long SupportedPauseFunctions;
  /* 0x10f0 */ struct _NDIS_RESTART_GENERAL_ATTRIBUTES TopFilterRestartAttributes;
  /* 0x1148 */ struct _NDIS_RECEIVE_SCALE_CAPABILITIES TopRecvScaleCapabilities;
  /* 0x1158 */ long NumOfOpenPauseRestartRequests;
  /* 0x115c */ long MiniportStackPauseCount;
  /* 0x1160 */ unsigned long NsiOpenReferences;
  /* 0x1168 */ struct _KEVENT* NsiRequestsCompletedEvent;
  /* 0x1170 */ enum _DEVICE_POWER_STATE QueryPowerDeviceState;
  /* 0x1174 */ unsigned char MinimumNdisMajorVersion;
  /* 0x1175 */ unsigned char MinimumNdisMinorVersion;
  /* 0x1176 */ unsigned short NumOfMinimumVersionDrivers;
  /* 0x1178 */ struct _NDIS_MINIPORT_STATS* BottomIfStats;
  /* 0x1180 */ struct _NDIS_M_PERIODIC_RECEIVES PeriodicReceiveQueue;
  /* 0x1210 */ enum _NDIS_PORT_CONTROL_STATE DefaultSendControlState;
  /* 0x1214 */ enum _NDIS_PORT_CONTROL_STATE DefaultRcvControlState;
  /* 0x1218 */ enum _NDIS_PORT_AUTHORIZATION_STATE DefaultSendAuthorizationState;
  /* 0x121c */ enum _NDIS_PORT_AUTHORIZATION_STATE DefaultRcvAuthorizationState;
  /* 0x1220 */ enum _NDIS_PORT_CONTROL_STATE DefaultPortSendControlState;
  /* 0x1224 */ enum _NDIS_PORT_CONTROL_STATE DefaultPortRcvControlState;
  /* 0x1228 */ enum _NDIS_PORT_AUTHORIZATION_STATE DefaultPortSendAuthorizationState;
  /* 0x122c */ enum _NDIS_PORT_AUTHORIZATION_STATE DefaultPortRcvAuthorizationState;
  /* 0x1230 */ struct _NDIS_PCI_DEVICE_CUSTOM_PROPERTIES PciDeviceCustomProperties;
  /* 0x1268 */ void* TopNdis5PacketIndicateHandler /* function */;
  /* 0x1270 */ unsigned long* ndisSupportedOidList;
  /* 0x1278 */ unsigned long ndisSupportedOidListLength;
  /* 0x127c */ unsigned long MsiIntCount;
  /* 0x1280 */ struct _WORK_QUEUE_ITEM MiniportDpcWorkItem;
  /* 0x12a0 */ unsigned __int64 InvalidFrames;
  /* 0x12a8 */ long PagingPathCount;
  /* 0x12b0 */ struct _LIST_ENTRY ReceiveQueueList;
  /* 0x12c0 */ unsigned char* AllocatedQueueIndices;
  /* 0x12c8 */ unsigned long AllocatedQueueIndicesLength;
  /* 0x12cc */ unsigned long NumReceiveQueues;
  /* 0x12d0 */ struct _LIST_ENTRY ReceiveFilterList;
  /* 0x12e0 */ unsigned char* AllocatedReceiveFilterIndices;
  /* 0x12e8 */ unsigned long AllocatedReceiveFilterIndicesLength;
  /* 0x12ec */ unsigned long NumReceiveFilters;
  /* 0x12f0 */ unsigned long EnabledReceiveFilterTypes;
  /* 0x12f4 */ unsigned long EnabledReceiveQueueTypes;
  /* 0x12f8 */ struct _NDIS_RECEIVE_FILTER_CAPABILITIES* ReceiveFilterHwCapabilities;
  /* 0x1300 */ struct _NDIS_RECEIVE_FILTER_CAPABILITIES* ReceiveFilterCurrentCapabilities;
  /* 0x1308 */ struct _NDIS_NIC_SWITCH_CAPABILITIES* NicSwitchHwCapabilities;
  /* 0x1310 */ struct _NDIS_NIC_SWITCH_CAPABILITIES* NicSwitchCurrentCapabilities;
  /* 0x1318 */ struct _LIST_ENTRY SharedMemoryBlockList;
  /* 0x1328 */ void* AllocateSharedMemoryHandler /* function */;
  /* 0x1330 */ void* FreeSharedMemoryHandler /* function */;
  /* 0x1338 */ void* AllocateSharedMemoryContext;
  /* 0x1340 */ unsigned long MsiXTableEntries;
  /* 0x1344 */ struct PCI_MSI_CAPABILITY MsiCaps;
  /* 0x135c */ struct PCI_MSIX_CAPABILITY MsiXCaps;
  /* 0x1368 */ unsigned __int64 NumberOfIndirectionTableChanges;
  union
  {
    /* 0x1370 */ unsigned char BeginSavedFields;
    /* 0x1370 */ unsigned long NumUserOpens;
  }; /* size: 0x0004 */
  /* 0x1374 */ struct _NDIS_MINIPORT_OFFLOAD_REG OffloadRegistry;
  /* 0x1378 */ unsigned short MediaDisconnectTimeOut;
  /* 0x137a */ unsigned short SGMapRegistersNeeded;
  /* 0x137c */ unsigned long DriverVerifyFlags;
  /* 0x1380 */ void* SetBusData /* function */;
  /* 0x1388 */ void* GetBusData /* function */;
  /* 0x1390 */ void* BusDataContext;
  /* 0x1398 */ enum _NDIS_INTERFACE_TYPE BusType;
  /* 0x139c */ unsigned long BusNumber;
  /* 0x13a0 */ unsigned long SlotNumber;
  /* 0x13a8 */ struct _NDIS_EVENT OpenReadyEvent;
  /* 0x13c0 */ unsigned long NumAdminOpens;
  /* 0x13c8 */ struct _NDIS_M_DRIVER_BLOCK* DriverHandle;
  /* 0x13d0 */ struct _NDIS_BIND_PATHS* BindPaths;
  /* 0x13d8 */ struct _NDIS_BIND_PATHS* LWFilterList;
  /* 0x13e0 */ struct _NDIS_PROTOCOL_BLOCK** ProtocolsFailToBind;
  /* 0x13e8 */ unsigned long MiniportPhysicalMediumType;
  /* 0x13f0 */ struct _NDIS_FILTER_ATTACH_LIST* LWFilterAttachList;
  /* 0x13f8 */ unsigned long NumFilters;
  /* 0x13fc */ unsigned int NetLuidIndex;
  /* 0x1400 */ struct _KMUTANT LWFilterMutex;
  /* 0x1438 */ void* SecurityDescriptor;
  /* 0x1440 */ struct _UNICODE_STRING BaseName;
  /* 0x1450 */ struct _UNICODE_STRING MiniportName;
  /* 0x1460 */ struct _DEVICE_OBJECT* DeviceObject;
  /* 0x1468 */ struct _DEVICE_OBJECT* PhysicalDeviceObject;
  /* 0x1470 */ struct _DEVICE_OBJECT* NextDeviceObject;
  /* 0x1478 */ struct _NDIS_MINIPORT_BLOCK* NextGlobalMiniport;
  /* 0x1480 */ struct _UNICODE_STRING* pAdapterInstanceName;
  /* 0x1488 */ unsigned long PnPCapabilities;
  /* 0x148c */ enum _DEVICE_POWER_STATE CurrentDevicePowerState;
  /* 0x1490 */ enum _DEVICE_POWER_STATE DriverPowerState;
  /* 0x1494 */ struct _NDIS_PM_ADMIN_GONFIG PMAdminConfig;
  /* 0x1498 */ struct _KSEMAPHORE PMPatternSemaphore;
  /* 0x14b8 */ struct _KSEMAPHORE PMOffloadSemaphore;
  /* 0x14d8 */ void* BusInterface;
  /* 0x14e0 */ unsigned short InstanceNumber;
  /* 0x14e8 */ void* ConfigurationHandle;
  /* 0x14f0 */ struct _GUID InterfaceGuid;
  /* 0x1500 */ struct _NDIS_IF_BLOCK* IfBlock;
  /* 0x1508 */ unsigned int IfIndex;
  /* 0x150c */ enum _NET_IF_ADMIN_STATUS AdminStatus;
  /* 0x1510 */ enum _NET_IF_OPER_STATUS OperStatus;
  /* 0x1514 */ unsigned long OperStatusFlags;
  union
  {
    /* 0x1518 */ void* SendHandler /* function */;
    /* 0x1518 */ void* WanSendHandler /* function */;
  }; /* size: 0x0008 */
  /* 0x1520 */ struct _NDIS_MINIPORT_OFFLOAD* Offload;
  /* 0x1528 */ void* AddDeviceContext;
  /* 0x1530 */ struct _IO_REMOVE_LOCK RemoveLock;
  /* 0x1550 */ struct _UNICODE_STRING DevinterfaceNetSymbolicLinkName;
  /* 0x1560 */ unsigned char RssEnable;
  /* 0x1561 */ unsigned char ChimneyEnable;
  /* 0x1564 */ unsigned long PhysicalMediumInInf;
  /* 0x1568 */ struct _UNICODE_STRING ExportName;
  /* 0x1578 */ struct _UNICODE_STRING FilterClass;
  /* 0x1588 */ void* StatusProcessingThread;
  /* 0x1590 */ unsigned long StatusProcessingDbgX;
  /* 0x1598 */ struct _UNICODE_STRING FdoName;
  /* 0x15a8 */ struct _NDIS_MINIPORT_BLOCK* NextOrphanedMiniport;
  /* 0x15b0 */ struct _KEVENT PowerEvent;
  /* 0x15c8 */ struct _KEVENT* pPowerEvent;
  /* 0x15d0 */ unsigned long DirectOidRequestCount;
  /* 0x15d8 */ struct _KEVENT* AllDirectRequestsCompletedEvent;
  /* 0x15e0 */ struct _NDIS_HD_SPLIT_CURRENT_CONFIG* HDSplitCurrentConfig;
  /* 0x15e8 */ void* MSIXConfigContext;
  /* 0x15f0 */ void* SetMSIXTableEntry /* function */;
  /* 0x15f8 */ void* MaskMSIXTableEntry /* function */;
  /* 0x1600 */ void* UnmaskMSIXTableEntry /* function */;
  /* 0x1608 */ struct _WORK_QUEUE_ITEM DevicePowerStateWorkItem;
  /* 0x1628 */ struct _WORK_QUEUE_ITEM SystemPowerStateWorkItem;
  /* 0x1648 */ struct _NDIS_RECEIVE_QUEUE_BLOCK* DefaultReceiveQueue;
  /* 0x1650 */ unsigned long MaxNumRssProcessors;
  /* 0x1654 */ struct _PROCESSOR_NUMBER RssBaseProcessor;
  /* 0x1658 */ unsigned short NumaNodeId;
  /* 0x1660 */ unsigned short* NumaDistances;
  /* 0x1668 */ struct _UNICODE_STRING* pModifiedInstanceName;
  /* 0x1670 */ struct _WORK_QUEUE_ITEM DeleteMiniportWorkItem;
} NDIS_MINIPORT_BLOCK, *PNDIS_MINIPORT_BLOCK; /* size: 0x1690 */

typedef struct _NDIS_MINIPORT_DRIVER_CHARACTERISTICS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned char MajorNdisVersion;
  /* 0x0005 */ unsigned char MinorNdisVersion;
  /* 0x0006 */ unsigned char MajorDriverVersion;
  /* 0x0007 */ unsigned char MinorDriverVersion;
  /* 0x0008 */ unsigned long Flags;
  /* 0x0010 */ void* SetOptionsHandler /* function */;
  /* 0x0018 */ void* InitializeHandlerEx /* function */;
  /* 0x0020 */ void* HaltHandlerEx /* function */;
  /* 0x0028 */ void* UnloadHandler /* function */;
  /* 0x0030 */ void* PauseHandler /* function */;
  /* 0x0038 */ void* RestartHandler /* function */;
  /* 0x0040 */ void* OidRequestHandler /* function */;
  /* 0x0048 */ void* SendNetBufferListsHandler /* function */;
  /* 0x0050 */ void* ReturnNetBufferListsHandler /* function */;
  /* 0x0058 */ void* CancelSendHandler /* function */;
  /* 0x0060 */ void* CheckForHangHandlerEx /* function */;
  /* 0x0068 */ void* ResetHandlerEx /* function */;
  /* 0x0070 */ void* DevicePnPEventNotifyHandler /* function */;
  /* 0x0078 */ void* ShutdownHandlerEx /* function */;
  /* 0x0080 */ void* CancelOidRequestHandler /* function */;
  /* 0x0088 */ void* DirectOidRequestHandler /* function */;
  /* 0x0090 */ void* CancelDirectOidRequestHandler /* function */;
} NDIS_MINIPORT_DRIVER_CHARACTERISTICS, *PNDIS_MINIPORT_DRIVER_CHARACTERISTICS; /* size: 0x0098 */

typedef struct _NDIS_MINIPORT_HANDLERS
{
  /* 0x0000 */ void* RequestContext;
  /* 0x0008 */ void* CancelSendContext;
  /* 0x0010 */ void* IndicateNetBufferListsContext;
  /* 0x0018 */ void* IndicateNetBufferListsObject;
  /* 0x0020 */ void* SaveIndicateNetBufferListsContext;
  /* 0x0028 */ void* ReturnNetBufferListsContext;
  /* 0x0030 */ void* ReturnNetBufferListsObject;
  /* 0x0038 */ void* SendNetBufferListsContext;
  /* 0x0040 */ void* SendNetBufferListsObject;
  /* 0x0048 */ void* SendNetBufferListsCompleteContext;
  /* 0x0050 */ void* SendNetBufferListsCompleteObject;
  /* 0x0058 */ void* RequestHandle;
  /* 0x0060 */ void* StatusHandle;
  /* 0x0068 */ void* DevicePnPEventNotifyHandle;
  /* 0x0070 */ void* NetPnPEventHandle;
  union
  {
    /* 0x0078 */ void* CancelSendHandler /* function */;
    /* 0x0078 */ void* CancelSendPacketsHandler /* function */;
  }; /* size: 0x0008 */
  /* 0x0080 */ void* SendNetBufferListsCompleteHandler /* function */;
  /* 0x0088 */ void* IndicateNetBufferListsHandler /* function */;
  /* 0x0090 */ void* SaveIndicateNetBufferListsHandler /* function */;
  /* 0x0098 */ void* ReturnNetBufferListsHandler /* function */;
  /* 0x00a0 */ void* SendNetBufferListsHandler /* function */;
  /* 0x00a8 */ void* DirectRequestHandle;
} NDIS_MINIPORT_HANDLERS, *PNDIS_MINIPORT_HANDLERS; /* size: 0x00b0 */

typedef struct _NDIS_MINIPORT_INIT_PARAMETERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ struct _CM_PARTIAL_RESOURCE_LIST* AllocatedResources;
  /* 0x0010 */ void* IMDeviceInstanceContext;
  /* 0x0018 */ void* MiniportAddDeviceContext;
  /* 0x0020 */ unsigned long IfIndex;
  /* 0x0028 */ union _NET_LUID_LH NetLuid;
  /* 0x0030 */ struct _NDIS_PORT_AUTHENTICATION_PARAMETERS* DefaultPortAuthStates;
  /* 0x0038 */ struct _NDIS_PCI_DEVICE_CUSTOM_PROPERTIES* PciDeviceCustomProperties;
} NDIS_MINIPORT_INIT_PARAMETERS, *PNDIS_MINIPORT_INIT_PARAMETERS; /* size: 0x0040 */

typedef struct _NDIS_MINIPORT_INTERRUPT
{
  /* 0x0000 */ struct _KINTERRUPT* InterruptObject;
  /* 0x0008 */ unsigned __int64 DpcCountLock;
  /* 0x0010 */ void* Reserved;
  /* 0x0018 */ void* MiniportIsr /* function */;
  /* 0x0020 */ void* MiniportDpc /* function */;
  /* 0x0028 */ struct _KDPC InterruptDpc;
  /* 0x0068 */ struct _NDIS_MINIPORT_BLOCK* Miniport;
  /* 0x0070 */ unsigned char DpcCount;
  /* 0x0071 */ unsigned char Filler1;
  /* 0x0078 */ struct _KEVENT DpcsCompletedEvent;
  /* 0x0090 */ unsigned char SharedInterrupt;
  /* 0x0091 */ unsigned char IsrRequested;
  /* 0x0092 */ char __PADDING__[6];
} NDIS_MINIPORT_INTERRUPT, *PNDIS_MINIPORT_INTERRUPT; /* size: 0x0098 */

typedef struct _NDIS_MINIPORT_OFFLOAD
{
  /* 0x0000 */ unsigned char SupportsOffload;
  /* 0x0001 */ unsigned char SupportsTopOffload;
  /* 0x0002 */ unsigned char SupportsTcpConnectionOffload;
  /* 0x0003 */ unsigned char SupportsTopTcpConnectionOffload;
  /* 0x0004 */ unsigned char TopConnectionOffloadPaused;
  /* 0x0008 */ struct _NDIS_OFFLOAD MiniportCurrentConfig;
  /* 0x0098 */ struct _NDIS_OFFLOAD TopCapabilities;
  /* 0x0128 */ struct _NDIS_OFFLOAD MiniportInitialConfig;
  /* 0x01b8 */ struct _NDIS_OFFLOAD MiniportHardwareCapabilties;
  /* 0x0248 */ struct _NDIS_OFFLOAD_ENCAPSULATION MiniportSetEncapsulation;
  /* 0x0264 */ struct _NDIS_OFFLOAD_ENCAPSULATION TopSetEncapsulation;
  /* 0x0280 */ struct _NDIS_OFFLOAD_ENCAPSULATION TopMergedEncapsulation;
  /* 0x029c */ struct _NDIS_OFFLOAD_ENCAPSULATION MiniportMergedEncapsulation;
  /* 0x02b8 */ struct _NDIS_TCP_CONNECTION_OFFLOAD TopTcpConnectionOffloadCapabilities;
  /* 0x02cc */ struct _NDIS_TCP_CONNECTION_OFFLOAD MiniportTcpConnectionOffloadCurrentConfig;
  /* 0x02e0 */ struct _NDIS_TCP_CONNECTION_OFFLOAD MiniportHwTcpConnectionOffloadCapabilities;
  /* 0x02f4 */ struct _NDIS_TCP_CONNECTION_OFFLOAD_PARAMETERS TopTcpConnectionParameters;
  /* 0x0330 */ struct _NDIS_TCP_CONNECTION_OFFLOAD_PARAMETERS MiniportTcpConnectionParameters;
  /* 0x036c */ unsigned char MiniportTask[144];
  /* 0x03fc */ unsigned long MiniportTaskSize;
  /* 0x0400 */ unsigned char Ndis5Xsum;
  /* 0x0401 */ unsigned char Ndis5LSO;
  /* 0x0402 */ unsigned char Ndis5IPsec;
  /* 0x0408 */ void* MiniportRequestBuffer;
  /* 0x0410 */ unsigned long MiniportRequestOid;
  /* 0x0414 */ unsigned long MiniportRequestBufferLength;
} NDIS_MINIPORT_OFFLOAD, *PNDIS_MINIPORT_OFFLOAD; /* size: 0x0418 */

typedef struct _NDIS_MINIPORT_OFFLOAD_BLOCK_LIST
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0008 */ struct _NDIS_MINIPORT_OFFLOAD_BLOCK_LIST* NextBlock;
  /* 0x0010 */ struct _NDIS_MINIPORT_OFFLOAD_BLOCK_LIST* DependentBlockList;
  /* 0x0018 */ int Status;
  /* 0x0020 */ void* NdisReserved[2];
  /* 0x0030 */ void** MiniportOffloadContext;
  /* 0x0038 */ void* NdisOffloadHandle;
  /* 0x0040 */ void* ProtocolReserved[2];
  /* 0x0050 */ void* MiniportReserved[2];
  /* 0x0060 */ void* ImReserved[2];
  /* 0x0070 */ void* Scratch[2];
  /* 0x0080 */ void* SourceHandle;
  /* 0x0088 */ unsigned long PortNumber;
  /* 0x0090 */ struct _NET_BUFFER_LIST* NetBufferListChain;
} NDIS_MINIPORT_OFFLOAD_BLOCK_LIST, *PNDIS_MINIPORT_OFFLOAD_BLOCK_LIST; /* size: 0x0098 */

typedef struct _NDIS_MINIPORT_OFFLOAD_REG
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long IPv4XSumTxDisabled : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned long IPv4XSumRxDisabled : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned long TCPv4XSumTxDisabled : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned long TCPv4XSumRxDisabled : 1; /* bit position: 3 */
      /* 0x0000 */ unsigned long UDPv4XSumTxDisabled : 1; /* bit position: 4 */
      /* 0x0000 */ unsigned long UDPv4XSumRxDisabled : 1; /* bit position: 5 */
      /* 0x0000 */ unsigned long TCPv6XSumTxDisabled : 1; /* bit position: 6 */
      /* 0x0000 */ unsigned long TCPv6XSumRxDisabled : 1; /* bit position: 7 */
      /* 0x0000 */ unsigned long UDPv6XSumTxDisabled : 1; /* bit position: 8 */
      /* 0x0000 */ unsigned long UDPv6XSumRxDisabled : 1; /* bit position: 9 */
      /* 0x0000 */ unsigned long LsoV1IPv4Disabled : 1; /* bit position: 10 */
      /* 0x0000 */ unsigned long LsoV2IPv4Disabled : 1; /* bit position: 11 */
      /* 0x0000 */ unsigned long LsoV2IPv6Disabled : 1; /* bit position: 12 */
      /* 0x0000 */ unsigned long IPsecAHDisabled : 1; /* bit position: 13 */
      /* 0x0000 */ unsigned long IPsecESPDisabled : 1; /* bit position: 14 */
      /* 0x0000 */ unsigned long TCPv4ConnectionOffloadDisabled : 1; /* bit position: 15 */
      /* 0x0000 */ unsigned long TCPv6ConnectionOffloadDisabled : 1; /* bit position: 16 */
      /* 0x0000 */ unsigned long ReadRegistry : 1; /* bit position: 17 */
      /* 0x0000 */ unsigned long IPsecV2AHDisabled : 1; /* bit position: 18 */
      /* 0x0000 */ unsigned long IPsecV2ESPDisabled : 1; /* bit position: 19 */
      /* 0x0000 */ unsigned long IPsecV2IPv4AHDisabled : 1; /* bit position: 20 */
      /* 0x0000 */ unsigned long IPsecV2IPv4ESPDisabled : 1; /* bit position: 21 */
      /* 0x0000 */ unsigned long IPSecV2IPv6Disabled : 1; /* bit position: 22 */
    }; /* bitfield */
    /* 0x0000 */ unsigned long Value;
  }; /* size: 0x0004 */
} NDIS_MINIPORT_OFFLOAD_REG, *PNDIS_MINIPORT_OFFLOAD_REG; /* size: 0x0004 */

typedef struct _NDIS_MINIPORT_PAUSE_PARAMETERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ unsigned long PauseReason;
} NDIS_MINIPORT_PAUSE_PARAMETERS, *PNDIS_MINIPORT_PAUSE_PARAMETERS; /* size: 0x000c */

typedef struct _NDIS_MINIPORT_RESTART_PARAMETERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0008 */ struct _NDIS_RESTART_ATTRIBUTES* RestartAttributes;
  /* 0x0010 */ unsigned long Flags;
  /* 0x0014 */ long __PADDING__[1];
} NDIS_MINIPORT_RESTART_PARAMETERS, *PNDIS_MINIPORT_RESTART_PARAMETERS; /* size: 0x0018 */

typedef enum _NDIS_MINIPORT_STATE
{
  NdisMiniportUndefindState = 0,
  NdisMiniportHalted = 1,
  NdisMiniportInitializing = 2,
  NdisMiniportRestarting = 3,
  NdisMiniportRunning = 4,
  NdisMiniportPausing = 5,
  NdisMiniportPaused = 6,
} NDIS_MINIPORT_STATE, *PNDIS_MINIPORT_STATE;

typedef struct _NDIS_MINIPORT_STATS
{
  /* 0x0000 */ unsigned __int64 ifHCInOctets;
  /* 0x0008 */ unsigned __int64 ifHCInUcastOctets;
  /* 0x0010 */ unsigned __int64 ifHCInBroadcastOctets;
  /* 0x0018 */ unsigned __int64 ifHCInMulticastOctets;
  /* 0x0020 */ unsigned __int64 ifHCInUcastPkts;
  /* 0x0028 */ unsigned __int64 ifHCInMulticastPkts;
  /* 0x0030 */ unsigned __int64 ifHCInBroadcastPkts;
  /* 0x0038 */ unsigned __int64 ifHCOutOctets;
  /* 0x0040 */ unsigned __int64 ifHCOutUcastPkts;
  /* 0x0048 */ unsigned __int64 ifHCOutMulticastPkts;
  /* 0x0050 */ unsigned __int64 ifHCOutBroadcastPkts;
  /* 0x0058 */ unsigned __int64 ifHCOutUcastOctets;
  /* 0x0060 */ unsigned __int64 ifHCOutMulticastOctets;
  /* 0x0068 */ unsigned __int64 ifHCOutBroadcastOctets;
} NDIS_MINIPORT_STATS, *PNDIS_MINIPORT_STATS; /* size: 0x0070 */

typedef struct _NDIS_MINIPORT_TIMER
{
  /* 0x0000 */ struct _KTIMER Timer;
  /* 0x0040 */ struct _KDPC Dpc;
  /* 0x0080 */ void* MiniportTimerFunction /* function */;
  /* 0x0088 */ void* MiniportTimerContext;
  /* 0x0090 */ struct _NDIS_MINIPORT_BLOCK* Miniport;
  /* 0x0098 */ struct _NDIS_MINIPORT_TIMER* NextTimer;
} NDIS_MINIPORT_TIMER, *PNDIS_MINIPORT_TIMER; /* size: 0x00a0 */

typedef struct _NDIS_MINIPORT_WORK_ITEM
{
  /* 0x0000 */ struct _SINGLE_LIST_ENTRY Link;
  /* 0x0008 */ enum _NDIS_WORK_ITEM_TYPE WorkItemType;
  /* 0x0010 */ void* WorkItemContext;
} NDIS_MINIPORT_WORK_ITEM, *PNDIS_MINIPORT_WORK_ITEM; /* size: 0x0018 */

typedef struct _NDIS_M_DRIVER_BLOCK
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0008 */ struct _NDIS_M_DRIVER_BLOCK* NextDriver;
  /* 0x0010 */ struct _NDIS_MINIPORT_BLOCK* MiniportQueue;
  /* 0x0018 */ unsigned char MajorNdisVersion;
  /* 0x0019 */ unsigned char MinorNdisVersion;
  /* 0x001a */ unsigned short Flags;
  /* 0x0020 */ struct _NDIS_WRAPPER_HANDLE* NdisDriverInfo;
  /* 0x0028 */ struct _DRIVER_OBJECT* DriverObject;
  /* 0x0030 */ struct _UNICODE_STRING ServiceRegPath;
  /* 0x0040 */ void* MiniportDriverContext;
  /* 0x0048 */ struct _NDIS_PROTOCOL_BLOCK* AssociatedProtocol;
  /* 0x0050 */ struct _LIST_ENTRY DeviceList;
  /* 0x0060 */ struct _NDIS_PENDING_IM_INSTANCE* PendingDeviceList;
  /* 0x0068 */ void* UnloadHandler /* function */;
  union
  {
    /* 0x0070 */ struct _NDIS_MINIPORT_DRIVER_CHARACTERISTICS MiniportDriverCharacteristics;
    /* 0x0070 */ struct _NDIS51_MINIPORT_CHARACTERISTICS MiniportCharacteristics;
  }; /* size: 0x00f0 */
  /* 0x0160 */ struct _KEVENT MiniportsRemovedEvent;
  /* 0x0178 */ struct _REFERENCE Ref;
  /* 0x0188 */ struct _KMUTANT IMStartRemoveMutex;
  /* 0x01c0 */ void* IMStartRemoveMutexOwnerThread;
  /* 0x01c8 */ unsigned long DriverVersion;
  /* 0x01d0 */ struct _UNICODE_STRING ServiceName;
  /* 0x01e0 */ void* CoCreateVcHandler /* function */;
  /* 0x01e8 */ void* CoDeleteVcHandler /* function */;
  /* 0x01f0 */ void* CoActivateVcHandler /* function */;
  /* 0x01f8 */ void* CoDeactivateVcHandler /* function */;
  /* 0x0200 */ void* CoSendNetBufferListsHandler /* function */;
  /* 0x0208 */ void* CoRequestHandler /* function */;
  /* 0x0210 */ void* CoOidRequestHandler /* function */;
  /* 0x0218 */ void* InitiateOffloadHandler /* function */;
  /* 0x0220 */ void* TerminateOffloadHandler /* function */;
  /* 0x0228 */ void* UpdateOffloadHandler /* function */;
  /* 0x0230 */ void* InvalidateOffloadHandler /* function */;
  /* 0x0238 */ void* QueryOffloadHandler /* function */;
  /* 0x0240 */ void* TcpOffloadSendHandler /* function */;
  /* 0x0248 */ void* TcpOffloadReceiveHandler /* function */;
  /* 0x0250 */ void* TcpOffloadDisconnectHandler /* function */;
  /* 0x0258 */ void* TcpOffloadForwardHandler /* function */;
  /* 0x0260 */ void* TcpOffloadReceiveReturnHandler /* function */;
  /* 0x0268 */ struct _NDIS_CO_CALL_MANAGER_OPTIONAL_HANDLERS CallMgrChars;
  /* 0x02f8 */ void* AddDeviceHandler /* function */;
  /* 0x0300 */ void* RemoveDeviceHandler /* function */;
  /* 0x0308 */ void* FilterResourceRequirementsHandler /* function */;
  /* 0x0310 */ void* StartDeviceHandler /* function */;
} NDIS_M_DRIVER_BLOCK, *PNDIS_M_DRIVER_BLOCK; /* size: 0x0318 */

typedef struct _NDIS_M_PERIODIC_RECEIVES
{
  /* 0x0000 */ struct _NDIS_MINIPORT_BLOCK* NextMiniportBlock;
  /* 0x0008 */ enum _NDIS_M_PERIODIC_RECEIVE_STATE State;
  /* 0x0010 */ unsigned __int64 SpinLock;
  /* 0x0018 */ void* LockThread;
  /* 0x0020 */ unsigned long LockDbg;
  /* 0x0024 */ long NumMQueuedNbls;
  /* 0x0028 */ long NumNblsDequeued;
  /* 0x0030 */ struct _NET_BUFFER_LIST* QueuedHead;
  /* 0x0038 */ struct _NET_BUFFER_LIST* QueuedTail;
  /* 0x0040 */ unsigned long BoundToIP;
  /* 0x0044 */ unsigned char Paused;
  /* 0x0048 */ long NblsAllocated;
  /* 0x004c */ unsigned long TrackingQueued;
  /* 0x0050 */ unsigned long TrackingDequeued;
  /* 0x0054 */ unsigned long TrackingResources;
  /* 0x0058 */ unsigned long TrackingPending;
  /* 0x005c */ unsigned long TrackingIndicated;
  /* 0x0060 */ unsigned long TrackingEmptied;
  /* 0x0068 */ struct _WORK_QUEUE_ITEM WorkItem;
  /* 0x0088 */ long WorkItemQueued;
  /* 0x008c */ long __PADDING__[1];
} NDIS_M_PERIODIC_RECEIVES, *PNDIS_M_PERIODIC_RECEIVES; /* size: 0x0090 */

typedef enum _NDIS_M_PERIODIC_RECEIVE_STATE
{
  PeriodicReceivesOff = 0,
  PeriodicReceivesOn = 1,
  PeriodicReceivesBlocked = 2,
} NDIS_M_PERIODIC_RECEIVE_STATE, *PNDIS_M_PERIODIC_RECEIVE_STATE;

typedef enum _NDIS_NDIS5_DRIVER_STATE
{
  Ndis5StateUnused = 0,
  Ndis5StatePaused = 1,
  Ndis5StateRunning = 2,
} NDIS_NDIS5_DRIVER_STATE, *PNDIS_NDIS5_DRIVER_STATE;

typedef enum _NDIS_NET_BUFFER_LIST_INFO
{
  TcpIpChecksumNetBufferListInfo = 0,
  TcpOffloadBytesTransferred = 0,
  IPsecOffloadV1NetBufferListInfo = 1,
  IPsecOffloadV2NetBufferListInfo = 1,
  TcpLargeSendNetBufferListInfo = 2,
  TcpReceiveNoPush = 2,
  ClassificationHandleNetBufferListInfo = 3,
  Ieee8021QNetBufferListInfo = 4,
  NetBufferListCancelId = 5,
  MediaSpecificInformation = 6,
  NetBufferListFrameType = 7,
  NetBufferListProtocolId = 7,
  NetBufferListHashValue = 8,
  NetBufferListHashInfo = 9,
  WfpNetBufferListInfo = 10,
  IPsecOffloadV2TunnelNetBufferListInfo = 11,
  IPsecOffloadV2HeaderNetBufferListInfo = 12,
  NetBufferListCorrelationId = 13,
  NetBufferListFilteringInfo = 14,
  MediaSpecificInformationEx = 15,
  NblOriginalInterfaceIfIndex = 16,
  NblReAuthWfpFlowContext = 16,
  TcpReceiveBytesTransferred = 17,
  NblCurrentOwner = 18,
  MaxNetBufferListInfo = 19,
} NDIS_NET_BUFFER_LIST_INFO, *PNDIS_NET_BUFFER_LIST_INFO;

typedef struct _NDIS_NIC_SWITCH_CAPABILITIES
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ unsigned long NdisReserved1;
  /* 0x000c */ unsigned long NumTotalMacAddresses;
  /* 0x0010 */ unsigned long NumMacAddressesPerPort;
  /* 0x0014 */ unsigned long NumVlansPerPort;
  /* 0x0018 */ unsigned long NdisReserved2;
  /* 0x001c */ unsigned long NdisReserved3;
} NDIS_NIC_SWITCH_CAPABILITIES, *PNDIS_NIC_SWITCH_CAPABILITIES; /* size: 0x0020 */

typedef struct _NDIS_NSI_COMPARTMENT_RW
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0008 */ union _NET_LUID_LH LoopbackIfLuid;
  /* 0x0010 */ struct _GUID LoopbackIfNetworkGuid;
  /* 0x0020 */ struct _GUID LoopbackIfInterfaceGuid;
  /* 0x0030 */ struct _IF_COUNTED_STRING_LH LoopbackIfDescr;
  /* 0x0234 */ struct _IF_COUNTED_STRING_LH LoopbackIfAlias;
  /* 0x0438 */ struct _GUID CompartmentGuid;
} NDIS_NSI_COMPARTMENT_RW, *PNDIS_NSI_COMPARTMENT_RW; /* size: 0x0448 */

typedef struct _NDIS_NSI_NETWORK_RW
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned int CompartmentId;
  /* 0x0008 */ unsigned long SiteId;
  /* 0x000c */ struct _IF_COUNTED_STRING_LH NetworkName;
} NDIS_NSI_NETWORK_RW, *PNDIS_NSI_NETWORK_RW; /* size: 0x0210 */

typedef struct _NDIS_OBJECT_HEADER
{
  /* 0x0000 */ unsigned char Type;
  /* 0x0001 */ unsigned char Revision;
  /* 0x0002 */ unsigned short Size;
} NDIS_OBJECT_HEADER, *PNDIS_OBJECT_HEADER; /* size: 0x0004 */

typedef struct _NDIS_OFFLOAD
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ struct _NDIS_TCP_IP_CHECKSUM_OFFLOAD Checksum;
  /* 0x0024 */ struct _NDIS_TCP_LARGE_SEND_OFFLOAD_V1 LsoV1;
  /* 0x0034 */ struct _NDIS_IPSEC_OFFLOAD_V1 IPsecV1;
  /* 0x0050 */ struct _NDIS_TCP_LARGE_SEND_OFFLOAD_V2 LsoV2;
  /* 0x006c */ unsigned long Flags;
  /* 0x0070 */ struct _NDIS_IPSEC_OFFLOAD_V2 IPsecV2;
} NDIS_OFFLOAD, *PNDIS_OFFLOAD; /* size: 0x0090 */

typedef struct _NDIS_OFFLOAD_ENCAPSULATION
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  struct
  {
    /* 0x0004 */ unsigned long Enabled;
    /* 0x0008 */ unsigned long EncapsulationType;
    /* 0x000c */ unsigned long HeaderSize;
  } /* size: 0x000c */ IPv4;
  struct
  {
    /* 0x0010 */ unsigned long Enabled;
    /* 0x0014 */ unsigned long EncapsulationType;
    /* 0x0018 */ unsigned long HeaderSize;
  } /* size: 0x000c */ IPv6;
} NDIS_OFFLOAD_ENCAPSULATION, *PNDIS_OFFLOAD_ENCAPSULATION; /* size: 0x001c */

typedef struct _NDIS_OFFLOAD_HANDLE
{
  /* 0x0000 */ void* NdisReserved[1];
  /* 0x0008 */ void* MiniportOffloadContext;
} NDIS_OFFLOAD_HANDLE, *PNDIS_OFFLOAD_HANDLE; /* size: 0x0010 */

typedef struct _NDIS_OID_REQUEST
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ enum _NDIS_REQUEST_TYPE RequestType;
  /* 0x0008 */ unsigned long PortNumber;
  /* 0x000c */ unsigned int Timeout;
  /* 0x0010 */ void* RequestId;
  /* 0x0018 */ void* RequestHandle;
  /* 0x0020 */ union _REQUEST_DATA DATA;
  /* 0x0048 */ unsigned char NdisReserved[128];
  /* 0x00c8 */ unsigned char MiniportReserved[16];
  /* 0x00d8 */ unsigned char SourceReserved[16];
  /* 0x00e8 */ unsigned char SupportedRevision;
  /* 0x00e9 */ unsigned char Reserved1;
  /* 0x00ea */ unsigned short Reserved2;
  /* 0x00ec */ long __PADDING__[1];
} NDIS_OID_REQUEST, *PNDIS_OID_REQUEST; /* size: 0x00f0 */

typedef struct _NDIS_OPEN_BLOCK
{
  union
  {
    /* 0x0000 */ void* MacHandle;
    /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  }; /* size: 0x0008 */
  /* 0x0008 */ void* BindingHandle;
  /* 0x0010 */ struct _NDIS_MINIPORT_BLOCK* MiniportHandle;
  /* 0x0018 */ struct _NDIS_PROTOCOL_BLOCK* ProtocolHandle;
  /* 0x0020 */ void* ProtocolBindingContext;
  /* 0x0028 */ void* NextSendHandler /* function */;
  /* 0x0030 */ void* NextSendContext;
  /* 0x0038 */ void* MiniportAdapterContext;
  /* 0x0040 */ unsigned char Reserved1;
  /* 0x0041 */ unsigned char CallingFromNdis6Protocol;
  /* 0x0042 */ unsigned char Reserved3;
  /* 0x0043 */ unsigned char Reserved4;
  /* 0x0048 */ void* NextReturnNetBufferListsHandler /* function */;
  /* 0x0050 */ unsigned __int64 Reserved5;
  /* 0x0058 */ void* NextReturnNetBufferListsContext;
  union
  {
    /* 0x0060 */ void* SendHandler /* function */;
    /* 0x0060 */ void* WanSendHandler /* function */;
  }; /* size: 0x0008 */
  /* 0x0068 */ void* TransferDataHandler /* function */;
  /* 0x0070 */ void* SendCompleteHandler /* function */;
  /* 0x0078 */ void* TransferDataCompleteHandler /* function */;
  /* 0x0080 */ void* ReceiveHandler /* function */;
  /* 0x0088 */ void* ReceiveCompleteHandler /* function */;
  /* 0x0090 */ void* WanReceiveHandler /* function */;
  /* 0x0098 */ void* RequestCompleteHandler /* function */;
  /* 0x00a0 */ void* ReceivePacketHandler /* function */;
  /* 0x00a8 */ void* SendPacketsHandler /* function */;
  /* 0x00b0 */ void* ResetHandler /* function */;
  /* 0x00b8 */ void* RequestHandler /* function */;
  /* 0x00c0 */ void* OidRequestHandler /* function */;
  /* 0x00c8 */ void* ResetCompleteHandler /* function */;
  union
  {
    /* 0x00d0 */ void* StatusHandler /* function */;
    /* 0x00d0 */ void* StatusHandlerEx /* function */;
  }; /* size: 0x0008 */
  /* 0x00d8 */ void* StatusCompleteHandler /* function */;
  /* 0x00e0 */ unsigned long Flags;
  /* 0x00e4 */ long References;
  /* 0x00e8 */ unsigned __int64 SpinLock;
  /* 0x00f0 */ void* FilterHandle;
  /* 0x00f8 */ unsigned int FrameTypeArraySize;
  /* 0x00fc */ unsigned short FrameTypeArray[4];
  /* 0x0104 */ unsigned long ProtocolOptions;
  /* 0x0108 */ unsigned long CurrentLookahead;
  /* 0x0110 */ void* WSendHandler /* function */;
  /* 0x0118 */ void* WTransferDataHandler /* function */;
  /* 0x0120 */ void* WSendPacketsHandler /* function */;
  /* 0x0128 */ void* CancelSendPacketsHandler /* function */;
  /* 0x0130 */ unsigned long WakeUpEnable;
  /* 0x0134 */ struct _NDIS_PM_PARAMETERS PMCurrentParameters;
  /* 0x0148 */ struct _KEVENT* CloseCompleteEvent;
  /* 0x0150 */ struct _QUEUED_CLOSE QC;
  /* 0x0178 */ long AfReferences;
  /* 0x0180 */ struct _NDIS_OPEN_BLOCK* NextGlobalOpen;
  /* 0x0188 */ struct _NDIS_OPEN_BLOCK* MiniportNextOpen;
  /* 0x0190 */ struct _NDIS_OPEN_BLOCK* ProtocolNextOpen;
  /* 0x0198 */ struct _UNICODE_STRING* BindDeviceName;
  /* 0x01a0 */ struct _UNICODE_STRING* RootDeviceName;
  /* 0x01a8 */ struct _NDIS_OPEN_BLOCK* FilterNextOpen;
  /* 0x01b0 */ unsigned int PacketFilters;
  /* 0x01b4 */ unsigned int OldPacketFilters;
  union
  {
    struct
    {
      /* 0x01b8 */ unsigned int MaxMulticastAddresses;
      /* 0x01c0 */ struct _ETH_MULTICAST_WRAPPER* MCastAddressBuf;
      /* 0x01c8 */ unsigned int NumAddresses;
      /* 0x01d0 */ struct _ETH_MULTICAST_WRAPPER* OldMCastAddressBuf;
      /* 0x01d8 */ unsigned int OldNumAddresses;
    }; /* size: 0x001c */
    struct
    {
      /* 0x01b8 */ unsigned long FunctionalAddress;
      /* 0x01bc */ unsigned long OldFunctionalAddress;
      /* 0x01c0 */ unsigned char UsingGroupAddress;
      /* 0x01c1 */ unsigned char OldUsingGroupAddress;
      /* 0x01c4 */ unsigned long FARefCount[32];
      /* 0x0244 */ unsigned long OldFARefCount[32];
      /* 0x02d0 */ unsigned char RSSParametersBuf[656];
      /* 0x0560 */ struct _NDIS_RECEIVE_SCALE_PARAMETERS* NdisRSSParameters;
      /* 0x0568 */ struct _SINGLE_LIST_ENTRY PatternList;
      /* 0x0570 */ struct _SINGLE_LIST_ENTRY WOLPatternList;
      /* 0x0578 */ struct _SINGLE_LIST_ENTRY PMProtocolOffloadList;
      /* 0x0580 */ void* ProtSendNetBufferListsComplete /* function */;
      /* 0x0588 */ void* SendCompleteNdisPacketContext;
      /* 0x0590 */ void* SendCompleteNetBufferListsContext;
      /* 0x0598 */ void* ReceiveNetBufferLists /* function */;
      /* 0x05a0 */ void* ReceiveNetBufferListsContext;
      /* 0x05a8 */ void* SavedSendNBLHandler /* function */;
      /* 0x05b0 */ void* SavedSendPacketsHandler /* function */;
      /* 0x05b8 */ void* SavedCancelSendPacketsHandler /* function */;
      union
      {
        /* 0x05c0 */ void* SavedSendHandler /* function */;
        /* 0x05c0 */ void* SavedWanSendHandler /* function */;
      }; /* size: 0x0008 */
      /* 0x05c8 */ void* InitiateOffloadCompleteHandler /* function */;
      /* 0x05d0 */ void* TerminateOffloadCompleteHandler /* function */;
      /* 0x05d8 */ void* UpdateOffloadCompleteHandler /* function */;
      /* 0x05e0 */ void* InvalidateOffloadCompleteHandler /* function */;
      /* 0x05e8 */ void* QueryOffloadCompleteHandler /* function */;
      /* 0x05f0 */ void* IndicateOffloadEventHandler /* function */;
      /* 0x05f8 */ void* TcpOffloadSendCompleteHandler /* function */;
      /* 0x0600 */ void* TcpOffloadReceiveCompleteHandler /* function */;
      /* 0x0608 */ void* TcpOffloadDisconnectCompleteHandler /* function */;
      /* 0x0610 */ void* TcpOffloadForwardCompleteHandler /* function */;
      /* 0x0618 */ void* TcpOffloadEventHandler /* function */;
      /* 0x0620 */ void* TcpOffloadReceiveIndicateHandler /* function */;
      /* 0x0628 */ unsigned long ProtocolMajorVersion;
      /* 0x0630 */ void** IfBlock;
      /* 0x0638 */ struct _NDIS_SPIN_LOCK PnPStateLock;
      /* 0x0648 */ enum _NDIS_NDIS5_DRIVER_STATE PnPState;
      /* 0x064c */ enum _NDIS_OPEN_TRANSLATION_STATE TranslationState;
      /* 0x0650 */ int OutstandingSends;
      /* 0x0658 */ struct _NDIS_EVENT PauseEvent;
      /* 0x0670 */ void* Ndis5WanSendHandler /* function */;
      /* 0x0678 */ void* ProtSendCompleteHandler /* function */;
      /* 0x0680 */ void* OidRequestCompleteHandler /* function */;
      /* 0x0688 */ void* OidRequestCompleteContext;
      /* 0x0690 */ long NumOfPauseRestartRequests;
      /* 0x0694 */ enum _NDIS_OPEN_STATE State;
      /* 0x0698 */ struct _NDIS_OPEN_OFFLOAD* Offload;
      /* 0x06a0 */ struct _NDIS_STATUS_UNBIND_WORKITEM* StatusUnbindWorkItem;
      /* 0x06a8 */ unsigned __int64 DpcStartCycle;
      /* 0x06b0 */ unsigned long NumberOfNetBufferLists;
      /* 0x06b8 */ unsigned char* ReceivedAPacket;
      /* 0x06c0 */ void* DirectOidRequestCompleteHandler /* function */;
      /* 0x06c8 */ void* DirectOidRequestHandler /* function */;
      /* 0x06d0 */ void* DirectOidRequestCompleteContext;
      /* 0x06d8 */ struct _LIST_ENTRY ReceiveQueueList;
      /* 0x06e8 */ unsigned long NumReceiveQueues;
      /* 0x06f0 */ struct _LIST_ENTRY SharedMemoryBlockList;
      /* 0x0700 */ void* AllocateSharedMemoryHandler /* function */;
      /* 0x0708 */ void* FreeSharedMemoryHandler /* function */;
      /* 0x0710 */ void* AllocateSharedMemoryContext;
      /* 0x0720 */ struct _NDIS_CO_AF_BLOCK* NextAf;
      /* 0x0728 */ void* MiniportCoCreateVcHandler /* function */;
      /* 0x0730 */ void* MiniportCoRequestHandler /* function */;
      /* 0x0738 */ void* CoCreateVcHandler /* function */;
      /* 0x0740 */ void* CoDeleteVcHandler /* function */;
      /* 0x0748 */ void* CmActivateVcCompleteHandler /* function */;
      /* 0x0750 */ void* CmDeactivateVcCompleteHandler /* function */;
      /* 0x0758 */ void* CoRequestCompleteHandler /* function */;
      /* 0x0760 */ void* CoRequestHandler /* function */;
      /* 0x0768 */ struct _LIST_ENTRY ActiveVcHead;
      /* 0x0778 */ struct _LIST_ENTRY InactiveVcHead;
      /* 0x0788 */ long PendingAfNotifications;
      /* 0x0790 */ struct _KEVENT* AfNotifyCompleteEvent;
      /* 0x0798 */ void* MiniportCoOidRequestHandler /* function */;
      /* 0x07a0 */ void* CoOidRequestCompleteHandler /* function */;
      /* 0x07a8 */ void* CoOidRequestHandler /* function */;
    }; /* size: 0x05ce */
  }; /* size: 0x05ce */
} NDIS_OPEN_BLOCK, *PNDIS_OPEN_BLOCK; /* size: 0x07b0 */

typedef struct _NDIS_OPEN_OFFLOAD
{
  /* 0x0000 */ struct _NDIS_OFFLOAD_ENCAPSULATION SetEncapsulation;
  /* 0x001c */ unsigned char AlreadySetEncapsulation;
  /* 0x0020 */ struct _NDIS_OFFLOAD_ENCAPSULATION XlateEncap;
  struct
  {
    /* 0x0040 */ unsigned long Oid;
    /* 0x0048 */ void* Buffer;
    /* 0x0050 */ unsigned long BufferLength;
    /* 0x0054 */ long __PADDING__[1];
  } /* size: 0x0018 */ Encapsulation;
  struct
  {
    /* 0x0058 */ unsigned long Oid;
    /* 0x0060 */ void* Buffer;
    /* 0x0068 */ unsigned long BufferLength;
    /* 0x006c */ long __PADDING__[1];
  } /* size: 0x0018 */ Task;
} NDIS_OPEN_OFFLOAD, *PNDIS_OPEN_OFFLOAD; /* size: 0x0070 */

typedef enum _NDIS_OPEN_STATE
{
  NdisOpenStateRunning = 0,
  NdisOpenStatePausing = 1,
  NdisOpenStatePaused = 2,
  NdisOpenStateRestarting = 3,
} NDIS_OPEN_STATE, *PNDIS_OPEN_STATE;

typedef enum _NDIS_OPEN_TRANSLATION_STATE
{
  OpenDontXlate = 0,
  OpenXlateExceptSends = 1,
  OpenXlateAll = 2,
} NDIS_OPEN_TRANSLATION_STATE, *PNDIS_OPEN_TRANSLATION_STATE;

typedef struct _NDIS_PACKET
{
  /* 0x0000 */ struct _NDIS_PACKET_PRIVATE Private;
  union
  {
    struct
    {
      /* 0x0030 */ unsigned char MiniportReserved[16];
      /* 0x0040 */ unsigned char WrapperReserved[16];
    }; /* size: 0x0020 */
    struct
    {
      /* 0x0030 */ unsigned char MiniportReservedEx[24];
      /* 0x0048 */ unsigned char WrapperReservedEx[8];
    }; /* size: 0x0020 */
    /* 0x0030 */ unsigned char MacReserved[32];
  }; /* size: 0x0020 */
  /* 0x0050 */ unsigned __int64 Reserved[2];
  /* 0x0060 */ unsigned char ProtocolReserved[1];
  /* 0x0061 */ char __PADDING__[7];
} NDIS_PACKET, *PNDIS_PACKET; /* size: 0x0068 */

typedef struct _NDIS_PACKET_PRIVATE
{
  /* 0x0000 */ unsigned int PhysicalCount;
  /* 0x0004 */ unsigned int TotalLength;
  /* 0x0008 */ struct _MDL* Head;
  /* 0x0010 */ struct _MDL* Tail;
  /* 0x0018 */ void* Pool;
  /* 0x0020 */ unsigned int Count;
  /* 0x0024 */ unsigned long Flags;
  /* 0x0028 */ unsigned char ValidCounts;
  /* 0x0029 */ unsigned char NdisPacketFlags;
  /* 0x002a */ unsigned short NdisPacketOobOffset;
  /* 0x002c */ long __PADDING__[1];
} NDIS_PACKET_PRIVATE, *PNDIS_PACKET_PRIVATE; /* size: 0x0030 */

typedef struct _NDIS_PACKET_STACK
{
  /* 0x0000 */ unsigned __int64 IMReserved[2];
  /* 0x0010 */ unsigned __int64 NdisReserved[4];
} NDIS_PACKET_STACK, *PNDIS_PACKET_STACK; /* size: 0x0030 */

typedef struct _NDIS_PACKET_WRAPPER
{
  union
  {
    /* 0x0000 */ unsigned __int64 Padding;
    /* 0x0000 */ unsigned long PvtFlags;
  }; /* size: 0x0008 */
  /* 0x0008 */ struct _STACK_INDEX StackIndex;
  /* 0x0010 */ struct _NDIS_PACKET Packet;
} NDIS_PACKET_WRAPPER, *PNDIS_PACKET_WRAPPER; /* size: 0x0078 */

typedef struct _NDIS_PCI_DEVICE_CUSTOM_PROPERTIES
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned int DeviceType;
  /* 0x0008 */ unsigned int CurrentSpeedAndMode;
  /* 0x000c */ unsigned int CurrentPayloadSize;
  /* 0x0010 */ unsigned int MaxPayloadSize;
  /* 0x0014 */ unsigned int MaxReadRequestSize;
  /* 0x0018 */ unsigned int CurrentLinkSpeed;
  /* 0x001c */ unsigned int CurrentLinkWidth;
  /* 0x0020 */ unsigned int MaxLinkSpeed;
  /* 0x0024 */ unsigned int MaxLinkWidth;
  /* 0x0028 */ unsigned int PciExpressVersion;
  /* 0x002c */ unsigned int InterruptType;
  /* 0x0030 */ unsigned int MaxInterruptMessages;
} NDIS_PCI_DEVICE_CUSTOM_PROPERTIES, *PNDIS_PCI_DEVICE_CUSTOM_PROPERTIES; /* size: 0x0034 */

typedef struct _NDIS_PENDING_IM_INSTANCE
{
  /* 0x0000 */ struct _NDIS_PENDING_IM_INSTANCE* Next;
  /* 0x0008 */ void* Context;
  /* 0x0010 */ struct _UNICODE_STRING Name;
} NDIS_PENDING_IM_INSTANCE, *PNDIS_PENDING_IM_INSTANCE; /* size: 0x0020 */

typedef enum _NDIS_PER_PACKET_INFO
{
  TcpIpChecksumPacketInfo = 0,
  IpSecPacketInfo = 1,
  TcpLargeSendPacketInfo = 2,
  ClassificationHandlePacketInfo = 3,
  NdisReserved = 4,
  ScatterGatherListPacketInfo = 5,
  Ieee8021QInfo = 6,
  OriginalPacketInfo = 7,
  PacketCancelId = 8,
  OriginalNetBufferList = 9,
  CachedNetBufferList = 10,
  ShortPacketPaddingInfo = 11,
  MaxPerPacketInfo = 12,
} NDIS_PER_PACKET_INFO, *PNDIS_PER_PACKET_INFO;

typedef struct _NDIS_PER_PROC_COUNTERS
{
  /* 0x0000 */ struct _NDIS_PER_PROC_PERFORMANCE_COUNTERS PerProcPerfCounters;
  /* 0x0118 */ unsigned __int64 DpcTotalCyclesStart;
  /* 0x0120 */ unsigned __int64 IsrCyclesStart;
  /* 0x0128 */ unsigned __int64 NdisReceiveIndicationCyclesStart;
  /* 0x0130 */ unsigned __int64 StackReceiveIndicationCyclesStart;
  /* 0x0138 */ unsigned __int64 NdisReturnNblCyclesStart;
  /* 0x0140 */ unsigned __int64 MiniportReturnNblCyclesStart;
  /* 0x0148 */ unsigned __int64 NdisSendCyclesStart;
  /* 0x0150 */ unsigned __int64 MiniportSendCyclesStart;
  /* 0x0158 */ unsigned __int64 NdisSendCompleteCyclesStart;
  /* 0x0160 */ unsigned __int64 StackSendCompleteCyclesStart;
  /* 0x0168 */ unsigned __int64 HalBuildSGListCyclesStart;
  /* 0x0170 */ long __PADDING__[4];
} NDIS_PER_PROC_COUNTERS, *PNDIS_PER_PROC_COUNTERS; /* size: 0x0180 */

typedef struct _NDIS_PER_PROC_PERFORMANCE_COUNTERS
{
  /* 0x0000 */ unsigned __int64 DpcCount;
  /* 0x0008 */ unsigned __int64 IsrCount;
  /* 0x0010 */ unsigned __int64 ReceiveIndicationCalls;
  /* 0x0018 */ unsigned __int64 ReturnNblsCalls;
  /* 0x0020 */ unsigned __int64 ReceivedNbls;
  /* 0x0028 */ unsigned __int64 ReturnedNbls;
  /* 0x0030 */ unsigned __int64 SendCalls;
  /* 0x0038 */ unsigned __int64 SendCompleteCalls;
  /* 0x0040 */ unsigned __int64 SentNbs;
  /* 0x0048 */ unsigned __int64 SendCompleteNbs;
  /* 0x0050 */ unsigned __int64 HalBuildSGListCalls;
  /* 0x0058 */ unsigned __int64 IndirectionTableChangeCalls;
  /* 0x0060 */ unsigned __int64 NdisQueueDpcCallsNotCurrentCpu;
  /* 0x0068 */ unsigned __int64 DpcTotalCycles;
  /* 0x0070 */ unsigned __int64 IsrCycles;
  /* 0x0078 */ unsigned __int64 NdisReceiveIndicationCycles;
  /* 0x0080 */ unsigned __int64 StackReceiveIndicationCycles;
  /* 0x0088 */ unsigned __int64 NdisReturnNblCycles;
  /* 0x0090 */ unsigned __int64 MiniportReturnNblCycles;
  /* 0x0098 */ unsigned __int64 NdisSendCycles;
  /* 0x00a0 */ unsigned __int64 MiniportSendCycles;
  /* 0x00a8 */ unsigned __int64 NdisSendCompleteCycles;
  /* 0x00b0 */ unsigned __int64 StackSendCompleteCycles;
  /* 0x00b8 */ unsigned __int64 HalBuildSGListCycles;
  /* 0x00c0 */ unsigned __int64 IndirectionTableChangeCycles;
  /* 0x00c8 */ unsigned __int64 SendCallsAtPassive;
  /* 0x00d0 */ unsigned __int64 SentNbsAtPassive;
  /* 0x00d8 */ unsigned __int64 ReturnNblsCallsAtPassive;
  /* 0x00e0 */ unsigned __int64 ReturnedNblsAtPassive;
  /* 0x00e8 */ unsigned __int64 LowResourceReceiveIndicationCalls;
  /* 0x00f0 */ unsigned __int64 LowResourceReceivedNbls;
  /* 0x00f8 */ unsigned __int64 TcpOffloadReceiveIndicationCalls;
  /* 0x0100 */ unsigned __int64 TcpOffloadSendCalls;
  /* 0x0108 */ unsigned __int64 TcpOffloadReceiveData;
  /* 0x0110 */ unsigned __int64 TcpOffloadSendData;
} NDIS_PER_PROC_PERFORMANCE_COUNTERS, *PNDIS_PER_PROC_PERFORMANCE_COUNTERS; /* size: 0x0118 */

typedef enum _NDIS_PHYSICAL_MEDIUM
{
  NdisPhysicalMediumUnspecified = 0,
  NdisPhysicalMediumWirelessLan = 1,
  NdisPhysicalMediumCableModem = 2,
  NdisPhysicalMediumPhoneLine = 3,
  NdisPhysicalMediumPowerLine = 4,
  NdisPhysicalMediumDSL = 5,
  NdisPhysicalMediumFibreChannel = 6,
  NdisPhysicalMedium1394 = 7,
  NdisPhysicalMediumWirelessWan = 8,
  NdisPhysicalMediumNative802_11 = 9,
  NdisPhysicalMediumBluetooth = 10,
  NdisPhysicalMediumInfiniband = 11,
  NdisPhysicalMediumWiMax = 12,
  NdisPhysicalMediumUWB = 13,
  NdisPhysicalMedium802_3 = 14,
  NdisPhysicalMedium802_5 = 15,
  NdisPhysicalMediumIrda = 16,
  NdisPhysicalMediumWiredWAN = 17,
  NdisPhysicalMediumWiredCoWan = 18,
  NdisPhysicalMediumOther = 19,
  NdisPhysicalMediumMax = 20,
} NDIS_PHYSICAL_MEDIUM, *PNDIS_PHYSICAL_MEDIUM;

typedef struct _NDIS_PKT_POOL
{
  /* 0x0000 */ unsigned long Tag;
  /* 0x0004 */ unsigned short PacketLength;
  /* 0x0006 */ unsigned short PktsPerBlock;
  /* 0x0008 */ unsigned short MaxBlocks;
  /* 0x000a */ unsigned short StackSize;
  /* 0x000c */ long BlocksAllocated;
  /* 0x0010 */ unsigned long ProtocolId;
  /* 0x0014 */ unsigned long BlockSize;
  /* 0x0018 */ void* Allocator;
  /* 0x0020 */ unsigned __int64 Lock;
  /* 0x0028 */ struct _LIST_ENTRY FreeBlocks;
  /* 0x0038 */ struct _LIST_ENTRY UsedBlocks;
  /* 0x0048 */ struct _LIST_ENTRY AgingBlocks;
  /* 0x0058 */ struct _LIST_ENTRY GlobalPacketPoolList;
  /* 0x0068 */ union _LARGE_INTEGER NextScavengeTick;
} NDIS_PKT_POOL, *PNDIS_PKT_POOL; /* size: 0x0070 */

typedef struct _NDIS_PKT_POOL_HDR
{
  /* 0x0000 */ struct _LIST_ENTRY List;
  /* 0x0010 */ union _LARGE_INTEGER TimeStamp;
  /* 0x0020 */ union _SLIST_HEADER FreeList;
  /* 0x0030 */ enum _POOL_BLOCK_TYPE State;
  /* 0x0034 */ long __PADDING__[3];
} NDIS_PKT_POOL_HDR, *PNDIS_PKT_POOL_HDR; /* size: 0x0040 */

typedef struct _NDIS_PM_ADMIN_GONFIG
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long WakeOnPattern : 2; /* bit position: 0 */
      /* 0x0000 */ unsigned long WakeOnMagicPacket : 2; /* bit position: 2 */
      /* 0x0000 */ unsigned long DeviceSleepOnDisconnect : 2; /* bit position: 4 */
      /* 0x0000 */ unsigned long PMARPOffload : 2; /* bit position: 6 */
      /* 0x0000 */ unsigned long PMNSOffload : 2; /* bit position: 8 */
      /* 0x0000 */ unsigned long PMWiFiRekeyOffload : 2; /* bit position: 10 */
    }; /* bitfield */
    /* 0x0000 */ unsigned long Value;
  }; /* size: 0x0004 */
} NDIS_PM_ADMIN_GONFIG, *PNDIS_PM_ADMIN_GONFIG; /* size: 0x0004 */

typedef struct _NDIS_PM_CAPABILITIES
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ unsigned long SupportedWoLPacketPatterns;
  /* 0x000c */ unsigned long NumTotalWoLPatterns;
  /* 0x0010 */ unsigned long MaxWoLPatternSize;
  /* 0x0014 */ unsigned long MaxWoLPatternOffset;
  /* 0x0018 */ unsigned long MaxWoLPacketSaveBuffer;
  /* 0x001c */ unsigned long SupportedProtocolOffloads;
  /* 0x0020 */ unsigned long NumArpOffloadIPv4Addresses;
  /* 0x0024 */ unsigned long NumNSOffloadIPv6Addresses;
  /* 0x0028 */ enum _NDIS_DEVICE_POWER_STATE MinMagicPacketWakeUp;
  /* 0x002c */ enum _NDIS_DEVICE_POWER_STATE MinPatternWakeUp;
  /* 0x0030 */ enum _NDIS_DEVICE_POWER_STATE MinLinkChangeWakeUp;
} NDIS_PM_CAPABILITIES, *PNDIS_PM_CAPABILITIES; /* size: 0x0034 */

typedef struct _NDIS_PM_PARAMETERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long EnabledWoLPacketPatterns;
  /* 0x0008 */ unsigned long EnabledProtocolOffloads;
  /* 0x000c */ unsigned long WakeUpFlags;
} NDIS_PM_PARAMETERS, *PNDIS_PM_PARAMETERS; /* size: 0x0010 */

typedef struct _NDIS_PM_WAKE_UP_CAPABILITIES
{
  /* 0x0000 */ enum _NDIS_DEVICE_POWER_STATE MinMagicPacketWakeUp;
  /* 0x0004 */ enum _NDIS_DEVICE_POWER_STATE MinPatternWakeUp;
  /* 0x0008 */ enum _NDIS_DEVICE_POWER_STATE MinLinkChangeWakeUp;
} NDIS_PM_WAKE_UP_CAPABILITIES, *PNDIS_PM_WAKE_UP_CAPABILITIES; /* size: 0x000c */

typedef struct _NDIS_PNP_CAPABILITIES
{
  /* 0x0000 */ unsigned long Flags;
  /* 0x0004 */ struct _NDIS_PM_WAKE_UP_CAPABILITIES WakeUpCapabilities;
} NDIS_PNP_CAPABILITIES, *PNDIS_PNP_CAPABILITIES; /* size: 0x0010 */

typedef enum _NDIS_PNP_DEVICE_STATE
{
  NdisPnPDeviceAdded = 0,
  NdisPnPDeviceStarted = 1,
  NdisPnPDeviceQueryStopped = 2,
  NdisPnPDeviceStopped = 3,
  NdisPnPDeviceQueryRemoved = 4,
  NdisPnPDeviceRemoved = 5,
  NdisPnPDeviceSurpriseRemoved = 6,
} NDIS_PNP_DEVICE_STATE, *PNDIS_PNP_DEVICE_STATE;

typedef struct _NDIS_PORT
{
  /* 0x0000 */ struct _NDIS_PORT* Next;
  /* 0x0008 */ void* NdisReserved;
  /* 0x0010 */ void* MiniportReserved;
  /* 0x0018 */ void* ProtocolReserved;
  /* 0x0020 */ struct _NDIS_PORT_CHARACTERISTICS PortCharacteristics;
} NDIS_PORT, *PNDIS_PORT; /* size: 0x0060 */

typedef struct _NDIS_PORT_AUTHENTICATION_PARAMETERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ enum _NDIS_PORT_CONTROL_STATE SendControlState;
  /* 0x0008 */ enum _NDIS_PORT_CONTROL_STATE RcvControlState;
  /* 0x000c */ enum _NDIS_PORT_AUTHORIZATION_STATE SendAuthorizationState;
  /* 0x0010 */ enum _NDIS_PORT_AUTHORIZATION_STATE RcvAuthorizationState;
} NDIS_PORT_AUTHENTICATION_PARAMETERS, *PNDIS_PORT_AUTHENTICATION_PARAMETERS; /* size: 0x0014 */

typedef enum _NDIS_PORT_AUTHORIZATION_STATE
{
  NdisPortAuthorizationUnknown = 0,
  NdisPortAuthorized = 1,
  NdisPortUnauthorized = 2,
  NdisPortReauthorizing = 3,
} NDIS_PORT_AUTHORIZATION_STATE, *PNDIS_PORT_AUTHORIZATION_STATE;

typedef struct _NDIS_PORT_CHARACTERISTICS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long PortNumber;
  /* 0x0008 */ unsigned long Flags;
  /* 0x000c */ enum _NDIS_PORT_TYPE Type;
  /* 0x0010 */ enum _NET_IF_MEDIA_CONNECT_STATE MediaConnectState;
  /* 0x0018 */ unsigned __int64 XmitLinkSpeed;
  /* 0x0020 */ unsigned __int64 RcvLinkSpeed;
  /* 0x0028 */ enum _NET_IF_DIRECTION_TYPE Direction;
  /* 0x002c */ enum _NDIS_PORT_CONTROL_STATE SendControlState;
  /* 0x0030 */ enum _NDIS_PORT_CONTROL_STATE RcvControlState;
  /* 0x0034 */ enum _NDIS_PORT_AUTHORIZATION_STATE SendAuthorizationState;
  /* 0x0038 */ enum _NDIS_PORT_AUTHORIZATION_STATE RcvAuthorizationState;
  /* 0x003c */ long __PADDING__[1];
} NDIS_PORT_CHARACTERISTICS, *PNDIS_PORT_CHARACTERISTICS; /* size: 0x0040 */

typedef enum _NDIS_PORT_CONTROL_STATE
{
  NdisPortControlStateUnknown = 0,
  NdisPortControlStateControlled = 1,
  NdisPortControlStateUncontrolled = 2,
} NDIS_PORT_CONTROL_STATE, *PNDIS_PORT_CONTROL_STATE;

typedef enum _NDIS_PORT_TYPE
{
  NdisPortTypeUndefined = 0,
  NdisPortTypeBridge = 1,
  NdisPortTypeRasConnection = 2,
  NdisPortType8021xSupplicant = 3,
  NdisPortTypeMax = 4,
} NDIS_PORT_TYPE, *PNDIS_PORT_TYPE;

typedef enum _NDIS_PROCESSOR_VENDOR
{
  NdisProcessorVendorUnknown = 0,
  NdisProcessorVendorGenuinIntel = 1,
  NdisProcessorVendorGenuineIntel = 1,
  NdisProcessorVendorAuthenticAMD = 2,
} NDIS_PROCESSOR_VENDOR, *PNDIS_PROCESSOR_VENDOR;

typedef struct _NDIS_PROTOCOL_BLOCK
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0008 */ void* ProtocolDriverContext;
  /* 0x0010 */ struct _NDIS_PROTOCOL_BLOCK* NextProtocol;
  /* 0x0018 */ struct _NDIS_OPEN_BLOCK* OpenQueue;
  /* 0x0020 */ struct _REFERENCE Ref;
  /* 0x0030 */ unsigned char MajorNdisVersion;
  /* 0x0031 */ unsigned char MinorNdisVersion;
  /* 0x0032 */ unsigned char MajorDriverVersion;
  /* 0x0033 */ unsigned char MinorDriverVersion;
  /* 0x0034 */ unsigned int Reserved;
  /* 0x0038 */ unsigned int Flags;
  /* 0x0040 */ struct _UNICODE_STRING Name;
  /* 0x0050 */ unsigned char IsIPv4;
  /* 0x0051 */ unsigned char IsIPv6;
  /* 0x0052 */ unsigned char IsNdisTest6;
  /* 0x0058 */ void* BindAdapterHandlerEx /* function */;
  /* 0x0060 */ void* UnbindAdapterHandlerEx /* function */;
  /* 0x0068 */ void* OpenAdapterCompleteHandlerEx /* function */;
  /* 0x0070 */ void* CloseAdapterCompleteHandlerEx /* function */;
  union
  {
    /* 0x0078 */ void* PnPEventHandler /* function */;
    /* 0x0078 */ void* NetPnPEventHandler /* function */;
  }; /* size: 0x0008 */
  /* 0x0080 */ void* UnloadHandler /* function */;
  /* 0x0088 */ void* UninstallHandler /* function */;
  /* 0x0090 */ void* RequestCompleteHandler /* function */;
  union
  {
    /* 0x0098 */ void* StatusHandlerEx /* function */;
    /* 0x0098 */ void* StatusHandler /* function */;
  }; /* size: 0x0008 */
  /* 0x00a0 */ void* StatusCompleteHandler /* function */;
  /* 0x00a8 */ void* ReceiveNetBufferListsHandler /* function */;
  /* 0x00b0 */ void* SendNetBufferListsCompleteHandler /* function */;
  union
  {
    /* 0x00b8 */ void* CoStatusHandlerEx /* function */;
    /* 0x00b8 */ void* CoStatusHandler /* function */;
  }; /* size: 0x0008 */
  /* 0x00c0 */ void* CoAfRegisterNotifyHandler /* function */;
  /* 0x00c8 */ void* CoReceiveNetBufferListsHandler /* function */;
  /* 0x00d0 */ void* CoSendNetBufferListsCompleteHandler /* function */;
  /* 0x00d8 */ void* OpenAdapterCompleteHandler /* function */;
  /* 0x00e0 */ void* CloseAdapterCompleteHandler /* function */;
  union
  {
    /* 0x00e8 */ void* SendCompleteHandler /* function */;
    /* 0x00e8 */ void* WanSendCompleteHandler /* function */;
  }; /* size: 0x0008 */
  union
  {
    /* 0x00f0 */ void* TransferDataCompleteHandler /* function */;
    /* 0x00f0 */ void* WanTransferDataCompleteHandler /* function */;
  }; /* size: 0x0008 */
  /* 0x00f8 */ void* ResetCompleteHandler /* function */;
  union
  {
    /* 0x0100 */ void* ReceiveHandler /* function */;
    /* 0x0100 */ void* WanReceiveHandler /* function */;
  }; /* size: 0x0008 */
  /* 0x0108 */ void* ReceiveCompleteHandler /* function */;
  /* 0x0110 */ void* ReceivePacketHandler /* function */;
  /* 0x0118 */ void* BindAdapterHandler /* function */;
  /* 0x0120 */ void* UnbindAdapterHandler /* function */;
  /* 0x0128 */ void* CoSendCompleteHandler /* function */;
  /* 0x0130 */ void* CoReceivePacketHandler /* function */;
  /* 0x0138 */ void* OidRequestCompleteHandler /* function */;
  /* 0x0140 */ struct _WORK_QUEUE_ITEM WorkItem;
  /* 0x0160 */ struct _KMUTANT Mutex;
  /* 0x0198 */ void* MutexOwnerThread;
  /* 0x01a0 */ unsigned long MutexOwnerCount;
  /* 0x01a4 */ unsigned long MutexOwner;
  /* 0x01a8 */ struct _UNICODE_STRING* BindDeviceName;
  /* 0x01b0 */ struct _UNICODE_STRING* RootDeviceName;
  /* 0x01b8 */ struct _NDIS_M_DRIVER_BLOCK* AssociatedMiniDriver;
  /* 0x01c0 */ struct _NDIS_MINIPORT_BLOCK* BindingAdapter;
  /* 0x01c8 */ struct _KEVENT* DeregEvent;
  union
  {
    /* 0x01d0 */ struct _NDIS_CO_CLIENT_OPTIONAL_HANDLERS ClientChars;
    /* 0x01d0 */ struct _NDIS_CO_CALL_MANAGER_OPTIONAL_HANDLERS CallMgrChars;
  }; /* size: 0x00a0 */
  /* 0x0270 */ void* InitiateOffloadCompleteHandler /* function */;
  /* 0x0278 */ void* TerminateOffloadCompleteHandler /* function */;
  /* 0x0280 */ void* UpdateOffloadCompleteHandler /* function */;
  /* 0x0288 */ void* InvalidateOffloadCompleteHandler /* function */;
  /* 0x0290 */ void* QueryOffloadCompleteHandler /* function */;
  /* 0x0298 */ void* IndicateOffloadEventHandler /* function */;
  /* 0x02a0 */ void* TcpOffloadSendCompleteHandler /* function */;
  /* 0x02a8 */ void* TcpOffloadReceiveCompleteHandler /* function */;
  /* 0x02b0 */ void* TcpOffloadDisconnectCompleteHandler /* function */;
  /* 0x02b8 */ void* TcpOffloadForwardCompleteHandler /* function */;
  /* 0x02c0 */ void* TcpOffloadEventHandler /* function */;
  /* 0x02c8 */ void* TcpOffloadReceiveIndicateHandler /* function */;
  /* 0x02d0 */ void* DirectOidRequestCompleteHandler /* function */;
  /* 0x02d8 */ void* AllocateSharedMemoryHandler /* function */;
  /* 0x02e0 */ void* FreeSharedMemoryHandler /* function */;
  /* 0x02e8 */ void* AllocateSharedMemoryContext;
} NDIS_PROTOCOL_BLOCK, *PNDIS_PROTOCOL_BLOCK; /* size: 0x02f0 */

typedef struct _NDIS_PROTOCOL_OFFLOAD_BLOCK_LIST
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0008 */ struct _NDIS_PROTOCOL_OFFLOAD_BLOCK_LIST* NextBlock;
  /* 0x0010 */ struct _NDIS_PROTOCOL_OFFLOAD_BLOCK_LIST* DependentBlockList;
  /* 0x0018 */ int Status;
  /* 0x0020 */ void* NdisReserved[3];
  /* 0x0038 */ struct _NDIS_OFFLOAD_HANDLE* OffloadHandle;
  /* 0x0040 */ void* ProtocolReserved[2];
  /* 0x0050 */ void* MiniportReserved[2];
  /* 0x0060 */ void* ImReserved[2];
  /* 0x0070 */ void* Scratch[2];
  /* 0x0080 */ void* SourceHandle;
  /* 0x0088 */ unsigned long PortNumber;
  /* 0x0090 */ struct _NET_BUFFER_LIST* NetBufferListChain;
} NDIS_PROTOCOL_OFFLOAD_BLOCK_LIST, *PNDIS_PROTOCOL_OFFLOAD_BLOCK_LIST; /* size: 0x0098 */

typedef struct _NDIS_RECEIVE_FILTER_BLOCK
{
  /* 0x0000 */ struct _LIST_ENTRY AdapterLink;
  /* 0x0010 */ struct _LIST_ENTRY QueueLink;
  /* 0x0020 */ unsigned long FilterId;
  /* 0x0028 */ struct _NDIS_MINIPORT_BLOCK* Miniport;
  /* 0x0030 */ struct _NDIS_OPEN_BLOCK* Open;
  /* 0x0038 */ struct _NDIS_RECEIVE_QUEUE_BLOCK* ReceiveQueue;
  /* 0x0040 */ enum _NDIS_RECEIVE_FILTER_STATE FilterState;
  /* 0x0044 */ long Reference;
  /* 0x0048 */ struct _NDIS_CONNECTION_INFO ConnectionInfo;
  /* 0x0078 */ struct _NDIS_RECEIVE_FILTER_PARAMETERS FilterParameters;
  /* 0x009c */ long __PADDING__[1];
} NDIS_RECEIVE_FILTER_BLOCK, *PNDIS_RECEIVE_FILTER_BLOCK; /* size: 0x00a0 */

typedef struct _NDIS_RECEIVE_FILTER_CAPABILITIES
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ unsigned long EnabledFilterTypes;
  /* 0x000c */ unsigned long EnabledQueueTypes;
  /* 0x0010 */ unsigned long NumQueues;
  /* 0x0014 */ unsigned long SupportedQueueProperties;
  /* 0x0018 */ unsigned long SupportedFilterTests;
  /* 0x001c */ unsigned long SupportedHeaders;
  /* 0x0020 */ unsigned long SupportedMacHeaderFields;
  /* 0x0024 */ unsigned long MaxMacHeaderFilters;
  /* 0x0028 */ unsigned long MaxQueueGroups;
  /* 0x002c */ unsigned long MaxQueuesPerQueueGroup;
  /* 0x0030 */ unsigned long MinLookaheadSplitSize;
  /* 0x0034 */ unsigned long MaxLookaheadSplitSize;
} NDIS_RECEIVE_FILTER_CAPABILITIES, *PNDIS_RECEIVE_FILTER_CAPABILITIES; /* size: 0x0038 */

typedef struct _NDIS_RECEIVE_FILTER_FIELD_PARAMETERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ enum _NDIS_FRAME_HEADER FrameHeader;
  /* 0x000c */ enum _NDIS_RECEIVE_FILTER_TEST ReceiveFilterTest;
  /* 0x0010 */ union _HEADER_FIELD HeaderField;
  /* 0x0018 */ union _FIELD_VALUE FieldValue;
  /* 0x0028 */ union _RESULT_VALUE ResultValue;
} NDIS_RECEIVE_FILTER_FIELD_PARAMETERS, *PNDIS_RECEIVE_FILTER_FIELD_PARAMETERS; /* size: 0x0038 */

typedef struct _NDIS_RECEIVE_FILTER_PARAMETERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ enum _NDIS_RECEIVE_FILTER_TYPE FilterType;
  /* 0x000c */ unsigned long QueueId;
  /* 0x0010 */ unsigned long FilterId;
  /* 0x0014 */ unsigned long FieldParametersArrayOffset;
  /* 0x0018 */ unsigned long FieldParametersArrayNumElements;
  /* 0x001c */ unsigned long FieldParametersArrayElementSize;
  /* 0x0020 */ unsigned long RequestedFilterIdBitCount;
} NDIS_RECEIVE_FILTER_PARAMETERS, *PNDIS_RECEIVE_FILTER_PARAMETERS; /* size: 0x0024 */

typedef enum _NDIS_RECEIVE_FILTER_STATE
{
  NdisReceiveFilterStateUndefined = 0,
  NdisReceiveFilterStateAddedToList = 1,
  NdisReceiveFilterStateSet = 2,
  NdisReceiveFilterStateCleared = 3,
  NdisReceiveFilterStateMaximum = 4,
} NDIS_RECEIVE_FILTER_STATE, *PNDIS_RECEIVE_FILTER_STATE;

typedef enum _NDIS_RECEIVE_FILTER_TEST
{
  NdisReceiveFilterTestUndefined = 0,
  NdisReceiveFilterTestEqual = 1,
  NdisReceiveFilterTestMaskEqual = 2,
  NdisReceiveFilterTestMaximum = 3,
} NDIS_RECEIVE_FILTER_TEST, *PNDIS_RECEIVE_FILTER_TEST;

typedef enum _NDIS_RECEIVE_FILTER_TYPE
{
  NdisReceiveFilterTypeUndefined = 0,
  NdisReceiveFilterTypeVMQueue = 1,
  NdisReceiveFilterTypeMaximum = 2,
} NDIS_RECEIVE_FILTER_TYPE, *PNDIS_RECEIVE_FILTER_TYPE;

typedef struct _NDIS_RECEIVE_QUEUE_BLOCK
{
  /* 0x0000 */ struct _LIST_ENTRY AdapterLink;
  /* 0x0010 */ struct _LIST_ENTRY OpenLink;
  /* 0x0020 */ struct _LIST_ENTRY FilterList;
  /* 0x0030 */ unsigned long QueueId;
  /* 0x0034 */ enum _NDIS_RECEIVE_QUEUE_PNP_STATE QueuePnPState;
  /* 0x0038 */ enum _NDIS_RECEIVE_QUEUE_OPERATIONAL_STATE QueueState;
  /* 0x0040 */ struct _NDIS_MINIPORT_BLOCK* Miniport;
  /* 0x0048 */ struct _NDIS_OPEN_BLOCK* Open;
  /* 0x0050 */ long Reference;
  /* 0x0054 */ unsigned long NumFilters;
  /* 0x0058 */ struct _LIST_ENTRY SharedMemoryList;
  /* 0x0068 */ void* AllocateSharedMemoryHandler /* function */;
  /* 0x0070 */ void* FreeSharedMemoryHandler /* function */;
  /* 0x0078 */ unsigned char MacAddress[6];
  /* 0x0080 */ struct _NDIS_RECEIVE_QUEUE_PARAMETERS QueueParameters;
} NDIS_RECEIVE_QUEUE_BLOCK, *PNDIS_RECEIVE_QUEUE_BLOCK; /* size: 0x04c0 */

typedef enum _NDIS_RECEIVE_QUEUE_OPERATIONAL_STATE
{
  NdisReceiveQueueOperationalStateUndefined = 0,
  NdisReceiveQueueOperationalStateRunning = 1,
  NdisReceiveQueueOperationalStatePaused = 2,
  NdisReceiveQueueOperationalStateDmaStopped = 3,
  NdisReceiveQueueOperationalStateMaximum = 4,
} NDIS_RECEIVE_QUEUE_OPERATIONAL_STATE, *PNDIS_RECEIVE_QUEUE_OPERATIONAL_STATE;

typedef struct _NDIS_RECEIVE_QUEUE_PARAMETERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ enum _NDIS_RECEIVE_QUEUE_TYPE QueueType;
  /* 0x000c */ unsigned long QueueId;
  /* 0x0010 */ unsigned long QueueGroupId;
  /* 0x0018 */ struct _GROUP_AFFINITY ProcessorAffinity;
  /* 0x0028 */ unsigned long NumSuggestedReceiveBuffers;
  /* 0x002c */ unsigned long MSIXTableEntry;
  /* 0x0030 */ unsigned long LookaheadSize;
  /* 0x0034 */ struct _IF_COUNTED_STRING_LH VmName;
  /* 0x0238 */ struct _IF_COUNTED_STRING_LH QueueName;
  /* 0x043c */ long __PADDING__[1];
} NDIS_RECEIVE_QUEUE_PARAMETERS, *PNDIS_RECEIVE_QUEUE_PARAMETERS; /* size: 0x0440 */

typedef enum _NDIS_RECEIVE_QUEUE_PNP_STATE
{
  NdisReceiveQueuePnPStateUndefined = 0,
  NdisReceiveQueuePnPStateAddedToList = 1,
  NdisReceiveQueuePnPStateAllocated = 2,
  NdisReceiveQueuePnPStateEnabled = 3,
  NdisReceiveQueuePnPStateMaximum = 4,
} NDIS_RECEIVE_QUEUE_PNP_STATE, *PNDIS_RECEIVE_QUEUE_PNP_STATE;

typedef enum _NDIS_RECEIVE_QUEUE_TYPE
{
  NdisReceiveQueueTypeUnspecified = 0,
  NdisReceiveQueueTypeVMQueue = 1,
  NdisReceiveQueueTypeMaximum = 2,
} NDIS_RECEIVE_QUEUE_TYPE, *PNDIS_RECEIVE_QUEUE_TYPE;

typedef struct _NDIS_RECEIVE_SCALE_CAPABILITIES
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long CapabilitiesFlags;
  /* 0x0008 */ unsigned long NumberOfInterruptMessages;
  /* 0x000c */ unsigned long NumberOfReceiveQueues;
} NDIS_RECEIVE_SCALE_CAPABILITIES, *PNDIS_RECEIVE_SCALE_CAPABILITIES; /* size: 0x0010 */

typedef struct _NDIS_RECEIVE_SCALE_PARAMETERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned short Flags;
  /* 0x0006 */ unsigned short BaseCpuNumber;
  /* 0x0008 */ unsigned long HashInformation;
  /* 0x000c */ unsigned short IndirectionTableSize;
  /* 0x0010 */ unsigned long IndirectionTableOffset;
  /* 0x0014 */ unsigned short HashSecretKeySize;
  /* 0x0018 */ unsigned long HashSecretKeyOffset;
  /* 0x001c */ unsigned long ProcessorMasksOffset;
  /* 0x0020 */ unsigned long NumberOfProcessorMasks;
  /* 0x0024 */ unsigned long ProcessorMasksEntrySize;
} NDIS_RECEIVE_SCALE_PARAMETERS, *PNDIS_RECEIVE_SCALE_PARAMETERS; /* size: 0x0028 */

typedef struct _NDIS_REQUEST
{
  /* 0x0000 */ unsigned char MacReserved[32];
  /* 0x0020 */ enum _NDIS_REQUEST_TYPE RequestType;
  /* 0x0028 */ union _DATA DATA;
  /* 0x0048 */ unsigned char NdisReserved[72];
  union
  {
    /* 0x0090 */ unsigned char CallMgrReserved[16];
    /* 0x0090 */ unsigned char ProtocolReserved[16];
  }; /* size: 0x0010 */
  /* 0x00a0 */ unsigned char MiniportReserved[16];
} NDIS_REQUEST, *PNDIS_REQUEST; /* size: 0x00b0 */

typedef enum _NDIS_REQUEST_TYPE
{
  NdisRequestQueryInformation = 0,
  NdisRequestSetInformation = 1,
  NdisRequestQueryStatistics = 2,
  NdisRequestOpen = 3,
  NdisRequestClose = 4,
  NdisRequestSend = 5,
  NdisRequestTransferData = 6,
  NdisRequestReset = 7,
  NdisRequestGeneric1 = 8,
  NdisRequestGeneric2 = 9,
  NdisRequestGeneric3 = 10,
  NdisRequestGeneric4 = 11,
  NdisRequestMethod = 12,
} NDIS_REQUEST_TYPE, *PNDIS_REQUEST_TYPE;

typedef struct _NDIS_RESTART_ATTRIBUTES
{
  /* 0x0000 */ struct _NDIS_RESTART_ATTRIBUTES* Next;
  /* 0x0008 */ unsigned long Oid;
  /* 0x000c */ unsigned long DataLength;
  /* 0x0010 */ unsigned char Data[1];
  /* 0x0011 */ char __PADDING__[15];
} NDIS_RESTART_ATTRIBUTES, *PNDIS_RESTART_ATTRIBUTES; /* size: 0x0020 */

typedef struct _NDIS_RESTART_GENERAL_ATTRIBUTES
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long MtuSize;
  /* 0x0008 */ unsigned __int64 MaxXmitLinkSpeed;
  /* 0x0010 */ unsigned __int64 MaxRcvLinkSpeed;
  /* 0x0018 */ unsigned long LookaheadSize;
  /* 0x001c */ unsigned long MacOptions;
  /* 0x0020 */ unsigned long SupportedPacketFilters;
  /* 0x0024 */ unsigned long MaxMulticastListSize;
  /* 0x0028 */ struct _NDIS_RECEIVE_SCALE_CAPABILITIES* RecvScaleCapabilities;
  /* 0x0030 */ enum _NET_IF_ACCESS_TYPE AccessType;
  /* 0x0034 */ unsigned long Flags;
  /* 0x0038 */ enum _NET_IF_CONNECTION_TYPE ConnectionType;
  /* 0x003c */ unsigned long SupportedStatistics;
  /* 0x0040 */ unsigned long DataBackFillSize;
  /* 0x0044 */ unsigned long ContextBackFillSize;
  /* 0x0048 */ unsigned long* SupportedOidList;
  /* 0x0050 */ unsigned long SupportedOidListLength;
  /* 0x0054 */ unsigned long MaxLookaheadSizeAccessed;
} NDIS_RESTART_GENERAL_ATTRIBUTES, *PNDIS_RESTART_GENERAL_ATTRIBUTES; /* size: 0x0058 */

typedef struct _NDIS_RWL_REFCOUNT_POOL
{
  /* 0x0000 */ struct _LIST_ENTRY ListEntry;
  /* 0x0010 */ unsigned long* RefCounts;
  /* 0x0018 */ unsigned long FirstFreeIdx;
  /* 0x001c */ unsigned long NumUsedIdx;
} NDIS_RWL_REFCOUNT_POOL, *PNDIS_RWL_REFCOUNT_POOL; /* size: 0x0020 */

typedef struct _NDIS_RW_LOCK_EX
{
  /* 0x0000 */ void* SourceHandle;
  /* 0x0008 */ unsigned __int64 WriteLock;
  /* 0x0010 */ struct _ETHREAD* Owner;
  /* 0x0018 */ struct _NDIS_RWL_REFCOUNT_POOL* RefCountPool;
  /* 0x0020 */ unsigned long* RefCount[1];
} NDIS_RW_LOCK_EX, *PNDIS_RW_LOCK_EX; /* size: 0x0028 */

typedef struct _NDIS_SG_DMA_BLOCK
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0008 */ struct _NDIS_MINIPORT_BLOCK* Miniport;
  /* 0x0010 */ void* MiniportAdapterContext;
  /* 0x0018 */ struct _DMA_ADAPTER* DmaAdapterObject;
  /* 0x0020 */ void* ProcessSGListHandler /* function */;
  /* 0x0028 */ void* SharedMemAllocateCompleteHandler /* function */;
  /* 0x0030 */ unsigned long Flags;
  /* 0x0034 */ unsigned long MaximumPhysicalMapping;
  /* 0x0038 */ unsigned long ScatterGatherListSize;
  /* 0x0040 */ struct _NPAGED_LOOKASIDE_LIST* SGListLookasideList;
  /* 0x0048 */ long DmaAdapterRefCount;
  /* 0x0050 */ struct _KEVENT* DmaResourcesReleasedEvent;
  /* 0x0058 */ void* SharedMemoryPage[2];
  /* 0x0068 */ unsigned long SharedMemoryLeft[2];
  /* 0x0070 */ union _LARGE_INTEGER SharedMemoryAddress[2];
  /* 0x0080 */ struct _DMA_ADAPTER* SavedDmaAdapterObject;
  /* 0x0088 */ struct _MAP_REGISTER_ENTRY* MapRegisters;
  /* 0x0090 */ struct _KEVENT* AllocationEvent;
  /* 0x0098 */ unsigned short CurrentMapRegister;
  /* 0x009a */ unsigned short BaseMapRegistersNeeded;
  /* 0x009c */ unsigned short SGMapRegistersNeeded;
  /* 0x009e */ char __PADDING__[2];
} NDIS_SG_DMA_BLOCK, *PNDIS_SG_DMA_BLOCK; /* size: 0x00a0 */

typedef struct _NDIS_SHARED_MEMORY_BLOCK
{
  /* 0x0000 */ struct _LIST_ENTRY MiniportLink;
  /* 0x0010 */ struct _LIST_ENTRY OpenLink;
  /* 0x0020 */ struct _LIST_ENTRY QueueLink;
  /* 0x0030 */ unsigned long Flags;
  /* 0x0038 */ struct _NDIS_MINIPORT_BLOCK* Miniport;
  /* 0x0040 */ struct _NDIS_OPEN_BLOCK* Open;
  /* 0x0048 */ struct _NDIS_RECEIVE_QUEUE_BLOCK* ReceiveQueue;
  /* 0x0050 */ void* FreeSharedMemoryHandler /* function */;
  /* 0x0058 */ void* SharedMemoryHandlerContext;
  /* 0x0060 */ void* ProviderAllocationContext;
  /* 0x0068 */ union _LARGE_INTEGER PhysicalAddress;
  /* 0x0070 */ struct _NDIS_SHARED_MEMORY_PARAMETERS SharedMemoryParameters;
} NDIS_SHARED_MEMORY_BLOCK, *PNDIS_SHARED_MEMORY_BLOCK; /* size: 0x00b0 */

typedef struct _NDIS_SHARED_MEMORY_PARAMETERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ unsigned long QueueId;
  /* 0x0010 */ void* SharedMemoryHandle;
  /* 0x0018 */ unsigned long PreferredNode;
  /* 0x001c */ enum _NDIS_SHARED_MEMORY_USAGE Usage;
  /* 0x0020 */ unsigned long Length;
  /* 0x0028 */ void* VirtualAddress;
  /* 0x0030 */ unsigned long SGListBufferLength;
  /* 0x0038 */ struct _SCATTER_GATHER_LIST* SGListBuffer;
} NDIS_SHARED_MEMORY_PARAMETERS, *PNDIS_SHARED_MEMORY_PARAMETERS; /* size: 0x0040 */

typedef enum _NDIS_SHARED_MEMORY_USAGE
{
  NdisSharedMemoryUsageUndefined = 0,
  NdisSharedMemoryUsageXmit = 1,
  NdisSharedMemoryUsageXmitHeader = 2,
  NdisSharedMemoryUsageXmitData = 3,
  NdisSharedMemoryUsageReceive = 4,
  NdisSharedMemoryUsageReceiveLookahead = 5,
  NdisSharedMemoryUsageReceivePostLookahead = 6,
  NdisSharedMemoryUsageReceiveHeader = 7,
  NdisSharedMemoryUsageReceiveData = 8,
  NdisSharedMemoryUsageOther = 9,
  NdisSharedMemoryUsageMax = 10,
} NDIS_SHARED_MEMORY_USAGE, *PNDIS_SHARED_MEMORY_USAGE;

typedef enum _NDIS_SHUTDOWN_ACTION
{
  NdisShutdownPowerOff = 0,
  NdisShutdownBugCheck = 1,
} NDIS_SHUTDOWN_ACTION, *PNDIS_SHUTDOWN_ACTION;

typedef struct _NDIS_SPIN_LOCK
{
  /* 0x0000 */ unsigned __int64 SpinLock;
  /* 0x0008 */ unsigned char OldIrql;
  /* 0x0009 */ char __PADDING__[7];
} NDIS_SPIN_LOCK, *PNDIS_SPIN_LOCK; /* size: 0x0010 */

typedef struct _NDIS_STATUS_INDICATION
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0008 */ void* SourceHandle;
  /* 0x0010 */ unsigned long PortNumber;
  /* 0x0014 */ int StatusCode;
  /* 0x0018 */ unsigned long Flags;
  /* 0x0020 */ void* DestinationHandle;
  /* 0x0028 */ void* RequestId;
  /* 0x0030 */ void* StatusBuffer;
  /* 0x0038 */ unsigned long StatusBufferSize;
  /* 0x003c */ struct _GUID Guid;
  /* 0x0050 */ void* NdisReserved[4];
} NDIS_STATUS_INDICATION, *PNDIS_STATUS_INDICATION; /* size: 0x0070 */

typedef struct _NDIS_STATUS_UNBIND_WORKITEM
{
  /* 0x0000 */ struct _NDIS_WORK_ITEM WorkItem;
  /* 0x0050 */ struct _NDIS_MINIPORT_BLOCK* Miniport;
} NDIS_STATUS_UNBIND_WORKITEM, *PNDIS_STATUS_UNBIND_WORKITEM; /* size: 0x0058 */

typedef enum _NDIS_SUPPORTED_PAUSE_FUNCTIONS
{
  NdisPauseFunctionsUnsupported = 0,
  NdisPauseFunctionsSendOnly = 1,
  NdisPauseFunctionsReceiveOnly = 2,
  NdisPauseFunctionsSendAndReceive = 3,
  NdisPauseFunctionsUnknown = 4,
} NDIS_SUPPORTED_PAUSE_FUNCTIONS, *PNDIS_SUPPORTED_PAUSE_FUNCTIONS;

typedef struct _NDIS_TCP_CONNECTION_OFFLOAD
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Encapsulation;
  struct /* bitfield */
  {
    /* 0x0008 */ unsigned long SupportIPv4 : 2; /* bit position: 0 */
    /* 0x0008 */ unsigned long SupportIPv6 : 2; /* bit position: 2 */
    /* 0x0008 */ unsigned long SupportIPv6ExtensionHeaders : 2; /* bit position: 4 */
    /* 0x0008 */ unsigned long SupportSack : 2; /* bit position: 6 */
    /* 0x0008 */ unsigned long CongestionAlgorithm : 4; /* bit position: 8 */
  }; /* bitfield */
  /* 0x000c */ unsigned long TcpConnectionOffloadCapacity;
  /* 0x0010 */ unsigned long Flags;
} NDIS_TCP_CONNECTION_OFFLOAD, *PNDIS_TCP_CONNECTION_OFFLOAD; /* size: 0x0014 */

typedef struct _NDIS_TCP_CONNECTION_OFFLOAD_PARAMETERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ struct _NDIS_OFFLOAD_ENCAPSULATION Encapsulation;
  /* 0x0020 */ unsigned long TicksPerSecond;
  /* 0x0024 */ unsigned char TcpAckFrequency;
  /* 0x0025 */ unsigned char TcpDelayedAckTicks;
  /* 0x0026 */ unsigned char TcpMaximumRetransmissions;
  /* 0x0027 */ unsigned char TcpDoubtReachabilityRetransmissions;
  /* 0x0028 */ unsigned long TcpSwsPreventionTicks;
  /* 0x002c */ unsigned long TcpDuplicateAckThreshold;
  /* 0x0030 */ unsigned long TcpPushTicks;
  /* 0x0034 */ unsigned long NceStaleTicks;
  /* 0x0038 */ unsigned long CongestionAlgorithm;
} NDIS_TCP_CONNECTION_OFFLOAD_PARAMETERS, *PNDIS_TCP_CONNECTION_OFFLOAD_PARAMETERS; /* size: 0x003c */

typedef struct _NDIS_TCP_IP_CHECKSUM_OFFLOAD
{
  struct
  {
    /* 0x0000 */ unsigned long Encapsulation;
    struct /* bitfield */
    {
      /* 0x0004 */ unsigned long IpOptionsSupported : 2; /* bit position: 0 */
      /* 0x0004 */ unsigned long TcpOptionsSupported : 2; /* bit position: 2 */
      /* 0x0004 */ unsigned long TcpChecksum : 2; /* bit position: 4 */
      /* 0x0004 */ unsigned long UdpChecksum : 2; /* bit position: 6 */
      /* 0x0004 */ unsigned long IpChecksum : 2; /* bit position: 8 */
    }; /* bitfield */
  } /* size: 0x0008 */ IPv4Transmit;
  struct
  {
    /* 0x0008 */ unsigned long Encapsulation;
    struct /* bitfield */
    {
      /* 0x000c */ unsigned long IpOptionsSupported : 2; /* bit position: 0 */
      /* 0x000c */ unsigned long TcpOptionsSupported : 2; /* bit position: 2 */
      /* 0x000c */ unsigned long TcpChecksum : 2; /* bit position: 4 */
      /* 0x000c */ unsigned long UdpChecksum : 2; /* bit position: 6 */
      /* 0x000c */ unsigned long IpChecksum : 2; /* bit position: 8 */
    }; /* bitfield */
  } /* size: 0x0008 */ IPv4Receive;
  struct
  {
    /* 0x0010 */ unsigned long Encapsulation;
    struct /* bitfield */
    {
      /* 0x0014 */ unsigned long IpExtensionHeadersSupported : 2; /* bit position: 0 */
      /* 0x0014 */ unsigned long TcpOptionsSupported : 2; /* bit position: 2 */
      /* 0x0014 */ unsigned long TcpChecksum : 2; /* bit position: 4 */
      /* 0x0014 */ unsigned long UdpChecksum : 2; /* bit position: 6 */
    }; /* bitfield */
  } /* size: 0x0008 */ IPv6Transmit;
  struct
  {
    /* 0x0018 */ unsigned long Encapsulation;
    struct /* bitfield */
    {
      /* 0x001c */ unsigned long IpExtensionHeadersSupported : 2; /* bit position: 0 */
      /* 0x001c */ unsigned long TcpOptionsSupported : 2; /* bit position: 2 */
      /* 0x001c */ unsigned long TcpChecksum : 2; /* bit position: 4 */
      /* 0x001c */ unsigned long UdpChecksum : 2; /* bit position: 6 */
    }; /* bitfield */
  } /* size: 0x0008 */ IPv6Receive;
} NDIS_TCP_IP_CHECKSUM_OFFLOAD, *PNDIS_TCP_IP_CHECKSUM_OFFLOAD; /* size: 0x0020 */

typedef struct _NDIS_TCP_LARGE_SEND_OFFLOAD_V1
{
  struct
  {
    /* 0x0000 */ unsigned long Encapsulation;
    /* 0x0004 */ unsigned long MaxOffLoadSize;
    /* 0x0008 */ unsigned long MinSegmentCount;
    struct /* bitfield */
    {
      /* 0x000c */ unsigned long TcpOptions : 2; /* bit position: 0 */
      /* 0x000c */ unsigned long IpOptions : 2; /* bit position: 2 */
    }; /* bitfield */
  } /* size: 0x0010 */ IPv4;
} NDIS_TCP_LARGE_SEND_OFFLOAD_V1, *PNDIS_TCP_LARGE_SEND_OFFLOAD_V1; /* size: 0x0010 */

typedef struct _NDIS_TCP_LARGE_SEND_OFFLOAD_V2
{
  struct
  {
    /* 0x0000 */ unsigned long Encapsulation;
    /* 0x0004 */ unsigned long MaxOffLoadSize;
    /* 0x0008 */ unsigned long MinSegmentCount;
  } /* size: 0x000c */ IPv4;
  struct
  {
    /* 0x000c */ unsigned long Encapsulation;
    /* 0x0010 */ unsigned long MaxOffLoadSize;
    /* 0x0014 */ unsigned long MinSegmentCount;
    struct /* bitfield */
    {
      /* 0x0018 */ unsigned long IpExtensionHeadersSupported : 2; /* bit position: 0 */
      /* 0x0018 */ unsigned long TcpOptionsSupported : 2; /* bit position: 2 */
    }; /* bitfield */
  } /* size: 0x0010 */ IPv6;
} NDIS_TCP_LARGE_SEND_OFFLOAD_V2, *PNDIS_TCP_LARGE_SEND_OFFLOAD_V2; /* size: 0x001c */

typedef struct _NDIS_TIMER
{
  /* 0x0000 */ struct _KTIMER Timer;
  /* 0x0040 */ struct _KDPC Dpc;
} NDIS_TIMER, *PNDIS_TIMER; /* size: 0x0080 */

typedef struct _NDIS_TIMER_ENTRY
{
  /* 0x0000 */ struct _NDIS_TIMER_ENTRY* NextTimer;
  /* 0x0008 */ struct _LIST_ENTRY GlobalLink;
  /* 0x0018 */ void* Handle;
  /* 0x0020 */ struct _KTIMER Timer;
  /* 0x0060 */ struct _KDPC Dpc;
  /* 0x00a0 */ unsigned long AllocationTag;
  /* 0x00a8 */ void* TimerFunction /* function */;
  /* 0x00b0 */ void* DefaultFunctionContext;
  /* 0x00b8 */ void* FunctionContext;
  /* 0x00c0 */ struct _NDIS_MINIPORT_BLOCK* Miniport;
  /* 0x00c8 */ unsigned char Periodic;
  /* 0x00c9 */ char __PADDING__[7];
} NDIS_TIMER_ENTRY, *PNDIS_TIMER_ENTRY; /* size: 0x00d0 */

typedef struct _NDIS_TRACK_MEM
{
  /* 0x0000 */ struct _LIST_ENTRY List;
  /* 0x0010 */ unsigned long Tag;
  /* 0x0014 */ unsigned int Length;
  /* 0x0018 */ void* Caller;
  /* 0x0020 */ void* CallersCaller;
} NDIS_TRACK_MEM, *PNDIS_TRACK_MEM; /* size: 0x0028 */

typedef struct _NDIS_WAN_PACKET
{
  /* 0x0000 */ struct _LIST_ENTRY WanPacketQueue;
  /* 0x0010 */ unsigned char* CurrentBuffer;
  /* 0x0018 */ unsigned long CurrentLength;
  /* 0x0020 */ unsigned char* StartBuffer;
  /* 0x0028 */ unsigned char* EndBuffer;
  /* 0x0030 */ void* ProtocolReserved1;
  /* 0x0038 */ void* ProtocolReserved2;
  /* 0x0040 */ void* ProtocolReserved3;
  /* 0x0048 */ void* ProtocolReserved4;
  /* 0x0050 */ void* MacReserved1;
  /* 0x0058 */ void* MacReserved2;
  /* 0x0060 */ void* MacReserved3;
  /* 0x0068 */ void* MacReserved4;
} NDIS_WAN_PACKET, *PNDIS_WAN_PACKET; /* size: 0x0070 */

typedef struct _NDIS_WORK_ITEM
{
  /* 0x0000 */ void* Context;
  /* 0x0008 */ void* Routine /* function */;
  /* 0x0010 */ unsigned char WrapperReserved[64];
} NDIS_WORK_ITEM, *PNDIS_WORK_ITEM; /* size: 0x0050 */

typedef enum _NDIS_WORK_ITEM_TYPE
{
  NdisWorkItemRequest = 0,
  NdisWorkItemSend = 1,
  NdisWorkItemReturnPackets = 2,
  NdisWorkItemResetRequested = 3,
  NdisWorkItemResetInProgress = 4,
  NdisWorkItemReserved = 5,
  NdisWorkItemMiniportCallback = 6,
  NdisMaxWorkItems = 7,
} NDIS_WORK_ITEM_TYPE, *PNDIS_WORK_ITEM_TYPE;

typedef struct _NDIS_WORK_QUEUE
{
  /* 0x0000 */ struct _LIST_ENTRY WorkItemList;
  /* 0x0010 */ unsigned __int64 ListLock;
  /* 0x0018 */ unsigned long NumEntries;
  /* 0x0020 */ struct _KSEMAPHORE ItemsAvailable;
} NDIS_WORK_QUEUE, *PNDIS_WORK_QUEUE; /* size: 0x0040 */

typedef struct _NDIS_WRAPPER_HANDLE
{
  /* 0x0000 */ struct _DRIVER_OBJECT* DriverObject;
  /* 0x0008 */ struct _UNICODE_STRING ServiceRegPath;
} NDIS_WRAPPER_HANDLE, *PNDIS_WRAPPER_HANDLE; /* size: 0x0018 */

typedef enum _NDIS_XLATE_TYPE
{
  XlateSend = 0,
  XlateSendComplete = 1,
  XlateReceive = 2,
  XlateReturn = 3,
} NDIS_XLATE_TYPE, *PNDIS_XLATE_TYPE;

typedef struct _NETIO_NET_BUFFER_CONTEXT
{
  /* 0x0000 */ unsigned long OriginalDataOffset;
  /* 0x0004 */ unsigned long OriginalDataLength;
  /* 0x0008 */ unsigned long TruncatedLength;
  union
  {
    /* 0x000c */ unsigned long Flags;
    struct /* bitfield */
    {
      /* 0x000c */ unsigned long EcnField : 2; /* bit position: 0 */
      /* 0x000c */ unsigned long EspTrailerSpaceAllocated : 1; /* bit position: 2 */
    }; /* bitfield */
  }; /* size: 0x0004 */
  /* 0x0010 */ void* Scratch[2];
} NETIO_NET_BUFFER_CONTEXT, *PNETIO_NET_BUFFER_CONTEXT; /* size: 0x0020 */

typedef struct _NETIO_NET_BUFFER_LIST_CONTEXT
{
  /* 0x0000 */ long ReferenceCount;
  /* 0x0008 */ struct _NET_BUFFER_LIST* Parent;
  /* 0x0010 */ void* CompletionRoutine /* function */;
  /* 0x0018 */ void* CompletionContext;
} NETIO_NET_BUFFER_LIST_CONTEXT, *PNETIO_NET_BUFFER_LIST_CONTEXT; /* size: 0x0020 */

typedef struct _NET_BUFFER
{
  union
  {
    struct
    {
      /* 0x0000 */ struct _NET_BUFFER* Next;
      /* 0x0008 */ struct _MDL* CurrentMdl;
      /* 0x0010 */ unsigned long CurrentMdlOffset;
      union
      {
        /* 0x0018 */ unsigned long DataLength;
        struct
        {
          /* 0x0018 */ unsigned __int64 stDataLength;
          /* 0x0020 */ struct _MDL* MdlChain;
          /* 0x0028 */ unsigned long DataOffset;
        }; /* size: 0x0014 */
      }; /* size: 0x0014 */
    }; /* size: 0x0028 */
    /* 0x0000 */ union _SLIST_HEADER Link;
  }; /* size: 0x0028 */
  /* 0x0030 */ unsigned short ChecksumBias;
  /* 0x0032 */ unsigned short Reserved;
  /* 0x0038 */ void* NdisPoolHandle;
  /* 0x0040 */ void* NdisReserved[2];
  /* 0x0050 */ void* ProtocolReserved[6];
  /* 0x0080 */ void* MiniportReserved[4];
  /* 0x00a0 */ union _LARGE_INTEGER DataPhysicalAddress;
  union
  {
    /* 0x00a8 */ struct _NET_BUFFER_SHARED_MEMORY* SharedMemoryInfo;
    /* 0x00a8 */ struct _SCATTER_GATHER_LIST* ScatterGatherList;
  }; /* size: 0x0008 */
} NET_BUFFER, *PNET_BUFFER; /* size: 0x00b0 */

typedef struct _NET_BUFFER_LIST
{
  union
  {
    struct
    {
      /* 0x0000 */ struct _NET_BUFFER_LIST* Next;
      /* 0x0008 */ struct _NET_BUFFER* FirstNetBuffer;
    }; /* size: 0x0010 */
    /* 0x0000 */ union _SLIST_HEADER Link;
  }; /* size: 0x0010 */
  /* 0x0010 */ struct _NET_BUFFER_LIST_CONTEXT* Context;
  /* 0x0018 */ struct _NET_BUFFER_LIST* ParentNetBufferList;
  /* 0x0020 */ void* NdisPoolHandle;
  /* 0x0030 */ void* NdisReserved[2];
  /* 0x0040 */ void* ProtocolReserved[4];
  /* 0x0060 */ void* MiniportReserved[2];
  /* 0x0070 */ void* Scratch;
  /* 0x0078 */ void* SourceHandle;
  /* 0x0080 */ unsigned long NblFlags;
  /* 0x0084 */ long ChildRefCount;
  /* 0x0088 */ unsigned long Flags;
  /* 0x008c */ int Status;
  /* 0x0090 */ void* NetBufferListInfo[19];
  /* 0x0128 */ long __PADDING__[2];
} NET_BUFFER_LIST, *PNET_BUFFER_LIST; /* size: 0x0130 */

typedef struct _NET_BUFFER_LIST_CONTEXT
{
  /* 0x0000 */ struct _NET_BUFFER_LIST_CONTEXT* Next;
  /* 0x0008 */ unsigned short Size;
  /* 0x000a */ unsigned short Offset;
  /* 0x0010 */ unsigned char* ContextData /* zero-length array */;
} NET_BUFFER_LIST_CONTEXT, *PNET_BUFFER_LIST_CONTEXT; /* size: 0x0010 */

typedef struct _NET_BUFFER_SHARED_MEMORY
{
  /* 0x0000 */ struct _NET_BUFFER_SHARED_MEMORY* NextSharedMemorySegment;
  /* 0x0008 */ unsigned long SharedMemoryFlags;
  /* 0x0010 */ void* SharedMemoryHandle;
  /* 0x0018 */ unsigned long SharedMemoryOffset;
  /* 0x001c */ unsigned long SharedMemoryLength;
} NET_BUFFER_SHARED_MEMORY, *PNET_BUFFER_SHARED_MEMORY; /* size: 0x0020 */

typedef struct _NET_DEVICE_PNP_EVENT
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long PortNumber;
  /* 0x0008 */ enum _NDIS_DEVICE_PNP_EVENT DevicePnPEvent;
  /* 0x0010 */ void* InformationBuffer;
  /* 0x0018 */ unsigned long InformationBufferLength;
  /* 0x001c */ unsigned char NdisReserved[16];
  /* 0x002c */ long __PADDING__[1];
} NET_DEVICE_PNP_EVENT, *PNET_DEVICE_PNP_EVENT; /* size: 0x0030 */

typedef enum _NET_IF_ACCESS_TYPE
{
  NET_IF_ACCESS_LOOPBACK = 1,
  NET_IF_ACCESS_BROADCAST = 2,
  NET_IF_ACCESS_POINT_TO_POINT = 3,
  NET_IF_ACCESS_POINT_TO_MULTI_POINT = 4,
  NET_IF_ACCESS_MAXIMUM = 5,
} NET_IF_ACCESS_TYPE, *PNET_IF_ACCESS_TYPE;

typedef enum _NET_IF_ADMIN_STATUS
{
  NET_IF_ADMIN_STATUS_UP = 1,
  NET_IF_ADMIN_STATUS_DOWN = 2,
  NET_IF_ADMIN_STATUS_TESTING = 3,
} NET_IF_ADMIN_STATUS, *PNET_IF_ADMIN_STATUS;

typedef enum _NET_IF_CONNECTION_TYPE
{
  NET_IF_CONNECTION_DEDICATED = 1,
  NET_IF_CONNECTION_PASSIVE = 2,
  NET_IF_CONNECTION_DEMAND = 3,
  NET_IF_CONNECTION_MAXIMUM = 4,
} NET_IF_CONNECTION_TYPE, *PNET_IF_CONNECTION_TYPE;

typedef enum _NET_IF_DIRECTION_TYPE
{
  NET_IF_DIRECTION_SENDRECEIVE = 0,
  NET_IF_DIRECTION_SENDONLY = 1,
  NET_IF_DIRECTION_RECEIVEONLY = 2,
  NET_IF_DIRECTION_MAXIMUM = 3,
} NET_IF_DIRECTION_TYPE, *PNET_IF_DIRECTION_TYPE;

typedef enum _NET_IF_MEDIA_CONNECT_STATE
{
  MediaConnectStateUnknown = 0,
  MediaConnectStateConnected = 1,
  MediaConnectStateDisconnected = 2,
} NET_IF_MEDIA_CONNECT_STATE, *PNET_IF_MEDIA_CONNECT_STATE;

typedef enum _NET_IF_MEDIA_DUPLEX_STATE
{
  MediaDuplexStateUnknown = 0,
  MediaDuplexStateHalf = 1,
  MediaDuplexStateFull = 2,
} NET_IF_MEDIA_DUPLEX_STATE, *PNET_IF_MEDIA_DUPLEX_STATE;

typedef enum _NET_IF_OPER_STATUS
{
  NET_IF_OPER_STATUS_UP = 1,
  NET_IF_OPER_STATUS_DOWN = 2,
  NET_IF_OPER_STATUS_TESTING = 3,
  NET_IF_OPER_STATUS_UNKNOWN = 4,
  NET_IF_OPER_STATUS_DORMANT = 5,
  NET_IF_OPER_STATUS_NOT_PRESENT = 6,
  NET_IF_OPER_STATUS_LOWER_LAYER_DOWN = 7,
} NET_IF_OPER_STATUS, *PNET_IF_OPER_STATUS;

typedef enum _NET_IF_RCV_ADDRESS_TYPE
{
  NET_IF_RCV_ADDRESS_TYPE_OTHER = 1,
  NET_IF_RCV_ADDRESS_TYPE_VOLATILE = 2,
  NET_IF_RCV_ADDRESS_TYPE_NON_VOLATILE = 3,
} NET_IF_RCV_ADDRESS_TYPE, *PNET_IF_RCV_ADDRESS_TYPE;

typedef union _NET_LUID_LH
{
  union
  {
    /* 0x0000 */ unsigned __int64 Value;
    struct
    {
      struct /* bitfield */
      {
        /* 0x0000 */ unsigned __int64 Reserved : 24; /* bit position: 0 */
        /* 0x0000 */ unsigned __int64 NetLuidIndex : 24; /* bit position: 24 */
        /* 0x0000 */ unsigned __int64 IfType : 16; /* bit position: 48 */
      }; /* bitfield */
    } /* size: 0x0008 */ Info;
  }; /* size: 0x0008 */
} NET_LUID_LH, *PNET_LUID_LH; /* size: 0x0008 */

typedef struct _NET_PHYSICAL_LOCATION_LH
{
  /* 0x0000 */ unsigned long BusNumber;
  /* 0x0004 */ unsigned long SlotNumber;
  /* 0x0008 */ unsigned long FunctionNumber;
} NET_PHYSICAL_LOCATION_LH, *PNET_PHYSICAL_LOCATION_LH; /* size: 0x000c */

typedef struct _NET_PNP_EVENT
{
  /* 0x0000 */ enum _NET_PNP_EVENT_CODE NetEvent;
  /* 0x0008 */ void* Buffer;
  /* 0x0010 */ unsigned long BufferLength;
  /* 0x0018 */ unsigned __int64 NdisReserved[4];
  /* 0x0038 */ unsigned __int64 TransportReserved[4];
  /* 0x0058 */ unsigned __int64 TdiReserved[4];
  /* 0x0078 */ unsigned __int64 TdiClientReserved[4];
} NET_PNP_EVENT, *PNET_PNP_EVENT; /* size: 0x0098 */

typedef enum _NET_PNP_EVENT_CODE
{
  NetEventSetPower = 0,
  NetEventQueryPower = 1,
  NetEventQueryRemoveDevice = 2,
  NetEventCancelRemoveDevice = 3,
  NetEventReconfigure = 4,
  NetEventBindList = 5,
  NetEventBindsComplete = 6,
  NetEventPnPCapabilities = 7,
  NetEventPause = 8,
  NetEventRestart = 9,
  NetEventPortActivation = 10,
  NetEventPortDeactivation = 11,
  NetEventIMReEnableDevice = 12,
  NetEventMaximum = 13,
} NET_PNP_EVENT_CODE, *PNET_PNP_EVENT_CODE;

typedef struct _NET_PNP_EVENT_NOTIFICATION
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long PortNumber;
  /* 0x0008 */ struct _NET_PNP_EVENT NetPnPEvent;
  /* 0x00a0 */ unsigned long Flags;
  /* 0x00a4 */ long __PADDING__[1];
} NET_PNP_EVENT_NOTIFICATION, *PNET_PNP_EVENT_NOTIFICATION; /* size: 0x00a8 */

typedef struct _NPAGED_LOOKASIDE_LIST
{
  /* 0x0000 */ struct _GENERAL_LOOKASIDE L;
} NPAGED_LOOKASIDE_LIST, *PNPAGED_LOOKASIDE_LIST; /* size: 0x0080 */

typedef struct _NPI_MODULEID
{
  /* 0x0000 */ unsigned short Length;
  /* 0x0004 */ enum _NPI_MODULEID_TYPE Type;
  union
  {
    /* 0x0008 */ struct _GUID Guid;
    struct
    {
      /* 0x0008 */ struct _LUID IfLuid;
      /* 0x0010 */ long __PADDING__[2];
    }; /* size: 0x0010 */
  }; /* size: 0x0010 */
} NPI_MODULEID, *PNPI_MODULEID; /* size: 0x0018 */

typedef enum _NPI_MODULEID_TYPE
{
  MIT_GUID = 1,
  MIT_IF_LUID = 2,
} NPI_MODULEID_TYPE, *PNPI_MODULEID_TYPE;

typedef enum _NT_PRODUCT_TYPE
{
  NtProductWinNt = 1,
  NtProductLanManNt = 2,
  NtProductServer = 3,
} NT_PRODUCT_TYPE, *PNT_PRODUCT_TYPE;

typedef struct _NT_TIB
{
  /* 0x0000 */ struct _EXCEPTION_REGISTRATION_RECORD* ExceptionList;
  /* 0x0008 */ void* StackBase;
  /* 0x0010 */ void* StackLimit;
  /* 0x0018 */ void* SubSystemTib;
  union
  {
    /* 0x0020 */ void* FiberData;
    /* 0x0020 */ unsigned long Version;
  }; /* size: 0x0008 */
  /* 0x0028 */ void* ArbitraryUserPointer;
  /* 0x0030 */ struct _NT_TIB* Self;
} NT_TIB, *PNT_TIB; /* size: 0x0038 */

typedef struct _OBJECT_ATTRIBUTES
{
  /* 0x0000 */ unsigned long Length;
  /* 0x0008 */ void* RootDirectory;
  /* 0x0010 */ struct _UNICODE_STRING* ObjectName;
  /* 0x0018 */ unsigned long Attributes;
  /* 0x0020 */ void* SecurityDescriptor;
  /* 0x0028 */ void* SecurityQualityOfService;
} OBJECT_ATTRIBUTES, *POBJECT_ATTRIBUTES; /* size: 0x0030 */

typedef struct _OBJECT_DUMP_CONTROL
{
  /* 0x0000 */ void* Stream;
  /* 0x0008 */ unsigned long Detail;
  /* 0x000c */ long __PADDING__[1];
} OBJECT_DUMP_CONTROL, *POBJECT_DUMP_CONTROL; /* size: 0x0010 */

typedef struct _OBJECT_HANDLE_INFORMATION
{
  /* 0x0000 */ unsigned long HandleAttributes;
  /* 0x0004 */ unsigned long GrantedAccess;
} OBJECT_HANDLE_INFORMATION, *POBJECT_HANDLE_INFORMATION; /* size: 0x0008 */

typedef struct _OBJECT_NAME_INFORMATION
{
  /* 0x0000 */ struct _UNICODE_STRING Name;
} OBJECT_NAME_INFORMATION, *POBJECT_NAME_INFORMATION; /* size: 0x0010 */

typedef struct _OBJECT_TYPE
{
  /* 0x0000 */ struct _LIST_ENTRY TypeList;
  /* 0x0010 */ struct _UNICODE_STRING Name;
  /* 0x0020 */ void* DefaultObject;
  /* 0x0028 */ unsigned char Index;
  /* 0x002c */ unsigned long TotalNumberOfObjects;
  /* 0x0030 */ unsigned long TotalNumberOfHandles;
  /* 0x0034 */ unsigned long HighWaterNumberOfObjects;
  /* 0x0038 */ unsigned long HighWaterNumberOfHandles;
  /* 0x0040 */ struct _OBJECT_TYPE_INITIALIZER TypeInfo;
  /* 0x00b0 */ struct _EX_PUSH_LOCK TypeLock;
  /* 0x00b8 */ unsigned long Key;
  /* 0x00c0 */ struct _LIST_ENTRY CallbackList;
} OBJECT_TYPE, *POBJECT_TYPE; /* size: 0x00d0 */

typedef struct _OBJECT_TYPE_INITIALIZER
{
  /* 0x0000 */ unsigned short Length;
  union
  {
    /* 0x0002 */ unsigned char ObjectTypeFlags;
    struct /* bitfield */
    {
      /* 0x0002 */ unsigned char CaseInsensitive : 1; /* bit position: 0 */
      /* 0x0002 */ unsigned char UnnamedObjectsOnly : 1; /* bit position: 1 */
      /* 0x0002 */ unsigned char UseDefaultObject : 1; /* bit position: 2 */
      /* 0x0002 */ unsigned char SecurityRequired : 1; /* bit position: 3 */
      /* 0x0002 */ unsigned char MaintainHandleCount : 1; /* bit position: 4 */
      /* 0x0002 */ unsigned char MaintainTypeList : 1; /* bit position: 5 */
      /* 0x0002 */ unsigned char SupportsObjectCallbacks : 1; /* bit position: 6 */
    }; /* bitfield */
  }; /* size: 0x0001 */
  /* 0x0004 */ unsigned long ObjectTypeCode;
  /* 0x0008 */ unsigned long InvalidAttributes;
  /* 0x000c */ struct _GENERIC_MAPPING GenericMapping;
  /* 0x001c */ unsigned long ValidAccessMask;
  /* 0x0020 */ unsigned long RetainAccess;
  /* 0x0024 */ enum _POOL_TYPE PoolType;
  /* 0x0028 */ unsigned long DefaultPagedPoolCharge;
  /* 0x002c */ unsigned long DefaultNonPagedPoolCharge;
  /* 0x0030 */ void* DumpProcedure /* function */;
  /* 0x0038 */ void* OpenProcedure /* function */;
  /* 0x0040 */ void* CloseProcedure /* function */;
  /* 0x0048 */ void* DeleteProcedure /* function */;
  /* 0x0050 */ void* ParseProcedure /* function */;
  /* 0x0058 */ void* SecurityProcedure /* function */;
  /* 0x0060 */ void* QueryNameProcedure /* function */;
  /* 0x0068 */ void* OkayToCloseProcedure /* function */;
} OBJECT_TYPE_INITIALIZER, *POBJECT_TYPE_INITIALIZER; /* size: 0x0070 */

typedef enum _OB_OPEN_REASON
{
  ObCreateHandle = 0,
  ObOpenHandle = 1,
  ObDuplicateHandle = 2,
  ObInheritHandle = 3,
  ObMaxOpenReason = 4,
} OB_OPEN_REASON, *POB_OPEN_REASON;

typedef struct _OID_LIST
{
  /* 0x0000 */ unsigned long StatsOidCount;
  /* 0x0004 */ unsigned long FullOidCount;
  /* 0x0008 */ unsigned long* StatsOidArray;
  /* 0x0010 */ unsigned long* FullOidArray;
} OID_LIST, *POID_LIST; /* size: 0x0018 */

typedef struct _OWNER_ENTRY
{
  /* 0x0000 */ unsigned __int64 OwnerThread;
  union
  {
    struct /* bitfield */
    {
      /* 0x0008 */ unsigned long IoPriorityBoosted : 1; /* bit position: 0 */
      /* 0x0008 */ unsigned long OwnerReferenced : 1; /* bit position: 1 */
      /* 0x0008 */ unsigned long OwnerCount : 30; /* bit position: 2 */
    }; /* bitfield */
    /* 0x0008 */ unsigned long TableSize;
  }; /* size: 0x0004 */
  /* 0x000c */ long __PADDING__[1];
} OWNER_ENTRY, *POWNER_ENTRY; /* size: 0x0010 */

typedef struct _PAGED_LOOKASIDE_LIST
{
  /* 0x0000 */ struct _GENERAL_LOOKASIDE L;
} PAGED_LOOKASIDE_LIST, *PPAGED_LOOKASIDE_LIST; /* size: 0x0080 */

typedef struct _PCI_CAPABILITIES_HEADER
{
  /* 0x0000 */ unsigned char CapabilityID;
  /* 0x0001 */ unsigned char Next;
} PCI_CAPABILITIES_HEADER, *PPCI_CAPABILITIES_HEADER; /* size: 0x0002 */

typedef struct _PCI_MSI_MESSAGE_ADDRESS
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned long Reserved : 2; /* bit position: 0 */
    /* 0x0000 */ unsigned long Address : 30; /* bit position: 2 */
  }; /* bitfield */
} PCI_MSI_MESSAGE_ADDRESS, *PPCI_MSI_MESSAGE_ADDRESS; /* size: 0x0004 */

typedef struct _PCI_MSI_MESSAGE_CONTROL
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned short MSIEnable : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned short MultipleMessageCapable : 3; /* bit position: 1 */
    /* 0x0000 */ unsigned short MultipleMessageEnable : 3; /* bit position: 4 */
    /* 0x0000 */ unsigned short CapableOf64Bits : 1; /* bit position: 7 */
    /* 0x0000 */ unsigned short PerVectorMaskCapable : 1; /* bit position: 8 */
    /* 0x0000 */ unsigned short Reserved : 7; /* bit position: 9 */
  }; /* bitfield */
} PCI_MSI_MESSAGE_CONTROL, *PPCI_MSI_MESSAGE_CONTROL; /* size: 0x0002 */

struct _PCW_BUFFER;

typedef union _PCW_CALLBACK_INFORMATION
{
  union
  {
    /* 0x0000 */ struct _PCW_COUNTER_INFORMATION AddCounter;
    /* 0x0000 */ struct _PCW_COUNTER_INFORMATION RemoveCounter;
    /* 0x0000 */ struct _PCW_MASK_INFORMATION EnumerateInstances;
    /* 0x0000 */ struct _PCW_MASK_INFORMATION CollectData;
  }; /* size: 0x0028 */
} PCW_CALLBACK_INFORMATION, *PPCW_CALLBACK_INFORMATION; /* size: 0x0028 */

typedef enum _PCW_CALLBACK_TYPE
{
  PcwCallbackAddCounter = 0,
  PcwCallbackRemoveCounter = 1,
  PcwCallbackEnumerateInstances = 2,
  PcwCallbackCollectData = 3,
} PCW_CALLBACK_TYPE, *PPCW_CALLBACK_TYPE;

typedef struct _PCW_COUNTER_DESCRIPTOR
{
  /* 0x0000 */ unsigned short Id;
  /* 0x0002 */ unsigned short StructIndex;
  /* 0x0004 */ unsigned short Offset;
  /* 0x0006 */ unsigned short Size;
} PCW_COUNTER_DESCRIPTOR, *PPCW_COUNTER_DESCRIPTOR; /* size: 0x0008 */

typedef struct _PCW_COUNTER_INFORMATION
{
  /* 0x0000 */ unsigned __int64 CounterMask;
  /* 0x0008 */ const struct _UNICODE_STRING* InstanceMask;
} PCW_COUNTER_INFORMATION, *PPCW_COUNTER_INFORMATION; /* size: 0x0010 */

typedef struct _PCW_DATA
{
  /* 0x0000 */ const void* Data;
  /* 0x0008 */ unsigned long Size;
  /* 0x000c */ long __PADDING__[1];
} PCW_DATA, *PPCW_DATA; /* size: 0x0010 */

struct _PCW_INSTANCE;

typedef struct _PCW_MASK_INFORMATION
{
  /* 0x0000 */ unsigned __int64 CounterMask;
  /* 0x0008 */ const struct _UNICODE_STRING* InstanceMask;
  /* 0x0010 */ unsigned long InstanceId;
  /* 0x0014 */ unsigned char CollectMultiple;
  /* 0x0018 */ struct _PCW_BUFFER* Buffer;
  /* 0x0020 */ struct _KEVENT* CancelEvent;
} PCW_MASK_INFORMATION, *PPCW_MASK_INFORMATION; /* size: 0x0028 */

struct _PCW_REGISTRATION;

typedef struct _PCW_REGISTRATION_INFORMATION
{
  /* 0x0000 */ unsigned long Version;
  /* 0x0008 */ const struct _UNICODE_STRING* Name;
  /* 0x0010 */ unsigned long CounterCount;
  /* 0x0018 */ struct _PCW_COUNTER_DESCRIPTOR* Counters;
  /* 0x0020 */ void* Callback /* function */;
  /* 0x0028 */ void* CallbackContext;
} PCW_REGISTRATION_INFORMATION, *PPCW_REGISTRATION_INFORMATION; /* size: 0x0030 */

typedef struct _PEB
{
  /* 0x0000 */ unsigned char InheritedAddressSpace;
  /* 0x0001 */ unsigned char ReadImageFileExecOptions;
  /* 0x0002 */ unsigned char BeingDebugged;
  union
  {
    /* 0x0003 */ unsigned char BitField;
    struct /* bitfield */
    {
      /* 0x0003 */ unsigned char ImageUsesLargePages : 1; /* bit position: 0 */
      /* 0x0003 */ unsigned char IsProtectedProcess : 1; /* bit position: 1 */
      /* 0x0003 */ unsigned char IsLegacyProcess : 1; /* bit position: 2 */
      /* 0x0003 */ unsigned char IsImageDynamicallyRelocated : 1; /* bit position: 3 */
      /* 0x0003 */ unsigned char SkipPatchingUser32Forwarders : 1; /* bit position: 4 */
      /* 0x0003 */ unsigned char SpareBits : 3; /* bit position: 5 */
    }; /* bitfield */
  }; /* size: 0x0001 */
  /* 0x0008 */ void* Mutant;
  /* 0x0010 */ void* ImageBaseAddress;
  /* 0x0018 */ struct _PEB_LDR_DATA* Ldr;
  /* 0x0020 */ struct _RTL_USER_PROCESS_PARAMETERS* ProcessParameters;
  /* 0x0028 */ void* SubSystemData;
  /* 0x0030 */ void* ProcessHeap;
  /* 0x0038 */ struct _RTL_CRITICAL_SECTION* FastPebLock;
  /* 0x0040 */ void* AtlThunkSListPtr;
  /* 0x0048 */ void* IFEOKey;
  union
  {
    /* 0x0050 */ unsigned long CrossProcessFlags;
    struct /* bitfield */
    {
      /* 0x0050 */ unsigned long ProcessInJob : 1; /* bit position: 0 */
      /* 0x0050 */ unsigned long ProcessInitializing : 1; /* bit position: 1 */
      /* 0x0050 */ unsigned long ProcessUsingVEH : 1; /* bit position: 2 */
      /* 0x0050 */ unsigned long ProcessUsingVCH : 1; /* bit position: 3 */
      /* 0x0050 */ unsigned long ProcessUsingFTH : 1; /* bit position: 4 */
      /* 0x0050 */ unsigned long ReservedBits0 : 27; /* bit position: 5 */
    }; /* bitfield */
  }; /* size: 0x0004 */
  union
  {
    /* 0x0058 */ void* KernelCallbackTable;
    /* 0x0058 */ void* UserSharedInfoPtr;
  }; /* size: 0x0008 */
  /* 0x0060 */ unsigned long SystemReserved[1];
  /* 0x0064 */ unsigned long AtlThunkSListPtr32;
  /* 0x0068 */ void* ApiSetMap;
  /* 0x0070 */ unsigned long TlsExpansionCounter;
  /* 0x0078 */ void* TlsBitmap;
  /* 0x0080 */ unsigned long TlsBitmapBits[2];
  /* 0x0088 */ void* ReadOnlySharedMemoryBase;
  /* 0x0090 */ void* HotpatchInformation;
  /* 0x0098 */ void** ReadOnlyStaticServerData;
  /* 0x00a0 */ void* AnsiCodePageData;
  /* 0x00a8 */ void* OemCodePageData;
  /* 0x00b0 */ void* UnicodeCaseTableData;
  /* 0x00b8 */ unsigned long NumberOfProcessors;
  /* 0x00bc */ unsigned long NtGlobalFlag;
  /* 0x00c0 */ union _LARGE_INTEGER CriticalSectionTimeout;
  /* 0x00c8 */ unsigned __int64 HeapSegmentReserve;
  /* 0x00d0 */ unsigned __int64 HeapSegmentCommit;
  /* 0x00d8 */ unsigned __int64 HeapDeCommitTotalFreeThreshold;
  /* 0x00e0 */ unsigned __int64 HeapDeCommitFreeBlockThreshold;
  /* 0x00e8 */ unsigned long NumberOfHeaps;
  /* 0x00ec */ unsigned long MaximumNumberOfHeaps;
  /* 0x00f0 */ void** ProcessHeaps;
  /* 0x00f8 */ void* GdiSharedHandleTable;
  /* 0x0100 */ void* ProcessStarterHelper;
  /* 0x0108 */ unsigned long GdiDCAttributeList;
  /* 0x0110 */ struct _RTL_CRITICAL_SECTION* LoaderLock;
  /* 0x0118 */ unsigned long OSMajorVersion;
  /* 0x011c */ unsigned long OSMinorVersion;
  /* 0x0120 */ unsigned short OSBuildNumber;
  /* 0x0122 */ unsigned short OSCSDVersion;
  /* 0x0124 */ unsigned long OSPlatformId;
  /* 0x0128 */ unsigned long ImageSubsystem;
  /* 0x012c */ unsigned long ImageSubsystemMajorVersion;
  /* 0x0130 */ unsigned long ImageSubsystemMinorVersion;
  /* 0x0138 */ unsigned __int64 ActiveProcessAffinityMask;
  /* 0x0140 */ unsigned long GdiHandleBuffer[60];
  /* 0x0230 */ void* PostProcessInitRoutine /* function */;
  /* 0x0238 */ void* TlsExpansionBitmap;
  /* 0x0240 */ unsigned long TlsExpansionBitmapBits[32];
  /* 0x02c0 */ unsigned long SessionId;
  /* 0x02c8 */ union _ULARGE_INTEGER AppCompatFlags;
  /* 0x02d0 */ union _ULARGE_INTEGER AppCompatFlagsUser;
  /* 0x02d8 */ void* pShimData;
  /* 0x02e0 */ void* AppCompatInfo;
  /* 0x02e8 */ struct _UNICODE_STRING CSDVersion;
  /* 0x02f8 */ const struct _ACTIVATION_CONTEXT_DATA* ActivationContextData;
  /* 0x0300 */ struct _ASSEMBLY_STORAGE_MAP* ProcessAssemblyStorageMap;
  /* 0x0308 */ const struct _ACTIVATION_CONTEXT_DATA* SystemDefaultActivationContextData;
  /* 0x0310 */ struct _ASSEMBLY_STORAGE_MAP* SystemAssemblyStorageMap;
  /* 0x0318 */ unsigned __int64 MinimumStackCommit;
  /* 0x0320 */ struct _FLS_CALLBACK_INFO* FlsCallback;
  /* 0x0328 */ struct _LIST_ENTRY FlsListHead;
  /* 0x0338 */ void* FlsBitmap;
  /* 0x0340 */ unsigned long FlsBitmapBits[4];
  /* 0x0350 */ unsigned long FlsHighIndex;
  /* 0x0358 */ void* WerRegistrationData;
  /* 0x0360 */ void* WerShipAssertPtr;
  /* 0x0368 */ void* pContextData;
  /* 0x0370 */ void* pImageHeaderHash;
  union
  {
    /* 0x0378 */ unsigned long TracingFlags;
    struct /* bitfield */
    {
      /* 0x0378 */ unsigned long HeapTracingEnabled : 1; /* bit position: 0 */
      /* 0x0378 */ unsigned long CritSecTracingEnabled : 1; /* bit position: 1 */
      /* 0x0378 */ unsigned long SpareTracingBits : 30; /* bit position: 2 */
    }; /* bitfield */
  }; /* size: 0x0004 */
  /* 0x037c */ long __PADDING__[1];
} PEB, *PPEB; /* size: 0x0380 */

typedef struct _PEB_LDR_DATA
{
  /* 0x0000 */ unsigned long Length;
  /* 0x0004 */ unsigned char Initialized;
  /* 0x0008 */ void* SsHandle;
  /* 0x0010 */ struct _LIST_ENTRY InLoadOrderModuleList;
  /* 0x0020 */ struct _LIST_ENTRY InMemoryOrderModuleList;
  /* 0x0030 */ struct _LIST_ENTRY InInitializationOrderModuleList;
  /* 0x0040 */ void* EntryInProgress;
  /* 0x0048 */ unsigned char ShutdownInProgress;
  /* 0x0050 */ void* ShutdownThreadId;
} PEB_LDR_DATA, *PPEB_LDR_DATA; /* size: 0x0058 */

typedef struct _PERFINFO_GROUPMASK
{
  /* 0x0000 */ unsigned long Masks[8];
} PERFINFO_GROUPMASK, *PPERFINFO_GROUPMASK; /* size: 0x0020 */

typedef enum _PKG_TYPE
{
  NDSP_PKG = 0,
  NDSM_PKG = 1,
  NPNP_PKG = 2,
  NDCO_PKG = 3,
  NDSE_PKG = 4,
  NDST_PKG = 5,
  MAX_PKG = 6,
} PKG_TYPE, *PPKG_TYPE;

typedef enum _POOL_BLOCK_TYPE
{
  NDIS_PACKET_POOL_BLOCK_FREE = 0,
  NDIS_PACKET_POOL_BLOCK_USED = 1,
  NDIS_PACKET_POOL_BLOCK_AGING = 2,
} POOL_BLOCK_TYPE, *PPOOL_BLOCK_TYPE;

typedef enum _POOL_TYPE
{
  NonPagedPool = 0,
  PagedPool = 1,
  NonPagedPoolMustSucceed = 2,
  DontUseThisType = 3,
  NonPagedPoolCacheAligned = 4,
  PagedPoolCacheAligned = 5,
  NonPagedPoolCacheAlignedMustS = 6,
  MaxPoolType = 7,
  NonPagedPoolSession = 32,
  PagedPoolSession = 33,
  NonPagedPoolMustSucceedSession = 34,
  DontUseThisTypeSession = 35,
  NonPagedPoolCacheAlignedSession = 36,
  PagedPoolCacheAlignedSession = 37,
  NonPagedPoolCacheAlignedMustSSession = 38,
} POOL_TYPE, *PPOOL_TYPE;

typedef struct _POWER_SEQUENCE
{
  /* 0x0000 */ unsigned long SequenceD1;
  /* 0x0004 */ unsigned long SequenceD2;
  /* 0x0008 */ unsigned long SequenceD3;
} POWER_SEQUENCE, *PPOWER_SEQUENCE; /* size: 0x000c */

typedef union _POWER_STATE
{
  union
  {
    /* 0x0000 */ enum _SYSTEM_POWER_STATE SystemState;
    /* 0x0000 */ enum _DEVICE_POWER_STATE DeviceState;
  }; /* size: 0x0004 */
} POWER_STATE, *PPOWER_STATE; /* size: 0x0004 */

typedef enum _POWER_STATE_TYPE
{
  SystemPowerState = 0,
  DevicePowerState = 1,
} POWER_STATE_TYPE, *PPOWER_STATE_TYPE;

typedef struct _PRIVILEGE_SET
{
  /* 0x0000 */ unsigned long PrivilegeCount;
  /* 0x0004 */ unsigned long Control;
  /* 0x0008 */ struct _LUID_AND_ATTRIBUTES Privilege[1];
} PRIVILEGE_SET, *PPRIVILEGE_SET; /* size: 0x0014 */

typedef struct _PROCESSOR_NUMBER
{
  /* 0x0000 */ unsigned short Group;
  /* 0x0002 */ unsigned char Number;
  /* 0x0003 */ unsigned char Reserved;
} PROCESSOR_NUMBER, *PPROCESSOR_NUMBER; /* size: 0x0004 */

typedef enum _PS_ATTRIBUTE_NUM
{
  PsAttributeParentProcess = 0,
  PsAttributeDebugObject = 1,
  PsAttributeToken = 2,
  PsAttributeClientId = 3,
  PsAttributeTebAddress = 4,
  PsAttributeImageName = 5,
  PsAttributeImageInfo = 6,
  PsAttributeMemoryReserve = 7,
  PsAttributePriorityClass = 8,
  PsAttributeErrorMode = 9,
  PsAttributeStdHandleInfo = 10,
  PsAttributeHandleList = 11,
  PsAttributeGroupAffinity = 12,
  PsAttributePreferredNode = 13,
  PsAttributeIdealProcessor = 14,
  PsAttributeUmsThread = 15,
  PsAttributeExecuteOptions = 16,
  PsAttributeMax = 17,
} PS_ATTRIBUTE_NUM, *PPS_ATTRIBUTE_NUM;

typedef enum _PS_IFEO_KEY_STATE
{
  PsReadIFEOAllValues = 0,
  PsSkipIFEODebugger = 1,
  PsSkipAllIFEO = 2,
  PsMaxIFEOKeyStates = 3,
} PS_IFEO_KEY_STATE, *PPS_IFEO_KEY_STATE;

typedef enum _PS_STD_HANDLE_STATE
{
  PsNeverDuplicate = 0,
  PsRequestDuplicate = 1,
  PsAlwaysDuplicate = 2,
  PsMaxStdHandleStates = 3,
} PS_STD_HANDLE_STATE, *PPS_STD_HANDLE_STATE;

typedef struct _QUAD
{
  union
  {
    /* 0x0000 */ __int64 UseThisFieldToCopy;
    /* 0x0000 */ double DoNotUseThisField;
  }; /* size: 0x0008 */
} QUAD, *PQUAD; /* size: 0x0008 */

typedef struct _QUERY
{
  /* 0x0000 */ unsigned long Oid;
  /* 0x0008 */ void* InformationBuffer;
  /* 0x0010 */ unsigned int InformationBufferLength;
  /* 0x0014 */ unsigned int BytesWritten;
  /* 0x0018 */ unsigned int BytesNeeded;
  /* 0x001c */ long __PADDING__[1];
} QUERY, *PQUERY; /* size: 0x0020 */

typedef struct _QUERY_INFORMATION
{
  /* 0x0000 */ unsigned long Oid;
  /* 0x0008 */ void* InformationBuffer;
  /* 0x0010 */ unsigned int InformationBufferLength;
  /* 0x0014 */ unsigned int BytesWritten;
  /* 0x0018 */ unsigned int BytesNeeded;
  /* 0x001c */ long __PADDING__[1];
} QUERY_INFORMATION, *PQUERY_INFORMATION; /* size: 0x0020 */

typedef struct _QUEUED_CLOSE
{
  /* 0x0000 */ int Status;
  /* 0x0008 */ struct _WORK_QUEUE_ITEM WorkItem;
} QUEUED_CLOSE, *PQUEUED_CLOSE; /* size: 0x0028 */

typedef struct _REFERENCE
{
  /* 0x0000 */ unsigned __int64 SpinLock;
  /* 0x0008 */ unsigned short ReferenceCount;
  /* 0x000a */ unsigned char Closing;
  /* 0x000b */ char __PADDING__[5];
} REFERENCE, *PREFERENCE; /* size: 0x0010 */

typedef union _REFERENCE_OBJECT
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long Deleting : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned long ReferenceCount : 30; /* bit position: 1 */
      /* 0x0000 */ unsigned long Overflow : 1; /* bit position: 31 */
    }; /* bitfield */
    /* 0x0000 */ long Value;
  }; /* size: 0x0004 */
} REFERENCE_OBJECT, *PREFERENCE_OBJECT; /* size: 0x0004 */

typedef enum _REG_NOTIFY_CLASS
{
  RegNtDeleteKey = 0,
  RegNtPreDeleteKey = 0,
  RegNtSetValueKey = 1,
  RegNtPreSetValueKey = 1,
  RegNtDeleteValueKey = 2,
  RegNtPreDeleteValueKey = 2,
  RegNtSetInformationKey = 3,
  RegNtPreSetInformationKey = 3,
  RegNtRenameKey = 4,
  RegNtPreRenameKey = 4,
  RegNtEnumerateKey = 5,
  RegNtPreEnumerateKey = 5,
  RegNtEnumerateValueKey = 6,
  RegNtPreEnumerateValueKey = 6,
  RegNtQueryKey = 7,
  RegNtPreQueryKey = 7,
  RegNtQueryValueKey = 8,
  RegNtPreQueryValueKey = 8,
  RegNtQueryMultipleValueKey = 9,
  RegNtPreQueryMultipleValueKey = 9,
  RegNtPreCreateKey = 10,
  RegNtPostCreateKey = 11,
  RegNtPreOpenKey = 12,
  RegNtPostOpenKey = 13,
  RegNtKeyHandleClose = 14,
  RegNtPreKeyHandleClose = 14,
  RegNtPostDeleteKey = 15,
  RegNtPostSetValueKey = 16,
  RegNtPostDeleteValueKey = 17,
  RegNtPostSetInformationKey = 18,
  RegNtPostRenameKey = 19,
  RegNtPostEnumerateKey = 20,
  RegNtPostEnumerateValueKey = 21,
  RegNtPostQueryKey = 22,
  RegNtPostQueryValueKey = 23,
  RegNtPostQueryMultipleValueKey = 24,
  RegNtPostKeyHandleClose = 25,
  RegNtPreCreateKeyEx = 26,
  RegNtPostCreateKeyEx = 27,
  RegNtPreOpenKeyEx = 28,
  RegNtPostOpenKeyEx = 29,
  RegNtPreFlushKey = 30,
  RegNtPostFlushKey = 31,
  RegNtPreLoadKey = 32,
  RegNtPostLoadKey = 33,
  RegNtPreUnLoadKey = 34,
  RegNtPostUnLoadKey = 35,
  RegNtPreQueryKeySecurity = 36,
  RegNtPostQueryKeySecurity = 37,
  RegNtPreSetKeySecurity = 38,
  RegNtPostSetKeySecurity = 39,
  RegNtCallbackObjectContextCleanup = 40,
  RegNtPreRestoreKey = 41,
  RegNtPostRestoreKey = 42,
  RegNtPreSaveKey = 43,
  RegNtPostSaveKey = 44,
  RegNtPreReplaceKey = 45,
  RegNtPostReplaceKey = 46,
  MaxRegNtNotifyClass = 47,
} REG_NOTIFY_CLASS, *PREG_NOTIFY_CLASS;

typedef union _REQUEST_DATA
{
  union
  {
    /* 0x0000 */ struct _QUERY QUERY_INFORMATION;
    /* 0x0000 */ struct _SET SET_INFORMATION;
    /* 0x0000 */ struct _METHOD METHOD_INFORMATION;
  }; /* size: 0x0028 */
} REQUEST_DATA, *PREQUEST_DATA; /* size: 0x0028 */

typedef union _RESULT_VALUE
{
  union
  {
    /* 0x0000 */ unsigned char ResultByteValue;
    /* 0x0000 */ unsigned short ResultShortValue;
    /* 0x0000 */ unsigned long ResultLongValue;
    /* 0x0000 */ unsigned __int64 ResultLong64Value;
    /* 0x0000 */ unsigned char ResultByteArrayValue[16];
  }; /* size: 0x0010 */
} RESULT_VALUE, *PRESULT_VALUE; /* size: 0x0010 */

struct _RTL_ACTIVATION_CONTEXT_STACK_FRAME;

typedef struct _RTL_BITMAP
{
  /* 0x0000 */ unsigned long SizeOfBitMap;
  /* 0x0008 */ unsigned long* Buffer;
} RTL_BITMAP, *PRTL_BITMAP; /* size: 0x0010 */

struct _RTL_CRITICAL_SECTION;

typedef struct _RTL_DRIVE_LETTER_CURDIR
{
  /* 0x0000 */ unsigned short Flags;
  /* 0x0002 */ unsigned short Length;
  /* 0x0004 */ unsigned long TimeStamp;
  /* 0x0008 */ struct _STRING DosPath;
} RTL_DRIVE_LETTER_CURDIR, *PRTL_DRIVE_LETTER_CURDIR; /* size: 0x0018 */

typedef struct _RTL_DYNAMIC_HASH_TABLE
{
  /* 0x0000 */ unsigned long Flags;
  /* 0x0004 */ unsigned long Shift;
  /* 0x0008 */ unsigned long TableSize;
  /* 0x000c */ unsigned long Pivot;
  /* 0x0010 */ unsigned long DivisorMask;
  /* 0x0014 */ unsigned long NumEntries;
  /* 0x0018 */ unsigned long NonEmptyBuckets;
  /* 0x001c */ unsigned long NumEnumerators;
  /* 0x0020 */ void* Directory;
} RTL_DYNAMIC_HASH_TABLE, *PRTL_DYNAMIC_HASH_TABLE; /* size: 0x0028 */

typedef struct _RTL_DYNAMIC_HASH_TABLE_CONTEXT
{
  /* 0x0000 */ struct _LIST_ENTRY* ChainHead;
  /* 0x0008 */ struct _LIST_ENTRY* PrevLinkage;
  /* 0x0010 */ unsigned __int64 Signature;
} RTL_DYNAMIC_HASH_TABLE_CONTEXT, *PRTL_DYNAMIC_HASH_TABLE_CONTEXT; /* size: 0x0018 */

typedef struct _RTL_DYNAMIC_HASH_TABLE_ENTRY
{
  /* 0x0000 */ struct _LIST_ENTRY Linkage;
  /* 0x0010 */ unsigned __int64 Signature;
} RTL_DYNAMIC_HASH_TABLE_ENTRY, *PRTL_DYNAMIC_HASH_TABLE_ENTRY; /* size: 0x0018 */

typedef struct _RTL_DYNAMIC_HASH_TABLE_ENUMERATOR
{
  /* 0x0000 */ struct _RTL_DYNAMIC_HASH_TABLE_ENTRY HashEntry;
  /* 0x0018 */ struct _LIST_ENTRY* ChainHead;
  /* 0x0020 */ unsigned long BucketIndex;
  /* 0x0024 */ long __PADDING__[1];
} RTL_DYNAMIC_HASH_TABLE_ENUMERATOR, *PRTL_DYNAMIC_HASH_TABLE_ENUMERATOR; /* size: 0x0028 */

typedef struct _RTL_USER_PROCESS_PARAMETERS
{
  /* 0x0000 */ unsigned long MaximumLength;
  /* 0x0004 */ unsigned long Length;
  /* 0x0008 */ unsigned long Flags;
  /* 0x000c */ unsigned long DebugFlags;
  /* 0x0010 */ void* ConsoleHandle;
  /* 0x0018 */ unsigned long ConsoleFlags;
  /* 0x0020 */ void* StandardInput;
  /* 0x0028 */ void* StandardOutput;
  /* 0x0030 */ void* StandardError;
  /* 0x0038 */ struct _CURDIR CurrentDirectory;
  /* 0x0050 */ struct _UNICODE_STRING DllPath;
  /* 0x0060 */ struct _UNICODE_STRING ImagePathName;
  /* 0x0070 */ struct _UNICODE_STRING CommandLine;
  /* 0x0080 */ void* Environment;
  /* 0x0088 */ unsigned long StartingX;
  /* 0x008c */ unsigned long StartingY;
  /* 0x0090 */ unsigned long CountX;
  /* 0x0094 */ unsigned long CountY;
  /* 0x0098 */ unsigned long CountCharsX;
  /* 0x009c */ unsigned long CountCharsY;
  /* 0x00a0 */ unsigned long FillAttribute;
  /* 0x00a4 */ unsigned long WindowFlags;
  /* 0x00a8 */ unsigned long ShowWindowFlags;
  /* 0x00b0 */ struct _UNICODE_STRING WindowTitle;
  /* 0x00c0 */ struct _UNICODE_STRING DesktopInfo;
  /* 0x00d0 */ struct _UNICODE_STRING ShellInfo;
  /* 0x00e0 */ struct _UNICODE_STRING RuntimeData;
  /* 0x00f0 */ struct _RTL_DRIVE_LETTER_CURDIR CurrentDirectores[32];
  /* 0x03f0 */ volatile unsigned __int64 EnvironmentSize;
  /* 0x03f8 */ volatile unsigned __int64 EnvironmentVersion;
} RTL_USER_PROCESS_PARAMETERS, *PRTL_USER_PROCESS_PARAMETERS; /* size: 0x0400 */

typedef struct _SCATTER_GATHER_ELEMENT
{
  /* 0x0000 */ union _LARGE_INTEGER Address;
  /* 0x0008 */ unsigned long Length;
  /* 0x0010 */ unsigned __int64 Reserved;
} SCATTER_GATHER_ELEMENT, *PSCATTER_GATHER_ELEMENT; /* size: 0x0018 */

typedef struct _SCATTER_GATHER_LIST
{
  /* 0x0000 */ unsigned long NumberOfElements;
  /* 0x0008 */ unsigned __int64 Reserved;
  /* 0x0010 */ struct _SCATTER_GATHER_ELEMENT* Elements /* zero-length array */;
} SCATTER_GATHER_LIST, *PSCATTER_GATHER_LIST; /* size: 0x0010 */

struct _SCSI_REQUEST_BLOCK;

typedef struct _SECTION_OBJECT_POINTERS
{
  /* 0x0000 */ void* DataSectionObject;
  /* 0x0008 */ void* SharedCacheMap;
  /* 0x0010 */ void* ImageSectionObject;
} SECTION_OBJECT_POINTERS, *PSECTION_OBJECT_POINTERS; /* size: 0x0018 */

typedef enum _SECURITY_IMPERSONATION_LEVEL
{
  SecurityAnonymous = 0,
  SecurityIdentification = 1,
  SecurityImpersonation = 2,
  SecurityDelegation = 3,
} SECURITY_IMPERSONATION_LEVEL, *PSECURITY_IMPERSONATION_LEVEL;

typedef enum _SECURITY_OPERATION_CODE
{
  SetSecurityDescriptor = 0,
  QuerySecurityDescriptor = 1,
  DeleteSecurityDescriptor = 2,
  AssignSecurityDescriptor = 3,
} SECURITY_OPERATION_CODE, *PSECURITY_OPERATION_CODE;

typedef struct _SECURITY_QUALITY_OF_SERVICE
{
  /* 0x0000 */ unsigned long Length;
  /* 0x0004 */ enum _SECURITY_IMPERSONATION_LEVEL ImpersonationLevel;
  /* 0x0008 */ unsigned char ContextTrackingMode;
  /* 0x0009 */ unsigned char EffectiveOnly;
  /* 0x000a */ char __PADDING__[2];
} SECURITY_QUALITY_OF_SERVICE, *PSECURITY_QUALITY_OF_SERVICE; /* size: 0x000c */

typedef struct _SECURITY_SUBJECT_CONTEXT
{
  /* 0x0000 */ void* ClientToken;
  /* 0x0008 */ enum _SECURITY_IMPERSONATION_LEVEL ImpersonationLevel;
  /* 0x0010 */ void* PrimaryToken;
  /* 0x0018 */ void* ProcessAuditId;
} SECURITY_SUBJECT_CONTEXT, *PSECURITY_SUBJECT_CONTEXT; /* size: 0x0020 */

typedef struct _SET
{
  /* 0x0000 */ unsigned long Oid;
  /* 0x0008 */ void* InformationBuffer;
  /* 0x0010 */ unsigned int InformationBufferLength;
  /* 0x0014 */ unsigned int BytesRead;
  /* 0x0018 */ unsigned int BytesNeeded;
  /* 0x001c */ long __PADDING__[1];
} SET, *PSET; /* size: 0x0020 */

typedef struct _SET_INFORMATION
{
  /* 0x0000 */ unsigned long Oid;
  /* 0x0008 */ void* InformationBuffer;
  /* 0x0010 */ unsigned int InformationBufferLength;
  /* 0x0014 */ unsigned int BytesRead;
  /* 0x0018 */ unsigned int BytesNeeded;
  /* 0x001c */ long __PADDING__[1];
} SET_INFORMATION, *PSET_INFORMATION; /* size: 0x0020 */

typedef struct _SID
{
  /* 0x0000 */ unsigned char Revision;
  /* 0x0001 */ unsigned char SubAuthorityCount;
  /* 0x0002 */ struct _SID_IDENTIFIER_AUTHORITY IdentifierAuthority;
  /* 0x0008 */ unsigned long SubAuthority[1];
} SID, *PSID; /* size: 0x000c */

typedef struct _SID_IDENTIFIER_AUTHORITY
{
  /* 0x0000 */ unsigned char Value[6];
} SID_IDENTIFIER_AUTHORITY, *PSID_IDENTIFIER_AUTHORITY; /* size: 0x0006 */

typedef struct _SINGLE_LIST_ENTRY
{
  /* 0x0000 */ struct _SINGLE_LIST_ENTRY* Next;
} SINGLE_LIST_ENTRY, *PSINGLE_LIST_ENTRY; /* size: 0x0008 */

typedef struct _SLIST_ENTRY
{
  /* 0x0000 */ struct _SLIST_ENTRY* Next;
  /* 0x0008 */ long __PADDING__[2];
} SLIST_ENTRY, *PSLIST_ENTRY; /* size: 0x0010 */

typedef union _SLIST_HEADER
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned __int64 Alignment;
      /* 0x0008 */ unsigned __int64 Region;
    }; /* size: 0x0010 */
    struct
    {
      struct /* bitfield */
      {
        /* 0x0000 */ unsigned __int64 Depth : 16; /* bit position: 0 */
        /* 0x0000 */ unsigned __int64 Sequence : 9; /* bit position: 16 */
        /* 0x0000 */ unsigned __int64 NextEntry : 39; /* bit position: 25 */
      }; /* bitfield */
      struct /* bitfield */
      {
        /* 0x0008 */ unsigned __int64 HeaderType : 1; /* bit position: 0 */
        /* 0x0008 */ unsigned __int64 Init : 1; /* bit position: 1 */
        /* 0x0008 */ unsigned __int64 Reserved : 59; /* bit position: 2 */
        /* 0x0008 */ unsigned __int64 Region : 3; /* bit position: 61 */
      }; /* bitfield */
    } /* size: 0x0010 */ Header8;
    struct
    {
      struct /* bitfield */
      {
        /* 0x0000 */ unsigned __int64 Depth : 16; /* bit position: 0 */
        /* 0x0000 */ unsigned __int64 Sequence : 48; /* bit position: 16 */
      }; /* bitfield */
      struct /* bitfield */
      {
        /* 0x0008 */ unsigned __int64 HeaderType : 1; /* bit position: 0 */
        /* 0x0008 */ unsigned __int64 Init : 1; /* bit position: 1 */
        /* 0x0008 */ unsigned __int64 Reserved : 2; /* bit position: 2 */
        /* 0x0008 */ unsigned __int64 NextEntry : 60; /* bit position: 4 */
      }; /* bitfield */
    } /* size: 0x0010 */ Header16;
    struct
    {
      struct /* bitfield */
      {
        /* 0x0000 */ unsigned __int64 Depth : 16; /* bit position: 0 */
        /* 0x0000 */ unsigned __int64 Sequence : 48; /* bit position: 16 */
      }; /* bitfield */
      struct /* bitfield */
      {
        /* 0x0008 */ unsigned __int64 HeaderType : 1; /* bit position: 0 */
        /* 0x0008 */ unsigned __int64 Reserved : 3; /* bit position: 1 */
        /* 0x0008 */ unsigned __int64 NextEntry : 60; /* bit position: 4 */
      }; /* bitfield */
    } /* size: 0x0010 */ HeaderX64;
  }; /* size: 0x0010 */
} SLIST_HEADER, *PSLIST_HEADER; /* size: 0x0010 */

typedef struct _STACK_INDEX
{
  /* 0x0000 */ unsigned long XferDataIndex;
  /* 0x0004 */ unsigned long Index;
} STACK_INDEX, *PSTACK_INDEX; /* size: 0x0008 */

typedef struct _STRING
{
  /* 0x0000 */ unsigned short Length;
  /* 0x0002 */ unsigned short MaximumLength;
  /* 0x0008 */ char* Buffer;
} STRING, *PSTRING; /* size: 0x0010 */

typedef enum _SYSTEM_POWER_STATE
{
  PowerSystemUnspecified = 0,
  PowerSystemWorking = 1,
  PowerSystemSleeping1 = 2,
  PowerSystemSleeping2 = 3,
  PowerSystemSleeping3 = 4,
  PowerSystemHibernate = 5,
  PowerSystemShutdown = 6,
  PowerSystemMaximum = 7,
} SYSTEM_POWER_STATE, *PSYSTEM_POWER_STATE;

typedef struct _SYSTEM_POWER_STATE_CONTEXT
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long Reserved1 : 8; /* bit position: 0 */
      /* 0x0000 */ unsigned long TargetSystemState : 4; /* bit position: 8 */
      /* 0x0000 */ unsigned long EffectiveSystemState : 4; /* bit position: 12 */
      /* 0x0000 */ unsigned long CurrentSystemState : 4; /* bit position: 16 */
      /* 0x0000 */ unsigned long IgnoreHibernationPath : 1; /* bit position: 20 */
      /* 0x0000 */ unsigned long PseudoTransition : 1; /* bit position: 21 */
      /* 0x0000 */ unsigned long Reserved2 : 10; /* bit position: 22 */
    }; /* bitfield */
    /* 0x0000 */ unsigned long ContextAsUlong;
  }; /* size: 0x0004 */
} SYSTEM_POWER_STATE_CONTEXT, *PSYSTEM_POWER_STATE_CONTEXT; /* size: 0x0004 */

typedef struct _TEB
{
  /* 0x0000 */ struct _NT_TIB NtTib;
  /* 0x0038 */ void* EnvironmentPointer;
  /* 0x0040 */ struct _CLIENT_ID ClientId;
  /* 0x0050 */ void* ActiveRpcHandle;
  /* 0x0058 */ void* ThreadLocalStoragePointer;
  /* 0x0060 */ struct _PEB* ProcessEnvironmentBlock;
  /* 0x0068 */ unsigned long LastErrorValue;
  /* 0x006c */ unsigned long CountOfOwnedCriticalSections;
  /* 0x0070 */ void* CsrClientThread;
