typedef struct _NDR_FWD_ROUTINES
{
  /* 0x0000 */ void* CStdStubBuffer_AddRef /* function */;
  /* 0x0004 */ void* CStdStubBuffer_Connect /* function */;
  /* 0x0008 */ void* CStdStubBuffer_CountRefs /* function */;
  /* 0x000c */ void* CStdStubBuffer_DebugServerQueryInterface /* function */;
  /* 0x0010 */ void* CStdStubBuffer_DebugServerRelease /* function */;
  /* 0x0014 */ void* CStdStubBuffer_Disconnect /* function */;
  /* 0x0018 */ void* CStdStubBuffer_Invoke /* function */;
  /* 0x001c */ void* CStdStubBuffer_IsIIDSupported /* function */;
  /* 0x0020 */ void* CStdStubBuffer_QueryInterface /* function */;
  /* 0x0024 */ void* CreateProxyFromTypeInfo /* function */;
  /* 0x0028 */ void* CreateStubFromTypeInfo /* function */;
  /* 0x002c */ void* DllGetClassObject /* function */;
  /* 0x0030 */ void* DllRegisterServer /* function */;
  /* 0x0034 */ void* IUnknown_AddRef_Proxy /* function */;
  /* 0x0038 */ void* IUnknown_QueryInterface_Proxy /* function */;
  /* 0x003c */ void* IUnknown_Release_Proxy /* function */;
  /* 0x0040 */ void* NdrCStdStubBuffer2_Release /* function */;
  /* 0x0044 */ void* NdrCStdStubBuffer_Release /* function */;
  /* 0x0048 */ void* NdrCreateServerInterfaceFromStub /* function */;
  /* 0x004c */ void* NdrpDcomAsyncClientCall /* function */;
  /* 0x0050 */ void* NdrDcomAsyncStubCall /* function */;
  /* 0x0054 */ void* Ndr64pDcomAsyncClientCall /* function */;
  /* 0x0058 */ void* Ndr64DcomAsyncStubCall /* function */;
  /* 0x005c */ void* NdrDllCanUnloadNow /* function */;
  /* 0x0060 */ void* NdrDllGetClassObject /* function */;
  /* 0x0064 */ void* NdrDllRegisterProxy /* function */;
  /* 0x0068 */ void* NdrDllUnregisterProxy /* function */;
  /* 0x006c */ void* NdrGetBaseInterfaceFromStub /* function */;
  /* 0x0070 */ void* NdrOleAllocate /* function */;
  /* 0x0074 */ void* NdrOleFree /* function */;
  /* 0x0078 */ void* NdrStubForwardingFunction /* function */;
  /* 0x007c */ void* NdrStubInitializeMarshall /* function */;
  /* 0x0080 */ void* NdrpCreateProxy /* function */;
  /* 0x0084 */ void* NdrpCreateStub /* function */;
  /* 0x0088 */ void* NdrpGetProcFormatString /* function */;
  /* 0x008c */ void* NdrpGetTypeFormatString /* function */;
  /* 0x0090 */ void* NdrpGetTypeGenCookie /* function */;
  /* 0x0094 */ void* NdrpReleaseTypeFormatString /* function */;
  /* 0x0098 */ void* NdrpReleaseTypeGenCookie /* function */;
  /* 0x009c */ void* NdrpVarVtOfTypeDesc /* function */;
} NDR_FWD_ROUTINES, *PNDR_FWD_ROUTINES; /* size: 0x00a0 */

