class CGenObject
{
  /* 0x0004 */ unsigned long m_ulRefs;
  /* 0x0008 */ unsigned long m_dwAspect;
  /* 0x000c */ unsigned long m_dwSize;
  /* 0x0010 */ long m_lWidth;
  /* 0x0014 */ long m_lHeight;
  /* 0x0018 */ void* m_hPres;
  /* 0x001c */ unsigned short m_cfFormat;
  /* 0x0020 */ class CCacheNode* m_pCacheNode;
}; /* size: 0x0024 */

