struct tagINPUT_TRANSFORM
{
  union
  {
    struct
    {
      /* 0x0000 */ float _11;
      /* 0x0004 */ float _12;
      /* 0x0008 */ float _13;
      /* 0x000c */ float _14;
      /* 0x0010 */ float _21;
      /* 0x0014 */ float _22;
      /* 0x0018 */ float _23;
      /* 0x001c */ float _24;
      /* 0x0020 */ float _31;
      /* 0x0024 */ float _32;
      /* 0x0028 */ float _33;
      /* 0x002c */ float _34;
      /* 0x0030 */ float _41;
      /* 0x0034 */ float _42;
      /* 0x0038 */ float _43;
      /* 0x003c */ float _44;
    }; /* size: 0x0040 */
    /* 0x0000 */ float m[4][4];
  }; /* size: 0x0040 */
}; /* size: 0x0040 */

