enum _DEVICE_USAGE_NOTIFICATION_TYPE;
struct _LIST_ENTRY;
struct _KSEVENT_ENTRY;
enum _MODE;
struct _NDIS_OBJECT_HEADER;
enum _EVENT_TYPE;
struct KSTOPOLOGY_CONNECTION;
enum _POOL_TYPE;
struct _COMPRESSED_DATA_INFO;
enum _FILE_INFORMATION_CLASS;
enum _FSINFOCLASS;
enum _DEVICE_RELATION_TYPE;
enum BUS_QUERY_ID_TYPE;
enum _NET_PNP_EVENT_CODE;
struct _NET_PNP_EVENT;
struct _NET_PNP_EVENT_NOTIFICATION;
enum DEVICE_TEXT_TYPE;
enum _SYSTEM_POWER_STATE;
enum _POWER_STATE_TYPE;
enum POWER_ACTION;
enum _WHEA_ERROR_TYPE;
struct _KDPC;
struct KSDPC_ITEM;
struct KSBUFFER_ITEM;
enum _WHEA_ERROR_SEVERITY;
enum _WHEA_ERROR_SOURCE_TYPE;
enum _WHEA_RAW_DATA_FORMAT;
enum SCOPE_LEVEL;
enum NL_ADDRESS_TYPE;
enum _NPI_MODULEID_TYPE;
enum _MEMORY_CACHING_TYPE;
enum _MM_PAGE_PRIORITY;
struct KSMETHOD_ITEM;
enum _NDIS_XLATE_TYPE;
enum KSPIN_COMMUNICATION;
struct _GUID;
enum KSPIN_DATAFLOW;
enum KSSTATE;
struct KSPIN_DESCRIPTOR;
enum KSRESET;
enum _DEVICE_POWER_STATE;
enum _NET_IF_MEDIA_CONNECT_STATE;
enum _NET_IF_MEDIA_DUPLEX_STATE;
enum _NDIS_MEDIUM;
enum _NDIS_INTERFACE_TYPE;
enum _NDIS_SUPPORTED_PAUSE_FUNCTIONS;
enum _NDIS_PNP_DEVICE_STATE;
enum _NDIS_PORT_TYPE;
enum _NET_IF_DIRECTION_TYPE;
enum _NDIS_PORT_CONTROL_STATE;
enum _NDIS_PORT_AUTHORIZATION_STATE;
struct _NDIS_PORT_CHARACTERISTICS;
struct in_addr;
struct sockaddr_in;
enum _NDIS_MINIPORT_STATE;
struct _NDIS_TCP_IP_CHECKSUM_OFFLOAD;
struct _NDIS_TCP_LARGE_SEND_OFFLOAD_V1;
struct _NDIS_IPSEC_OFFLOAD_V1;

struct KSALLOCATOR_FRAMING_EX;
struct _NDIS_IPSEC_OFFLOAD_V1_NET_BUFFER_LIST_INFO;
struct _NDIS_IPSEC_PACKET_INFO;
struct _KSGATE;
struct KSEVENT_SET;
struct KSEVENTDATA;
struct _NDIS_BIND_PATHS;
struct _KSPROCESSPIN_INDEXENTRY;
struct _KSPROCESSPIN;
struct KSIDENTIFIER;
struct KSPRIORITY;
struct _KSPIN;
struct _KSPIN_DESCRIPTOR_EX;
struct _KSPIN_DISPATCH;
struct _NDIS_FRAME_TYPE_AND_OPEN;
struct KSMULTIPLE_ITEM;
struct KSATTRIBUTE_LIST;
struct KSATTRIBUTE;
struct _KSCLOCK_DISPATCH;
struct _NDIS_GUID;
struct _NDIS_PORT_AUTHENTICATION_PARAMETERS;
struct _KSALLOCATOR_DISPATCH;
struct _NDIS_RECEIVE_SCALE_PARAMETERS;
struct KSAUTOMATION_TABLE_;
struct KSPROPERTY_SET;
struct KSPROPERTY_ITEM;
struct _SCATTER_GATHER_ELEMENT;
struct KSPROPERTY_VALUES;
struct _QUERY;
struct _SET;
struct _METHOD;
union _REQUEST_DATA;
struct _NDIS_OID_REQUEST;
struct KSFASTPROPERTY_ITEM;
struct KSFASTMETHOD_ITEM;
struct KSP_PIN;
struct _NDIS_BIND_PARAMETERS;
struct KSSTREAM_HEADER;
struct _NDIS_TIMER_ENTRY;
struct _KSFILTERFACTORY;
struct _KSDEVICE_DESCRIPTOR;
struct _DMA_ADAPTER;
struct _KSDEVICE;
struct _NDIS_SG_DMA_BLOCK;
struct _PERFINFO_GROUPMASK;
struct _NDIS_RECEIVE_SCALE_CAPABILITIES;
struct _KBUGCHECK_CALLBACK_RECORD;
struct _ULONG_REFERENCE;
struct _NDIS_MINIPORT_HANDLERS;
struct _NDIS_RESTART_GENERAL_ATTRIBUTES;
struct _NDIS_M_PERIODIC_RECEIVES;
struct _NDIS_PCI_DEVICE_CUSTOM_PROPERTIES;
struct _IO_REMOVE_LOCK;
struct _NDIS_MINIPORT_BLOCK;
struct _NDIS_MINIPORT_INTERRUPT;
struct _KINTERRUPT;
struct _NDIS_FILTER_ATTACH_LIST;
struct _IO_INTERRUPT_MESSAGE_INFO;
struct _NDIS_FRAME_TYPE_RECORD;
struct _X_FILTER;
struct _NDIS_OPEN_BLOCK;
struct _NDIS_STATUS_INDICATION;
struct _NDIS_FILTER_TASK_OFFLOAD;
struct _NDIS_IF_RCV_ADDRESS;
struct CO_ADDRESS_FAMILY;
struct _NDIS_TRACK_MEM;
struct _NDIS_FILTER_DRIVER_CHARACTERISTICS;
struct _NDIS_PACKET_STACK;
struct _NDIS_MINIPORT_DRIVER_CHARACTERISTICS;
struct _NDIS51_MINIPORT_CHARACTERISTICS;
struct _NDIS_M_DRIVER_BLOCK;
struct _NDIS_COMMON_OPEN_BLOCK;
struct _NDIS_WRAPPER_HANDLE;
struct _NDIS_MINIPORT_STATS;
struct _OID_LIST;
struct _CO_CALL_PARAMETERS;
struct _CO_MEDIA_PARAMETERS;
struct _NDIS_MINIPORT_OFFLOAD_BLOCK_LIST;
struct _NDIS_PROTOCOL_OFFLOAD_BLOCK_LIST;
struct _ETH_MULTICAST_WRAPPER;
struct _NDIS_OPEN_OFFLOAD;
struct _NDIS_CALL_MANAGER_CHARACTERISTICS;
struct _DMA_OPERATIONS;
struct _SCATTER_GATHER_LIST;
struct _MAP_REGISTER_ENTRY;
struct _NDIS_AF_LIST;
struct _NDIS_LOG;
struct _NDIS_FILTER_PARTIAL_CHARACTERISTICS;
struct _NDIS_FILTER_BLOCK;
struct _NDIS_FILTER_DRIVER_BLOCK;
struct _NDIS_FILTER_ATTACH_PARAMETERS;
struct _NDIS_IF_PROVIDER_CHARACTERISTICS;
struct _NDIS_IF_PROVIDER_BLOCK;
struct _NDIS_IF_NETWORK_BLOCK;
struct _NDIS_PKT_POOL;
union _STACK_INDEX;
struct _NDIS_PKT_POOL_HDR;

typedef enum _DEVICE_USAGE_NOTIFICATION_TYPE
{
  DeviceUsageTypeUndefined = 0,
  DeviceUsageTypePaging = 1,
  DeviceUsageTypeHibernation = 2,
  DeviceUsageTypeDumpFile = 3,
} DEVICE_USAGE_NOTIFICATION_TYPE, *PDEVICE_USAGE_NOTIFICATION_TYPE;

typedef struct _LIST_ENTRY
{
  /* 0x0000 */ struct _LIST_ENTRY* Flink;
  /* 0x0004 */ struct _LIST_ENTRY* Blink;
} LIST_ENTRY, *PLIST_ENTRY; /* size: 0x0008 */

typedef struct _KSEVENT_ENTRY
{
  /* 0x0000 */ struct _LIST_ENTRY ListEntry;
  /* 0x0008 */ void* Object;
  union
  {
    /* 0x000c */ struct KSDPC_ITEM* DpcItem;
    /* 0x000c */ struct KSBUFFER_ITEM* BufferItem;
  }; /* size: 0x0004 */
  /* 0x0010 */ struct KSEVENTDATA* EventData;
  /* 0x0014 */ unsigned long NotificationType;
  /* 0x0018 */ const struct KSEVENT_SET* EventSet;
  /* 0x001c */ const struct KSEVENT_ITEM* EventItem;
  /* 0x0020 */ struct _FILE_OBJECT* FileObject;
  /* 0x0024 */ unsigned long SemaphoreAdjustment;
  /* 0x0028 */ unsigned long Reserved;
  /* 0x002c */ unsigned long Flags;
} KSEVENT_ENTRY, *PKSEVENT_ENTRY; /* size: 0x0030 */

typedef enum _MODE
{
  KernelMode = 0,
  UserMode = 1,
  MaximumMode = 2,
} MODE, *PMODE;

typedef struct _NDIS_OBJECT_HEADER
{
  /* 0x0000 */ unsigned char Type;
  /* 0x0001 */ unsigned char Revision;
  /* 0x0002 */ unsigned short Size;
} NDIS_OBJECT_HEADER, *PNDIS_OBJECT_HEADER; /* size: 0x0004 */

typedef enum _EVENT_TYPE
{
  NotificationEvent = 0,
  SynchronizationEvent = 1,
} EVENT_TYPE, *PEVENT_TYPE;

struct KSTOPOLOGY_CONNECTION
{
  /* 0x0000 */ unsigned long FromNode;
  /* 0x0004 */ unsigned long FromNodePin;
  /* 0x0008 */ unsigned long ToNode;
  /* 0x000c */ unsigned long ToNodePin;
}; /* size: 0x0010 */

typedef enum _POOL_TYPE
{
  NonPagedPool = 0,
  PagedPool = 1,
  NonPagedPoolMustSucceed = 2,
  DontUseThisType = 3,
  NonPagedPoolCacheAligned = 4,
  PagedPoolCacheAligned = 5,
  NonPagedPoolCacheAlignedMustS = 6,
  MaxPoolType = 7,
  NonPagedPoolSession = 32,
  PagedPoolSession = 33,
  NonPagedPoolMustSucceedSession = 34,
  DontUseThisTypeSession = 35,
  NonPagedPoolCacheAlignedSession = 36,
  PagedPoolCacheAlignedSession = 37,
  NonPagedPoolCacheAlignedMustSSession = 38,
} POOL_TYPE, *PPOOL_TYPE;

typedef struct _COMPRESSED_DATA_INFO
{
  /* 0x0000 */ unsigned short CompressionFormatAndEngine;
  /* 0x0002 */ unsigned char CompressionUnitShift;
  /* 0x0003 */ unsigned char ChunkShift;
  /* 0x0004 */ unsigned char ClusterShift;
  /* 0x0005 */ unsigned char Reserved;
  /* 0x0006 */ unsigned short NumberOfChunks;
  /* 0x0008 */ unsigned long CompressedChunkSizes[1];
} COMPRESSED_DATA_INFO, *PCOMPRESSED_DATA_INFO; /* size: 0x000c */

typedef enum _FILE_INFORMATION_CLASS
{
  FileDirectoryInformation = 1,
  FileFullDirectoryInformation = 2,
  FileBothDirectoryInformation = 3,
  FileBasicInformation = 4,
  FileStandardInformation = 5,
  FileInternalInformation = 6,
  FileEaInformation = 7,
  FileAccessInformation = 8,
  FileNameInformation = 9,
  FileRenameInformation = 10,
  FileLinkInformation = 11,
  FileNamesInformation = 12,
  FileDispositionInformation = 13,
  FilePositionInformation = 14,
  FileFullEaInformation = 15,
  FileModeInformation = 16,
  FileAlignmentInformation = 17,
  FileAllInformation = 18,
  FileAllocationInformation = 19,
  FileEndOfFileInformation = 20,
  FileAlternateNameInformation = 21,
  FileStreamInformation = 22,
  FilePipeInformation = 23,
  FilePipeLocalInformation = 24,
  FilePipeRemoteInformation = 25,
  FileMailslotQueryInformation = 26,
  FileMailslotSetInformation = 27,
  FileCompressionInformation = 28,
  FileObjectIdInformation = 29,
  FileCompletionInformation = 30,
  FileMoveClusterInformation = 31,
  FileQuotaInformation = 32,
  FileReparsePointInformation = 33,
  FileNetworkOpenInformation = 34,
  FileAttributeTagInformation = 35,
  FileTrackingInformation = 36,
  FileIdBothDirectoryInformation = 37,
  FileIdFullDirectoryInformation = 38,
  FileValidDataLengthInformation = 39,
  FileShortNameInformation = 40,
  FileIoCompletionNotificationInformation = 41,
  FileIoStatusBlockRangeInformation = 42,
  FileIoPriorityHintInformation = 43,
  FileSfioReserveInformation = 44,
  FileSfioVolumeInformation = 45,
  FileHardLinkInformation = 46,
  FileProcessIdsUsingFileInformation = 47,
  FileNormalizedNameInformation = 48,
  FileNetworkPhysicalNameInformation = 49,
  FileIdGlobalTxDirectoryInformation = 50,
  FileMaximumInformation = 51,
} FILE_INFORMATION_CLASS, *PFILE_INFORMATION_CLASS;

typedef enum _FSINFOCLASS
{
  FileFsVolumeInformation = 1,
  FileFsLabelInformation = 2,
  FileFsSizeInformation = 3,
  FileFsDeviceInformation = 4,
  FileFsAttributeInformation = 5,
  FileFsControlInformation = 6,
  FileFsFullSizeInformation = 7,
  FileFsObjectIdInformation = 8,
  FileFsDriverPathInformation = 9,
  FileFsVolumeFlagsInformation = 10,
  FileFsMaximumInformation = 11,
} FSINFOCLASS, *PFSINFOCLASS;

typedef enum _DEVICE_RELATION_TYPE
{
  BusRelations = 0,
  EjectionRelations = 1,
  PowerRelations = 2,
  RemovalRelations = 3,
  TargetDeviceRelation = 4,
  SingleBusRelations = 5,
} DEVICE_RELATION_TYPE, *PDEVICE_RELATION_TYPE;

enum BUS_QUERY_ID_TYPE
{
  BusQueryDeviceID = 0,
  BusQueryHardwareIDs = 1,
  BusQueryCompatibleIDs = 2,
  BusQueryInstanceID = 3,
  BusQueryDeviceSerialNumber = 4,
};

typedef enum _NET_PNP_EVENT_CODE
{
  NetEventSetPower = 0,
  NetEventQueryPower = 1,
  NetEventQueryRemoveDevice = 2,
  NetEventCancelRemoveDevice = 3,
  NetEventReconfigure = 4,
  NetEventBindList = 5,
  NetEventBindsComplete = 6,
  NetEventPnPCapabilities = 7,
  NetEventPause = 8,
  NetEventRestart = 9,
  NetEventPortActivation = 10,
  NetEventPortDeactivation = 11,
  NetEventIMReEnableDevice = 12,
  NetEventMaximum = 13,
} NET_PNP_EVENT_CODE, *PNET_PNP_EVENT_CODE;

typedef struct _NET_PNP_EVENT
{
  /* 0x0000 */ enum _NET_PNP_EVENT_CODE NetEvent;
  /* 0x0004 */ void* Buffer;
  /* 0x0008 */ unsigned long BufferLength;
  /* 0x000c */ unsigned long NdisReserved[4];
  /* 0x001c */ unsigned long TransportReserved[4];
  /* 0x002c */ unsigned long TdiReserved[4];
  /* 0x003c */ unsigned long TdiClientReserved[4];
} NET_PNP_EVENT, *PNET_PNP_EVENT; /* size: 0x004c */

typedef struct _NET_PNP_EVENT_NOTIFICATION
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long PortNumber;
  /* 0x0008 */ struct _NET_PNP_EVENT NetPnPEvent;
  /* 0x0054 */ unsigned long Flags;
} NET_PNP_EVENT_NOTIFICATION, *PNET_PNP_EVENT_NOTIFICATION; /* size: 0x0058 */

enum DEVICE_TEXT_TYPE
{
  DeviceTextDescription = 0,
  DeviceTextLocationInformation = 1,
};

typedef enum _SYSTEM_POWER_STATE
{
  PowerSystemUnspecified = 0,
  PowerSystemWorking = 1,
  PowerSystemSleeping1 = 2,
  PowerSystemSleeping2 = 3,
  PowerSystemSleeping3 = 4,
  PowerSystemHibernate = 5,
  PowerSystemShutdown = 6,
  PowerSystemMaximum = 7,
} SYSTEM_POWER_STATE, *PSYSTEM_POWER_STATE;

typedef enum _POWER_STATE_TYPE
{
  SystemPowerState = 0,
  DevicePowerState = 1,
} POWER_STATE_TYPE, *PPOWER_STATE_TYPE;

enum POWER_ACTION
{
  PowerActionNone = 0,
  PowerActionReserved = 1,
  PowerActionSleep = 2,
  PowerActionHibernate = 3,
  PowerActionShutdown = 4,
  PowerActionShutdownReset = 5,
  PowerActionShutdownOff = 6,
  PowerActionWarmEject = 7,
};

typedef enum _WHEA_ERROR_TYPE
{
  WheaErrTypeProcessor = 0,
  WheaErrTypeMemory = 1,
  WheaErrTypePCIExpress = 2,
  WheaErrTypeNMI = 3,
  WheaErrTypePCIXBus = 4,
  WheaErrTypePCIXDevice = 5,
  WheaErrTypeGeneric = 6,
} WHEA_ERROR_TYPE, *PWHEA_ERROR_TYPE;

typedef struct _KDPC
{
  /* 0x0000 */ unsigned char Type;
  /* 0x0001 */ unsigned char Importance;
  /* 0x0002 */ volatile unsigned short Number;
  /* 0x0004 */ struct _LIST_ENTRY DpcListEntry;
  /* 0x000c */ void* DeferredRoutine /* function */;
  /* 0x0010 */ void* DeferredContext;
  /* 0x0014 */ void* SystemArgument1;
  /* 0x0018 */ void* SystemArgument2;
  /* 0x001c */ void* DpcData;
} KDPC, *PKDPC; /* size: 0x0020 */

struct KSDPC_ITEM
{
  /* 0x0000 */ struct _KDPC Dpc;
  /* 0x0020 */ unsigned long ReferenceCount;
  /* 0x0024 */ unsigned long AccessLock;
}; /* size: 0x0028 */

struct KSBUFFER_ITEM
{
  /* 0x0000 */ struct KSDPC_ITEM DpcItem;
  /* 0x0028 */ struct _LIST_ENTRY BufferList;
}; /* size: 0x0030 */

typedef enum _WHEA_ERROR_SEVERITY
{
  WheaErrSevRecoverable = 0,
  WheaErrSevFatal = 1,
  WheaErrSevCorrected = 2,
  WheaErrSevNone = 3,
} WHEA_ERROR_SEVERITY, *PWHEA_ERROR_SEVERITY;

typedef enum _WHEA_ERROR_SOURCE_TYPE
{
  WheaErrSrcTypeMCE = 0,
  WheaErrSrcTypeCMC = 1,
  WheaErrSrcTypeCPE = 2,
  WheaErrSrcTypeNMI = 3,
  WheaErrSrcTypePCIe = 4,
  WheaErrSrcTypeGeneric = 5,
  WheaErrSrcTypeINIT = 6,
  WheaErrSrcTypeBOOT = 7,
  WheaErrSrcTypeSCIGeneric = 8,
  WheaErrSrcTypeIPFMCA = 9,
  WheaErrSrcTypeIPFCMC = 10,
  WheaErrSrcTypeIPFCPE = 11,
  WheaErrSrcTypeMax = 12,
} WHEA_ERROR_SOURCE_TYPE, *PWHEA_ERROR_SOURCE_TYPE;

typedef enum _WHEA_RAW_DATA_FORMAT
{
  WheaRawDataFormatIPFSalRecord = 0,
  WheaRawDataFormatIA32MCA = 1,
  WheaRawDataFormatIntel64MCA = 2,
  WheaRawDataFormatAMD64MCA = 3,
  WheaRawDataFormatMemory = 4,
  WheaRawDataFormatPCIExpress = 5,
  WheaRawDataFormatNMIPort = 6,
  WheaRawDataFormatPCIXBus = 7,
  WheaRawDataFormatPCIXDevice = 8,
  WheaRawDataFormatGeneric = 9,
  WheaRawDataFormatMax = 10,
} WHEA_RAW_DATA_FORMAT, *PWHEA_RAW_DATA_FORMAT;

enum SCOPE_LEVEL
{
  ScopeLevelInterface = 1,
  ScopeLevelLink = 2,
  ScopeLevelSubnet = 3,
  ScopeLevelAdmin = 4,
  ScopeLevelSite = 5,
  ScopeLevelOrganization = 8,
  ScopeLevelGlobal = 14,
  ScopeLevelCount = 16,
};

enum NL_ADDRESS_TYPE
{
  NlatUnspecified = 0,
  NlatUnicast = 1,
  NlatAnycast = 2,
  NlatMulticast = 3,
  NlatBroadcast = 4,
  NlatInvalid = 5,
};

typedef enum _NPI_MODULEID_TYPE
{
  MIT_GUID = 1,
  MIT_IF_LUID = 2,
} NPI_MODULEID_TYPE, *PNPI_MODULEID_TYPE;

typedef enum _MEMORY_CACHING_TYPE
{
  MmNonCached = 0,
  MmCached = 1,
  MmWriteCombined = 2,
  MmHardwareCoherentCached = 3,
  MmNonCachedUnordered = 4,
  MmUSWCCached = 5,
  MmMaximumCacheType = 6,
} MEMORY_CACHING_TYPE, *PMEMORY_CACHING_TYPE;

typedef enum _MM_PAGE_PRIORITY
{
  LowPagePriority = 0,
  NormalPagePriority = 16,
  HighPagePriority = 32,
} MM_PAGE_PRIORITY, *PMM_PAGE_PRIORITY;

struct KSMETHOD_ITEM
{
  /* 0x0000 */ unsigned long MethodId;
  union
  {
    /* 0x0004 */ void* MethodHandler /* function */;
    /* 0x0004 */ unsigned char MethodSupported;
  }; /* size: 0x0004 */
  /* 0x0008 */ unsigned long MinMethod;
  /* 0x000c */ unsigned long MinData;
  /* 0x0010 */ void* SupportHandler /* function */;
  /* 0x0014 */ unsigned long Flags;
}; /* size: 0x0018 */

typedef enum _NDIS_XLATE_TYPE
{
  XlateSend = 0,
  XlateSendComplete = 1,
  XlateReceive = 2,
  XlateReturn = 3,
} NDIS_XLATE_TYPE, *PNDIS_XLATE_TYPE;

enum KSPIN_COMMUNICATION
{
  KSPIN_COMMUNICATION_NONE = 0,
  KSPIN_COMMUNICATION_SINK = 1,
  KSPIN_COMMUNICATION_SOURCE = 2,
  KSPIN_COMMUNICATION_BOTH = 3,
  KSPIN_COMMUNICATION_BRIDGE = 4,
};

typedef struct _GUID
{
  /* 0x0000 */ unsigned long Data1;
  /* 0x0004 */ unsigned short Data2;
  /* 0x0006 */ unsigned short Data3;
  /* 0x0008 */ unsigned char Data4[8];
} GUID, *PGUID; /* size: 0x0010 */

enum KSPIN_DATAFLOW
{
  KSPIN_DATAFLOW_IN = 1,
  KSPIN_DATAFLOW_OUT = 2,
};

enum KSSTATE
{
  KSSTATE_STOP = 0,
  KSSTATE_ACQUIRE = 1,
  KSSTATE_PAUSE = 2,
  KSSTATE_RUN = 3,
};

struct KSPIN_DESCRIPTOR
{
  /* 0x0000 */ unsigned long InterfacesCount;
  /* 0x0004 */ const struct KSIDENTIFIER* Interfaces;
  /* 0x0008 */ unsigned long MediumsCount;
  /* 0x000c */ const struct KSIDENTIFIER* Mediums;
  /* 0x0010 */ unsigned long DataRangesCount;
  /* 0x0014 */ union KSDATAFORMAT* const* DataRanges;
  /* 0x0018 */ enum KSPIN_DATAFLOW DataFlow;
  /* 0x001c */ enum KSPIN_COMMUNICATION Communication;
  /* 0x0020 */ const struct _GUID* Category;
  /* 0x0024 */ const struct _GUID* Name;
  union
  {
    /* 0x0028 */ __int64 Reserved;
    struct
    {
      /* 0x0028 */ unsigned long ConstrainedDataRangesCount;
      /* 0x002c */ union KSDATAFORMAT** ConstrainedDataRanges;
    }; /* size: 0x0008 */
  }; /* size: 0x0008 */
}; /* size: 0x0030 */

enum KSRESET
{
  KSRESET_BEGIN = 0,
  KSRESET_END = 1,
};

typedef enum _DEVICE_POWER_STATE
{
  PowerDeviceUnspecified = 0,
  PowerDeviceD0 = 1,
  PowerDeviceD1 = 2,
  PowerDeviceD2 = 3,
  PowerDeviceD3 = 4,
  PowerDeviceMaximum = 5,
} DEVICE_POWER_STATE, *PDEVICE_POWER_STATE;

typedef enum _NET_IF_MEDIA_CONNECT_STATE
{
  MediaConnectStateUnknown = 0,
  MediaConnectStateConnected = 1,
  MediaConnectStateDisconnected = 2,
} NET_IF_MEDIA_CONNECT_STATE, *PNET_IF_MEDIA_CONNECT_STATE;

typedef enum _NET_IF_MEDIA_DUPLEX_STATE
{
  MediaDuplexStateUnknown = 0,
  MediaDuplexStateHalf = 1,
  MediaDuplexStateFull = 2,
} NET_IF_MEDIA_DUPLEX_STATE, *PNET_IF_MEDIA_DUPLEX_STATE;

typedef enum _NDIS_MEDIUM
{
  NdisMedium802_3 = 0,
  NdisMedium802_5 = 1,
  NdisMediumFddi = 2,
  NdisMediumWan = 3,
  NdisMediumLocalTalk = 4,
  NdisMediumDix = 5,
  NdisMediumArcnetRaw = 6,
  NdisMediumArcnet878_2 = 7,
  NdisMediumAtm = 8,
  NdisMediumWirelessWan = 9,
  NdisMediumIrda = 10,
  NdisMediumBpc = 11,
  NdisMediumCoWan = 12,
  NdisMedium1394 = 13,
  NdisMediumInfiniBand = 14,
  NdisMediumTunnel = 15,
  NdisMediumNative802_11 = 16,
  NdisMediumLoopback = 17,
  NdisMediumMax = 18,
} NDIS_MEDIUM, *PNDIS_MEDIUM;

typedef enum _NDIS_INTERFACE_TYPE
{
  NdisInterfaceInternal = 0,
  NdisInterfaceIsa = 1,
  NdisInterfaceEisa = 2,
  NdisInterfaceMca = 3,
  NdisInterfaceTurboChannel = 4,
  NdisInterfacePci = 5,
  NdisInterfacePcMcia = 8,
  NdisInterfaceCBus = 9,
  NdisInterfaceMPIBus = 10,
  NdisInterfaceMPSABus = 11,
  NdisInterfaceProcessorInternal = 12,
  NdisInterfaceInternalPowerBus = 13,
  NdisInterfacePNPISABus = 14,
  NdisInterfacePNPBus = 15,
  NdisInterfaceUSB = 16,
  NdisInterfaceIrda = 17,
  NdisInterface1394 = 18,
  NdisMaximumInterfaceType = 19,
} NDIS_INTERFACE_TYPE, *PNDIS_INTERFACE_TYPE;

typedef enum _NDIS_SUPPORTED_PAUSE_FUNCTIONS
{
  NdisPauseFunctionsUnsupported = 0,
  NdisPauseFunctionsSendOnly = 1,
  NdisPauseFunctionsReceiveOnly = 2,
  NdisPauseFunctionsSendAndReceive = 3,
  NdisPauseFunctionsUnknown = 4,
} NDIS_SUPPORTED_PAUSE_FUNCTIONS, *PNDIS_SUPPORTED_PAUSE_FUNCTIONS;

typedef enum _NDIS_PNP_DEVICE_STATE
{
  NdisPnPDeviceAdded = 0,
  NdisPnPDeviceStarted = 1,
  NdisPnPDeviceQueryStopped = 2,
  NdisPnPDeviceStopped = 3,
  NdisPnPDeviceQueryRemoved = 4,
  NdisPnPDeviceRemoved = 5,
  NdisPnPDeviceSurpriseRemoved = 6,
} NDIS_PNP_DEVICE_STATE, *PNDIS_PNP_DEVICE_STATE;

typedef enum _NDIS_PORT_TYPE
{
  NdisPortTypeUndefined = 0,
  NdisPortTypeBridge = 1,
  NdisPortTypeRasConnection = 2,
  NdisPortType8021xSupplicant = 3,
  NdisPortTypeMax = 4,
} NDIS_PORT_TYPE, *PNDIS_PORT_TYPE;

typedef enum _NET_IF_DIRECTION_TYPE
{
  NET_IF_DIRECTION_SENDRECEIVE = 0,
  NET_IF_DIRECTION_SENDONLY = 1,
  NET_IF_DIRECTION_RECEIVEONLY = 2,
  NET_IF_DIRECTION_MAXIMUM = 3,
} NET_IF_DIRECTION_TYPE, *PNET_IF_DIRECTION_TYPE;

typedef enum _NDIS_PORT_CONTROL_STATE
{
  NdisPortControlStateUnknown = 0,
  NdisPortControlStateControlled = 1,
  NdisPortControlStateUncontrolled = 2,
} NDIS_PORT_CONTROL_STATE, *PNDIS_PORT_CONTROL_STATE;

typedef enum _NDIS_PORT_AUTHORIZATION_STATE
{
  NdisPortAuthorizationUnknown = 0,
  NdisPortAuthorized = 1,
  NdisPortUnauthorized = 2,
  NdisPortReauthorizing = 3,
} NDIS_PORT_AUTHORIZATION_STATE, *PNDIS_PORT_AUTHORIZATION_STATE;

typedef struct _NDIS_PORT_CHARACTERISTICS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long PortNumber;
  /* 0x0008 */ unsigned long Flags;
  /* 0x000c */ enum _NDIS_PORT_TYPE Type;
  /* 0x0010 */ enum _NET_IF_MEDIA_CONNECT_STATE MediaConnectState;
  /* 0x0014 */ long Padding_0;
  /* 0x0018 */ unsigned __int64 XmitLinkSpeed;
  /* 0x0020 */ unsigned __int64 RcvLinkSpeed;
  /* 0x0028 */ enum _NET_IF_DIRECTION_TYPE Direction;
  /* 0x002c */ enum _NDIS_PORT_CONTROL_STATE SendControlState;
  /* 0x0030 */ enum _NDIS_PORT_CONTROL_STATE RcvControlState;
  /* 0x0034 */ enum _NDIS_PORT_AUTHORIZATION_STATE SendAuthorizationState;
  /* 0x0038 */ enum _NDIS_PORT_AUTHORIZATION_STATE RcvAuthorizationState;
  /* 0x003c */ long __PADDING__[1];
} NDIS_PORT_CHARACTERISTICS, *PNDIS_PORT_CHARACTERISTICS; /* size: 0x0040 */

struct in_addr
{
  union
  {
    union
    {
      struct
      {
        /* 0x0000 */ unsigned char s_b1;
        /* 0x0001 */ unsigned char s_b2;
        /* 0x0002 */ unsigned char s_b3;
        /* 0x0003 */ unsigned char s_b4;
      } /* size: 0x0004 */ S_un_b;
      struct
      {
        /* 0x0000 */ unsigned short s_w1;
        /* 0x0002 */ unsigned short s_w2;
      } /* size: 0x0004 */ S_un_w;
      /* 0x0000 */ unsigned long S_addr;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ S_un;
}; /* size: 0x0004 */

struct sockaddr_in
{
  /* 0x0000 */ unsigned short sin_family;
  /* 0x0002 */ unsigned short sin_port;
  /* 0x0004 */ struct in_addr sin_addr;
  /* 0x0008 */ char sin_zero[8];
}; /* size: 0x0010 */

typedef enum _NDIS_MINIPORT_STATE
{
  NdisMiniportUndefindState = 0,
  NdisMiniportHalted = 1,
  NdisMiniportInitializing = 2,
  NdisMiniportRestarting = 3,
  NdisMiniportRunning = 4,
  NdisMiniportPausing = 5,
  NdisMiniportPaused = 6,
} NDIS_MINIPORT_STATE, *PNDIS_MINIPORT_STATE;

typedef struct _NDIS_TCP_IP_CHECKSUM_OFFLOAD
{
  struct
  {
    /* 0x0000 */ unsigned long Encapsulation;
    struct /* bitfield */
    {
      /* 0x0004 */ unsigned long IpOptionsSupported : 2; /* bit position: 0 */
      /* 0x0004 */ unsigned long TcpOptionsSupported : 2; /* bit position: 2 */
      /* 0x0004 */ unsigned long TcpChecksum : 2; /* bit position: 4 */
      /* 0x0004 */ unsigned long UdpChecksum : 2; /* bit position: 6 */
      /* 0x0004 */ unsigned long IpChecksum : 2; /* bit position: 8 */
    }; /* bitfield */
  } /* size: 0x0008 */ IPv4Transmit;
  struct
  {
    /* 0x0008 */ unsigned long Encapsulation;
    struct /* bitfield */
    {
      /* 0x000c */ unsigned long IpOptionsSupported : 2; /* bit position: 0 */
      /* 0x000c */ unsigned long TcpOptionsSupported : 2; /* bit position: 2 */
      /* 0x000c */ unsigned long TcpChecksum : 2; /* bit position: 4 */
      /* 0x000c */ unsigned long UdpChecksum : 2; /* bit position: 6 */
      /* 0x000c */ unsigned long IpChecksum : 2; /* bit position: 8 */
    }; /* bitfield */
  } /* size: 0x0008 */ IPv4Receive;
  struct
  {
    /* 0x0010 */ unsigned long Encapsulation;
    struct /* bitfield */
    {
      /* 0x0014 */ unsigned long IpExtensionHeadersSupported : 2; /* bit position: 0 */
      /* 0x0014 */ unsigned long TcpOptionsSupported : 2; /* bit position: 2 */
      /* 0x0014 */ unsigned long TcpChecksum : 2; /* bit position: 4 */
      /* 0x0014 */ unsigned long UdpChecksum : 2; /* bit position: 6 */
    }; /* bitfield */
  } /* size: 0x0008 */ IPv6Transmit;
  struct
  {
    /* 0x0018 */ unsigned long Encapsulation;
    struct /* bitfield */
    {
      /* 0x001c */ unsigned long IpExtensionHeadersSupported : 2; /* bit position: 0 */
      /* 0x001c */ unsigned long TcpOptionsSupported : 2; /* bit position: 2 */
      /* 0x001c */ unsigned long TcpChecksum : 2; /* bit position: 4 */
      /* 0x001c */ unsigned long UdpChecksum : 2; /* bit position: 6 */
    }; /* bitfield */
  } /* size: 0x0008 */ IPv6Receive;
} NDIS_TCP_IP_CHECKSUM_OFFLOAD, *PNDIS_TCP_IP_CHECKSUM_OFFLOAD; /* size: 0x0020 */

typedef struct _NDIS_TCP_LARGE_SEND_OFFLOAD_V1
{
  struct
  {
    /* 0x0000 */ unsigned long Encapsulation;
    /* 0x0004 */ unsigned long MaxOffLoadSize;
    /* 0x0008 */ unsigned long MinSegmentCount;
    struct /* bitfield */
    {
      /* 0x000c */ unsigned long TcpOptions : 2; /* bit position: 0 */
      /* 0x000c */ unsigned long IpOptions : 2; /* bit position: 2 */
    }; /* bitfield */
  } /* size: 0x0010 */ IPv4;
} NDIS_TCP_LARGE_SEND_OFFLOAD_V1, *PNDIS_TCP_LARGE_SEND_OFFLOAD_V1; /* size: 0x0010 */

typedef struct _NDIS_IPSEC_OFFLOAD_V1
{
  struct
  {
    /* 0x0000 */ unsigned long Encapsulation;
    /* 0x0004 */ unsigned long AhEspCombined;
    /* 0x0008 */ unsigned long TransportTunnelCombined;
    /* 0x000c */ unsigned long IPv4Options;
    /* 0x0010 */ unsigned long Flags;
  } /* size: 0x0014 */ Supported;
  struct
  {
    struct /* bitfield */
    {
      /* 0x0014 */ unsigned long Md5 : 2; /* bit position: 0 */
      /* 0x0014 */ unsigned long Sha_1 : 2; /* bit position: 2 */
      /* 0x0014 */ unsigned long Transport : 2; /* bit position: 4 */
      /* 0x0014 */ unsigned long Tunnel : 2; /* bit position: 6 */
      /* 0x0014 */ unsigned long Send : 2; /* bit position: 8 */
      /* 0x0014 */ unsigned long Receive : 2; /* bit position: 10 */
    }; /* bitfield */
  } /* size: 0x0004 */ IPv4AH;
  struct
  {
    struct /* bitfield */
    {
      /* 0x0018 */ unsigned long Des : 2; /* bit position: 0 */
      /* 0x0018 */ unsigned long Reserved : 2; /* bit position: 2 */
      /* 0x0018 */ unsigned long TripleDes : 2; /* bit position: 4 */
      /* 0x0018 */ unsigned long NullEsp : 2; /* bit position: 6 */
      /* 0x0018 */ unsigned long Transport : 2; /* bit position: 8 */
      /* 0x0018 */ unsigned long Tunnel : 2; /* bit position: 10 */
      /* 0x0018 */ unsigned long Send : 2; /* bit position: 12 */
      /* 0x0018 */ unsigned long Receive : 2; /* bit position: 14 */
    }; /* bitfield */
  } /* size: 0x0004 */ IPv4ESP;
} NDIS_IPSEC_OFFLOAD_V1, *PNDIS_IPSEC_OFFLOAD_V1; /* size: 0x001c */

typedef struct _NDIS_TCP_LARGE_SEND_OFFLOAD_V2
{
  struct
  {
    /* 0x0000 */ unsigned long Encapsulation;
    /* 0x0004 */ unsigned long MaxOffLoadSize;
    /* 0x0008 */ unsigned long MinSegmentCount;
  } /* size: 0x000c */ IPv4;
  struct
  {
    /* 0x000c */ unsigned long Encapsulation;
    /* 0x0010 */ unsigned long MaxOffLoadSize;
    /* 0x0014 */ unsigned long MinSegmentCount;
    struct /* bitfield */
    {
      /* 0x0018 */ unsigned long IpExtensionHeadersSupported : 2; /* bit position: 0 */
      /* 0x0018 */ unsigned long TcpOptionsSupported : 2; /* bit position: 2 */
    }; /* bitfield */
  } /* size: 0x0010 */ IPv6;
} NDIS_TCP_LARGE_SEND_OFFLOAD_V2, *PNDIS_TCP_LARGE_SEND_OFFLOAD_V2; /* size: 0x001c */

typedef struct _NDIS_IPSEC_OFFLOAD_V2
{
  /* 0x0000 */ unsigned long Encapsulation;
  /* 0x0004 */ unsigned char IPv6Supported;
  /* 0x0005 */ unsigned char IPv4Options;
  /* 0x0006 */ unsigned char IPv6NonIPsecExtensionHeaders;
  /* 0x0007 */ unsigned char Ah;
  /* 0x0008 */ unsigned char Esp;
  /* 0x0009 */ unsigned char AhEspCombined;
  /* 0x000a */ unsigned char Transport;
  /* 0x000b */ unsigned char Tunnel;
  /* 0x000c */ unsigned char TransportTunnelCombined;
  /* 0x000d */ unsigned char LsoSupported;
  /* 0x000e */ unsigned char ExtendedSequenceNumbers;
  /* 0x000f */ char Padding_1;
  /* 0x0010 */ unsigned long UdpEsp;
  /* 0x0014 */ unsigned long AuthenticationAlgorithms;
  /* 0x0018 */ unsigned long EncryptionAlgorithms;
  /* 0x001c */ unsigned long SaOffloadCapacity;
} NDIS_IPSEC_OFFLOAD_V2, *PNDIS_IPSEC_OFFLOAD_V2; /* size: 0x0020 */

typedef struct _NDIS_OFFLOAD
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ struct _NDIS_TCP_IP_CHECKSUM_OFFLOAD Checksum;
  /* 0x0024 */ struct _NDIS_TCP_LARGE_SEND_OFFLOAD_V1 LsoV1;
  /* 0x0034 */ struct _NDIS_IPSEC_OFFLOAD_V1 IPsecV1;
  /* 0x0050 */ struct _NDIS_TCP_LARGE_SEND_OFFLOAD_V2 LsoV2;
  /* 0x006c */ unsigned long Flags;
  /* 0x0070 */ struct _NDIS_IPSEC_OFFLOAD_V2 IPsecV2;
} NDIS_OFFLOAD, *PNDIS_OFFLOAD; /* size: 0x0090 */

typedef struct _NDIS_OFFLOAD_ENCAPSULATION
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  struct
  {
    /* 0x0004 */ unsigned long Enabled;
    /* 0x0008 */ unsigned long EncapsulationType;
    /* 0x000c */ unsigned long HeaderSize;
  } /* size: 0x000c */ IPv4;
  struct
  {
    /* 0x0010 */ unsigned long Enabled;
    /* 0x0014 */ unsigned long EncapsulationType;
    /* 0x0018 */ unsigned long HeaderSize;
  } /* size: 0x000c */ IPv6;
} NDIS_OFFLOAD_ENCAPSULATION, *PNDIS_OFFLOAD_ENCAPSULATION; /* size: 0x001c */

typedef struct _NDIS_TCP_CONNECTION_OFFLOAD
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Encapsulation;
  struct /* bitfield */
  {
    /* 0x0008 */ unsigned long SupportIPv4 : 2; /* bit position: 0 */
    /* 0x0008 */ unsigned long SupportIPv6 : 2; /* bit position: 2 */
    /* 0x0008 */ unsigned long SupportIPv6ExtensionHeaders : 2; /* bit position: 4 */
    /* 0x0008 */ unsigned long SupportSack : 2; /* bit position: 6 */
    /* 0x0008 */ unsigned long CongestionAlgorithm : 4; /* bit position: 8 */
  }; /* bitfield */
  /* 0x000c */ unsigned long TcpConnectionOffloadCapacity;
  /* 0x0010 */ unsigned long Flags;
} NDIS_TCP_CONNECTION_OFFLOAD, *PNDIS_TCP_CONNECTION_OFFLOAD; /* size: 0x0014 */

typedef struct _NDIS_TCP_CONNECTION_OFFLOAD_PARAMETERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ struct _NDIS_OFFLOAD_ENCAPSULATION Encapsulation;
  /* 0x0020 */ unsigned long TicksPerSecond;
  /* 0x0024 */ unsigned char TcpAckFrequency;
  /* 0x0025 */ unsigned char TcpDelayedAckTicks;
  /* 0x0026 */ unsigned char TcpMaximumRetransmissions;
  /* 0x0027 */ unsigned char TcpDoubtReachabilityRetransmissions;
  /* 0x0028 */ unsigned long TcpSwsPreventionTicks;
  /* 0x002c */ unsigned long TcpDuplicateAckThreshold;
  /* 0x0030 */ unsigned long TcpPushTicks;
  /* 0x0034 */ unsigned long NceStaleTicks;
  /* 0x0038 */ unsigned long CongestionAlgorithm;
} NDIS_TCP_CONNECTION_OFFLOAD_PARAMETERS, *PNDIS_TCP_CONNECTION_OFFLOAD_PARAMETERS; /* size: 0x003c */

typedef struct _NDIS_MINIPORT_OFFLOAD
{
  /* 0x0000 */ unsigned char SupportsOffload;
  /* 0x0001 */ unsigned char SupportsTopOffload;
  /* 0x0002 */ unsigned char SupportsTcpConnectionOffload;
  /* 0x0003 */ unsigned char SupportsTopTcpConnectionOffload;
  /* 0x0004 */ unsigned char TopConnectionOffloadPaused;
  /* 0x0005 */ char Padding_2[3];
  /* 0x0008 */ struct _NDIS_OFFLOAD MiniportCurrentConfig;
  /* 0x0098 */ struct _NDIS_OFFLOAD TopCapabilities;
  /* 0x0128 */ struct _NDIS_OFFLOAD MiniportInitialConfig;
  /* 0x01b8 */ struct _NDIS_OFFLOAD MiniportHardwareCapabilties;
  /* 0x0248 */ struct _NDIS_OFFLOAD_ENCAPSULATION MiniportSetEncapsulation;
  /* 0x0264 */ struct _NDIS_OFFLOAD_ENCAPSULATION TopSetEncapsulation;
  /* 0x0280 */ struct _NDIS_OFFLOAD_ENCAPSULATION TopMergedEncapsulation;
  /* 0x029c */ struct _NDIS_OFFLOAD_ENCAPSULATION MiniportMergedEncapsulation;
  /* 0x02b8 */ struct _NDIS_TCP_CONNECTION_OFFLOAD TopTcpConnectionOffloadCapabilities;
  /* 0x02cc */ struct _NDIS_TCP_CONNECTION_OFFLOAD MiniportTcpConnectionOffloadCurrentConfig;
  /* 0x02e0 */ struct _NDIS_TCP_CONNECTION_OFFLOAD MiniportHwTcpConnectionOffloadCapabilities;
  /* 0x02f4 */ struct _NDIS_TCP_CONNECTION_OFFLOAD_PARAMETERS TopTcpConnectionParameters;
  /* 0x0330 */ struct _NDIS_TCP_CONNECTION_OFFLOAD_PARAMETERS MiniportTcpConnectionParameters;
  /* 0x036c */ unsigned char MiniportTask[144];
  /* 0x03fc */ unsigned long MiniportTaskSize;
  /* 0x0400 */ unsigned char Ndis5Xsum;
  /* 0x0401 */ unsigned char Ndis5LSO;
  /* 0x0402 */ unsigned char Ndis5IPsec;
  /* 0x0403 */ char Padding_3;
  /* 0x0404 */ void* MiniportRequestBuffer;
  /* 0x0408 */ unsigned long MiniportRequestOid;
  /* 0x040c */ unsigned long MiniportRequestBufferLength;
} NDIS_MINIPORT_OFFLOAD, *PNDIS_MINIPORT_OFFLOAD; /* size: 0x0410 */

typedef enum _NDIS_SHUTDOWN_ACTION
{
  NdisShutdownPowerOff = 0,
  NdisShutdownBugCheck = 1,
} NDIS_SHUTDOWN_ACTION, *PNDIS_SHUTDOWN_ACTION;

typedef struct _KDEVICE_QUEUE_ENTRY
{
  /* 0x0000 */ struct _LIST_ENTRY DeviceListEntry;
  /* 0x0008 */ unsigned long SortKey;
  /* 0x000c */ unsigned char Inserted;
  /* 0x000d */ char __PADDING__[3];
} KDEVICE_QUEUE_ENTRY, *PKDEVICE_QUEUE_ENTRY; /* size: 0x0010 */

typedef struct _WAIT_CONTEXT_BLOCK
{
  /* 0x0000 */ struct _KDEVICE_QUEUE_ENTRY WaitQueueEntry;
  /* 0x0010 */ void* DeviceRoutine /* function */;
  /* 0x0014 */ void* DeviceContext;
  /* 0x0018 */ unsigned long NumberOfMapRegisters;
  /* 0x001c */ void* DeviceObject;
  /* 0x0020 */ void* CurrentIrp;
  /* 0x0024 */ struct _KDPC* BufferChainingDpc;
} WAIT_CONTEXT_BLOCK, *PWAIT_CONTEXT_BLOCK; /* size: 0x0028 */

typedef union _DL_OUI
{
  union
  {
    /* 0x0000 */ unsigned char Byte[3];
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned char Group : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned char Local : 1; /* bit position: 1 */
    }; /* bitfield */
  }; /* size: 0x0003 */
} DL_OUI, *PDL_OUI; /* size: 0x0003 */

typedef union _DL_EI48
{
  /* 0x0000 */ unsigned char Byte[3];
} DL_EI48, *PDL_EI48; /* size: 0x0003 */

union DL_EUI48
{
  union
  {
    /* 0x0000 */ unsigned char Byte[6];
    struct
    {
      /* 0x0000 */ union _DL_OUI Oui;
      /* 0x0003 */ union _DL_EI48 Ei48;
    }; /* size: 0x0006 */
  }; /* size: 0x0006 */
}; /* size: 0x0006 */

typedef enum _NET_IF_ADMIN_STATUS
{
  NET_IF_ADMIN_STATUS_UP = 1,
  NET_IF_ADMIN_STATUS_DOWN = 2,
  NET_IF_ADMIN_STATUS_TESTING = 3,
} NET_IF_ADMIN_STATUS, *PNET_IF_ADMIN_STATUS;

typedef enum _NET_IF_OPER_STATUS
{
  NET_IF_OPER_STATUS_UP = 1,
  NET_IF_OPER_STATUS_DOWN = 2,
  NET_IF_OPER_STATUS_TESTING = 3,
  NET_IF_OPER_STATUS_UNKNOWN = 4,
  NET_IF_OPER_STATUS_DORMANT = 5,
  NET_IF_OPER_STATUS_NOT_PRESENT = 6,
  NET_IF_OPER_STATUS_LOWER_LAYER_DOWN = 7,
} NET_IF_OPER_STATUS, *PNET_IF_OPER_STATUS;

typedef enum _NDIS_INTERRUPT_TYPE
{
  NDIS_CONNECT_LINE_BASED = 1,
  NDIS_CONNECT_MESSAGE_BASED = 2,
} NDIS_INTERRUPT_TYPE, *PNDIS_INTERRUPT_TYPE;

typedef struct _NDIS_MINIPORT_INTERRUPT_CHARACTERISTICS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ void* InterruptHandler /* function */;
  /* 0x0008 */ void* InterruptDpcHandler /* function */;
  /* 0x000c */ void* DisableInterruptHandler /* function */;
  /* 0x0010 */ void* EnableInterruptHandler /* function */;
  /* 0x0014 */ unsigned char MsiSupported;
  /* 0x0015 */ unsigned char MsiSyncWithAllMessages;
  /* 0x0016 */ char Padding_4[2];
  /* 0x0018 */ void* MessageInterruptHandler /* function */;
  /* 0x001c */ void* MessageInterruptDpcHandler /* function */;
  /* 0x0020 */ void* DisableMessageInterruptHandler /* function */;
  /* 0x0024 */ void* EnableMessageInterruptHandler /* function */;
  /* 0x0028 */ enum _NDIS_INTERRUPT_TYPE InterruptType;
  /* 0x002c */ struct _IO_INTERRUPT_MESSAGE_INFO* MessageInfoTable;
} NDIS_MINIPORT_INTERRUPT_CHARACTERISTICS, *PNDIS_MINIPORT_INTERRUPT_CHARACTERISTICS; /* size: 0x0030 */

typedef enum _NDIS_WORK_ITEM_TYPE
{
  NdisWorkItemRequest = 0,
  NdisWorkItemSend = 1,
  NdisWorkItemReturnPackets = 2,
  NdisWorkItemResetRequested = 3,
  NdisWorkItemResetInProgress = 4,
  NdisWorkItemReserved = 5,
  NdisWorkItemMiniportCallback = 6,
  NdisMaxWorkItems = 7,
} NDIS_WORK_ITEM_TYPE, *PNDIS_WORK_ITEM_TYPE;

typedef enum _INTERFACE_TYPE
{
  InterfaceTypeUndefined = -1,
  Internal = 0,
  Isa = 1,
  Eisa = 2,
  MicroChannel = 3,
  TurboChannel = 4,
  PCIBus = 5,
  VMEBus = 6,
  NuBus = 7,
  PCMCIABus = 8,
  CBus = 9,
  MPIBus = 10,
  MPSABus = 11,
  ProcessorInternal = 12,
  InternalPowerBus = 13,
  PNPISABus = 14,
  PNPBus = 15,
  Vmcs = 16,
  MaximumInterfaceType = 17,
} INTERFACE_TYPE, *PINTERFACE_TYPE;

typedef enum _NDIS_NDIS5_DRIVER_STATE
{
  Ndis5StateUnused = 0,
  Ndis5StatePaused = 1,
  Ndis5StateRunning = 2,
} NDIS_NDIS5_DRIVER_STATE, *PNDIS_NDIS5_DRIVER_STATE;

typedef enum _NDIS_OPEN_TRANSLATION_STATE
{
  OpenDontXlate = 0,
  OpenXlateExceptSends = 1,
  OpenXlateAll = 2,
} NDIS_OPEN_TRANSLATION_STATE, *PNDIS_OPEN_TRANSLATION_STATE;

typedef enum _NDIS_OPEN_STATE
{
  NdisOpenStateRunning = 0,
  NdisOpenStatePausing = 1,
  NdisOpenStatePaused = 2,
  NdisOpenStateRestarting = 3,
} NDIS_OPEN_STATE, *PNDIS_OPEN_STATE;

typedef struct _DISPATCHER_HEADER
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned char Type;
      union
      {
        /* 0x0001 */ unsigned char Abandoned;
        /* 0x0001 */ unsigned char Absolute;
        /* 0x0001 */ unsigned char NpxIrql;
        struct
        {
          /* 0x0001 */ unsigned char Signalling;
          union
          {
            /* 0x0002 */ unsigned char Size;
            struct
            {
              /* 0x0002 */ unsigned char Hand;
              union
              {
                /* 0x0003 */ unsigned char Inserted;
                /* 0x0003 */ unsigned char DebugActive;
                /* 0x0003 */ unsigned char DpcActive;
              }; /* size: 0x0001 */
            }; /* size: 0x0002 */
          }; /* size: 0x0002 */
        }; /* size: 0x0003 */
      }; /* size: 0x0003 */
    }; /* size: 0x0004 */
    /* 0x0000 */ volatile long Lock;
  }; /* size: 0x0004 */
  /* 0x0004 */ long SignalState;
  /* 0x0008 */ struct _LIST_ENTRY WaitListHead;
} DISPATCHER_HEADER, *PDISPATCHER_HEADER; /* size: 0x0010 */

typedef union _ULARGE_INTEGER
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned long LowPart;
      /* 0x0004 */ unsigned long HighPart;
    }; /* size: 0x0008 */
    struct
    {
      /* 0x0000 */ unsigned long LowPart;
      /* 0x0004 */ unsigned long HighPart;
    } /* size: 0x0008 */ u;
    /* 0x0000 */ unsigned __int64 QuadPart;
  }; /* size: 0x0008 */
} ULARGE_INTEGER, *PULARGE_INTEGER; /* size: 0x0008 */

typedef struct _KTIMER
{
  /* 0x0000 */ struct _DISPATCHER_HEADER Header;
  /* 0x0010 */ union _ULARGE_INTEGER DueTime;
  /* 0x0018 */ struct _LIST_ENTRY TimerListEntry;
  /* 0x0020 */ struct _KDPC* Dpc;
  /* 0x0024 */ long Period;
} KTIMER, *PKTIMER; /* size: 0x0028 */

typedef struct _NDIS_MINIPORT_TIMER
{
  /* 0x0000 */ struct _KTIMER Timer;
  /* 0x0028 */ struct _KDPC Dpc;
  /* 0x0048 */ void* MiniportTimerFunction /* function */;
  /* 0x004c */ void* MiniportTimerContext;
  /* 0x0050 */ struct _NDIS_MINIPORT_BLOCK* Miniport;
  /* 0x0054 */ struct _NDIS_MINIPORT_TIMER* NextTimer;
} NDIS_MINIPORT_TIMER, *PNDIS_MINIPORT_TIMER; /* size: 0x0058 */

typedef enum _NDIS_REQUEST_TYPE
{
  NdisRequestQueryInformation = 0,
  NdisRequestSetInformation = 1,
  NdisRequestQueryStatistics = 2,
  NdisRequestOpen = 3,
  NdisRequestClose = 4,
  NdisRequestSend = 5,
  NdisRequestTransferData = 6,
  NdisRequestReset = 7,
  NdisRequestGeneric1 = 8,
  NdisRequestGeneric2 = 9,
  NdisRequestGeneric3 = 10,
  NdisRequestGeneric4 = 11,
  NdisRequestMethod = 12,
} NDIS_REQUEST_TYPE, *PNDIS_REQUEST_TYPE;

typedef enum _NDIS_M_PERIODIC_RECEIVE_STATE
{
  PeriodicReceivesOff = 0,
  PeriodicReceivesOn = 1,
  PeriodicReceivesBlocked = 2,
} NDIS_M_PERIODIC_RECEIVE_STATE, *PNDIS_M_PERIODIC_RECEIVE_STATE;

typedef enum _NDIS_DEVICE_PNP_EVENT
{
  NdisDevicePnPEventQueryRemoved = 0,
  NdisDevicePnPEventRemoved = 1,
  NdisDevicePnPEventSurpriseRemoved = 2,
  NdisDevicePnPEventQueryStopped = 3,
  NdisDevicePnPEventStopped = 4,
  NdisDevicePnPEventPowerProfileChanged = 5,
  NdisDevicePnPEventFilterListChanged = 6,
  NdisDevicePnPEventMaximum = 7,
} NDIS_DEVICE_PNP_EVENT, *PNDIS_DEVICE_PNP_EVENT;

typedef union _LARGE_INTEGER
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned long LowPart;
      /* 0x0004 */ long HighPart;
    }; /* size: 0x0008 */
    struct
    {
      /* 0x0000 */ unsigned long LowPart;
      /* 0x0004 */ long HighPart;
    } /* size: 0x0008 */ u;
    /* 0x0000 */ __int64 QuadPart;
  }; /* size: 0x0008 */
} LARGE_INTEGER, *PLARGE_INTEGER; /* size: 0x0008 */

typedef struct _SYSTEM_POWER_STATE_CONTEXT
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long Reserved1 : 8; /* bit position: 0 */
      /* 0x0000 */ unsigned long TargetSystemState : 4; /* bit position: 8 */
      /* 0x0000 */ unsigned long EffectiveSystemState : 4; /* bit position: 12 */
      /* 0x0000 */ unsigned long CurrentSystemState : 4; /* bit position: 16 */
      /* 0x0000 */ unsigned long IgnoreHibernationPath : 1; /* bit position: 20 */
      /* 0x0000 */ unsigned long PseudoTransition : 1; /* bit position: 21 */
      /* 0x0000 */ unsigned long Reserved2 : 10; /* bit position: 22 */
    }; /* bitfield */
    /* 0x0000 */ unsigned long ContextAsUlong;
  }; /* size: 0x0004 */
} SYSTEM_POWER_STATE_CONTEXT, *PSYSTEM_POWER_STATE_CONTEXT; /* size: 0x0004 */

typedef union _POWER_STATE
{
  union
  {
    /* 0x0000 */ enum _SYSTEM_POWER_STATE SystemState;
    /* 0x0000 */ enum _DEVICE_POWER_STATE DeviceState;
  }; /* size: 0x0004 */
} POWER_STATE, *PPOWER_STATE; /* size: 0x0004 */

typedef struct _IO_STACK_LOCATION
{
  /* 0x0000 */ unsigned char MajorFunction;
  /* 0x0001 */ unsigned char MinorFunction;
  /* 0x0002 */ unsigned char Flags;
  /* 0x0003 */ unsigned char Control;
  union
  {
    union
    {
      struct
      {
        /* 0x0004 */ struct _IO_SECURITY_CONTEXT* SecurityContext;
        /* 0x0008 */ unsigned long Options;
        /* 0x000c */ unsigned short FileAttributes;
        /* 0x000e */ unsigned short ShareAccess;
        /* 0x0010 */ unsigned long EaLength;
      } /* size: 0x0010 */ Create;
      struct
      {
        /* 0x0004 */ struct _IO_SECURITY_CONTEXT* SecurityContext;
        /* 0x0008 */ unsigned long Options;
        /* 0x000c */ unsigned short Reserved;
        /* 0x000e */ unsigned short ShareAccess;
        /* 0x0010 */ struct _NAMED_PIPE_CREATE_PARAMETERS* Parameters;
      } /* size: 0x0010 */ CreatePipe;
      struct
      {
        /* 0x0004 */ struct _IO_SECURITY_CONTEXT* SecurityContext;
        /* 0x0008 */ unsigned long Options;
        /* 0x000c */ unsigned short Reserved;
        /* 0x000e */ unsigned short ShareAccess;
        /* 0x0010 */ struct _MAILSLOT_CREATE_PARAMETERS* Parameters;
      } /* size: 0x0010 */ CreateMailslot;
      struct
      {
        /* 0x0004 */ unsigned long Length;
        /* 0x0008 */ unsigned long Key;
        /* 0x000c */ union _LARGE_INTEGER ByteOffset;
      } /* size: 0x0010 */ Read;
      struct
      {
        /* 0x0004 */ unsigned long Length;
        /* 0x0008 */ unsigned long Key;
        /* 0x000c */ union _LARGE_INTEGER ByteOffset;
      } /* size: 0x0010 */ Write;
      struct
      {
        /* 0x0004 */ unsigned long Length;
        /* 0x0008 */ struct _UNICODE_STRING* FileName;
        /* 0x000c */ enum _FILE_INFORMATION_CLASS FileInformationClass;
        /* 0x0010 */ unsigned long FileIndex;
      } /* size: 0x0010 */ QueryDirectory;
      struct
      {
        /* 0x0004 */ unsigned long Length;
        /* 0x0008 */ unsigned long CompletionFilter;
      } /* size: 0x0008 */ NotifyDirectory;
      struct
      {
        /* 0x0004 */ unsigned long Length;
        /* 0x0008 */ enum _FILE_INFORMATION_CLASS FileInformationClass;
      } /* size: 0x0008 */ QueryFile;
      struct
      {
        /* 0x0004 */ unsigned long Length;
        /* 0x0008 */ enum _FILE_INFORMATION_CLASS FileInformationClass;
        /* 0x000c */ struct _FILE_OBJECT* FileObject;
        union
        {
          struct
          {
            /* 0x0010 */ unsigned char ReplaceIfExists;
            /* 0x0011 */ unsigned char AdvanceOnly;
          }; /* size: 0x0002 */
          /* 0x0010 */ unsigned long ClusterCount;
          /* 0x0010 */ void* DeleteHandle;
        }; /* size: 0x0004 */
      } /* size: 0x0010 */ SetFile;
      struct
      {
        /* 0x0004 */ unsigned long Length;
        /* 0x0008 */ enum _FSINFOCLASS FsInformationClass;
      } /* size: 0x0008 */ QueryVolume;
      struct
      {
        /* 0x0004 */ unsigned long OutputBufferLength;
        /* 0x0008 */ unsigned long InputBufferLength;
        /* 0x000c */ unsigned long FsControlCode;
        /* 0x0010 */ void* Type3InputBuffer;
      } /* size: 0x0010 */ FileSystemControl;
      struct
      {
        /* 0x0004 */ union _LARGE_INTEGER* Length;
        /* 0x0008 */ unsigned long Key;
        /* 0x000c */ union _LARGE_INTEGER ByteOffset;
      } /* size: 0x0010 */ LockControl;
      struct
      {
        /* 0x0004 */ unsigned long OutputBufferLength;
        /* 0x0008 */ unsigned long InputBufferLength;
        /* 0x000c */ unsigned long IoControlCode;
        /* 0x0010 */ void* Type3InputBuffer;
      } /* size: 0x0010 */ DeviceIoControl;
      struct
      {
        /* 0x0004 */ unsigned long SecurityInformation;
        /* 0x0008 */ unsigned long Length;
      } /* size: 0x0008 */ QuerySecurity;
      struct
      {
        /* 0x0004 */ unsigned long SecurityInformation;
        /* 0x0008 */ void* SecurityDescriptor;
      } /* size: 0x0008 */ SetSecurity;
      struct
      {
        /* 0x0004 */ struct _VPB* Vpb;
        /* 0x0008 */ struct _DEVICE_OBJECT* DeviceObject;
      } /* size: 0x0008 */ MountVolume;
      struct
      {
        /* 0x0004 */ struct _VPB* Vpb;
        /* 0x0008 */ struct _DEVICE_OBJECT* DeviceObject;
      } /* size: 0x0008 */ VerifyVolume;
      struct
      {
        /* 0x0004 */ struct _SCSI_REQUEST_BLOCK* Srb;
      } /* size: 0x0004 */ Scsi;
      struct
      {
        /* 0x0004 */ enum _DEVICE_RELATION_TYPE Type;
      } /* size: 0x0004 */ QueryDeviceRelations;
      struct
      {
        /* 0x0004 */ const struct _GUID* InterfaceType;
        /* 0x0008 */ unsigned short Size;
        /* 0x000a */ unsigned short Version;
        /* 0x000c */ struct _INTERFACE* Interface;
        /* 0x0010 */ void* InterfaceSpecificData;
      } /* size: 0x0010 */ QueryInterface;
      struct
      {
        /* 0x0004 */ struct _DEVICE_CAPABILITIES* Capabilities;
      } /* size: 0x0004 */ DeviceCapabilities;
      struct
      {
        /* 0x0004 */ struct _IO_RESOURCE_REQUIREMENTS_LIST* IoResourceRequirementList;
      } /* size: 0x0004 */ FilterResourceRequirements;
      struct
      {
        /* 0x0004 */ unsigned long WhichSpace;
        /* 0x0008 */ void* Buffer;
        /* 0x000c */ unsigned long Offset;
        /* 0x0010 */ unsigned long Length;
      } /* size: 0x0010 */ ReadWriteConfig;
      struct
      {
        /* 0x0004 */ unsigned char Lock;
      } /* size: 0x0001 */ SetLock;
      struct
      {
        /* 0x0004 */ enum BUS_QUERY_ID_TYPE IdType;
      } /* size: 0x0004 */ QueryId;
      struct
      {
        /* 0x0004 */ enum DEVICE_TEXT_TYPE DeviceTextType;
        /* 0x0008 */ unsigned long LocaleId;
      } /* size: 0x0008 */ QueryDeviceText;
      struct
      {
        /* 0x0004 */ unsigned char InPath;
        /* 0x0005 */ unsigned char Reserved[3];
        /* 0x0008 */ enum _DEVICE_USAGE_NOTIFICATION_TYPE Type;
      } /* size: 0x0008 */ UsageNotification;
      struct
      {
        /* 0x0004 */ enum _SYSTEM_POWER_STATE PowerState;
      } /* size: 0x0004 */ WaitWake;
      struct
      {
        /* 0x0004 */ struct _POWER_SEQUENCE* PowerSequence;
      } /* size: 0x0004 */ PowerSequence;
      struct
      {
        union
        {
          /* 0x0004 */ unsigned long SystemContext;
          /* 0x0004 */ struct _SYSTEM_POWER_STATE_CONTEXT SystemPowerStateContext;
        }; /* size: 0x0004 */
        /* 0x0008 */ enum _POWER_STATE_TYPE Type;
        /* 0x000c */ union _POWER_STATE State;
        /* 0x0010 */ enum POWER_ACTION ShutdownType;
      } /* size: 0x0010 */ Power;
      struct
      {
        /* 0x0004 */ struct _CM_RESOURCE_LIST* AllocatedResources;
        /* 0x0008 */ struct _CM_RESOURCE_LIST* AllocatedResourcesTranslated;
      } /* size: 0x0008 */ StartDevice;
      struct
      {
        /* 0x0004 */ unsigned long ProviderId;
        /* 0x0008 */ void* DataPath;
        /* 0x000c */ unsigned long BufferSize;
        /* 0x0010 */ void* Buffer;
      } /* size: 0x0010 */ WMI;
      struct
      {
        /* 0x0004 */ void* Argument1;
        /* 0x0008 */ void* Argument2;
        /* 0x000c */ void* Argument3;
        /* 0x0010 */ void* Argument4;
      } /* size: 0x0010 */ Others;
    }; /* size: 0x0010 */
  } /* size: 0x0010 */ Parameters;
  /* 0x0014 */ struct _DEVICE_OBJECT* DeviceObject;
  /* 0x0018 */ struct _FILE_OBJECT* FileObject;
  /* 0x001c */ void* CompletionRoutine /* function */;
  /* 0x0020 */ void* Context;
} IO_STACK_LOCATION, *PIO_STACK_LOCATION; /* size: 0x0024 */

enum NetDmaEventTypes
{
  NdisMIndicateRecvEvent = 0,
  NdisPIndicateRecvEvent = 1,
  NdisPIndicateRecvCompleteEvent = 2,
  NdisPReturnPacketsExEvent = 3,
  NdisMReturnPacketsExEvent = 4,
  NdisPReturnPacketEvent = 5,
  NdisMReturnPacketEvent = 6,
  NdisMReturnPacketInRecvEvent = 7,
  DmaCopyV2VEvent = 8,
  DmaChainV2VNoCopyEvent = 9,
  DmaChainV2VCopyEvent = 10,
  DmaCopyP2VEvent = 11,
  DmaChainP2VNoCopyEvent = 12,
  DmaChainP2VCopyEvent = 13,
  DmaCopyFlushEvent = 14,
  DmaCopyAppendEvent = 15,
  DmaChainCopyAppendEvent = 16,
  DmaCopyFlushAppendEvent = 17,
  DmaCopyCheckForCompletionEvent = 18,
  DmaCopyGetPhysicalAddressEvent = 19,
  DmaCopyNullXferEvent = 20,
  DmaCopyDummyEvent = 21,
  TotalEventTypes = 22,
};

typedef enum _NDIS_PER_PACKET_INFO
{
  TcpIpChecksumPacketInfo = 0,
  IpSecPacketInfo = 1,
  TcpLargeSendPacketInfo = 2,
  ClassificationHandlePacketInfo = 3,
  NdisReserved = 4,
  ScatterGatherListPacketInfo = 5,
  Ieee8021QInfo = 6,
  OriginalPacketInfo = 7,
  PacketCancelId = 8,
  OriginalNetBufferList = 9,
  CachedNetBufferList = 10,
  ShortPacketPaddingInfo = 11,
  MaxPerPacketInfo = 12,
} NDIS_PER_PACKET_INFO, *PNDIS_PER_PACKET_INFO;

typedef struct _KAPC
{
  /* 0x0000 */ unsigned char Type;
  /* 0x0001 */ unsigned char SpareByte0;
  /* 0x0002 */ unsigned char Size;
  /* 0x0003 */ unsigned char SpareByte1;
  /* 0x0004 */ unsigned long SpareLong0;
  /* 0x0008 */ struct _KTHREAD* Thread;
  /* 0x000c */ struct _LIST_ENTRY ApcListEntry;
  /* 0x0014 */ void* KernelRoutine /* function */;
  /* 0x0018 */ void* RundownRoutine /* function */;
  /* 0x001c */ void* NormalRoutine /* function */;
  /* 0x0020 */ void* NormalContext;
  /* 0x0024 */ void* SystemArgument1;
  /* 0x0028 */ void* SystemArgument2;
  /* 0x002c */ char ApcStateIndex;
  /* 0x002d */ char ApcMode;
  /* 0x002e */ unsigned char Inserted;
  /* 0x002f */ char __PADDING__[1];
} KAPC, *PKAPC; /* size: 0x0030 */

typedef enum _NDIS_PHYSICAL_MEDIUM
{
  NdisPhysicalMediumUnspecified = 0,
  NdisPhysicalMediumWirelessLan = 1,
  NdisPhysicalMediumCableModem = 2,
  NdisPhysicalMediumPhoneLine = 3,
  NdisPhysicalMediumPowerLine = 4,
  NdisPhysicalMediumDSL = 5,
  NdisPhysicalMediumFibreChannel = 6,
  NdisPhysicalMedium1394 = 7,
  NdisPhysicalMediumWirelessWan = 8,
  NdisPhysicalMediumNative802_11 = 9,
  NdisPhysicalMediumBluetooth = 10,
  NdisPhysicalMediumInfiniband = 11,
  NdisPhysicalMediumWiMax = 12,
  NdisPhysicalMediumUWB = 13,
  NdisPhysicalMedium802_3 = 14,
  NdisPhysicalMedium802_5 = 15,
  NdisPhysicalMediumIrda = 16,
  NdisPhysicalMediumWiredWAN = 17,
  NdisPhysicalMediumWiredCoWan = 18,
  NdisPhysicalMediumOther = 19,
  NdisPhysicalMediumMax = 20,
} NDIS_PHYSICAL_MEDIUM, *PNDIS_PHYSICAL_MEDIUM;

typedef enum _NET_IF_ACCESS_TYPE
{
  NET_IF_ACCESS_LOOPBACK = 1,
  NET_IF_ACCESS_BROADCAST = 2,
  NET_IF_ACCESS_POINT_TO_POINT = 3,
  NET_IF_ACCESS_POINT_TO_MULTI_POINT = 4,
  NET_IF_ACCESS_MAXIMUM = 5,
} NET_IF_ACCESS_TYPE, *PNET_IF_ACCESS_TYPE;

typedef enum _NET_IF_CONNECTION_TYPE
{
  NET_IF_CONNECTION_DEDICATED = 1,
  NET_IF_CONNECTION_PASSIVE = 2,
  NET_IF_CONNECTION_DEMAND = 3,
  NET_IF_CONNECTION_MAXIMUM = 4,
} NET_IF_CONNECTION_TYPE, *PNET_IF_CONNECTION_TYPE;

struct KSTIME
{
  /* 0x0000 */ __int64 Time;
  /* 0x0008 */ unsigned long Numerator;
  /* 0x000c */ unsigned long Denominator;
}; /* size: 0x0010 */

struct _ETHREAD;

typedef enum _WORK_QUEUE_TYPE
{
  CriticalWorkQueue = 0,
  DelayedWorkQueue = 1,
  HyperCriticalWorkQueue = 2,
  MaximumWorkQueue = 3,
} WORK_QUEUE_TYPE, *PWORK_QUEUE_TYPE;

enum DL_ADDRESS_TYPE
{
  DlUnicast = 0,
  DlMulticast = 1,
  DlBroadcast = 2,
};

typedef enum _NDIS_FILTER_STATE
{
  NdisFilterDetached = 0,
  NdisFilterAttaching = 1,
  NdisFilterPaused = 2,
  NdisFilterRestarting = 3,
  NdisFilterRunning = 4,
  NdisFilterPausing = 5,
  NdisFilterDetaching = 6,
} NDIS_FILTER_STATE, *PNDIS_FILTER_STATE;

typedef enum _NDIS_802_11_WEP_STATUS
{
  Ndis802_11WEPEnabled = 0,
  Ndis802_11Encryption1Enabled = 0,
  Ndis802_11WEPDisabled = 1,
  Ndis802_11EncryptionDisabled = 1,
  Ndis802_11WEPKeyAbsent = 2,
  Ndis802_11Encryption1KeyAbsent = 2,
  Ndis802_11WEPNotSupported = 3,
  Ndis802_11EncryptionNotSupported = 3,
  Ndis802_11Encryption2Enabled = 4,
  Ndis802_11Encryption2KeyAbsent = 5,
  Ndis802_11Encryption3Enabled = 6,
  Ndis802_11Encryption3KeyAbsent = 7,
} NDIS_802_11_WEP_STATUS, *PNDIS_802_11_WEP_STATUS;

typedef enum _OB_OPEN_REASON
{
  ObCreateHandle = 0,
  ObOpenHandle = 1,
  ObDuplicateHandle = 2,
  ObInheritHandle = 3,
  ObMaxOpenReason = 4,
} OB_OPEN_REASON, *POB_OPEN_REASON;

typedef enum _SECURITY_OPERATION_CODE
{
  SetSecurityDescriptor = 0,
  QuerySecurityDescriptor = 1,
  DeleteSecurityDescriptor = 2,
  AssignSecurityDescriptor = 3,
} SECURITY_OPERATION_CODE, *PSECURITY_OPERATION_CODE;

typedef enum _NDIS_NET_BUFFER_LIST_INFO
{
  TcpIpChecksumNetBufferListInfo = 0,
  TcpOffloadBytesTransferred = 0,
  IPsecOffloadV1NetBufferListInfo = 1,
  IPsecOffloadV2NetBufferListInfo = 1,
  TcpLargeSendNetBufferListInfo = 2,
  TcpReceiveNoPush = 2,
  ClassificationHandleNetBufferListInfo = 3,
  Ieee8021QNetBufferListInfo = 4,
  NetBufferListCancelId = 5,
  MediaSpecificInformation = 6,
  NetBufferListFrameType = 7,
  NetBufferListProtocolId = 7,
  NetBufferListHashValue = 8,
  NetBufferListHashInfo = 9,
  WfpNetBufferListInfo = 10,
  IPsecOffloadV2TunnelNetBufferListInfo = 11,
  IPsecOffloadV2HeaderNetBufferListInfo = 12,
  MaxNetBufferListInfo = 13,
} NDIS_NET_BUFFER_LIST_INFO, *PNDIS_NET_BUFFER_LIST_INFO;

struct CO_SAP
{
  /* 0x0000 */ unsigned long SapType;
  /* 0x0004 */ unsigned long SapLength;
  /* 0x0008 */ unsigned char Sap[1];
  /* 0x0009 */ char __PADDING__[3];
}; /* size: 0x000c */

typedef enum _SECURITY_IMPERSONATION_LEVEL
{
  SecurityAnonymous = 0,
  SecurityIdentification = 1,
  SecurityImpersonation = 2,
  SecurityDelegation = 3,
} SECURITY_IMPERSONATION_LEVEL, *PSECURITY_IMPERSONATION_LEVEL;

typedef enum _MEMORY_CACHING_TYPE_ORIG
{
  MmFrameBufferCached = 2,
} MEMORY_CACHING_TYPE_ORIG, *PMEMORY_CACHING_TYPE_ORIG;

typedef struct _NET_PHYSICAL_LOCATION_LH
{
  /* 0x0000 */ unsigned long BusNumber;
  /* 0x0004 */ unsigned long SlotNumber;
  /* 0x0008 */ unsigned long FunctionNumber;
} NET_PHYSICAL_LOCATION_LH, *PNET_PHYSICAL_LOCATION_LH; /* size: 0x000c */

typedef enum _KSPIN_LOCK_QUEUE_NUMBER
{
  LockQueueDispatcherLock = 0,
  LockQueueExpansionLock = 1,
  LockQueuePfnLock = 2,
  LockQueueSystemSpaceLock = 3,
  LockQueueVacbLock = 4,
  LockQueueMasterLock = 5,
  LockQueueNonPagedPoolLock = 6,
  LockQueueIoCancelLock = 7,
  LockQueueWorkQueueLock = 8,
  LockQueueIoVpbLock = 9,
  LockQueueIoDatabaseLock = 10,
  LockQueueIoCompletionLock = 11,
  LockQueueNtfsStructLock = 12,
  LockQueueAfdWorkQueueLock = 13,
  LockQueueBcbLock = 14,
  LockQueueMmNonPagedPoolLock = 15,
  LockQueueUnusedSpare16 = 16,
  LockQueueTimerTableLock = 17,
  LockQueueMaximumLock = 49,
} KSPIN_LOCK_QUEUE_NUMBER, *PKSPIN_LOCK_QUEUE_NUMBER;

typedef struct _LUID
{
  /* 0x0000 */ unsigned long LowPart;
  /* 0x0004 */ long HighPart;
} LUID, *PLUID; /* size: 0x0008 */

typedef struct _LUID_AND_ATTRIBUTES
{
  /* 0x0000 */ struct _LUID Luid;
  /* 0x0008 */ unsigned long Attributes;
} LUID_AND_ATTRIBUTES, *PLUID_AND_ATTRIBUTES; /* size: 0x000c */

typedef struct _INITIAL_PRIVILEGE_SET
{
  /* 0x0000 */ unsigned long PrivilegeCount;
  /* 0x0004 */ unsigned long Control;
  /* 0x0008 */ struct _LUID_AND_ATTRIBUTES Privilege[3];
} INITIAL_PRIVILEGE_SET, *PINITIAL_PRIVILEGE_SET; /* size: 0x002c */

typedef struct _PRIVILEGE_SET
{
  /* 0x0000 */ unsigned long PrivilegeCount;
  /* 0x0004 */ unsigned long Control;
  /* 0x0008 */ struct _LUID_AND_ATTRIBUTES Privilege[1];
} PRIVILEGE_SET, *PPRIVILEGE_SET; /* size: 0x0014 */

enum WHEA_PCIEXPRESS_DEVICE_TYPE
{
  WheaPciExpressEndpoint = 0,
  WheaPciExpressLegacyEndpoint = 1,
  WheaPciExpressRootPort = 4,
  WheaPciExpressUpstreamSwitchPort = 5,
  WheaPciExpressDownstreamSwitchPort = 6,
  WheaPciExpressToPciXBridge = 7,
  WheaPciXToExpressBridge = 8,
  WheaPciExpressRootComplexIntegratedEndpoint = 9,
  WheaPciExpressRootComplexEventCollector = 10,
};

typedef enum _IO_ALLOCATION_ACTION
{
  KeepObject = 1,
  DeallocateObject = 2,
  DeallocateObjectKeepRegisters = 3,
} IO_ALLOCATION_ACTION, *PIO_ALLOCATION_ACTION;

typedef struct _IO_SECURITY_CONTEXT
{
  /* 0x0000 */ struct _SECURITY_QUALITY_OF_SERVICE* SecurityQos;
  /* 0x0004 */ struct _ACCESS_STATE* AccessState;
  /* 0x0008 */ unsigned long DesiredAccess;
  /* 0x000c */ unsigned long FullCreateOptions;
} IO_SECURITY_CONTEXT, *PIO_SECURITY_CONTEXT; /* size: 0x0010 */

typedef enum _PKG_TYPE
{
  NDSP_PKG = 0,
  NDSM_PKG = 1,
  NPNP_PKG = 2,
  NDCO_PKG = 3,
  NDSE_PKG = 4,
  NDST_PKG = 5,
  MAX_PKG = 6,
} PKG_TYPE, *PPKG_TYPE;

typedef enum _POOL_BLOCK_TYPE
{
  NDIS_PACKET_POOL_BLOCK_FREE = 0,
  NDIS_PACKET_POOL_BLOCK_USED = 1,
  NDIS_PACKET_POOL_BLOCK_AGING = 2,
} POOL_BLOCK_TYPE, *PPOOL_BLOCK_TYPE;

enum ReplacesCorHdrNumericDefines
{
  COMIMAGE_FLAGS_ILONLY = 1,
  COMIMAGE_FLAGS_32BITREQUIRED = 2,
  COMIMAGE_FLAGS_IL_LIBRARY = 4,
  COMIMAGE_FLAGS_STRONGNAMESIGNED = 8,
  COMIMAGE_FLAGS_NATIVE_ENTRYPOINT = 16,
  COMIMAGE_FLAGS_TRACKDEBUGDATA = 0x10000,
  COR_VERSION_MAJOR_V2 = 2,
  COR_VERSION_MAJOR = 2,
  COR_VERSION_MINOR = 0,
  COR_DELETED_NAME_LENGTH = 8,
  COR_VTABLEGAP_NAME_LENGTH = 8,
  NATIVE_TYPE_MAX_CB = 1,
  COR_ILMETHOD_SECT_SMALL_MAX_DATASIZE = 255,
  IMAGE_COR_MIH_METHODRVA = 1,
  IMAGE_COR_MIH_EHRVA = 2,
  IMAGE_COR_MIH_BASICBLOCK = 8,
  COR_VTABLE_32BIT = 1,
  COR_VTABLE_64BIT = 2,
  COR_VTABLE_FROM_UNMANAGED = 4,
  COR_VTABLE_FROM_UNMANAGED_RETAIN_APPDOMAIN = 8,
  COR_VTABLE_CALL_MOST_DERIVED = 16,
  IMAGE_COR_EATJ_THUNK_SIZE = 32,
  MAX_CLASS_NAME = 1024,
  MAX_PACKAGE_NAME = 1024,
};

typedef union _NET_LUID_LH
{
  union
  {
    /* 0x0000 */ unsigned __int64 Value;
    struct
    {
      struct /* bitfield */
      {
        /* 0x0000 */ unsigned __int64 Reserved : 24; /* bit position: 0 */
        /* 0x0000 */ unsigned __int64 NetLuidIndex : 24; /* bit position: 24 */
        /* 0x0000 */ unsigned __int64 IfType : 16; /* bit position: 48 */
      }; /* bitfield */
    } /* size: 0x0008 */ Info;
  }; /* size: 0x0008 */
} NET_LUID_LH, *PNET_LUID_LH; /* size: 0x0008 */

typedef struct _IF_COUNTED_STRING_LH
{
  /* 0x0000 */ unsigned short Length;
  /* 0x0002 */ wchar_t String[257];
} IF_COUNTED_STRING_LH, *PIF_COUNTED_STRING_LH; /* size: 0x0204 */

typedef struct _NDIS_NSI_COMPARTMENT_RW
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ long Padding_5;
  /* 0x0008 */ union _NET_LUID_LH LoopbackIfLuid;
  /* 0x0010 */ struct _GUID LoopbackIfNetworkGuid;
  /* 0x0020 */ struct _GUID LoopbackIfInterfaceGuid;
  /* 0x0030 */ struct _IF_COUNTED_STRING_LH LoopbackIfDescr;
  /* 0x0234 */ struct _IF_COUNTED_STRING_LH LoopbackIfAlias;
  /* 0x0438 */ struct _GUID CompartmentGuid;
} NDIS_NSI_COMPARTMENT_RW, *PNDIS_NSI_COMPARTMENT_RW; /* size: 0x0448 */

typedef enum _NET_IF_RCV_ADDRESS_TYPE
{
  NET_IF_RCV_ADDRESS_TYPE_OTHER = 1,
  NET_IF_RCV_ADDRESS_TYPE_VOLATILE = 2,
  NET_IF_RCV_ADDRESS_TYPE_NON_VOLATILE = 3,
} NET_IF_RCV_ADDRESS_TYPE, *PNET_IF_RCV_ADDRESS_TYPE;

typedef enum _NDIS_DEVICE_POWER_STATE
{
  NdisDeviceStateUnspecified = 0,
  NdisDeviceStateD0 = 1,
  NdisDeviceStateD1 = 2,
  NdisDeviceStateD2 = 3,
  NdisDeviceStateD3 = 4,
  NdisDeviceStateMaximum = 5,
} NDIS_DEVICE_POWER_STATE, *PNDIS_DEVICE_POWER_STATE;

typedef struct _SET_INFORMATION
{
  /* 0x0000 */ unsigned long Oid;
  /* 0x0004 */ void* InformationBuffer;
  /* 0x0008 */ unsigned int InformationBufferLength;
  /* 0x000c */ unsigned int BytesRead;
  /* 0x0010 */ unsigned int BytesNeeded;
} SET_INFORMATION, *PSET_INFORMATION; /* size: 0x0014 */

typedef struct _NAMED_PIPE_CREATE_PARAMETERS
{
  /* 0x0000 */ unsigned long NamedPipeType;
  /* 0x0004 */ unsigned long ReadMode;
  /* 0x0008 */ unsigned long CompletionMode;
  /* 0x000c */ unsigned long MaximumInstances;
  /* 0x0010 */ unsigned long InboundQuota;
  /* 0x0014 */ unsigned long OutboundQuota;
  /* 0x0018 */ union _LARGE_INTEGER DefaultTimeout;
  /* 0x0020 */ unsigned char TimeoutSpecified;
  /* 0x0021 */ char __PADDING__[7];
} NAMED_PIPE_CREATE_PARAMETERS, *PNAMED_PIPE_CREATE_PARAMETERS; /* size: 0x0028 */

typedef enum _REG_NOTIFY_CLASS
{
  RegNtDeleteKey = 0,
  RegNtPreDeleteKey = 0,
  RegNtSetValueKey = 1,
  RegNtPreSetValueKey = 1,
  RegNtDeleteValueKey = 2,
  RegNtPreDeleteValueKey = 2,
  RegNtSetInformationKey = 3,
  RegNtPreSetInformationKey = 3,
  RegNtRenameKey = 4,
  RegNtPreRenameKey = 4,
  RegNtEnumerateKey = 5,
  RegNtPreEnumerateKey = 5,
  RegNtEnumerateValueKey = 6,
  RegNtPreEnumerateValueKey = 6,
  RegNtQueryKey = 7,
  RegNtPreQueryKey = 7,
  RegNtQueryValueKey = 8,
  RegNtPreQueryValueKey = 8,
  RegNtQueryMultipleValueKey = 9,
  RegNtPreQueryMultipleValueKey = 9,
  RegNtPreCreateKey = 10,
  RegNtPostCreateKey = 11,
  RegNtPreOpenKey = 12,
  RegNtPostOpenKey = 13,
  RegNtKeyHandleClose = 14,
  RegNtPreKeyHandleClose = 14,
  RegNtPostDeleteKey = 15,
  RegNtPostSetValueKey = 16,
  RegNtPostDeleteValueKey = 17,
  RegNtPostSetInformationKey = 18,
  RegNtPostRenameKey = 19,
  RegNtPostEnumerateKey = 20,
  RegNtPostEnumerateValueKey = 21,
  RegNtPostQueryKey = 22,
  RegNtPostQueryValueKey = 23,
  RegNtPostQueryMultipleValueKey = 24,
  RegNtPostKeyHandleClose = 25,
  RegNtPreCreateKeyEx = 26,
  RegNtPostCreateKeyEx = 27,
  RegNtPreOpenKeyEx = 28,
  RegNtPostOpenKeyEx = 29,
  RegNtPreFlushKey = 30,
  RegNtPostFlushKey = 31,
  RegNtPreLoadKey = 32,
  RegNtPostLoadKey = 33,
  RegNtPreUnLoadKey = 34,
  RegNtPostUnLoadKey = 35,
  RegNtPreQueryKeySecurity = 36,
  RegNtPostQueryKeySecurity = 37,
  RegNtPreSetKeySecurity = 38,
  RegNtPostSetKeySecurity = 39,
  RegNtCallbackObjectContextCleanup = 40,
  MaxRegNtNotifyClass = 41,
} REG_NOTIFY_CLASS, *PREG_NOTIFY_CLASS;

typedef enum _NDIS_FILTER_TYPE
{
  NdisFilterTypeMonitoring = 1,
  NdisFilterTypeModifying = 2,
} NDIS_FILTER_TYPE, *PNDIS_FILTER_TYPE;

typedef enum _NDIS_FILTER_RUN_TYPE
{
  NdisFilterRunTypeMandatory = 1,
  NdisFilterRunTypeOptional = 2,
} NDIS_FILTER_RUN_TYPE, *PNDIS_FILTER_RUN_TYPE;

typedef enum _IRQ_DEVICE_POLICY
{
  IrqPolicyMachineDefault = 0,
  IrqPolicyAllCloseProcessors = 1,
  IrqPolicyOneCloseProcessor = 2,
  IrqPolicyAllProcessorsInMachine = 3,
  IrqPolicySpecifiedProcessors = 4,
  IrqPolicySpreadMessagesAcrossAllProcessors = 5,
} IRQ_DEVICE_POLICY, *PIRQ_DEVICE_POLICY;

typedef enum _IRQ_PRIORITY
{
  IrqPriorityUndefined = 0,
  IrqPriorityLow = 1,
  IrqPriorityNormal = 2,
  IrqPriorityHigh = 3,
} IRQ_PRIORITY, *PIRQ_PRIORITY;

typedef enum _DOT11_PHY_TYPE
{
  dot11_phy_type_unknown = 0,
  dot11_phy_type_any = 0,
  dot11_phy_type_fhss = 1,
  dot11_phy_type_dsss = 2,
  dot11_phy_type_irbaseband = 3,
  dot11_phy_type_ofdm = 4,
  dot11_phy_type_hrdsss = 5,
  dot11_phy_type_erp = 6,
  dot11_phy_type_ht = 7,
  dot11_phy_type_IHV_start = -2147483648,
  dot11_phy_type_IHV_end = -1,
} DOT11_PHY_TYPE, *PDOT11_PHY_TYPE;

typedef struct _NDIS_DPC_TRACKER
{
  /* 0x0000 */ unsigned __int64 TotalCycleInRcvTranslation;
  /* 0x0008 */ unsigned __int64 TotalCycleInReturnTranslation;
  /* 0x0010 */ unsigned __int64 TotalCycleInReturn;
  /* 0x0018 */ unsigned __int64 TotalCycleInMiniportReturn;
  /* 0x0020 */ unsigned __int64 TotalCycleSendComplete;
  /* 0x0028 */ unsigned __int64 TotalCycleInNdis;
  /* 0x0030 */ unsigned __int64 TotalCycleInTransfer;
  /* 0x0038 */ unsigned long TotalNumInRcvTranslation;
  /* 0x003c */ unsigned long TotalNumInReturnTranslation;
  /* 0x0040 */ unsigned long TotalNumInReturn;
  /* 0x0044 */ unsigned long TotalNumInMiniportReturn;
  /* 0x0048 */ unsigned long TotalNumSendComplete;
  /* 0x004c */ unsigned long TotalNumInNdis;
  /* 0x0050 */ unsigned long TotalNumInTransfer;
  /* 0x0054 */ long Padding_6;
  /* 0x0058 */ unsigned __int64 DpcStartCycle;
  /* 0x0060 */ unsigned __int64 DpcStopCycle;
  /* 0x0068 */ unsigned __int64 RcvTranslationTrace[256];
  /* 0x0868 */ unsigned __int64 ReturnTranslationTrace[256];
  /* 0x1068 */ unsigned __int64 ReturnTrace[256];
  /* 0x1868 */ unsigned __int64 NdisTrace[256];
  /* 0x2068 */ unsigned __int64 SendCompleteTrace[256];
  /* 0x2868 */ unsigned __int64 MiniportReturnTrace[256];
  /* 0x3068 */ unsigned __int64 ProtocolRcvTrace[256];
  /* 0x3868 */ unsigned __int64 MiniportTransferTrace[256];
  /* 0x4068 */ unsigned char RcvTranslationTraceIndex;
  /* 0x4069 */ unsigned char ReturnTranslationTraceIndex;
  /* 0x406a */ unsigned char NdisTraceIndex;
  /* 0x406b */ unsigned char ReturnTraceIndex;
  /* 0x406c */ unsigned char SendCompleteTraceIndex;
  /* 0x406d */ unsigned char MiniportReturnTraceIndex;
  /* 0x406e */ unsigned char ProtocolRcvTraceIndex;
  /* 0x406f */ unsigned char MiniportTransferTraceIndex;
} NDIS_DPC_TRACKER, *PNDIS_DPC_TRACKER; /* size: 0x4070 */

typedef struct _NDIS_WAN_PACKET
{
  /* 0x0000 */ struct _LIST_ENTRY WanPacketQueue;
  /* 0x0008 */ unsigned char* CurrentBuffer;
  /* 0x000c */ unsigned long CurrentLength;
  /* 0x0010 */ unsigned char* StartBuffer;
  /* 0x0014 */ unsigned char* EndBuffer;
  /* 0x0018 */ void* ProtocolReserved1;
  /* 0x001c */ void* ProtocolReserved2;
  /* 0x0020 */ void* ProtocolReserved3;
  /* 0x0024 */ void* ProtocolReserved4;
  /* 0x0028 */ void* MacReserved1;
  /* 0x002c */ void* MacReserved2;
  /* 0x0030 */ void* MacReserved3;
  /* 0x0034 */ void* MacReserved4;
} NDIS_WAN_PACKET, *PNDIS_WAN_PACKET; /* size: 0x0038 */

typedef enum _NDIS_HALT_ACTION
{
  NdisHaltDeviceDisabled = 0,
  NdisHaltDeviceInstanceDeInitialized = 1,
  NdisHaltDevicePoweredDown = 2,
  NdisHaltDeviceSurpriseRemoved = 3,
  NdisHaltDeviceFailed = 4,
  NdisHaltDeviceInitializationFailed = 5,
  NdisHaltDeviceStopped = 6,
} NDIS_HALT_ACTION, *PNDIS_HALT_ACTION;

typedef enum _KINTERRUPT_MODE
{
  LevelSensitive = 0,
  Latched = 1,
} KINTERRUPT_MODE, *PKINTERRUPT_MODE;

typedef enum _KINTERRUPT_POLARITY
{
  InterruptPolarityUnknown = 0,
  InterruptActiveHigh = 1,
  InterruptActiveLow = 2,
} KINTERRUPT_POLARITY, *PKINTERRUPT_POLARITY;

struct LIST_ENTRY64
{
  /* 0x0000 */ unsigned __int64 Flink;
  /* 0x0008 */ unsigned __int64 Blink;
}; /* size: 0x0010 */

typedef struct _KSDEVICE_DISPATCH
{
  /* 0x0000 */ void* Add /* function */;
  /* 0x0004 */ void* Start /* function */;
  /* 0x0008 */ void* PostStart /* function */;
  /* 0x000c */ void* QueryStop /* function */;
  /* 0x0010 */ void* CancelStop /* function */;
  /* 0x0014 */ void* Stop /* function */;
  /* 0x0018 */ void* QueryRemove /* function */;
  /* 0x001c */ void* CancelRemove /* function */;
  /* 0x0020 */ void* Remove /* function */;
  /* 0x0024 */ void* QueryCapabilities /* function */;
  /* 0x0028 */ void* SurpriseRemoval /* function */;
  /* 0x002c */ void* QueryPower /* function */;
  /* 0x0030 */ void* SetPower /* function */;
  /* 0x0034 */ void* QueryInterface /* function */;
} KSDEVICE_DISPATCH, *PKSDEVICE_DISPATCH; /* size: 0x0038 */

struct LIST_ENTRY32
{
  /* 0x0000 */ unsigned long Flink;
  /* 0x0004 */ unsigned long Blink;
}; /* size: 0x0008 */

typedef struct _NET_DEVICE_PNP_EVENT
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long PortNumber;
  /* 0x0008 */ enum _NDIS_DEVICE_PNP_EVENT DevicePnPEvent;
  /* 0x000c */ void* InformationBuffer;
  /* 0x0010 */ unsigned long InformationBufferLength;
  /* 0x0014 */ unsigned char NdisReserved[8];
} NET_DEVICE_PNP_EVENT, *PNET_DEVICE_PNP_EVENT; /* size: 0x001c */

struct _TP_POOL;

struct _TP_CLEANUP_GROUP;

struct _ACTIVATION_CONTEXT;

struct _TP_CALLBACK_INSTANCE;

struct KS_FRAMING_RANGE
{
  /* 0x0000 */ unsigned long MinFrameSize;
  /* 0x0004 */ unsigned long MaxFrameSize;
  /* 0x0008 */ unsigned long Stepping;
}; /* size: 0x000c */

struct KS_FRAMING_RANGE_WEIGHTED
{
  /* 0x0000 */ struct KS_FRAMING_RANGE Range;
  /* 0x000c */ unsigned long InPlaceWeight;
  /* 0x0010 */ unsigned long NotInPlaceWeight;
}; /* size: 0x0014 */

struct KS_FRAMING_ITEM
{
  /* 0x0000 */ struct _GUID MemoryType;
  /* 0x0010 */ struct _GUID BusType;
  /* 0x0020 */ unsigned long MemoryFlags;
  /* 0x0024 */ unsigned long BusFlags;
  /* 0x0028 */ unsigned long Flags;
  /* 0x002c */ unsigned long Frames;
  /* 0x0030 */ unsigned long FileAlignment;
  /* 0x0034 */ unsigned long MemoryTypeWeight;
  /* 0x0038 */ struct KS_FRAMING_RANGE PhysicalRange;
  /* 0x0044 */ struct KS_FRAMING_RANGE_WEIGHTED FramingRange;
}; /* size: 0x0058 */

struct _SCSI_REQUEST_BLOCK;

typedef struct _TP_CALLBACK_ENVIRON
{
  /* 0x0000 */ unsigned long Version;
  /* 0x0004 */ struct _TP_POOL* Pool;
  /* 0x0008 */ struct _TP_CLEANUP_GROUP* CleanupGroup;
  /* 0x000c */ void* CleanupGroupCancelCallback /* function */;
  /* 0x0010 */ void* RaceDll;
  /* 0x0014 */ struct _ACTIVATION_CONTEXT* ActivationContext;
  /* 0x0018 */ void* FinalizationCallback /* function */;
  union
  {
    union
    {
      /* 0x001c */ unsigned long Flags;
      struct
      {
        struct /* bitfield */
        {
          /* 0x001c */ unsigned long LongFunction : 1; /* bit position: 0 */
          /* 0x001c */ unsigned long Private : 31; /* bit position: 1 */
        }; /* bitfield */
      } /* size: 0x0004 */ s;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ u;
} TP_CALLBACK_ENVIRON, *PTP_CALLBACK_ENVIRON; /* size: 0x0020 */

typedef struct _DEVICE_CAPABILITIES
{
  /* 0x0000 */ unsigned short Size;
  /* 0x0002 */ unsigned short Version;
  struct /* bitfield */
  {
    /* 0x0004 */ unsigned long DeviceD1 : 1; /* bit position: 0 */
    /* 0x0004 */ unsigned long DeviceD2 : 1; /* bit position: 1 */
    /* 0x0004 */ unsigned long LockSupported : 1; /* bit position: 2 */
    /* 0x0004 */ unsigned long EjectSupported : 1; /* bit position: 3 */
    /* 0x0004 */ unsigned long Removable : 1; /* bit position: 4 */
    /* 0x0004 */ unsigned long DockDevice : 1; /* bit position: 5 */
    /* 0x0004 */ unsigned long UniqueID : 1; /* bit position: 6 */
    /* 0x0004 */ unsigned long SilentInstall : 1; /* bit position: 7 */
    /* 0x0004 */ unsigned long RawDeviceOK : 1; /* bit position: 8 */
    /* 0x0004 */ unsigned long SurpriseRemovalOK : 1; /* bit position: 9 */
    /* 0x0004 */ unsigned long WakeFromD0 : 1; /* bit position: 10 */
    /* 0x0004 */ unsigned long WakeFromD1 : 1; /* bit position: 11 */
    /* 0x0004 */ unsigned long WakeFromD2 : 1; /* bit position: 12 */
    /* 0x0004 */ unsigned long WakeFromD3 : 1; /* bit position: 13 */
    /* 0x0004 */ unsigned long HardwareDisabled : 1; /* bit position: 14 */
    /* 0x0004 */ unsigned long NonDynamic : 1; /* bit position: 15 */
    /* 0x0004 */ unsigned long WarmEjectSupported : 1; /* bit position: 16 */
    /* 0x0004 */ unsigned long NoDisplayInUI : 1; /* bit position: 17 */
    /* 0x0004 */ unsigned long Reserved : 14; /* bit position: 18 */
  }; /* bitfield */
  /* 0x0008 */ unsigned long Address;
  /* 0x000c */ unsigned long UINumber;
  /* 0x0010 */ enum _DEVICE_POWER_STATE DeviceState[7];
  /* 0x002c */ enum _SYSTEM_POWER_STATE SystemWake;
  /* 0x0030 */ enum _DEVICE_POWER_STATE DeviceWake;
  /* 0x0034 */ unsigned long D1Latency;
  /* 0x0038 */ unsigned long D2Latency;
  /* 0x003c */ unsigned long D3Latency;
} DEVICE_CAPABILITIES, *PDEVICE_CAPABILITIES; /* size: 0x0040 */

typedef struct _IO_RESOURCE_DESCRIPTOR
{
  /* 0x0000 */ unsigned char Option;
  /* 0x0001 */ unsigned char Type;
  /* 0x0002 */ unsigned char ShareDisposition;
  /* 0x0003 */ unsigned char Spare1;
  /* 0x0004 */ unsigned short Flags;
  /* 0x0006 */ unsigned short Spare2;
  union
  {
    union
    {
      struct
      {
        /* 0x0008 */ unsigned long Length;
        /* 0x000c */ unsigned long Alignment;
        /* 0x0010 */ union _LARGE_INTEGER MinimumAddress;
        /* 0x0018 */ union _LARGE_INTEGER MaximumAddress;
      } /* size: 0x0018 */ Port;
      struct
      {
        /* 0x0008 */ unsigned long Length;
        /* 0x000c */ unsigned long Alignment;
        /* 0x0010 */ union _LARGE_INTEGER MinimumAddress;
        /* 0x0018 */ union _LARGE_INTEGER MaximumAddress;
      } /* size: 0x0018 */ Memory;
      struct
      {
        /* 0x0008 */ unsigned long MinimumVector;
        /* 0x000c */ unsigned long MaximumVector;
        /* 0x0010 */ enum _IRQ_DEVICE_POLICY AffinityPolicy;
        /* 0x0014 */ enum _IRQ_PRIORITY PriorityPolicy;
        /* 0x0018 */ unsigned long TargetedProcessors;
      } /* size: 0x0014 */ Interrupt;
      struct
      {
        /* 0x0008 */ unsigned long MinimumChannel;
        /* 0x000c */ unsigned long MaximumChannel;
      } /* size: 0x0008 */ Dma;
      struct
      {
        /* 0x0008 */ unsigned long Length;
        /* 0x000c */ unsigned long Alignment;
        /* 0x0010 */ union _LARGE_INTEGER MinimumAddress;
        /* 0x0018 */ union _LARGE_INTEGER MaximumAddress;
      } /* size: 0x0018 */ Generic;
      struct
      {
        /* 0x0008 */ unsigned long Data[3];
      } /* size: 0x000c */ DevicePrivate;
      struct
      {
        /* 0x0008 */ unsigned long Length;
        /* 0x000c */ unsigned long MinBusNumber;
        /* 0x0010 */ unsigned long MaxBusNumber;
        /* 0x0014 */ unsigned long Reserved;
      } /* size: 0x0010 */ BusNumber;
      struct
      {
        /* 0x0008 */ unsigned long Priority;
        /* 0x000c */ unsigned long Reserved1;
        /* 0x0010 */ unsigned long Reserved2;
      } /* size: 0x000c */ ConfigData;
      struct
      {
        /* 0x0008 */ unsigned long Length40;
        /* 0x000c */ unsigned long Alignment40;
        /* 0x0010 */ union _LARGE_INTEGER MinimumAddress;
        /* 0x0018 */ union _LARGE_INTEGER MaximumAddress;
      } /* size: 0x0018 */ Memory40;
      struct
      {
        /* 0x0008 */ unsigned long Length48;
        /* 0x000c */ unsigned long Alignment48;
        /* 0x0010 */ union _LARGE_INTEGER MinimumAddress;
        /* 0x0018 */ union _LARGE_INTEGER MaximumAddress;
      } /* size: 0x0018 */ Memory48;
      struct
      {
        /* 0x0008 */ unsigned long Length64;
        /* 0x000c */ unsigned long Alignment64;
        /* 0x0010 */ union _LARGE_INTEGER MinimumAddress;
        /* 0x0018 */ union _LARGE_INTEGER MaximumAddress;
      } /* size: 0x0018 */ Memory64;
    }; /* size: 0x0018 */
  } /* size: 0x0018 */ u;
} IO_RESOURCE_DESCRIPTOR, *PIO_RESOURCE_DESCRIPTOR; /* size: 0x0020 */

typedef struct _IO_RESOURCE_LIST
{
  /* 0x0000 */ unsigned short Version;
  /* 0x0002 */ unsigned short Revision;
  /* 0x0004 */ unsigned long Count;
  /* 0x0008 */ struct _IO_RESOURCE_DESCRIPTOR Descriptors[1];
} IO_RESOURCE_LIST, *PIO_RESOURCE_LIST; /* size: 0x0028 */

typedef struct _IO_RESOURCE_REQUIREMENTS_LIST
{
  /* 0x0000 */ unsigned long ListSize;
  /* 0x0004 */ enum _INTERFACE_TYPE InterfaceType;
  /* 0x0008 */ unsigned long BusNumber;
  /* 0x000c */ unsigned long SlotNumber;
  /* 0x0010 */ unsigned long Reserved[3];
  /* 0x001c */ unsigned long AlternativeLists;
  /* 0x0020 */ struct _IO_RESOURCE_LIST List[1];
} IO_RESOURCE_REQUIREMENTS_LIST, *PIO_RESOURCE_REQUIREMENTS_LIST; /* size: 0x0048 */

typedef struct _TP_TASK_CALLBACKS
{
  /* 0x0000 */ void* ExecuteCallback /* function */;
  /* 0x0004 */ void* Unposted /* function */;
} TP_TASK_CALLBACKS, *PTP_TASK_CALLBACKS; /* size: 0x0008 */

typedef struct _SECURITY_SUBJECT_CONTEXT
{
  /* 0x0000 */ void* ClientToken;
  /* 0x0004 */ enum _SECURITY_IMPERSONATION_LEVEL ImpersonationLevel;
  /* 0x0008 */ void* PrimaryToken;
  /* 0x000c */ void* ProcessAuditId;
} SECURITY_SUBJECT_CONTEXT, *PSECURITY_SUBJECT_CONTEXT; /* size: 0x0010 */

typedef struct _UNICODE_STRING
{
  /* 0x0000 */ unsigned short Length;
  /* 0x0002 */ unsigned short MaximumLength;
  /* 0x0004 */ unsigned short* Buffer;
} UNICODE_STRING, *PUNICODE_STRING; /* size: 0x0008 */

typedef struct _ACCESS_STATE
{
  /* 0x0000 */ struct _LUID OperationID;
  /* 0x0008 */ unsigned char SecurityEvaluated;
  /* 0x0009 */ unsigned char GenerateAudit;
  /* 0x000a */ unsigned char GenerateOnClose;
  /* 0x000b */ unsigned char PrivilegesAllocated;
  /* 0x000c */ unsigned long Flags;
  /* 0x0010 */ unsigned long RemainingDesiredAccess;
  /* 0x0014 */ unsigned long PreviouslyGrantedAccess;
  /* 0x0018 */ unsigned long OriginalDesiredAccess;
  /* 0x001c */ struct _SECURITY_SUBJECT_CONTEXT SubjectSecurityContext;
  /* 0x002c */ void* SecurityDescriptor;
  /* 0x0030 */ void* AuxData;
  union
  {
    union
    {
      /* 0x0034 */ struct _INITIAL_PRIVILEGE_SET InitialPrivilegeSet;
      /* 0x0034 */ struct _PRIVILEGE_SET PrivilegeSet;
    }; /* size: 0x002c */
  } /* size: 0x002c */ Privileges;
  /* 0x0060 */ unsigned char AuditPrivileges;
  /* 0x0061 */ char Padding_7[3];
  /* 0x0064 */ struct _UNICODE_STRING ObjectName;
  /* 0x006c */ struct _UNICODE_STRING ObjectTypeName;
} ACCESS_STATE, *PACCESS_STATE; /* size: 0x0074 */

typedef struct _TP_TASK
{
  /* 0x0000 */ const struct _TP_TASK_CALLBACKS* Callbacks;
} TP_TASK, *PTP_TASK; /* size: 0x0004 */

typedef struct _SECURITY_QUALITY_OF_SERVICE
{
  /* 0x0000 */ unsigned long Length;
  /* 0x0004 */ enum _SECURITY_IMPERSONATION_LEVEL ImpersonationLevel;
  /* 0x0008 */ unsigned char ContextTrackingMode;
  /* 0x0009 */ unsigned char EffectiveOnly;
  /* 0x000a */ char __PADDING__[2];
} SECURITY_QUALITY_OF_SERVICE, *PSECURITY_QUALITY_OF_SERVICE; /* size: 0x000c */

typedef struct _TP_DIRECT
{
  /* 0x0000 */ void* Callback /* function */;
} TP_DIRECT, *PTP_DIRECT; /* size: 0x0004 */

typedef struct _IO_STATUS_BLOCK
{
  union
  {
    /* 0x0000 */ long Status;
    /* 0x0000 */ void* Pointer;
  }; /* size: 0x0004 */
  /* 0x0004 */ unsigned long Information;
} IO_STATUS_BLOCK, *PIO_STATUS_BLOCK; /* size: 0x0008 */

typedef struct _IF_PHYSICAL_ADDRESS_LH
{
  /* 0x0000 */ unsigned short Length;
  /* 0x0002 */ unsigned char Address[32];
} IF_PHYSICAL_ADDRESS_LH, *PIF_PHYSICAL_ADDRESS_LH; /* size: 0x0022 */

typedef struct _NDIS_IF_BLOCK
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ struct _LIST_ENTRY Link;
  /* 0x000c */ struct _LIST_ENTRY ProviderLink;
  /* 0x0014 */ struct _LIST_ENTRY NetworkLink;
  /* 0x001c */ struct _NDIS_IF_RCV_ADDRESS* ifRcvAddressTable;
  /* 0x0020 */ unsigned long ifRcvAddressCount;
  /* 0x0024 */ unsigned long LowerLayerIfCount;
  /* 0x0028 */ unsigned long HigherLayerIfCount;
  /* 0x002c */ long Ref;
  /* 0x0030 */ long MiniportRef;
  /* 0x0034 */ long Padding_8;
  /* 0x0038 */ union _NET_LUID_LH NetLuid;
  /* 0x0040 */ void* ProviderIfContext;
  /* 0x0044 */ struct _NDIS_IF_PROVIDER_BLOCK* ProviderHandle;
  /* 0x0048 */ unsigned long Flags;
  /* 0x004c */ struct _NET_PHYSICAL_LOCATION_LH PhysicalLocation;
  /* 0x0058 */ unsigned long WanTunnelType;
  /* 0x005c */ unsigned long PortNumber;
  /* 0x0060 */ unsigned __int64 ifLastChange;
  /* 0x0068 */ unsigned __int64 ifCounterDiscontinuityTime;
  union
  {
    /* 0x0070 */ unsigned char RosInfo;
    /* 0x0070 */ unsigned long ifIndex;
  }; /* size: 0x0004 */
  /* 0x0074 */ struct _IF_COUNTED_STRING_LH ifDescr;
  /* 0x0278 */ unsigned short ifType;
  /* 0x027a */ char Padding_9[2];
  /* 0x027c */ enum _NET_IF_ACCESS_TYPE AccessType;
  /* 0x0280 */ enum _NET_IF_DIRECTION_TYPE DirectionType;
  /* 0x0284 */ enum _NET_IF_CONNECTION_TYPE ConnectionType;
  /* 0x0288 */ struct _GUID InterfaceGuid;
  /* 0x0298 */ unsigned char ifConnectorPresent;
  /* 0x0299 */ char Padding_10[3];
  /* 0x029c */ unsigned long ifFlags;
  /* 0x02a0 */ enum _NDIS_MEDIUM MediaType;
  /* 0x02a4 */ enum _NDIS_PHYSICAL_MEDIUM PhysicalMediumType;
  union
  {
    /* 0x02a8 */ unsigned char RodInfo;
    /* 0x02a8 */ unsigned int CompartmentId;
  }; /* size: 0x0004 */
  /* 0x02ac */ struct _GUID NetworkGuid;
  /* 0x02bc */ struct _IF_COUNTED_STRING_LH ifAlias;
  /* 0x04c0 */ enum _NET_IF_OPER_STATUS ifOperStatus;
  /* 0x04c4 */ unsigned long ifOperStatusFlags;
  /* 0x04c8 */ unsigned long ifMtu;
  /* 0x04cc */ struct _IF_PHYSICAL_ADDRESS_LH ifPhysAddress;
  /* 0x04ee */ struct _IF_PHYSICAL_ADDRESS_LH PermanentPhysAddress;
  /* 0x0510 */ enum _NET_IF_ADMIN_STATUS ifAdminStatus;
  /* 0x0514 */ long Padding_11;
  /* 0x0518 */ unsigned __int64 XmitLinkSpeed;
  /* 0x0520 */ unsigned __int64 RcvLinkSpeed;
  /* 0x0528 */ unsigned char ifPromiscuousMode;
  /* 0x0529 */ unsigned char ifDeviceWakeUpEnable;
  /* 0x052a */ char Padding_12[2];
  /* 0x052c */ enum _NET_IF_MEDIA_CONNECT_STATE MediaConnectState;
  /* 0x0530 */ enum _NET_IF_MEDIA_DUPLEX_STATE MediaDuplexState;
  /* 0x0534 */ long Padding_13;
  /* 0x0538 */ struct _NDIS_IF_NETWORK_BLOCK* Network;
  /* 0x053c */ struct _NDIS_IF_COMPARTMENT_BLOCK* Compartment;
  /* 0x0540 */ struct _KEVENT* AsyncEvent;
  /* 0x0544 */ struct _KEVENT* MiniportAsyncEvent;
  /* 0x0548 */ unsigned char bNdisIsProvider;
  /* 0x0549 */ unsigned char MiniportPresent;
  /* 0x054a */ char Padding_14[2];
  /* 0x054c */ unsigned long SupportedStatistics;
} NDIS_IF_BLOCK, *PNDIS_IF_BLOCK; /* size: 0x0550 */

typedef struct _SINGLE_LIST_ENTRY
{
  /* 0x0000 */ struct _SINGLE_LIST_ENTRY* Next;
} SINGLE_LIST_ENTRY, *PSINGLE_LIST_ENTRY; /* size: 0x0004 */

struct KSEVENT_ITEM
{
  /* 0x0000 */ unsigned long EventId;
  /* 0x0004 */ unsigned long DataInput;
  /* 0x0008 */ unsigned long ExtraEntryData;
  /* 0x000c */ void* AddHandler /* function */;
  /* 0x0010 */ void* RemoveHandler /* function */;
  /* 0x0014 */ void* SupportHandler /* function */;
}; /* size: 0x0018 */

typedef struct _STRING
{
  /* 0x0000 */ unsigned short Length;
  /* 0x0002 */ unsigned short MaximumLength;
  /* 0x0004 */ char* Buffer;
} STRING, *PSTRING; /* size: 0x0008 */

typedef struct _FILE_BASIC_INFORMATION
{
  /* 0x0000 */ union _LARGE_INTEGER CreationTime;
  /* 0x0008 */ union _LARGE_INTEGER LastAccessTime;
  /* 0x0010 */ union _LARGE_INTEGER LastWriteTime;
  /* 0x0018 */ union _LARGE_INTEGER ChangeTime;
  /* 0x0020 */ unsigned long FileAttributes;
  /* 0x0024 */ long __PADDING__[1];
} FILE_BASIC_INFORMATION, *PFILE_BASIC_INFORMATION; /* size: 0x0028 */

typedef struct _IMAGE_FILE_HEADER
{
  /* 0x0000 */ unsigned short Machine;
  /* 0x0002 */ unsigned short NumberOfSections;
  /* 0x0004 */ unsigned long TimeDateStamp;
  /* 0x0008 */ unsigned long PointerToSymbolTable;
  /* 0x000c */ unsigned long NumberOfSymbols;
  /* 0x0010 */ unsigned short SizeOfOptionalHeader;
  /* 0x0012 */ unsigned short Characteristics;
} IMAGE_FILE_HEADER, *PIMAGE_FILE_HEADER; /* size: 0x0014 */

typedef struct _IMAGE_DATA_DIRECTORY
{
  /* 0x0000 */ unsigned long VirtualAddress;
  /* 0x0004 */ unsigned long Size;
} IMAGE_DATA_DIRECTORY, *PIMAGE_DATA_DIRECTORY; /* size: 0x0008 */

typedef struct _IMAGE_OPTIONAL_HEADER
{
  /* 0x0000 */ unsigned short Magic;
  /* 0x0002 */ unsigned char MajorLinkerVersion;
  /* 0x0003 */ unsigned char MinorLinkerVersion;
  /* 0x0004 */ unsigned long SizeOfCode;
  /* 0x0008 */ unsigned long SizeOfInitializedData;
  /* 0x000c */ unsigned long SizeOfUninitializedData;
  /* 0x0010 */ unsigned long AddressOfEntryPoint;
  /* 0x0014 */ unsigned long BaseOfCode;
  /* 0x0018 */ unsigned long BaseOfData;
  /* 0x001c */ unsigned long ImageBase;
  /* 0x0020 */ unsigned long SectionAlignment;
  /* 0x0024 */ unsigned long FileAlignment;
  /* 0x0028 */ unsigned short MajorOperatingSystemVersion;
  /* 0x002a */ unsigned short MinorOperatingSystemVersion;
  /* 0x002c */ unsigned short MajorImageVersion;
  /* 0x002e */ unsigned short MinorImageVersion;
  /* 0x0030 */ unsigned short MajorSubsystemVersion;
  /* 0x0032 */ unsigned short MinorSubsystemVersion;
  /* 0x0034 */ unsigned long Win32VersionValue;
  /* 0x0038 */ unsigned long SizeOfImage;
  /* 0x003c */ unsigned long SizeOfHeaders;
  /* 0x0040 */ unsigned long CheckSum;
  /* 0x0044 */ unsigned short Subsystem;
  /* 0x0046 */ unsigned short DllCharacteristics;
  /* 0x0048 */ unsigned long SizeOfStackReserve;
  /* 0x004c */ unsigned long SizeOfStackCommit;
  /* 0x0050 */ unsigned long SizeOfHeapReserve;
  /* 0x0054 */ unsigned long SizeOfHeapCommit;
  /* 0x0058 */ unsigned long LoaderFlags;
  /* 0x005c */ unsigned long NumberOfRvaAndSizes;
  /* 0x0060 */ struct _IMAGE_DATA_DIRECTORY DataDirectory[16];
} IMAGE_OPTIONAL_HEADER, *PIMAGE_OPTIONAL_HEADER; /* size: 0x00e0 */

typedef struct _IMAGE_NT_HEADERS
{
  /* 0x0000 */ unsigned long Signature;
  /* 0x0004 */ struct _IMAGE_FILE_HEADER FileHeader;
  /* 0x0018 */ struct _IMAGE_OPTIONAL_HEADER OptionalHeader;
} IMAGE_NT_HEADERS, *PIMAGE_NT_HEADERS; /* size: 0x00f8 */

struct KSPROPERTY_MEMBERSHEADER
{
  /* 0x0000 */ unsigned long MembersFlags;
  /* 0x0004 */ unsigned long MembersSize;
  /* 0x0008 */ unsigned long MembersCount;
  /* 0x000c */ unsigned long Flags;
}; /* size: 0x0010 */

struct KSPROPERTY_MEMBERSLIST
{
  /* 0x0000 */ struct KSPROPERTY_MEMBERSHEADER MembersHeader;
  /* 0x0010 */ const void* Members;
}; /* size: 0x0014 */

typedef struct _EVENT_DATA_DESCRIPTOR
{
  /* 0x0000 */ unsigned __int64 Ptr;
  /* 0x0008 */ unsigned long Size;
  /* 0x000c */ unsigned long Reserved;
} EVENT_DATA_DESCRIPTOR, *PEVENT_DATA_DESCRIPTOR; /* size: 0x0010 */

typedef struct _EVENT_DESCRIPTOR
{
  /* 0x0000 */ unsigned short Id;
  /* 0x0002 */ unsigned char Version;
  /* 0x0003 */ unsigned char Channel;
  /* 0x0004 */ unsigned char Level;
  /* 0x0005 */ unsigned char Opcode;
  /* 0x0006 */ unsigned short Task;
  /* 0x0008 */ unsigned __int64 Keyword;
} EVENT_DESCRIPTOR, *PEVENT_DESCRIPTOR; /* size: 0x0010 */

struct _KTHREAD;

typedef struct _KEVENT
{
  /* 0x0000 */ struct _DISPATCHER_HEADER Header;
} KEVENT, *PKEVENT; /* size: 0x0010 */

typedef struct _FAST_MUTEX
{
  /* 0x0000 */ volatile long Count;
  /* 0x0004 */ struct _KTHREAD* Owner;
  /* 0x0008 */ unsigned long Contention;
  /* 0x000c */ struct _KEVENT Gate;
  /* 0x001c */ unsigned long OldIrql;
} FAST_MUTEX, *PFAST_MUTEX; /* size: 0x0020 */

union KSDATAFORMAT
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned long FormatSize;
      /* 0x0004 */ unsigned long Flags;
      /* 0x0008 */ unsigned long SampleSize;
      /* 0x000c */ unsigned long Reserved;
      /* 0x0010 */ struct _GUID MajorFormat;
      /* 0x0020 */ struct _GUID SubFormat;
      /* 0x0030 */ struct _GUID Specifier;
    }; /* size: 0x0040 */
    /* 0x0000 */ __int64 Alignment;
  }; /* size: 0x0040 */
}; /* size: 0x0040 */

typedef struct _NDIS_CO_CLIENT_OPTIONAL_HANDLERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Reserved;
  /* 0x0008 */ void* ClCreateVcHandler /* function */;
  /* 0x000c */ void* ClDeleteVcHandler /* function */;
  /* 0x0010 */ void* ClOidRequestHandler /* function */;
  /* 0x0014 */ void* ClOidRequestCompleteHandler /* function */;
  /* 0x0018 */ void* ClOpenAfCompleteHandlerEx /* function */;
  /* 0x001c */ void* ClCloseAfCompleteHandler /* function */;
  /* 0x0020 */ void* ClRegisterSapCompleteHandler /* function */;
  /* 0x0024 */ void* ClDeregisterSapCompleteHandler /* function */;
  /* 0x0028 */ void* ClMakeCallCompleteHandler /* function */;
  /* 0x002c */ void* ClModifyCallQoSCompleteHandler /* function */;
  /* 0x0030 */ void* ClCloseCallCompleteHandler /* function */;
  /* 0x0034 */ void* ClAddPartyCompleteHandler /* function */;
  /* 0x0038 */ void* ClDropPartyCompleteHandler /* function */;
  /* 0x003c */ void* ClIncomingCallHandler /* function */;
  /* 0x0040 */ void* ClIncomingCallQoSChangeHandler /* function */;
  /* 0x0044 */ void* ClIncomingCloseCallHandler /* function */;
  /* 0x0048 */ void* ClIncomingDropPartyHandler /* function */;
  /* 0x004c */ void* ClCallConnectedHandler /* function */;
  /* 0x0050 */ void* ClNotifyCloseAfHandler /* function */;
} NDIS_CO_CLIENT_OPTIONAL_HANDLERS, *PNDIS_CO_CLIENT_OPTIONAL_HANDLERS; /* size: 0x0054 */

typedef union _SLIST_HEADER
{
  union
  {
    /* 0x0000 */ unsigned __int64 Alignment;
    struct
    {
      /* 0x0000 */ struct _SINGLE_LIST_ENTRY Next;
      /* 0x0004 */ unsigned short Depth;
      /* 0x0006 */ unsigned short Sequence;
    }; /* size: 0x0008 */
  }; /* size: 0x0008 */
} SLIST_HEADER, *PSLIST_HEADER; /* size: 0x0008 */

typedef struct _GENERAL_LOOKASIDE_POOL
{
  union
  {
    /* 0x0000 */ union _SLIST_HEADER ListHead;
    /* 0x0000 */ struct _SINGLE_LIST_ENTRY SingleListHead;
  }; /* size: 0x0008 */
  /* 0x0008 */ unsigned short Depth;
  /* 0x000a */ unsigned short MaximumDepth;
  /* 0x000c */ unsigned long TotalAllocates;
  union
  {
    /* 0x0010 */ unsigned long AllocateMisses;
    /* 0x0010 */ unsigned long AllocateHits;
  }; /* size: 0x0004 */
  /* 0x0014 */ unsigned long TotalFrees;
  union
  {
    /* 0x0018 */ unsigned long FreeMisses;
    /* 0x0018 */ unsigned long FreeHits;
  }; /* size: 0x0004 */
  /* 0x001c */ enum _POOL_TYPE Type;
  /* 0x0020 */ unsigned long Tag;
  /* 0x0024 */ unsigned long Size;
  union
  {
    /* 0x0028 */ void* AllocateEx /* function */;
    /* 0x0028 */ void* Allocate /* function */;
  }; /* size: 0x0004 */
  union
  {
    /* 0x002c */ void* FreeEx /* function */;
    /* 0x002c */ void* Free /* function */;
  }; /* size: 0x0004 */
  /* 0x0030 */ struct _LIST_ENTRY ListEntry;
  /* 0x0038 */ unsigned long LastTotalAllocates;
  union
  {
    /* 0x003c */ unsigned long LastAllocateMisses;
    /* 0x003c */ unsigned long LastAllocateHits;
  }; /* size: 0x0004 */
  /* 0x0040 */ unsigned long Future[2];
} GENERAL_LOOKASIDE_POOL, *PGENERAL_LOOKASIDE_POOL; /* size: 0x0048 */

typedef struct _LOOKASIDE_LIST_EX
{
  /* 0x0000 */ struct _GENERAL_LOOKASIDE_POOL L;
} LOOKASIDE_LIST_EX, *PLOOKASIDE_LIST_EX; /* size: 0x0048 */

typedef struct _NDIS_MINIPORT_ADAPTER_GENERAL_ATTRIBUTES
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ enum _NDIS_MEDIUM MediaType;
  /* 0x000c */ enum _NDIS_PHYSICAL_MEDIUM PhysicalMediumType;
  /* 0x0010 */ unsigned long MtuSize;
  /* 0x0014 */ long Padding_15;
  /* 0x0018 */ unsigned __int64 MaxXmitLinkSpeed;
  /* 0x0020 */ unsigned __int64 XmitLinkSpeed;
  /* 0x0028 */ unsigned __int64 MaxRcvLinkSpeed;
  /* 0x0030 */ unsigned __int64 RcvLinkSpeed;
  /* 0x0038 */ enum _NET_IF_MEDIA_CONNECT_STATE MediaConnectState;
  /* 0x003c */ enum _NET_IF_MEDIA_DUPLEX_STATE MediaDuplexState;
  /* 0x0040 */ unsigned long LookaheadSize;
  /* 0x0044 */ struct _NDIS_PNP_CAPABILITIES* PowerManagementCapabilities;
  /* 0x0048 */ unsigned long MacOptions;
  /* 0x004c */ unsigned long SupportedPacketFilters;
  /* 0x0050 */ unsigned long MaxMulticastListSize;
  /* 0x0054 */ unsigned short MacAddressLength;
  /* 0x0056 */ unsigned char PermanentMacAddress[32];
  /* 0x0076 */ unsigned char CurrentMacAddress[32];
  /* 0x0096 */ char Padding_16[2];
  /* 0x0098 */ struct _NDIS_RECEIVE_SCALE_CAPABILITIES* RecvScaleCapabilities;
  /* 0x009c */ enum _NET_IF_ACCESS_TYPE AccessType;
  /* 0x00a0 */ enum _NET_IF_DIRECTION_TYPE DirectionType;
  /* 0x00a4 */ enum _NET_IF_CONNECTION_TYPE ConnectionType;
  /* 0x00a8 */ unsigned short IfType;
  /* 0x00aa */ unsigned char IfConnectorPresent;
  /* 0x00ab */ char Padding_17;
  /* 0x00ac */ unsigned long SupportedStatistics;
  /* 0x00b0 */ unsigned long SupportedPauseFunctions;
  /* 0x00b4 */ unsigned long DataBackFillSize;
  /* 0x00b8 */ unsigned long ContextBackFillSize;
  /* 0x00bc */ unsigned long* SupportedOidList;
  /* 0x00c0 */ unsigned long SupportedOidListLength;
  /* 0x00c4 */ unsigned long AutoNegotiationFlags;
} NDIS_MINIPORT_ADAPTER_GENERAL_ATTRIBUTES, *PNDIS_MINIPORT_ADAPTER_GENERAL_ATTRIBUTES; /* size: 0x00c8 */

typedef struct _NDIS_HD_SPLIT_CURRENT_CONFIG
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long HardwareCapabilities;
  /* 0x0008 */ unsigned long CurrentCapabilities;
  /* 0x000c */ unsigned long HDSplitFlags;
  /* 0x0010 */ unsigned long HDSplitCombineFlags;
  /* 0x0014 */ unsigned long BackfillSize;
  /* 0x0018 */ unsigned long MaxHeaderSize;
} NDIS_HD_SPLIT_CURRENT_CONFIG, *PNDIS_HD_SPLIT_CURRENT_CONFIG; /* size: 0x001c */

typedef struct _WORK_QUEUE_ITEM
{
  /* 0x0000 */ struct _LIST_ENTRY List;
  /* 0x0008 */ void* WorkerRoutine /* function */;
  /* 0x000c */ void* Parameter;
} WORK_QUEUE_ITEM, *PWORK_QUEUE_ITEM; /* size: 0x0010 */

typedef struct _NDIS_MINIPORT_PAUSE_PARAMETERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ unsigned long PauseReason;
} NDIS_MINIPORT_PAUSE_PARAMETERS, *PNDIS_MINIPORT_PAUSE_PARAMETERS; /* size: 0x000c */

typedef struct _KSFILTER
{
  /* 0x0000 */ const struct _KSFILTER_DESCRIPTOR* Descriptor;
  /* 0x0004 */ void* Bag;
  /* 0x0008 */ void* Context;
} KSFILTER, *PKSFILTER; /* size: 0x000c */

typedef struct _KSFILTER_DISPATCH
{
  /* 0x0000 */ void* Create /* function */;
  /* 0x0004 */ void* Close /* function */;
  /* 0x0008 */ void* Process /* function */;
  /* 0x000c */ void* Reset /* function */;
} KSFILTER_DISPATCH, *PKSFILTER_DISPATCH; /* size: 0x0010 */

typedef struct _NDIS_RESTART_ATTRIBUTES
{
  /* 0x0000 */ struct _NDIS_RESTART_ATTRIBUTES* Next;
  /* 0x0004 */ unsigned long Oid;
  /* 0x0008 */ unsigned long DataLength;
  /* 0x000c */ long Padding_18;
  /* 0x0010 */ unsigned char Data[1];
  /* 0x0011 */ char __PADDING__[7];
} NDIS_RESTART_ATTRIBUTES, *PNDIS_RESTART_ATTRIBUTES; /* size: 0x0018 */

typedef struct _GENERAL_LOOKASIDE
{
  union
  {
    /* 0x0000 */ union _SLIST_HEADER ListHead;
    /* 0x0000 */ struct _SINGLE_LIST_ENTRY SingleListHead;
  }; /* size: 0x0008 */
  /* 0x0008 */ unsigned short Depth;
  /* 0x000a */ unsigned short MaximumDepth;
  /* 0x000c */ unsigned long TotalAllocates;
  union
  {
    /* 0x0010 */ unsigned long AllocateMisses;
    /* 0x0010 */ unsigned long AllocateHits;
  }; /* size: 0x0004 */
  /* 0x0014 */ unsigned long TotalFrees;
  union
  {
    /* 0x0018 */ unsigned long FreeMisses;
    /* 0x0018 */ unsigned long FreeHits;
  }; /* size: 0x0004 */
  /* 0x001c */ enum _POOL_TYPE Type;
  /* 0x0020 */ unsigned long Tag;
  /* 0x0024 */ unsigned long Size;
  union
  {
    /* 0x0028 */ void* AllocateEx /* function */;
    /* 0x0028 */ void* Allocate /* function */;
  }; /* size: 0x0004 */
  union
  {
    /* 0x002c */ void* FreeEx /* function */;
    /* 0x002c */ void* Free /* function */;
  }; /* size: 0x0004 */
  /* 0x0030 */ struct _LIST_ENTRY ListEntry;
  /* 0x0038 */ unsigned long LastTotalAllocates;
  union
  {
    /* 0x003c */ unsigned long LastAllocateMisses;
    /* 0x003c */ unsigned long LastAllocateHits;
  }; /* size: 0x0004 */
  /* 0x0040 */ unsigned long Future[2];
} GENERAL_LOOKASIDE, *PGENERAL_LOOKASIDE; /* size: 0x0048 */

typedef struct _NPAGED_LOOKASIDE_LIST
{
  /* 0x0000 */ struct _GENERAL_LOOKASIDE L;
  /* 0x0048 */ unsigned long Lock__ObsoleteButDoNotDelete;
  /* 0x004c */ long __PADDING__[1];
} NPAGED_LOOKASIDE_LIST, *PNPAGED_LOOKASIDE_LIST; /* size: 0x0050 */

typedef struct _PAGED_LOOKASIDE_LIST
{
  /* 0x0000 */ struct _GENERAL_LOOKASIDE L;
  /* 0x0048 */ struct _FAST_MUTEX Lock__ObsoleteButDoNotDelete;
} PAGED_LOOKASIDE_LIST, *PPAGED_LOOKASIDE_LIST; /* size: 0x0068 */

typedef struct _NDIS_MINIPORT_RESTART_PARAMETERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ struct _NDIS_RESTART_ATTRIBUTES* RestartAttributes;
  /* 0x0008 */ unsigned long Flags;
} NDIS_MINIPORT_RESTART_PARAMETERS, *PNDIS_MINIPORT_RESTART_PARAMETERS; /* size: 0x000c */

typedef struct _QUAD
{
  union
  {
    /* 0x0000 */ __int64 UseThisFieldToCopy;
    /* 0x0000 */ double DoNotUseThisField;
  }; /* size: 0x0008 */
} QUAD, *PQUAD; /* size: 0x0008 */

typedef struct _QUEUED_CLOSE
{
  /* 0x0000 */ int Status;
  /* 0x0004 */ struct _WORK_QUEUE_ITEM WorkItem;
} QUEUED_CLOSE, *PQUEUED_CLOSE; /* size: 0x0014 */

typedef struct _NDIS_MINIPORT_INIT_PARAMETERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ struct _CM_PARTIAL_RESOURCE_LIST* AllocatedResources;
  /* 0x000c */ void* IMDeviceInstanceContext;
  /* 0x0010 */ void* MiniportAddDeviceContext;
  /* 0x0014 */ unsigned long IfIndex;
  /* 0x0018 */ union _NET_LUID_LH NetLuid;
  /* 0x0020 */ struct _NDIS_PORT_AUTHENTICATION_PARAMETERS* DefaultPortAuthStates;
  /* 0x0024 */ struct _NDIS_PCI_DEVICE_CUSTOM_PROPERTIES* PciDeviceCustomProperties;
} NDIS_MINIPORT_INIT_PARAMETERS, *PNDIS_MINIPORT_INIT_PARAMETERS; /* size: 0x0028 */

struct KSRESOLUTION
{
  /* 0x0000 */ __int64 Granularity;
  /* 0x0008 */ __int64 Error;
}; /* size: 0x0010 */

typedef struct _KMUTANT
{
  /* 0x0000 */ struct _DISPATCHER_HEADER Header;
  /* 0x0010 */ struct _LIST_ENTRY MutantListEntry;
  /* 0x0018 */ struct _KTHREAD* OwnerThread;
  /* 0x001c */ unsigned char Abandoned;
  /* 0x001d */ unsigned char ApcDisable;
  /* 0x001e */ char __PADDING__[2];
} KMUTANT, *PKMUTANT; /* size: 0x0020 */

typedef struct _EX_PUSH_LOCK
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long Locked : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned long Waiting : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned long Waking : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned long MultipleShared : 1; /* bit position: 3 */
      /* 0x0000 */ unsigned long Shared : 28; /* bit position: 4 */
    }; /* bitfield */
    /* 0x0000 */ unsigned long Value;
    /* 0x0000 */ void* Ptr;
  }; /* size: 0x0004 */
} EX_PUSH_LOCK, *PEX_PUSH_LOCK; /* size: 0x0004 */

typedef struct _EX_PUSH_LOCK_CACHE_AWARE
{
  /* 0x0000 */ struct _EX_PUSH_LOCK* Locks[32];
} EX_PUSH_LOCK_CACHE_AWARE, *PEX_PUSH_LOCK_CACHE_AWARE; /* size: 0x0080 */

typedef struct _NDIS_EVENT
{
  /* 0x0000 */ struct _KEVENT Event;
} NDIS_EVENT, *PNDIS_EVENT; /* size: 0x0010 */

typedef struct _DEVPROPKEY
{
  /* 0x0000 */ struct _GUID fmtid;
  /* 0x0010 */ unsigned long pid;
} DEVPROPKEY, *PDEVPROPKEY; /* size: 0x0014 */

typedef struct _IRP
{
  /* 0x0000 */ short Type;
  /* 0x0002 */ unsigned short Size;
  /* 0x0004 */ struct _MDL* MdlAddress;
  /* 0x0008 */ unsigned long Flags;
  union
  {
    union
    {
      /* 0x000c */ struct _IRP* MasterIrp;
      /* 0x000c */ long IrpCount;
      /* 0x000c */ void* SystemBuffer;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ AssociatedIrp;
  /* 0x0010 */ struct _LIST_ENTRY ThreadListEntry;
  /* 0x0018 */ struct _IO_STATUS_BLOCK IoStatus;
  /* 0x0020 */ char RequestorMode;
  /* 0x0021 */ unsigned char PendingReturned;
  /* 0x0022 */ char StackCount;
  /* 0x0023 */ char CurrentLocation;
  /* 0x0024 */ unsigned char Cancel;
  /* 0x0025 */ unsigned char CancelIrql;
  /* 0x0026 */ char ApcEnvironment;
  /* 0x0027 */ unsigned char AllocationFlags;
  /* 0x0028 */ struct _IO_STATUS_BLOCK* UserIosb;
  /* 0x002c */ struct _KEVENT* UserEvent;
  union
  {
    union
    {
      struct
      {
        union
        {
          /* 0x0030 */ void* UserApcRoutine /* function */;
          /* 0x0030 */ void* IssuingProcess;
        }; /* size: 0x0004 */
        /* 0x0034 */ void* UserApcContext;
      } /* size: 0x0008 */ AsynchronousParameters;
      /* 0x0030 */ union _LARGE_INTEGER AllocationSize;
    }; /* size: 0x0008 */
  } /* size: 0x0008 */ Overlay;
  /* 0x0038 */ void* CancelRoutine /* function */;
  /* 0x003c */ void* UserBuffer;
  union
  {
    union
    {
      struct
      {
        union
        {
          /* 0x0040 */ struct _KDEVICE_QUEUE_ENTRY DeviceQueueEntry;
          /* 0x0040 */ void* DriverContext[4];
        }; /* size: 0x0010 */
        /* 0x0050 */ struct _ETHREAD* Thread;
        /* 0x0054 */ char* AuxiliaryBuffer;
        /* 0x0058 */ struct _LIST_ENTRY ListEntry;
        union
        {
          /* 0x0060 */ struct _IO_STACK_LOCATION* CurrentStackLocation;
          /* 0x0060 */ unsigned long PacketType;
        }; /* size: 0x0004 */
        /* 0x0064 */ struct _FILE_OBJECT* OriginalFileObject;
      } /* size: 0x0028 */ Overlay;
      /* 0x0040 */ struct _KAPC Apc;
      /* 0x0040 */ void* CompletionKey;
    }; /* size: 0x0030 */
  } /* size: 0x0030 */ Tail;
} IRP, *PIRP; /* size: 0x0070 */

struct KSALLOCATOR_FRAMING
{
  union
  {
    /* 0x0000 */ unsigned long OptionsFlags;
    /* 0x0000 */ unsigned long RequirementsFlags;
  }; /* size: 0x0004 */
  /* 0x0004 */ enum _POOL_TYPE PoolType;
  /* 0x0008 */ unsigned long Frames;
  /* 0x000c */ unsigned long FrameSize;
  /* 0x0010 */ unsigned long FileAlignment;
  /* 0x0014 */ unsigned long Reserved;
}; /* size: 0x0018 */

typedef struct _MDL
{
  /* 0x0000 */ struct _MDL* Next;
  /* 0x0004 */ short Size;
  /* 0x0006 */ short MdlFlags;
  /* 0x0008 */ struct _EPROCESS* Process;
  /* 0x000c */ void* MappedSystemVa;
  /* 0x0010 */ void* StartVa;
  /* 0x0014 */ unsigned long ByteCount;
  /* 0x0018 */ unsigned long ByteOffset;
} MDL, *PMDL; /* size: 0x001c */

typedef struct _NDIS_SPIN_LOCK
{
  /* 0x0000 */ unsigned long SpinLock;
  /* 0x0004 */ unsigned char OldIrql;
  /* 0x0005 */ char __PADDING__[3];
} NDIS_SPIN_LOCK, *PNDIS_SPIN_LOCK; /* size: 0x0008 */

typedef struct _NDIS_WORK_ITEM
{
  /* 0x0000 */ void* Context;
  /* 0x0004 */ void* Routine /* function */;
  /* 0x0008 */ unsigned char WrapperReserved[32];
} NDIS_WORK_ITEM, *PNDIS_WORK_ITEM; /* size: 0x0028 */

struct _EPROCESS;

typedef struct _KSSTREAM_POINTER_OFFSET
{
  union
  {
    /* 0x0000 */ unsigned char* Data;
    /* 0x0000 */ struct _KSMAPPING* Mappings;
  }; /* size: 0x0004 */
  /* 0x0004 */ void* Alignment;
  /* 0x0008 */ unsigned long Count;
  /* 0x000c */ unsigned long Remaining;
} KSSTREAM_POINTER_OFFSET, *PKSSTREAM_POINTER_OFFSET; /* size: 0x0010 */

typedef struct _KSSTREAM_POINTER
{
  /* 0x0000 */ void* Context;
  /* 0x0004 */ struct _KSPIN* Pin;
  /* 0x0008 */ struct KSSTREAM_HEADER* StreamHeader;
  /* 0x000c */ struct _KSSTREAM_POINTER_OFFSET* Offset;
  /* 0x0010 */ struct _KSSTREAM_POINTER_OFFSET OffsetIn;
  /* 0x0020 */ struct _KSSTREAM_POINTER_OFFSET OffsetOut;
} KSSTREAM_POINTER, *PKSSTREAM_POINTER; /* size: 0x0030 */

typedef struct _NDIS_STATUS_UNBIND_WORKITEM
{
  /* 0x0000 */ struct _NDIS_WORK_ITEM WorkItem;
  /* 0x0028 */ struct _NDIS_MINIPORT_BLOCK* Miniport;
} NDIS_STATUS_UNBIND_WORKITEM, *PNDIS_STATUS_UNBIND_WORKITEM; /* size: 0x002c */

typedef struct _KSMAPPING
{
  /* 0x0000 */ union _LARGE_INTEGER PhysicalAddress;
  /* 0x0008 */ unsigned long ByteCount;
  /* 0x000c */ unsigned long Alignment;
} KSMAPPING, *PKSMAPPING; /* size: 0x0010 */

typedef struct _KDEVICE_QUEUE
{
  /* 0x0000 */ short Type;
  /* 0x0002 */ short Size;
  /* 0x0004 */ struct _LIST_ENTRY DeviceListHead;
  /* 0x000c */ unsigned long Lock;
  /* 0x0010 */ unsigned char Busy;
  /* 0x0011 */ char __PADDING__[3];
} KDEVICE_QUEUE, *PKDEVICE_QUEUE; /* size: 0x0014 */

typedef struct _DEVICE_OBJECT
{
  /* 0x0000 */ short Type;
  /* 0x0002 */ unsigned short Size;
  /* 0x0004 */ long ReferenceCount;
  /* 0x0008 */ struct _DRIVER_OBJECT* DriverObject;
  /* 0x000c */ struct _DEVICE_OBJECT* NextDevice;
  /* 0x0010 */ struct _DEVICE_OBJECT* AttachedDevice;
  /* 0x0014 */ struct _IRP* CurrentIrp;
  /* 0x0018 */ struct _IO_TIMER* Timer;
  /* 0x001c */ unsigned long Flags;
  /* 0x0020 */ unsigned long Characteristics;
  /* 0x0024 */ struct _VPB* Vpb;
  /* 0x0028 */ void* DeviceExtension;
  /* 0x002c */ unsigned long DeviceType;
  /* 0x0030 */ char StackSize;
  /* 0x0031 */ char Padding_19[3];
  union
  {
    union
    {
      /* 0x0034 */ struct _LIST_ENTRY ListEntry;
      /* 0x0034 */ struct _WAIT_CONTEXT_BLOCK Wcb;
    }; /* size: 0x0028 */
  } /* size: 0x0028 */ Queue;
  /* 0x005c */ unsigned long AlignmentRequirement;
  /* 0x0060 */ struct _KDEVICE_QUEUE DeviceQueue;
  /* 0x0074 */ struct _KDPC Dpc;
  /* 0x0094 */ unsigned long ActiveThreadCount;
  /* 0x0098 */ void* SecurityDescriptor;
  /* 0x009c */ struct _KEVENT DeviceLock;
  /* 0x00ac */ unsigned short SectorSize;
  /* 0x00ae */ unsigned short Spare1;
  /* 0x00b0 */ struct _DEVOBJ_EXTENSION* DeviceObjectExtension;
  /* 0x00b4 */ void* Reserved;
} DEVICE_OBJECT, *PDEVICE_OBJECT; /* size: 0x00b8 */

typedef struct _NDIS_CLIENT_CHARACTERISTICS
{
  /* 0x0000 */ unsigned char MajorVersion;
  /* 0x0001 */ unsigned char MinorVersion;
  /* 0x0002 */ unsigned short Filler;
  /* 0x0004 */ unsigned int Reserved;
  /* 0x0008 */ void* ClCreateVcHandler /* function */;
  /* 0x000c */ void* ClDeleteVcHandler /* function */;
  /* 0x0010 */ void* ClRequestHandler /* function */;
  /* 0x0014 */ void* ClRequestCompleteHandler /* function */;
  /* 0x0018 */ void* ClOpenAfCompleteHandler /* function */;
  /* 0x001c */ void* ClCloseAfCompleteHandler /* function */;
  /* 0x0020 */ void* ClRegisterSapCompleteHandler /* function */;
  /* 0x0024 */ void* ClDeregisterSapCompleteHandler /* function */;
  /* 0x0028 */ void* ClMakeCallCompleteHandler /* function */;
  /* 0x002c */ void* ClModifyCallQoSCompleteHandler /* function */;
  /* 0x0030 */ void* ClCloseCallCompleteHandler /* function */;
  /* 0x0034 */ void* ClAddPartyCompleteHandler /* function */;
  /* 0x0038 */ void* ClDropPartyCompleteHandler /* function */;
  /* 0x003c */ void* ClIncomingCallHandler /* function */;
  /* 0x0040 */ void* ClIncomingCallQoSChangeHandler /* function */;
  /* 0x0044 */ void* ClIncomingCloseCallHandler /* function */;
  /* 0x0048 */ void* ClIncomingDropPartyHandler /* function */;
  /* 0x004c */ void* ClCallConnectedHandler /* function */;
} NDIS_CLIENT_CHARACTERISTICS, *PNDIS_CLIENT_CHARACTERISTICS; /* size: 0x0050 */

typedef struct _QUERY_INFORMATION
{
  /* 0x0000 */ unsigned long Oid;
  /* 0x0004 */ void* InformationBuffer;
  /* 0x0008 */ unsigned int InformationBufferLength;
  /* 0x000c */ unsigned int BytesWritten;
  /* 0x0010 */ unsigned int BytesNeeded;
} QUERY_INFORMATION, *PQUERY_INFORMATION; /* size: 0x0014 */

typedef union _DATA
{
  union
  {
    /* 0x0000 */ struct _QUERY_INFORMATION QUERY_INFORMATION;
    /* 0x0000 */ struct _SET_INFORMATION SET_INFORMATION;
  }; /* size: 0x0014 */
} DATA, *PDATA; /* size: 0x0014 */

typedef struct _NDIS_REQUEST
{
  /* 0x0000 */ unsigned char MacReserved[16];
  /* 0x0010 */ enum _NDIS_REQUEST_TYPE RequestType;
  /* 0x0014 */ union _DATA DATA;
  /* 0x0028 */ unsigned char NdisReserved[36];
  union
  {
    /* 0x004c */ unsigned char CallMgrReserved[8];
    /* 0x004c */ unsigned char ProtocolReserved[8];
  }; /* size: 0x0008 */
  /* 0x0054 */ unsigned char MiniportReserved[8];
} NDIS_REQUEST, *PNDIS_REQUEST; /* size: 0x005c */

typedef struct _NDIS_CO_AF_BLOCK
{
  /* 0x0000 */ struct _NDIS_CO_AF_BLOCK* NextAf;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ long References;
  /* 0x000c */ struct _NDIS_MINIPORT_BLOCK* Miniport;
  /* 0x0010 */ struct _NDIS_CALL_MANAGER_CHARACTERISTICS* CallMgrEntries;
  /* 0x0014 */ struct _NDIS_CO_CALL_MANAGER_OPTIONAL_HANDLERS* CallMgrChars;
  /* 0x0018 */ struct _NDIS_OPEN_BLOCK* CallMgrOpen;
  /* 0x001c */ void* CallMgrContext;
  /* 0x0020 */ struct _NDIS_CLIENT_CHARACTERISTICS ClientEntries;
  /* 0x0070 */ struct _NDIS_CO_CLIENT_OPTIONAL_HANDLERS ClientChars;
  /* 0x00c4 */ struct _NDIS_OPEN_BLOCK* ClientOpen;
  /* 0x00c8 */ void* ClientContext;
  /* 0x00cc */ unsigned long Lock;
  /* 0x00d0 */ unsigned long CmMajorNdisVersion;
  /* 0x00d4 */ unsigned long ClMajorNdisVersion;
  /* 0x00d8 */ struct _NDIS_REQUEST* Ndis5CmRequest;
  /* 0x00dc */ struct _NDIS_REQUEST Request;
  /* 0x0138 */ struct _NDIS_REQUEST* CloseAfNdisRequest;
  /* 0x013c */ unsigned char CloseAfRequested;
  /* 0x013d */ char __PADDING__[3];
} NDIS_CO_AF_BLOCK, *PNDIS_CO_AF_BLOCK; /* size: 0x0140 */

typedef struct _DRIVER_OBJECT
{
  /* 0x0000 */ short Type;
  /* 0x0002 */ short Size;
  /* 0x0004 */ struct _DEVICE_OBJECT* DeviceObject;
  /* 0x0008 */ unsigned long Flags;
  /* 0x000c */ void* DriverStart;
  /* 0x0010 */ unsigned long DriverSize;
  /* 0x0014 */ void* DriverSection;
  /* 0x0018 */ struct _DRIVER_EXTENSION* DriverExtension;
  /* 0x001c */ struct _UNICODE_STRING DriverName;
  /* 0x0024 */ struct _UNICODE_STRING* HardwareDatabase;
  /* 0x0028 */ struct _FAST_IO_DISPATCH* FastIoDispatch;
  /* 0x002c */ void* DriverInit /* function */;
  /* 0x0030 */ void* DriverStartIo /* function */;
  /* 0x0034 */ void* DriverUnload /* function */;
  /* 0x0038 */ void* MajorFunction[28] /* function */;
} DRIVER_OBJECT, *PDRIVER_OBJECT; /* size: 0x00a8 */

typedef struct _DRIVER_EXTENSION
{
  /* 0x0000 */ struct _DRIVER_OBJECT* DriverObject;
  /* 0x0004 */ void* AddDevice /* function */;
  /* 0x0008 */ unsigned long Count;
  /* 0x000c */ struct _UNICODE_STRING ServiceKeyName;
} DRIVER_EXTENSION, *PDRIVER_EXTENSION; /* size: 0x0014 */

typedef struct _KSNODE_DESCRIPTOR
{
  /* 0x0000 */ const struct KSAUTOMATION_TABLE_* AutomationTable;
  /* 0x0004 */ const struct _GUID* Type;
  /* 0x0008 */ const struct _GUID* Name;
  /* 0x000c */ void* Alignment;
} KSNODE_DESCRIPTOR, *PKSNODE_DESCRIPTOR; /* size: 0x0010 */

typedef struct _flowspec
{
  /* 0x0000 */ unsigned long TokenRate;
  /* 0x0004 */ unsigned long TokenBucketSize;
  /* 0x0008 */ unsigned long PeakBandwidth;
  /* 0x000c */ unsigned long Latency;
  /* 0x0010 */ unsigned long DelayVariation;
  /* 0x0014 */ unsigned long ServiceType;
  /* 0x0018 */ unsigned long MaxSduSize;
  /* 0x001c */ unsigned long MinimumPolicedSize;
} flowspec, *Pflowspec; /* size: 0x0020 */

typedef struct _FAST_IO_DISPATCH
{
  /* 0x0000 */ unsigned long SizeOfFastIoDispatch;
  /* 0x0004 */ void* FastIoCheckIfPossible /* function */;
  /* 0x0008 */ void* FastIoRead /* function */;
  /* 0x000c */ void* FastIoWrite /* function */;
  /* 0x0010 */ void* FastIoQueryBasicInfo /* function */;
  /* 0x0014 */ void* FastIoQueryStandardInfo /* function */;
  /* 0x0018 */ void* FastIoLock /* function */;
  /* 0x001c */ void* FastIoUnlockSingle /* function */;
  /* 0x0020 */ void* FastIoUnlockAll /* function */;
  /* 0x0024 */ void* FastIoUnlockAllByKey /* function */;
  /* 0x0028 */ void* FastIoDeviceControl /* function */;
  /* 0x002c */ void* AcquireFileForNtCreateSection /* function */;
  /* 0x0030 */ void* ReleaseFileForNtCreateSection /* function */;
  /* 0x0034 */ void* FastIoDetachDevice /* function */;
  /* 0x0038 */ void* FastIoQueryNetworkOpenInfo /* function */;
  /* 0x003c */ void* AcquireForModWrite /* function */;
  /* 0x0040 */ void* MdlRead /* function */;
  /* 0x0044 */ void* MdlReadComplete /* function */;
  /* 0x0048 */ void* PrepareMdlWrite /* function */;
  /* 0x004c */ void* MdlWriteComplete /* function */;
  /* 0x0050 */ void* FastIoReadCompressed /* function */;
  /* 0x0054 */ void* FastIoWriteCompressed /* function */;
  /* 0x0058 */ void* MdlReadCompleteCompressed /* function */;
  /* 0x005c */ void* MdlWriteCompleteCompressed /* function */;
  /* 0x0060 */ void* FastIoQueryOpen /* function */;
  /* 0x0064 */ void* ReleaseForModWrite /* function */;
  /* 0x0068 */ void* AcquireForCcFlush /* function */;
  /* 0x006c */ void* ReleaseForCcFlush /* function */;
} FAST_IO_DISPATCH, *PFAST_IO_DISPATCH; /* size: 0x0070 */

typedef struct _NDIS50_PROTOCOL_CHARACTERISTICS
{
  /* 0x0000 */ unsigned char MajorNdisVersion;
  /* 0x0001 */ unsigned char MinorNdisVersion;
  /* 0x0002 */ unsigned short Filler;
  union
  {
    /* 0x0004 */ unsigned int Reserved;
    /* 0x0004 */ unsigned int Flags;
  }; /* size: 0x0004 */
  /* 0x0008 */ void* OpenAdapterCompleteHandler /* function */;
  /* 0x000c */ void* CloseAdapterCompleteHandler /* function */;
  union
  {
    /* 0x0010 */ void* SendCompleteHandler /* function */;
    /* 0x0010 */ void* WanSendCompleteHandler /* function */;
  }; /* size: 0x0004 */
  union
  {
    /* 0x0014 */ void* TransferDataCompleteHandler /* function */;
    /* 0x0014 */ void* WanTransferDataCompleteHandler /* function */;
  }; /* size: 0x0004 */
  /* 0x0018 */ void* ResetCompleteHandler /* function */;
  /* 0x001c */ void* RequestCompleteHandler /* function */;
  union
  {
    /* 0x0020 */ void* ReceiveHandler /* function */;
    /* 0x0020 */ void* WanReceiveHandler /* function */;
  }; /* size: 0x0004 */
  /* 0x0024 */ void* ReceiveCompleteHandler /* function */;
  /* 0x0028 */ void* StatusHandler /* function */;
  /* 0x002c */ void* StatusCompleteHandler /* function */;
  /* 0x0030 */ struct _UNICODE_STRING Name;
  /* 0x0038 */ void* ReceivePacketHandler /* function */;
  /* 0x003c */ void* BindAdapterHandler /* function */;
  /* 0x0040 */ void* UnbindAdapterHandler /* function */;
  /* 0x0044 */ void* PnPEventHandler /* function */;
  /* 0x0048 */ void* UnloadHandler /* function */;
  /* 0x004c */ void* ReservedHandlers[4];
  /* 0x005c */ void* CoSendCompleteHandler /* function */;
  /* 0x0060 */ void* CoStatusHandler /* function */;
  /* 0x0064 */ void* CoReceivePacketHandler /* function */;
  /* 0x0068 */ void* CoAfRegisterNotifyHandler /* function */;
} NDIS50_PROTOCOL_CHARACTERISTICS, *PNDIS50_PROTOCOL_CHARACTERISTICS; /* size: 0x006c */

typedef struct _FILE_OBJECT
{
  /* 0x0000 */ short Type;
  /* 0x0002 */ short Size;
  /* 0x0004 */ struct _DEVICE_OBJECT* DeviceObject;
  /* 0x0008 */ struct _VPB* Vpb;
  /* 0x000c */ void* FsContext;
  /* 0x0010 */ void* FsContext2;
  /* 0x0014 */ struct _SECTION_OBJECT_POINTERS* SectionObjectPointer;
  /* 0x0018 */ void* PrivateCacheMap;
  /* 0x001c */ long FinalStatus;
  /* 0x0020 */ struct _FILE_OBJECT* RelatedFileObject;
  /* 0x0024 */ unsigned char LockOperation;
  /* 0x0025 */ unsigned char DeletePending;
  /* 0x0026 */ unsigned char ReadAccess;
  /* 0x0027 */ unsigned char WriteAccess;
  /* 0x0028 */ unsigned char DeleteAccess;
  /* 0x0029 */ unsigned char SharedRead;
  /* 0x002a */ unsigned char SharedWrite;
  /* 0x002b */ unsigned char SharedDelete;
  /* 0x002c */ unsigned long Flags;
  /* 0x0030 */ struct _UNICODE_STRING FileName;
  /* 0x0038 */ union _LARGE_INTEGER CurrentByteOffset;
  /* 0x0040 */ unsigned long Waiters;
  /* 0x0044 */ unsigned long Busy;
  /* 0x0048 */ void* LastLock;
  /* 0x004c */ struct _KEVENT Lock;
  /* 0x005c */ struct _KEVENT Event;
  /* 0x006c */ struct _IO_COMPLETION_CONTEXT* CompletionContext;
  /* 0x0070 */ unsigned long IrpListLock;
  /* 0x0074 */ struct _LIST_ENTRY IrpList;
  /* 0x007c */ void* FileObjectExtension;
} FILE_OBJECT, *PFILE_OBJECT; /* size: 0x0080 */

typedef struct _VPB
{
  /* 0x0000 */ short Type;
  /* 0x0002 */ short Size;
  /* 0x0004 */ unsigned short Flags;
  /* 0x0006 */ unsigned short VolumeLabelLength;
  /* 0x0008 */ struct _DEVICE_OBJECT* DeviceObject;
  /* 0x000c */ struct _DEVICE_OBJECT* RealDevice;
  /* 0x0010 */ unsigned long SerialNumber;
  /* 0x0014 */ unsigned long ReferenceCount;
  /* 0x0018 */ wchar_t VolumeLabel[32];
} VPB, *PVPB; /* size: 0x0058 */

typedef struct _NDIS_MINIPORT_OFFLOAD_REG
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long IPv4XSumTxDisabled : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned long IPv4XSumRxDisabled : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned long TCPv4XSumTxDisabled : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned long TCPv4XSumRxDisabled : 1; /* bit position: 3 */
      /* 0x0000 */ unsigned long UDPv4XSumTxDisabled : 1; /* bit position: 4 */
      /* 0x0000 */ unsigned long UDPv4XSumRxDisabled : 1; /* bit position: 5 */
      /* 0x0000 */ unsigned long TCPv6XSumTxDisabled : 1; /* bit position: 6 */
      /* 0x0000 */ unsigned long TCPv6XSumRxDisabled : 1; /* bit position: 7 */
      /* 0x0000 */ unsigned long UDPv6XSumTxDisabled : 1; /* bit position: 8 */
      /* 0x0000 */ unsigned long UDPv6XSumRxDisabled : 1; /* bit position: 9 */
      /* 0x0000 */ unsigned long LsoV1IPv4Disabled : 1; /* bit position: 10 */
      /* 0x0000 */ unsigned long LsoV2IPv4Disabled : 1; /* bit position: 11 */
      /* 0x0000 */ unsigned long LsoV2IPv6Disabled : 1; /* bit position: 12 */
      /* 0x0000 */ unsigned long IPsecAHDisabled : 1; /* bit position: 13 */
      /* 0x0000 */ unsigned long IPsecESPDisabled : 1; /* bit position: 14 */
      /* 0x0000 */ unsigned long TCPv4ConnectionOffloadDisabled : 1; /* bit position: 15 */
      /* 0x0000 */ unsigned long TCPv6ConnectionOffloadDisabled : 1; /* bit position: 16 */
      /* 0x0000 */ unsigned long ReadRegistry : 1; /* bit position: 17 */
      /* 0x0000 */ unsigned long IPsecV2AHDisabled : 1; /* bit position: 18 */
      /* 0x0000 */ unsigned long IPsecV2ESPDisabled : 1; /* bit position: 19 */
      /* 0x0000 */ unsigned long IPsecV2IPv4AHDisabled : 1; /* bit position: 20 */
      /* 0x0000 */ unsigned long IPsecV2IPv4ESPDisabled : 1; /* bit position: 21 */
    }; /* bitfield */
    /* 0x0000 */ unsigned long Value;
  }; /* size: 0x0004 */
} NDIS_MINIPORT_OFFLOAD_REG, *PNDIS_MINIPORT_OFFLOAD_REG; /* size: 0x0004 */

typedef struct _SECTION_OBJECT_POINTERS
{
  /* 0x0000 */ void* DataSectionObject;
  /* 0x0004 */ void* SharedCacheMap;
  /* 0x0008 */ void* ImageSectionObject;
} SECTION_OBJECT_POINTERS, *PSECTION_OBJECT_POINTERS; /* size: 0x000c */

typedef struct _IO_COMPLETION_CONTEXT
{
  /* 0x0000 */ void* Port;
  /* 0x0004 */ void* Key;
} IO_COMPLETION_CONTEXT, *PIO_COMPLETION_CONTEXT; /* size: 0x0008 */

typedef struct _NDIS_PENDING_IM_INSTANCE
{
  /* 0x0000 */ struct _NDIS_PENDING_IM_INSTANCE* Next;
  /* 0x0004 */ void* Context;
  /* 0x0008 */ struct _UNICODE_STRING Name;
} NDIS_PENDING_IM_INSTANCE, *PNDIS_PENDING_IM_INSTANCE; /* size: 0x0010 */

typedef union _WHEA_PCIXBUS_ERROR_VALIDBITS
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned __int64 ErrorStatus : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned __int64 ErrorType : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned __int64 BusId : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned __int64 BusAddress : 1; /* bit position: 3 */
      /* 0x0000 */ unsigned __int64 BusData : 1; /* bit position: 4 */
      /* 0x0000 */ unsigned __int64 BusCommand : 1; /* bit position: 5 */
      /* 0x0000 */ unsigned __int64 RequesterId : 1; /* bit position: 6 */
      /* 0x0000 */ unsigned __int64 CompleterId : 1; /* bit position: 7 */
      /* 0x0000 */ unsigned __int64 TargetId : 1; /* bit position: 8 */
      /* 0x0000 */ unsigned __int64 Reserved : 55; /* bit position: 9 */
    }; /* bitfield */
    /* 0x0000 */ unsigned __int64 ValidBits;
  }; /* size: 0x0008 */
} WHEA_PCIXBUS_ERROR_VALIDBITS, *PWHEA_PCIXBUS_ERROR_VALIDBITS; /* size: 0x0008 */

typedef union _WHEA_PCIXDEVICE_ERROR_VALIDBITS
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned __int64 ErrorStatus : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned __int64 IdInfo : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned __int64 MemoryNumber : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned __int64 IoNumber : 1; /* bit position: 3 */
      /* 0x0000 */ unsigned __int64 RegisterDataPairs : 1; /* bit position: 4 */
      /* 0x0000 */ unsigned __int64 Reserved : 59; /* bit position: 5 */
    }; /* bitfield */
    /* 0x0000 */ unsigned __int64 ValidBits;
  }; /* size: 0x0008 */
} WHEA_PCIXDEVICE_ERROR_VALIDBITS, *PWHEA_PCIXDEVICE_ERROR_VALIDBITS; /* size: 0x0008 */

typedef union _WHEA_ERROR_PACKET_FLAGS
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long PreviousError : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned long CpuValid : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned long HypervisorError : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned long Simulated : 1; /* bit position: 3 */
      /* 0x0000 */ unsigned long Reserved : 28; /* bit position: 4 */
    }; /* bitfield */
    /* 0x0000 */ unsigned long AsULONG;
  }; /* size: 0x0004 */
} WHEA_ERROR_PACKET_FLAGS, *PWHEA_ERROR_PACKET_FLAGS; /* size: 0x0004 */

typedef union _WHEA_GENERIC_PROCESSOR_ERROR_VALIDBITS
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned __int64 ProcessorType : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned __int64 InstructionSet : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned __int64 ErrorType : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned __int64 Operation : 1; /* bit position: 3 */
      /* 0x0000 */ unsigned __int64 Flags : 1; /* bit position: 4 */
      /* 0x0000 */ unsigned __int64 Level : 1; /* bit position: 5 */
      /* 0x0000 */ unsigned __int64 CPUVersion : 1; /* bit position: 6 */
      /* 0x0000 */ unsigned __int64 CPUBrandString : 1; /* bit position: 7 */
      /* 0x0000 */ unsigned __int64 ProcessorId : 1; /* bit position: 8 */
      /* 0x0000 */ unsigned __int64 TargetAddress : 1; /* bit position: 9 */
      /* 0x0000 */ unsigned __int64 RequesterId : 1; /* bit position: 10 */
      /* 0x0000 */ unsigned __int64 ResponderId : 1; /* bit position: 11 */
      /* 0x0000 */ unsigned __int64 InstructionPointer : 1; /* bit position: 12 */
      /* 0x0000 */ unsigned __int64 Reserved : 51; /* bit position: 13 */
    }; /* bitfield */
    /* 0x0000 */ unsigned __int64 ValidBits;
  }; /* size: 0x0008 */
} WHEA_GENERIC_PROCESSOR_ERROR_VALIDBITS, *PWHEA_GENERIC_PROCESSOR_ERROR_VALIDBITS; /* size: 0x0008 */

typedef struct _WHEA_GENERIC_PROCESSOR_ERROR
{
  /* 0x0000 */ union _WHEA_GENERIC_PROCESSOR_ERROR_VALIDBITS ValidBits;
  /* 0x0008 */ unsigned char ProcessorType;
  /* 0x0009 */ unsigned char InstructionSet;
  /* 0x000a */ unsigned char ErrorType;
  /* 0x000b */ unsigned char Operation;
  /* 0x000c */ unsigned char Flags;
  /* 0x000d */ unsigned char Level;
  /* 0x000e */ unsigned short Reserved;
  /* 0x0010 */ unsigned __int64 CPUVersion;
  /* 0x0018 */ unsigned char CPUBrandString[128];
  /* 0x0098 */ unsigned __int64 ProcessorId;
  /* 0x00a0 */ unsigned __int64 TargetAddress;
  /* 0x00a8 */ unsigned __int64 RequesterId;
  /* 0x00b0 */ unsigned __int64 ResponderId;
  /* 0x00b8 */ unsigned __int64 InstructionPointer;
} WHEA_GENERIC_PROCESSOR_ERROR, *PWHEA_GENERIC_PROCESSOR_ERROR; /* size: 0x00c0 */

typedef union _WHEA_MEMORY_ERROR_VALIDBITS
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned __int64 ErrorStatus : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned __int64 PhysicalAddress : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned __int64 PhysicalAddressMask : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned __int64 Node : 1; /* bit position: 3 */
      /* 0x0000 */ unsigned __int64 Card : 1; /* bit position: 4 */
      /* 0x0000 */ unsigned __int64 Module : 1; /* bit position: 5 */
      /* 0x0000 */ unsigned __int64 Bank : 1; /* bit position: 6 */
      /* 0x0000 */ unsigned __int64 Device : 1; /* bit position: 7 */
      /* 0x0000 */ unsigned __int64 Row : 1; /* bit position: 8 */
      /* 0x0000 */ unsigned __int64 Column : 1; /* bit position: 9 */
      /* 0x0000 */ unsigned __int64 BitPosition : 1; /* bit position: 10 */
      /* 0x0000 */ unsigned __int64 RequesterId : 1; /* bit position: 11 */
      /* 0x0000 */ unsigned __int64 ResponderId : 1; /* bit position: 12 */
      /* 0x0000 */ unsigned __int64 TargetId : 1; /* bit position: 13 */
      /* 0x0000 */ unsigned __int64 ErrorType : 1; /* bit position: 14 */
      /* 0x0000 */ unsigned __int64 Reserved : 49; /* bit position: 15 */
    }; /* bitfield */
    /* 0x0000 */ unsigned __int64 ValidBits;
  }; /* size: 0x0008 */
} WHEA_MEMORY_ERROR_VALIDBITS, *PWHEA_MEMORY_ERROR_VALIDBITS; /* size: 0x0008 */

typedef union _WHEA_ERROR_STATUS
{
  union
  {
    /* 0x0000 */ unsigned __int64 ErrorStatus;
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned __int64 Reserved1 : 8; /* bit position: 0 */
      /* 0x0000 */ unsigned __int64 ErrorType : 8; /* bit position: 8 */
      /* 0x0000 */ unsigned __int64 Address : 1; /* bit position: 16 */
      /* 0x0000 */ unsigned __int64 Control : 1; /* bit position: 17 */
      /* 0x0000 */ unsigned __int64 Data : 1; /* bit position: 18 */
      /* 0x0000 */ unsigned __int64 Responder : 1; /* bit position: 19 */
      /* 0x0000 */ unsigned __int64 Requester : 1; /* bit position: 20 */
      /* 0x0000 */ unsigned __int64 FirstError : 1; /* bit position: 21 */
      /* 0x0000 */ unsigned __int64 Overflow : 1; /* bit position: 22 */
      /* 0x0000 */ unsigned __int64 Reserved2 : 41; /* bit position: 23 */
    }; /* bitfield */
  }; /* size: 0x0008 */
} WHEA_ERROR_STATUS, *PWHEA_ERROR_STATUS; /* size: 0x0008 */

typedef struct _WHEA_MEMORY_ERROR
{
  /* 0x0000 */ union _WHEA_MEMORY_ERROR_VALIDBITS ValidBits;
  /* 0x0008 */ union _WHEA_ERROR_STATUS ErrorStatus;
  /* 0x0010 */ unsigned __int64 PhysicalAddress;
  /* 0x0018 */ unsigned __int64 PhysicalAddressMask;
  /* 0x0020 */ unsigned short Node;
  /* 0x0022 */ unsigned short Card;
  /* 0x0024 */ unsigned short Module;
  /* 0x0026 */ unsigned short Bank;
  /* 0x0028 */ unsigned short Device;
  /* 0x002a */ unsigned short Row;
  /* 0x002c */ unsigned short Column;
  /* 0x002e */ unsigned short BitPosition;
  /* 0x0030 */ unsigned __int64 RequesterId;
  /* 0x0038 */ unsigned __int64 ResponderId;
  /* 0x0040 */ unsigned __int64 TargetId;
  /* 0x0048 */ unsigned char ErrorType;
} WHEA_MEMORY_ERROR, *PWHEA_MEMORY_ERROR; /* size: 0x0049 */

typedef union _WHEA_NMI_ERROR_FLAGS
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long HypervisorError : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned long Reserved : 31; /* bit position: 1 */
    }; /* bitfield */
    /* 0x0000 */ unsigned long AsULONG;
  }; /* size: 0x0004 */
} WHEA_NMI_ERROR_FLAGS, *PWHEA_NMI_ERROR_FLAGS; /* size: 0x0004 */

typedef struct _WHEA_NMI_ERROR
{
  /* 0x0000 */ unsigned char Data[8];
  /* 0x0008 */ union _WHEA_NMI_ERROR_FLAGS Flags;
} WHEA_NMI_ERROR, *PWHEA_NMI_ERROR; /* size: 0x000c */

typedef union _WHEA_PCIEXPRESS_ERROR_VALIDBITS
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned __int64 PortType : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned __int64 Version : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned __int64 CommandStatus : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned __int64 DeviceId : 1; /* bit position: 3 */
      /* 0x0000 */ unsigned __int64 DeviceSerialNumber : 1; /* bit position: 4 */
      /* 0x0000 */ unsigned __int64 BridgeControlStatus : 1; /* bit position: 5 */
      /* 0x0000 */ unsigned __int64 ExpressCapability : 1; /* bit position: 6 */
      /* 0x0000 */ unsigned __int64 AerInfo : 1; /* bit position: 7 */
      /* 0x0000 */ unsigned __int64 Reserved : 56; /* bit position: 8 */
    }; /* bitfield */
    /* 0x0000 */ unsigned __int64 ValidBits;
  }; /* size: 0x0008 */
} WHEA_PCIEXPRESS_ERROR_VALIDBITS, *PWHEA_PCIEXPRESS_ERROR_VALIDBITS; /* size: 0x0008 */

typedef union _WHEA_PCIEXPRESS_VERSION
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned char MinorVersion;
      /* 0x0001 */ unsigned char MajorVersion;
      /* 0x0002 */ unsigned short Reserved;
    }; /* size: 0x0004 */
    /* 0x0000 */ unsigned long AsULONG;
  }; /* size: 0x0004 */
} WHEA_PCIEXPRESS_VERSION, *PWHEA_PCIEXPRESS_VERSION; /* size: 0x0004 */

typedef union _WHEA_PCIEXPRESS_COMMAND_STATUS
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned short Command;
      /* 0x0002 */ unsigned short Status;
    }; /* size: 0x0004 */
    /* 0x0000 */ unsigned long AsULONG;
  }; /* size: 0x0004 */
} WHEA_PCIEXPRESS_COMMAND_STATUS, *PWHEA_PCIEXPRESS_COMMAND_STATUS; /* size: 0x0004 */

typedef struct _WHEA_PCIEXPRESS_DEVICE_ID
{
  /* 0x0000 */ unsigned short VendorID;
  /* 0x0002 */ unsigned short DeviceID;
  struct /* bitfield */
  {
    /* 0x0004 */ unsigned long ClassCode : 24; /* bit position: 0 */
    /* 0x0004 */ unsigned long FunctionNumber : 8; /* bit position: 24 */
  }; /* bitfield */
  struct /* bitfield */
  {
    /* 0x0008 */ unsigned long DeviceNumber : 8; /* bit position: 0 */
    /* 0x0008 */ unsigned long Segment : 16; /* bit position: 8 */
    /* 0x0008 */ unsigned long PrimaryBusNumber : 8; /* bit position: 24 */
  }; /* bitfield */
  struct /* bitfield */
  {
    /* 0x000c */ unsigned long SecondaryBusNumber : 8; /* bit position: 0 */
    /* 0x000c */ unsigned long Reserved1 : 2; /* bit position: 8 */
    /* 0x000c */ unsigned long SlotNumber : 14; /* bit position: 10 */
    /* 0x000c */ unsigned long Reserved2 : 8; /* bit position: 24 */
  }; /* bitfield */
} WHEA_PCIEXPRESS_DEVICE_ID, *PWHEA_PCIEXPRESS_DEVICE_ID; /* size: 0x0010 */

typedef union _WHEA_PCIEXPRESS_BRIDGE_CONTROL_STATUS
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned short BridgeSecondaryStatus;
      /* 0x0002 */ unsigned short BridgeControl;
    }; /* size: 0x0004 */
    /* 0x0000 */ unsigned long AsULONG;
  }; /* size: 0x0004 */
} WHEA_PCIEXPRESS_BRIDGE_CONTROL_STATUS, *PWHEA_PCIEXPRESS_BRIDGE_CONTROL_STATUS; /* size: 0x0004 */

typedef struct _WHEA_PCIEXPRESS_ERROR
{
  /* 0x0000 */ union _WHEA_PCIEXPRESS_ERROR_VALIDBITS ValidBits;
  /* 0x0008 */ enum WHEA_PCIEXPRESS_DEVICE_TYPE PortType;
  /* 0x000c */ union _WHEA_PCIEXPRESS_VERSION Version;
  /* 0x0010 */ union _WHEA_PCIEXPRESS_COMMAND_STATUS CommandStatus;
  /* 0x0014 */ unsigned long Reserved;
  /* 0x0018 */ struct _WHEA_PCIEXPRESS_DEVICE_ID DeviceId;
  /* 0x0028 */ unsigned __int64 DeviceSerialNumber;
  /* 0x0030 */ union _WHEA_PCIEXPRESS_BRIDGE_CONTROL_STATUS BridgeControlStatus;
  /* 0x0034 */ unsigned char ExpressCapability[60];
  /* 0x0070 */ unsigned char AerInfo[96];
} WHEA_PCIEXPRESS_ERROR, *PWHEA_PCIEXPRESS_ERROR; /* size: 0x00d0 */

typedef union _WHEA_PCIXBUS_ID
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned char BusNumber;
      /* 0x0001 */ unsigned char BusSegment;
    }; /* size: 0x0002 */
    /* 0x0000 */ unsigned short AsUSHORT;
  }; /* size: 0x0002 */
} WHEA_PCIXBUS_ID, *PWHEA_PCIXBUS_ID; /* size: 0x0002 */

typedef union _WHEA_PCIXBUS_COMMAND
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned __int64 Command : 56; /* bit position: 0 */
      /* 0x0000 */ unsigned __int64 PCIXCommand : 1; /* bit position: 56 */
      /* 0x0000 */ unsigned __int64 Reserved : 7; /* bit position: 57 */
    }; /* bitfield */
    /* 0x0000 */ unsigned __int64 AsULONGLONG;
  }; /* size: 0x0008 */
} WHEA_PCIXBUS_COMMAND, *PWHEA_PCIXBUS_COMMAND; /* size: 0x0008 */

typedef struct _WHEA_PCIXBUS_ERROR
{
  /* 0x0000 */ union _WHEA_PCIXBUS_ERROR_VALIDBITS ValidBits;
  /* 0x0008 */ union _WHEA_ERROR_STATUS ErrorStatus;
  /* 0x0010 */ unsigned short ErrorType;
  /* 0x0012 */ union _WHEA_PCIXBUS_ID BusId;
  /* 0x0014 */ unsigned long Reserved;
  /* 0x0018 */ unsigned __int64 BusAddress;
  /* 0x0020 */ unsigned __int64 BusData;
  /* 0x0028 */ union _WHEA_PCIXBUS_COMMAND BusCommand;
  /* 0x0030 */ unsigned __int64 RequesterId;
  /* 0x0038 */ unsigned __int64 CompleterId;
  /* 0x0040 */ unsigned __int64 TargetId;
} WHEA_PCIXBUS_ERROR, *PWHEA_PCIXBUS_ERROR; /* size: 0x0048 */

typedef struct _WHEA_PCIXDEVICE_ID
{
  /* 0x0000 */ unsigned short VendorId;
  /* 0x0002 */ unsigned short DeviceId;
  struct /* bitfield */
  {
    /* 0x0004 */ unsigned long ClassCode : 24; /* bit position: 0 */
    /* 0x0004 */ unsigned long FunctionNumber : 8; /* bit position: 24 */
  }; /* bitfield */
  struct /* bitfield */
  {
    /* 0x0008 */ unsigned long DeviceNumber : 8; /* bit position: 0 */
    /* 0x0008 */ unsigned long BusNumber : 8; /* bit position: 8 */
    /* 0x0008 */ unsigned long SegmentNumber : 8; /* bit position: 16 */
    /* 0x0008 */ unsigned long Reserved1 : 8; /* bit position: 24 */
  }; /* bitfield */
  /* 0x000c */ unsigned long Reserved2;
} WHEA_PCIXDEVICE_ID, *PWHEA_PCIXDEVICE_ID; /* size: 0x0010 */

struct WHEA_PCIXDEVICE_REGISTER_PAIR
{
  /* 0x0000 */ unsigned __int64 Register;
  /* 0x0008 */ unsigned __int64 Data;
}; /* size: 0x0010 */

typedef struct _WHEA_PCIXDEVICE_ERROR
{
  /* 0x0000 */ union _WHEA_PCIXDEVICE_ERROR_VALIDBITS ValidBits;
  /* 0x0008 */ union _WHEA_ERROR_STATUS ErrorStatus;
  /* 0x0010 */ struct _WHEA_PCIXDEVICE_ID IdInfo;
  /* 0x0020 */ unsigned long MemoryNumber;
  /* 0x0024 */ unsigned long IoNumber;
  /* 0x0028 */ struct WHEA_PCIXDEVICE_REGISTER_PAIR RegisterDataPairs[4];
} WHEA_PCIXDEVICE_ERROR, *PWHEA_PCIXDEVICE_ERROR; /* size: 0x0068 */

typedef struct _WHEA_ERROR_PACKET
{
  /* 0x0000 */ unsigned long Signature;
  /* 0x0004 */ union _WHEA_ERROR_PACKET_FLAGS Flags;
  /* 0x0008 */ unsigned long Size;
  /* 0x000c */ unsigned long RawDataLength;
  /* 0x0010 */ unsigned __int64 Reserved1;
  /* 0x0018 */ unsigned __int64 Context;
  /* 0x0020 */ enum _WHEA_ERROR_TYPE ErrorType;
  /* 0x0024 */ enum _WHEA_ERROR_SEVERITY ErrorSeverity;
  /* 0x0028 */ unsigned long ErrorSourceId;
  /* 0x002c */ enum _WHEA_ERROR_SOURCE_TYPE ErrorSourceType;
  /* 0x0030 */ unsigned long Reserved2;
  /* 0x0034 */ unsigned long Version;
  /* 0x0038 */ unsigned __int64 Cpu;
  union
  {
    union
    {
      /* 0x0040 */ struct _WHEA_GENERIC_PROCESSOR_ERROR ProcessorError;
      /* 0x0040 */ struct _WHEA_MEMORY_ERROR MemoryError;
      /* 0x0040 */ struct _WHEA_NMI_ERROR NmiError;
      /* 0x0040 */ struct _WHEA_PCIEXPRESS_ERROR PciExpressError;
      /* 0x0040 */ struct _WHEA_PCIXBUS_ERROR PciXBusError;
      /* 0x0040 */ struct _WHEA_PCIXDEVICE_ERROR PciXDeviceError;
    }; /* size: 0x00d0 */
  } /* size: 0x00d0 */ u;
  /* 0x0110 */ enum _WHEA_RAW_DATA_FORMAT RawDataFormat;
  /* 0x0114 */ unsigned long RawDataOffset;
  /* 0x0118 */ unsigned char RawData[1];
} WHEA_ERROR_PACKET, *PWHEA_ERROR_PACKET; /* size: 0x0119 */

typedef struct _NDIS_PACKET_PRIVATE
{
  /* 0x0000 */ unsigned int PhysicalCount;
  /* 0x0004 */ unsigned int TotalLength;
  /* 0x0008 */ struct _MDL* Head;
  /* 0x000c */ struct _MDL* Tail;
  /* 0x0010 */ void* Pool;
  /* 0x0014 */ unsigned int Count;
  /* 0x0018 */ unsigned long Flags;
  /* 0x001c */ unsigned char ValidCounts;
  /* 0x001d */ unsigned char NdisPacketFlags;
  /* 0x001e */ unsigned short NdisPacketOobOffset;
} NDIS_PACKET_PRIVATE, *PNDIS_PACKET_PRIVATE; /* size: 0x0020 */

typedef struct _FILE_STANDARD_INFORMATION
{
  /* 0x0000 */ union _LARGE_INTEGER AllocationSize;
  /* 0x0008 */ union _LARGE_INTEGER EndOfFile;
  /* 0x0010 */ unsigned long NumberOfLinks;
  /* 0x0014 */ unsigned char DeletePending;
  /* 0x0015 */ unsigned char Directory;
  /* 0x0016 */ char __PADDING__[2];
} FILE_STANDARD_INFORMATION, *PFILE_STANDARD_INFORMATION; /* size: 0x0018 */

typedef struct _OBJECT_DIRECTORY
{
  /* 0x0000 */ struct _OBJECT_DIRECTORY_ENTRY* HashBuckets[37];
  /* 0x0094 */ struct _EX_PUSH_LOCK Lock;
  /* 0x0098 */ struct _DEVICE_MAP* DeviceMap;
  /* 0x009c */ unsigned long SessionId;
  /* 0x00a0 */ void* NamespaceEntry;
  /* 0x00a4 */ unsigned long Flags;
} OBJECT_DIRECTORY, *POBJECT_DIRECTORY; /* size: 0x00a8 */

typedef union _NDIS_RW_LOCK_REFCOUNT
{
  union
  {
    /* 0x0000 */ unsigned int RefCount;
    /* 0x0000 */ unsigned char cacheLine[16];
  }; /* size: 0x0010 */
} NDIS_RW_LOCK_REFCOUNT, *PNDIS_RW_LOCK_REFCOUNT; /* size: 0x0010 */

typedef struct _NDIS_RW_LOCK
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned long SpinLock;
      /* 0x0004 */ void* Context;
    }; /* size: 0x0008 */
    /* 0x0000 */ unsigned char Reserved[16];
  }; /* size: 0x0010 */
  /* 0x0010 */ union _NDIS_RW_LOCK_REFCOUNT RefCount[32];
} NDIS_RW_LOCK, *PNDIS_RW_LOCK; /* size: 0x0210 */

typedef struct _NDIS_MINIPORT_WORK_ITEM
{
  /* 0x0000 */ struct _SINGLE_LIST_ENTRY Link;
  /* 0x0004 */ enum _NDIS_WORK_ITEM_TYPE WorkItemType;
  /* 0x0008 */ void* WorkItemContext;
} NDIS_MINIPORT_WORK_ITEM, *PNDIS_MINIPORT_WORK_ITEM; /* size: 0x000c */

typedef struct _NDIS_TIMER
{
  /* 0x0000 */ struct _KTIMER Timer;
  /* 0x0028 */ struct _KDPC Dpc;
} NDIS_TIMER, *PNDIS_TIMER; /* size: 0x0048 */

typedef struct _NET_BUFFER_LIST
{
  union
  {
    struct
    {
      /* 0x0000 */ struct _NET_BUFFER_LIST* Next;
      /* 0x0004 */ struct _NET_BUFFER* FirstNetBuffer;
    }; /* size: 0x0008 */
    /* 0x0000 */ union _SLIST_HEADER Link;
  }; /* size: 0x0008 */
  /* 0x0008 */ struct _NET_BUFFER_LIST_CONTEXT* Context;
  /* 0x000c */ struct _NET_BUFFER_LIST* ParentNetBufferList;
  /* 0x0010 */ void* NdisPoolHandle;
  /* 0x0014 */ long Padding_20;
  /* 0x0018 */ void* NdisReserved[2];
  /* 0x0020 */ void* ProtocolReserved[4];
  /* 0x0030 */ void* MiniportReserved[2];
  /* 0x0038 */ void* Scratch;
  /* 0x003c */ void* SourceHandle;
  /* 0x0040 */ unsigned long NblFlags;
  /* 0x0044 */ long ChildRefCount;
  /* 0x0048 */ unsigned long Flags;
  /* 0x004c */ int Status;
  /* 0x0050 */ void* NetBufferListInfo[13];
  /* 0x0084 */ long __PADDING__[1];
} NET_BUFFER_LIST, *PNET_BUFFER_LIST; /* size: 0x0088 */

typedef struct _FILE_NETWORK_OPEN_INFORMATION
{
  /* 0x0000 */ union _LARGE_INTEGER CreationTime;
  /* 0x0008 */ union _LARGE_INTEGER LastAccessTime;
  /* 0x0010 */ union _LARGE_INTEGER LastWriteTime;
  /* 0x0018 */ union _LARGE_INTEGER ChangeTime;
  /* 0x0020 */ union _LARGE_INTEGER AllocationSize;
  /* 0x0028 */ union _LARGE_INTEGER EndOfFile;
  /* 0x0030 */ unsigned long FileAttributes;
  /* 0x0034 */ long __PADDING__[1];
} FILE_NETWORK_OPEN_INFORMATION, *PFILE_NETWORK_OPEN_INFORMATION; /* size: 0x0038 */

typedef struct _IO_INTERRUPT_MESSAGE_INFO_ENTRY
{
  /* 0x0000 */ union _LARGE_INTEGER MessageAddress;
  /* 0x0008 */ unsigned long TargetProcessorSet;
  /* 0x000c */ struct _KINTERRUPT* InterruptObject;
  /* 0x0010 */ unsigned long MessageData;
  /* 0x0014 */ unsigned long Vector;
  /* 0x0018 */ unsigned char Irql;
  /* 0x0019 */ char Padding_21[3];
  /* 0x001c */ enum _KINTERRUPT_MODE Mode;
  /* 0x0020 */ enum _KINTERRUPT_POLARITY Polarity;
  /* 0x0024 */ long __PADDING__[1];
} IO_INTERRUPT_MESSAGE_INFO_ENTRY, *PIO_INTERRUPT_MESSAGE_INFO_ENTRY; /* size: 0x0028 */

typedef struct _OWNER_ENTRY
{
  /* 0x0000 */ unsigned long OwnerThread;
  union
  {
    /* 0x0004 */ long OwnerCount;
    /* 0x0004 */ unsigned long TableSize;
  }; /* size: 0x0004 */
} OWNER_ENTRY, *POWNER_ENTRY; /* size: 0x0008 */

typedef struct _ERESOURCE
{
  /* 0x0000 */ struct _LIST_ENTRY SystemResourcesList;
  /* 0x0008 */ struct _OWNER_ENTRY* OwnerTable;
  /* 0x000c */ short ActiveCount;
  /* 0x000e */ unsigned short Flag;
  /* 0x0010 */ struct _KSEMAPHORE* SharedWaiters;
  /* 0x0014 */ struct _KEVENT* ExclusiveWaiters;
  /* 0x0018 */ struct _OWNER_ENTRY OwnerEntry;
  /* 0x0020 */ unsigned long ActiveEntries;
  /* 0x0024 */ unsigned long ContentionCount;
  /* 0x0028 */ unsigned long NumberOfSharedWaiters;
  /* 0x002c */ unsigned long NumberOfExclusiveWaiters;
  union
  {
    /* 0x0030 */ void* Address;
    /* 0x0030 */ unsigned long CreatorBackTraceIndex;
  }; /* size: 0x0004 */
  /* 0x0034 */ unsigned long SpinLock;
} ERESOURCE, *PERESOURCE; /* size: 0x0038 */

typedef struct _REFERENCE
{
  /* 0x0000 */ unsigned long SpinLock;
  /* 0x0004 */ unsigned short ReferenceCount;
  /* 0x0006 */ unsigned char Closing;
  /* 0x0007 */ char __PADDING__[1];
} REFERENCE, *PREFERENCE; /* size: 0x0008 */

typedef struct _NDIS_CO_CALL_MANAGER_OPTIONAL_HANDLERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Reserved;
  /* 0x0008 */ void* CmCreateVcHandler /* function */;
  /* 0x000c */ void* CmDeleteVcHandler /* function */;
  /* 0x0010 */ void* CmOpenAfHandler /* function */;
  /* 0x0014 */ void* CmCloseAfHandler /* function */;
  /* 0x0018 */ void* CmRegisterSapHandler /* function */;
  /* 0x001c */ void* CmDeregisterSapHandler /* function */;
  /* 0x0020 */ void* CmMakeCallHandler /* function */;
  /* 0x0024 */ void* CmCloseCallHandler /* function */;
  /* 0x0028 */ void* CmIncomingCallCompleteHandler /* function */;
  /* 0x002c */ void* CmAddPartyHandler /* function */;
  /* 0x0030 */ void* CmDropPartyHandler /* function */;
  /* 0x0034 */ void* CmActivateVcCompleteHandler /* function */;
  /* 0x0038 */ void* CmDeactivateVcCompleteHandler /* function */;
  /* 0x003c */ void* CmModifyCallQoSHandler /* function */;
  /* 0x0040 */ void* CmOidRequestHandler /* function */;
  /* 0x0044 */ void* CmOidRequestCompleteHandler /* function */;
  /* 0x0048 */ void* CmNotifyCloseAfCompleteHandler /* function */;
} NDIS_CO_CALL_MANAGER_OPTIONAL_HANDLERS, *PNDIS_CO_CALL_MANAGER_OPTIONAL_HANDLERS; /* size: 0x004c */

typedef struct _NDIS_PROTOCOL_BLOCK
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ void* ProtocolDriverContext;
  /* 0x0008 */ struct _NDIS_PROTOCOL_BLOCK* NextProtocol;
  /* 0x000c */ struct _NDIS_OPEN_BLOCK* OpenQueue;
  /* 0x0010 */ struct _REFERENCE Ref;
  /* 0x0018 */ unsigned char MajorNdisVersion;
  /* 0x0019 */ unsigned char MinorNdisVersion;
  /* 0x001a */ unsigned char MajorDriverVersion;
  /* 0x001b */ unsigned char MinorDriverVersion;
  /* 0x001c */ unsigned int Reserved;
  /* 0x0020 */ unsigned int Flags;
  /* 0x0024 */ struct _UNICODE_STRING Name;
  /* 0x002c */ unsigned char IsIPv4;
  /* 0x002d */ unsigned char IsIPv6;
  /* 0x002e */ unsigned char IsNdisTest6;
  /* 0x002f */ char Padding_22;
  /* 0x0030 */ void* BindAdapterHandlerEx /* function */;
  /* 0x0034 */ void* UnbindAdapterHandlerEx /* function */;
  /* 0x0038 */ void* OpenAdapterCompleteHandlerEx /* function */;
  /* 0x003c */ void* CloseAdapterCompleteHandlerEx /* function */;
  union
  {
    /* 0x0040 */ void* PnPEventHandler /* function */;
    /* 0x0040 */ void* NetPnPEventHandler /* function */;
  }; /* size: 0x0004 */
  /* 0x0044 */ void* UnloadHandler /* function */;
  /* 0x0048 */ void* UninstallHandler /* function */;
  /* 0x004c */ void* RequestCompleteHandler /* function */;
  union
  {
    /* 0x0050 */ void* StatusHandlerEx /* function */;
    /* 0x0050 */ void* StatusHandler /* function */;
  }; /* size: 0x0004 */
  /* 0x0054 */ void* StatusCompleteHandler /* function */;
  /* 0x0058 */ void* ReceiveNetBufferListsHandler /* function */;
  /* 0x005c */ void* SendNetBufferListsCompleteHandler /* function */;
  union
  {
    /* 0x0060 */ void* CoStatusHandlerEx /* function */;
    /* 0x0060 */ void* CoStatusHandler /* function */;
  }; /* size: 0x0004 */
  /* 0x0064 */ void* CoAfRegisterNotifyHandler /* function */;
  /* 0x0068 */ void* CoReceiveNetBufferListsHandler /* function */;
  /* 0x006c */ void* CoSendNetBufferListsCompleteHandler /* function */;
  /* 0x0070 */ void* OpenAdapterCompleteHandler /* function */;
  /* 0x0074 */ void* CloseAdapterCompleteHandler /* function */;
  union
  {
    /* 0x0078 */ void* SendCompleteHandler /* function */;
    /* 0x0078 */ void* WanSendCompleteHandler /* function */;
  }; /* size: 0x0004 */
  union
  {
    /* 0x007c */ void* TransferDataCompleteHandler /* function */;
    /* 0x007c */ void* WanTransferDataCompleteHandler /* function */;
  }; /* size: 0x0004 */
  /* 0x0080 */ void* ResetCompleteHandler /* function */;
  union
  {
    /* 0x0084 */ void* ReceiveHandler /* function */;
    /* 0x0084 */ void* WanReceiveHandler /* function */;
  }; /* size: 0x0004 */
  /* 0x0088 */ void* ReceiveCompleteHandler /* function */;
  /* 0x008c */ void* ReceivePacketHandler /* function */;
  /* 0x0090 */ void* BindAdapterHandler /* function */;
  /* 0x0094 */ void* UnbindAdapterHandler /* function */;
  /* 0x0098 */ void* CoSendCompleteHandler /* function */;
  /* 0x009c */ void* CoReceivePacketHandler /* function */;
  /* 0x00a0 */ void* OidRequestCompleteHandler /* function */;
  /* 0x00a4 */ struct _WORK_QUEUE_ITEM WorkItem;
  /* 0x00b4 */ struct _KMUTANT Mutex;
  /* 0x00d4 */ void* MutexOwnerThread;
  /* 0x00d8 */ unsigned long MutexOwnerCount;
  /* 0x00dc */ unsigned long MutexOwner;
  /* 0x00e0 */ struct _UNICODE_STRING* BindDeviceName;
  /* 0x00e4 */ struct _UNICODE_STRING* RootDeviceName;
  /* 0x00e8 */ struct _NDIS_M_DRIVER_BLOCK* AssociatedMiniDriver;
  /* 0x00ec */ struct _NDIS_MINIPORT_BLOCK* BindingAdapter;
  /* 0x00f0 */ struct _KEVENT* DeregEvent;
  union
  {
    /* 0x00f4 */ struct _NDIS_CO_CLIENT_OPTIONAL_HANDLERS ClientChars;
    /* 0x00f4 */ struct _NDIS_CO_CALL_MANAGER_OPTIONAL_HANDLERS CallMgrChars;
  }; /* size: 0x0054 */
  /* 0x0148 */ void* InitiateOffloadCompleteHandler /* function */;
  /* 0x014c */ void* TerminateOffloadCompleteHandler /* function */;
  /* 0x0150 */ void* UpdateOffloadCompleteHandler /* function */;
  /* 0x0154 */ void* InvalidateOffloadCompleteHandler /* function */;
  /* 0x0158 */ void* QueryOffloadCompleteHandler /* function */;
  /* 0x015c */ void* IndicateOffloadEventHandler /* function */;
  /* 0x0160 */ void* TcpOffloadSendCompleteHandler /* function */;
  /* 0x0164 */ void* TcpOffloadReceiveCompleteHandler /* function */;
  /* 0x0168 */ void* TcpOffloadDisconnectCompleteHandler /* function */;
  /* 0x016c */ void* TcpOffloadForwardCompleteHandler /* function */;
  /* 0x0170 */ void* TcpOffloadEventHandler /* function */;
  /* 0x0174 */ void* TcpOffloadReceiveIndicateHandler /* function */;
  /* 0x0178 */ void* DirectOidRequestCompleteHandler /* function */;
} NDIS_PROTOCOL_BLOCK, *PNDIS_PROTOCOL_BLOCK; /* size: 0x017c */

typedef struct _KSEMAPHORE
{
  /* 0x0000 */ struct _DISPATCHER_HEADER Header;
  /* 0x0010 */ long Limit;
} KSEMAPHORE, *PKSEMAPHORE; /* size: 0x0014 */

typedef union _WHEA_REVISION
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned char MinorRevision;
      /* 0x0001 */ unsigned char MajorRevision;
    }; /* size: 0x0002 */
    /* 0x0000 */ unsigned short AsUSHORT;
  }; /* size: 0x0002 */
} WHEA_REVISION, *PWHEA_REVISION; /* size: 0x0002 */

typedef union _WHEA_ERROR_RECORD_HEADER_VALIDBITS
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long Timestamp : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned long PlatformId : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned long PartitionId : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned long Reserved : 29; /* bit position: 3 */
    }; /* bitfield */
    /* 0x0000 */ unsigned long AsULONG;
  }; /* size: 0x0004 */
} WHEA_ERROR_RECORD_HEADER_VALIDBITS, *PWHEA_ERROR_RECORD_HEADER_VALIDBITS; /* size: 0x0004 */

typedef union _WHEA_TIMESTAMP
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned __int64 Seconds : 8; /* bit position: 0 */
      /* 0x0000 */ unsigned __int64 Minutes : 8; /* bit position: 8 */
      /* 0x0000 */ unsigned __int64 Hours : 8; /* bit position: 16 */
      /* 0x0000 */ unsigned __int64 Reserved : 8; /* bit position: 24 */
      /* 0x0000 */ unsigned __int64 Day : 8; /* bit position: 32 */
      /* 0x0000 */ unsigned __int64 Month : 8; /* bit position: 40 */
      /* 0x0000 */ unsigned __int64 Year : 8; /* bit position: 48 */
      /* 0x0000 */ unsigned __int64 Century : 8; /* bit position: 56 */
    }; /* bitfield */
    /* 0x0000 */ union _LARGE_INTEGER AsLARGE_INTEGER;
  }; /* size: 0x0008 */
} WHEA_TIMESTAMP, *PWHEA_TIMESTAMP; /* size: 0x0008 */

typedef union _WHEA_ERROR_RECORD_HEADER_FLAGS
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long Recovered : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned long PreviousError : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned long Simulated : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned long Reserved : 29; /* bit position: 3 */
    }; /* bitfield */
    /* 0x0000 */ unsigned long AsULONG;
  }; /* size: 0x0004 */
} WHEA_ERROR_RECORD_HEADER_FLAGS, *PWHEA_ERROR_RECORD_HEADER_FLAGS; /* size: 0x0004 */

typedef union _WHEA_PERSISTENCE_INFO
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned __int64 Signature : 16; /* bit position: 0 */
      /* 0x0000 */ unsigned __int64 Length : 24; /* bit position: 16 */
      /* 0x0000 */ unsigned __int64 Identifier : 16; /* bit position: 40 */
      /* 0x0000 */ unsigned __int64 Attributes : 2; /* bit position: 56 */
      /* 0x0000 */ unsigned __int64 DoNotLog : 1; /* bit position: 58 */
      /* 0x0000 */ unsigned __int64 Reserved : 5; /* bit position: 59 */
    }; /* bitfield */
    /* 0x0000 */ unsigned __int64 AsULONGLONG;
  }; /* size: 0x0008 */
} WHEA_PERSISTENCE_INFO, *PWHEA_PERSISTENCE_INFO; /* size: 0x0008 */

typedef struct _WHEA_ERROR_RECORD_HEADER
{
  /* 0x0000 */ unsigned long Signature;
  /* 0x0004 */ union _WHEA_REVISION Revision;
  /* 0x0006 */ unsigned long SignatureEnd;
  /* 0x000a */ unsigned short SectionCount;
  /* 0x000c */ enum _WHEA_ERROR_SEVERITY Severity;
  /* 0x0010 */ union _WHEA_ERROR_RECORD_HEADER_VALIDBITS ValidBits;
  /* 0x0014 */ unsigned long Length;
  /* 0x0018 */ union _WHEA_TIMESTAMP Timestamp;
  /* 0x0020 */ struct _GUID PlatformId;
  /* 0x0030 */ struct _GUID PartitionId;
  /* 0x0040 */ struct _GUID CreatorId;
  /* 0x0050 */ struct _GUID NotifyType;
  /* 0x0060 */ unsigned __int64 RecordId;
  /* 0x0068 */ union _WHEA_ERROR_RECORD_HEADER_FLAGS Flags;
  /* 0x006c */ union _WHEA_PERSISTENCE_INFO PersistenceInfo;
  /* 0x0074 */ unsigned char Reserved[12];
} WHEA_ERROR_RECORD_HEADER, *PWHEA_ERROR_RECORD_HEADER; /* size: 0x0080 */

typedef union _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_VALIDBITS
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned char FRUId : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned char FRUText : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned char Reserved : 6; /* bit position: 2 */
    }; /* bitfield */
    /* 0x0000 */ unsigned char AsUCHAR;
  }; /* size: 0x0001 */
} WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_VALIDBITS, *PWHEA_ERROR_RECORD_SECTION_DESCRIPTOR_VALIDBITS; /* size: 0x0001 */

typedef union _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_FLAGS
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long Primary : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned long ContainmentWarning : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned long Reset : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned long ThresholdExceeded : 1; /* bit position: 3 */
      /* 0x0000 */ unsigned long ResourceNotAvailable : 1; /* bit position: 4 */
      /* 0x0000 */ unsigned long LatentError : 1; /* bit position: 5 */
      /* 0x0000 */ unsigned long Reserved : 26; /* bit position: 6 */
    }; /* bitfield */
    /* 0x0000 */ unsigned long AsULONG;
  }; /* size: 0x0004 */
} WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_FLAGS, *PWHEA_ERROR_RECORD_SECTION_DESCRIPTOR_FLAGS; /* size: 0x0004 */

typedef struct _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR
{
  /* 0x0000 */ unsigned long SectionOffset;
  /* 0x0004 */ unsigned long SectionLength;
  /* 0x0008 */ union _WHEA_REVISION Revision;
  /* 0x000a */ union _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_VALIDBITS ValidBits;
  /* 0x000b */ unsigned char Reserved;
  /* 0x000c */ union _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_FLAGS Flags;
  /* 0x0010 */ struct _GUID SectionType;
  /* 0x0020 */ struct _GUID FRUId;
  /* 0x0030 */ enum _WHEA_ERROR_SEVERITY SectionSeverity;
  /* 0x0034 */ char FRUText[20];
} WHEA_ERROR_RECORD_SECTION_DESCRIPTOR, *PWHEA_ERROR_RECORD_SECTION_DESCRIPTOR; /* size: 0x0048 */

typedef struct _WHEA_ERROR_RECORD
{
  /* 0x0000 */ struct _WHEA_ERROR_RECORD_HEADER Header;
  /* 0x0080 */ struct _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR SectionDescriptor[1];
} WHEA_ERROR_RECORD, *PWHEA_ERROR_RECORD; /* size: 0x00c8 */

typedef struct _IPV6_FRAGMENT_HEADER
{
  /* 0x0000 */ unsigned char NextHeader;
  /* 0x0001 */ unsigned char Reserved;
  union
  {
    struct /* bitfield */
    {
      /* 0x0002 */ unsigned short DontUse1 : 8; /* bit position: 0 */
      /* 0x0002 */ unsigned short MoreFragments : 1; /* bit position: 8 */
      /* 0x0002 */ unsigned short ReservedBits : 2; /* bit position: 9 */
      /* 0x0002 */ unsigned short DontUse2 : 5; /* bit position: 11 */
    }; /* bitfield */
    /* 0x0002 */ unsigned short OffsetAndFlags;
  }; /* size: 0x0002 */
  /* 0x0004 */ unsigned int Id;
} IPV6_FRAGMENT_HEADER, *PIPV6_FRAGMENT_HEADER; /* size: 0x0008 */

typedef struct _NETIO_NET_BUFFER_CONTEXT
{
  /* 0x0000 */ unsigned long OriginalDataOffset;
  /* 0x0004 */ unsigned long OriginalDataLength;
  /* 0x0008 */ unsigned long TruncatedLength;
  union
  {
    /* 0x000c */ unsigned long Flags;
    struct /* bitfield */
    {
      /* 0x000c */ unsigned long EcnField : 2; /* bit position: 0 */
      /* 0x000c */ unsigned long EspTrailerSpaceAllocated : 1; /* bit position: 2 */
    }; /* bitfield */
  }; /* size: 0x0004 */
  /* 0x0010 */ void* Scratch[2];
} NETIO_NET_BUFFER_CONTEXT, *PNETIO_NET_BUFFER_CONTEXT; /* size: 0x0018 */

typedef struct _CM_PARTIAL_RESOURCE_DESCRIPTOR
{
  /* 0x0000 */ unsigned char Type;
  /* 0x0001 */ unsigned char ShareDisposition;
  /* 0x0002 */ unsigned short Flags;
  union
  {
    union
    {
      struct
      {
        /* 0x0004 */ union _LARGE_INTEGER Start;
        /* 0x000c */ unsigned long Length;
      } /* size: 0x000c */ Generic;
      struct
      {
        /* 0x0004 */ union _LARGE_INTEGER Start;
        /* 0x000c */ unsigned long Length;
      } /* size: 0x000c */ Port;
      struct
      {
        /* 0x0004 */ unsigned long Level;
        /* 0x0008 */ unsigned long Vector;
        /* 0x000c */ unsigned long Affinity;
      } /* size: 0x000c */ Interrupt;
      struct
      {
        union
        {
          struct
          {
            /* 0x0004 */ unsigned short Reserved;
            /* 0x0006 */ unsigned short MessageCount;
            /* 0x0008 */ unsigned long Vector;
            /* 0x000c */ unsigned long Affinity;
          } /* size: 0x000c */ Raw;
          struct
          {
            /* 0x0004 */ unsigned long Level;
            /* 0x0008 */ unsigned long Vector;
            /* 0x000c */ unsigned long Affinity;
          } /* size: 0x000c */ Translated;
        }; /* size: 0x000c */
      } /* size: 0x000c */ MessageInterrupt;
      struct
      {
        /* 0x0004 */ union _LARGE_INTEGER Start;
        /* 0x000c */ unsigned long Length;
      } /* size: 0x000c */ Memory;
      struct
      {
        /* 0x0004 */ unsigned long Channel;
        /* 0x0008 */ unsigned long Port;
        /* 0x000c */ unsigned long Reserved1;
      } /* size: 0x000c */ Dma;
      struct
      {
        /* 0x0004 */ unsigned long Data[3];
      } /* size: 0x000c */ DevicePrivate;
      struct
      {
        /* 0x0004 */ unsigned long Start;
        /* 0x0008 */ unsigned long Length;
        /* 0x000c */ unsigned long Reserved;
      } /* size: 0x000c */ BusNumber;
      struct
      {
        /* 0x0004 */ unsigned long DataSize;
        /* 0x0008 */ unsigned long Reserved1;
        /* 0x000c */ unsigned long Reserved2;
      } /* size: 0x000c */ DeviceSpecificData;
      struct
      {
        /* 0x0004 */ union _LARGE_INTEGER Start;
        /* 0x000c */ unsigned long Length40;
      } /* size: 0x000c */ Memory40;
      struct
      {
        /* 0x0004 */ union _LARGE_INTEGER Start;
        /* 0x000c */ unsigned long Length48;
      } /* size: 0x000c */ Memory48;
      struct
      {
        /* 0x0004 */ union _LARGE_INTEGER Start;
        /* 0x000c */ unsigned long Length64;
      } /* size: 0x000c */ Memory64;
    }; /* size: 0x000c */
  } /* size: 0x000c */ u;
} CM_PARTIAL_RESOURCE_DESCRIPTOR, *PCM_PARTIAL_RESOURCE_DESCRIPTOR; /* size: 0x0010 */

typedef struct _CM_PARTIAL_RESOURCE_LIST
{
  /* 0x0000 */ unsigned short Version;
  /* 0x0002 */ unsigned short Revision;
  /* 0x0004 */ unsigned long Count;
  /* 0x0008 */ struct _CM_PARTIAL_RESOURCE_DESCRIPTOR PartialDescriptors[1];
} CM_PARTIAL_RESOURCE_LIST, *PCM_PARTIAL_RESOURCE_LIST; /* size: 0x0018 */

typedef struct _CM_FULL_RESOURCE_DESCRIPTOR
{
  /* 0x0000 */ enum _INTERFACE_TYPE InterfaceType;
  /* 0x0004 */ unsigned long BusNumber;
  /* 0x0008 */ struct _CM_PARTIAL_RESOURCE_LIST PartialResourceList;
} CM_FULL_RESOURCE_DESCRIPTOR, *PCM_FULL_RESOURCE_DESCRIPTOR; /* size: 0x0020 */

typedef struct _NDIS_PM_WAKE_UP_CAPABILITIES
{
  /* 0x0000 */ enum _NDIS_DEVICE_POWER_STATE MinMagicPacketWakeUp;
  /* 0x0004 */ enum _NDIS_DEVICE_POWER_STATE MinPatternWakeUp;
  /* 0x0008 */ enum _NDIS_DEVICE_POWER_STATE MinLinkChangeWakeUp;
} NDIS_PM_WAKE_UP_CAPABILITIES, *PNDIS_PM_WAKE_UP_CAPABILITIES; /* size: 0x000c */

struct _IO_TIMER;

struct in6_addr
{
  union
  {
    union
    {
      /* 0x0000 */ unsigned char Byte[16];
      /* 0x0000 */ unsigned short Word[8];
    }; /* size: 0x0010 */
  } /* size: 0x0010 */ u;
}; /* size: 0x0010 */

struct SCOPE_ID
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long Zone : 28; /* bit position: 0 */
      /* 0x0000 */ unsigned long Level : 4; /* bit position: 28 */
    }; /* bitfield */
    /* 0x0000 */ unsigned long Value;
  }; /* size: 0x0004 */
}; /* size: 0x0004 */

struct sockaddr_in6
{
  /* 0x0000 */ unsigned short sin6_family;
  /* 0x0002 */ unsigned short sin6_port;
  /* 0x0004 */ unsigned long sin6_flowinfo;
  /* 0x0008 */ struct in6_addr sin6_addr;
  union
  {
    /* 0x0018 */ unsigned long sin6_scope_id;
    /* 0x0018 */ struct SCOPE_ID sin6_scope_struct;
  }; /* size: 0x0004 */
}; /* size: 0x001c */

typedef struct _NDIS_OFFLOAD_HANDLE
{
  /* 0x0000 */ void* NdisReserved[1];
  /* 0x0004 */ void* MiniportOffloadContext;
} NDIS_OFFLOAD_HANDLE, *PNDIS_OFFLOAD_HANDLE; /* size: 0x0008 */

typedef struct _DEVOBJ_EXTENSION
{
  /* 0x0000 */ short Type;
  /* 0x0002 */ unsigned short Size;
  /* 0x0004 */ struct _DEVICE_OBJECT* DeviceObject;
  /* 0x0008 */ unsigned long PowerFlags;
  /* 0x000c */ struct _DEVICE_OBJECT_POWER_EXTENSION* Dope;
  /* 0x0010 */ unsigned long ExtensionFlags;
  /* 0x0014 */ void* DeviceNode;
  /* 0x0018 */ struct _DEVICE_OBJECT* AttachedTo;
  /* 0x001c */ long StartIoCount;
  /* 0x0020 */ long StartIoKey;
  /* 0x0024 */ unsigned long StartIoFlags;
  /* 0x0028 */ struct _VPB* Vpb;
  /* 0x002c */ struct _LIST_ENTRY DependentList;
  /* 0x0034 */ struct _LIST_ENTRY ProviderList;
} DEVOBJ_EXTENSION, *PDEVOBJ_EXTENSION; /* size: 0x003c */

struct _DEVICE_OBJECT_POWER_EXTENSION;

typedef struct _NDIS_NSI_NETWORK_RW
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned int CompartmentId;
  /* 0x0008 */ unsigned long SiteId;
  /* 0x000c */ struct _IF_COUNTED_STRING_LH NetworkName;
} NDIS_NSI_NETWORK_RW, *PNDIS_NSI_NETWORK_RW; /* size: 0x0210 */

typedef struct _MAILSLOT_CREATE_PARAMETERS
{
  /* 0x0000 */ unsigned long MailslotQuota;
  /* 0x0004 */ unsigned long MaximumMessageSize;
  /* 0x0008 */ union _LARGE_INTEGER ReadTimeout;
  /* 0x0010 */ unsigned char TimeoutSpecified;
  /* 0x0011 */ char __PADDING__[7];
} MAILSLOT_CREATE_PARAMETERS, *PMAILSLOT_CREATE_PARAMETERS; /* size: 0x0018 */

typedef struct _INTERFACE
{
  /* 0x0000 */ unsigned short Size;
  /* 0x0002 */ unsigned short Version;
  /* 0x0004 */ void* Context;
  /* 0x0008 */ void* InterfaceReference /* function */;
  /* 0x000c */ void* InterfaceDereference /* function */;
} INTERFACE, *PINTERFACE; /* size: 0x0010 */

typedef struct _OBJECT_HEADER
{
  /* 0x0000 */ long PointerCount;
  union
  {
    /* 0x0004 */ long HandleCount;
    /* 0x0004 */ void* NextToFree;
  }; /* size: 0x0004 */
  /* 0x0008 */ struct _OBJECT_TYPE* Type;
  /* 0x000c */ unsigned char NameInfoOffset;
  /* 0x000d */ unsigned char HandleInfoOffset;
  /* 0x000e */ unsigned char QuotaInfoOffset;
  /* 0x000f */ unsigned char Flags;
  union
  {
    /* 0x0010 */ struct _OBJECT_CREATE_INFORMATION* ObjectCreateInfo;
    /* 0x0010 */ void* QuotaBlockCharged;
  }; /* size: 0x0004 */
  /* 0x0014 */ void* SecurityDescriptor;
  /* 0x0018 */ struct _QUAD Body;
} OBJECT_HEADER, *POBJECT_HEADER; /* size: 0x0020 */

typedef struct _GENERIC_MAPPING
{
  /* 0x0000 */ unsigned long GenericRead;
  /* 0x0004 */ unsigned long GenericWrite;
  /* 0x0008 */ unsigned long GenericExecute;
  /* 0x000c */ unsigned long GenericAll;
} GENERIC_MAPPING, *PGENERIC_MAPPING; /* size: 0x0010 */

typedef struct _POWER_SEQUENCE
{
  /* 0x0000 */ unsigned long SequenceD1;
  /* 0x0004 */ unsigned long SequenceD2;
  /* 0x0008 */ unsigned long SequenceD3;
} POWER_SEQUENCE, *PPOWER_SEQUENCE; /* size: 0x000c */

typedef struct _CM_RESOURCE_LIST
{
  /* 0x0000 */ unsigned long Count;
  /* 0x0004 */ struct _CM_FULL_RESOURCE_DESCRIPTOR List[1];
} CM_RESOURCE_LIST, *PCM_RESOURCE_LIST; /* size: 0x0024 */

struct _ECP_LIST;

typedef struct _IO_DRIVER_CREATE_CONTEXT
{
  /* 0x0000 */ short Size;
  /* 0x0002 */ char Padding_23[2];
  /* 0x0004 */ struct _ECP_LIST* ExtraCreateParameter;
  /* 0x0008 */ void* DeviceObjectHint;
  /* 0x000c */ struct _TXN_PARAMETER_BLOCK* TxnParameters;
} IO_DRIVER_CREATE_CONTEXT, *PIO_DRIVER_CREATE_CONTEXT; /* size: 0x0010 */

typedef struct _TXN_PARAMETER_BLOCK
{
  /* 0x0000 */ unsigned short Length;
  /* 0x0002 */ unsigned short TxFsContext;
  /* 0x0004 */ void* TransactionObject;
} TXN_PARAMETER_BLOCK, *PTXN_PARAMETER_BLOCK; /* size: 0x0008 */

struct _OBJECT_CREATE_INFORMATION;

typedef struct _OBJECT_TYPE_INITIALIZER
{
  /* 0x0000 */ unsigned short Length;
  union
  {
    /* 0x0002 */ unsigned char ObjectTypeFlags;
    struct /* bitfield */
    {
      /* 0x0002 */ unsigned char CaseInsensitive : 1; /* bit position: 0 */
      /* 0x0002 */ unsigned char UnnamedObjectsOnly : 1; /* bit position: 1 */
      /* 0x0002 */ unsigned char UseDefaultObject : 1; /* bit position: 2 */
      /* 0x0002 */ unsigned char SecurityRequired : 1; /* bit position: 3 */
      /* 0x0002 */ unsigned char MaintainHandleCount : 1; /* bit position: 4 */
      /* 0x0002 */ unsigned char MaintainTypeList : 1; /* bit position: 5 */
      /* 0x0002 */ unsigned char SupportsObjectCallbacks : 1; /* bit position: 6 */
    }; /* bitfield */
  }; /* size: 0x0001 */
  /* 0x0003 */ char Padding_24;
  /* 0x0004 */ unsigned long ObjectTypeCode;
  /* 0x0008 */ unsigned long InvalidAttributes;
  /* 0x000c */ struct _GENERIC_MAPPING GenericMapping;
  /* 0x001c */ unsigned long ValidAccessMask;
  /* 0x0020 */ unsigned long RetainAccess;
  /* 0x0024 */ enum _POOL_TYPE PoolType;
  /* 0x0028 */ unsigned long DefaultPagedPoolCharge;
  /* 0x002c */ unsigned long DefaultNonPagedPoolCharge;
  /* 0x0030 */ void* DumpProcedure /* function */;
  /* 0x0034 */ void* OpenProcedure /* function */;
  /* 0x0038 */ void* CloseProcedure /* function */;
  /* 0x003c */ void* DeleteProcedure /* function */;
  /* 0x0040 */ void* ParseProcedure /* function */;
  /* 0x0044 */ void* SecurityProcedure /* function */;
  /* 0x0048 */ void* QueryNameProcedure /* function */;
  /* 0x004c */ void* OkayToCloseProcedure /* function */;
} OBJECT_TYPE_INITIALIZER, *POBJECT_TYPE_INITIALIZER; /* size: 0x0050 */

typedef struct _OBJECT_TYPE
{
  /* 0x0000 */ struct _LIST_ENTRY TypeList;
  /* 0x0008 */ struct _UNICODE_STRING Name;
  /* 0x0010 */ void* DefaultObject;
  /* 0x0014 */ unsigned long Index;
  /* 0x0018 */ unsigned long TotalNumberOfObjects;
  /* 0x001c */ unsigned long TotalNumberOfHandles;
  /* 0x0020 */ unsigned long HighWaterNumberOfObjects;
  /* 0x0024 */ unsigned long HighWaterNumberOfHandles;
  /* 0x0028 */ struct _OBJECT_TYPE_INITIALIZER TypeInfo;
  /* 0x0078 */ struct _ERESOURCE Mutex;
  /* 0x00b0 */ struct _EX_PUSH_LOCK TypeLock;
  /* 0x00b4 */ unsigned long Key;
  /* 0x00b8 */ struct _EX_PUSH_LOCK ObjectLocks[32];
  /* 0x0138 */ struct _LIST_ENTRY CallbackList;
} OBJECT_TYPE, *POBJECT_TYPE; /* size: 0x0140 */

typedef struct _OBJECT_DUMP_CONTROL
{
  /* 0x0000 */ void* Stream;
  /* 0x0004 */ unsigned long Detail;
} OBJECT_DUMP_CONTROL, *POBJECT_DUMP_CONTROL; /* size: 0x0008 */

typedef struct _OBJECT_NAME_INFORMATION
{
  /* 0x0000 */ struct _UNICODE_STRING Name;
} OBJECT_NAME_INFORMATION, *POBJECT_NAME_INFORMATION; /* size: 0x0008 */

typedef struct _FILTER_PAUSE_RESTART_CONTEXT
{
  /* 0x0000 */ struct _NDIS_FILTER_BLOCK* Filter;
  /* 0x0004 */ int Status;
  /* 0x0008 */ struct _KEVENT Event;
} FILTER_PAUSE_RESTART_CONTEXT, *PFILTER_PAUSE_RESTART_CONTEXT; /* size: 0x0018 */

typedef struct _OBJECT_HEADER_NAME_INFO
{
  /* 0x0000 */ struct _OBJECT_DIRECTORY* Directory;
  /* 0x0004 */ struct _UNICODE_STRING Name;
  /* 0x000c */ unsigned long QueryReferences;
} OBJECT_HEADER_NAME_INFO, *POBJECT_HEADER_NAME_INFO; /* size: 0x0010 */

typedef struct _NDIS_FILTER_PAUSE_PARAMETERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ unsigned long PauseReason;
} NDIS_FILTER_PAUSE_PARAMETERS, *PNDIS_FILTER_PAUSE_PARAMETERS; /* size: 0x000c */

struct _OBJECT_DIRECTORY_ENTRY;

struct _DEVICE_MAP;

typedef struct _OBJECT_ATTRIBUTES
{
  /* 0x0000 */ unsigned long Length;
  /* 0x0004 */ void* RootDirectory;
  /* 0x0008 */ struct _UNICODE_STRING* ObjectName;
  /* 0x000c */ unsigned long Attributes;
  /* 0x0010 */ void* SecurityDescriptor;
  /* 0x0014 */ void* SecurityQualityOfService;
} OBJECT_ATTRIBUTES, *POBJECT_ATTRIBUTES; /* size: 0x0018 */

typedef struct _OBJECT_HANDLE_INFORMATION
{
  /* 0x0000 */ unsigned long HandleAttributes;
  /* 0x0004 */ unsigned long GrantedAccess;
} OBJECT_HANDLE_INFORMATION, *POBJECT_HANDLE_INFORMATION; /* size: 0x0008 */

struct KSMETHOD_SET
{
  /* 0x0000 */ const struct _GUID* Set;
  /* 0x0004 */ unsigned long MethodsCount;
  /* 0x0008 */ const struct KSMETHOD_ITEM* MethodItem;
  /* 0x000c */ unsigned long FastIoCount;
  /* 0x0010 */ const struct KSFASTMETHOD_ITEM* FastIoTable;
}; /* size: 0x0014 */

struct KSCOMPONENTID
{
  /* 0x0000 */ struct _GUID Manufacturer;
  /* 0x0010 */ struct _GUID Product;
  /* 0x0020 */ struct _GUID Component;
  /* 0x0030 */ struct _GUID Name;
  /* 0x0040 */ unsigned long Version;
  /* 0x0044 */ unsigned long Revision;
}; /* size: 0x0048 */

typedef struct _NDIS_IF_COMPARTMENT_BLOCK
{
  /* 0x0000 */ struct _LIST_ENTRY Link;
  /* 0x0008 */ unsigned int CompartmentId;
  /* 0x000c */ struct _LIST_ENTRY NetworkLink;
  /* 0x0014 */ unsigned long Flags;
  /* 0x0018 */ long Ref;
  /* 0x001c */ struct _NDIS_IF_NETWORK_BLOCK* LoopbackNetwork;
  /* 0x0020 */ struct _NDIS_NSI_COMPARTMENT_RW LoopbackInfo;
  /* 0x0468 */ struct _NDIS_IF_BLOCK* LoopbackIf;
  /* 0x046c */ struct _KEVENT* AsyncEvent;
} NDIS_IF_COMPARTMENT_BLOCK, *PNDIS_IF_COMPARTMENT_BLOCK; /* size: 0x0470 */

typedef struct _NDIS_FILTER_RESTART_PARAMETERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ enum _NDIS_MEDIUM MiniportMediaType;
  /* 0x0008 */ enum _NDIS_PHYSICAL_MEDIUM MiniportPhysicalMediaType;
  /* 0x000c */ struct _NDIS_RESTART_ATTRIBUTES* RestartAttributes;
  /* 0x0010 */ unsigned long LowerIfIndex;
  /* 0x0014 */ long Padding_25;
  /* 0x0018 */ union _NET_LUID_LH LowerIfNetLuid;
  /* 0x0020 */ unsigned long Flags;
  /* 0x0024 */ long __PADDING__[1];
} NDIS_FILTER_RESTART_PARAMETERS, *PNDIS_FILTER_RESTART_PARAMETERS; /* size: 0x0028 */

typedef struct _NDIS_PACKET
{
  /* 0x0000 */ struct _NDIS_PACKET_PRIVATE Private;
  union
  {
    struct
    {
      /* 0x0020 */ unsigned char MiniportReserved[8];
      /* 0x0028 */ unsigned char WrapperReserved[8];
    }; /* size: 0x0010 */
    struct
    {
      /* 0x0020 */ unsigned char MiniportReservedEx[12];
      /* 0x002c */ unsigned char WrapperReservedEx[4];
    }; /* size: 0x0010 */
    /* 0x0020 */ unsigned char MacReserved[16];
  }; /* size: 0x0010 */
  /* 0x0030 */ unsigned long Reserved[2];
  /* 0x0038 */ unsigned char ProtocolReserved[1];
  /* 0x0039 */ char __PADDING__[3];
} NDIS_PACKET, *PNDIS_PACKET; /* size: 0x003c */

typedef struct _IO_REMOVE_LOCK_COMMON_BLOCK
{
  /* 0x0000 */ unsigned char Removed;
  /* 0x0001 */ unsigned char Reserved[3];
  /* 0x0004 */ long IoCount;
  /* 0x0008 */ struct _KEVENT RemoveEvent;
} IO_REMOVE_LOCK_COMMON_BLOCK, *PIO_REMOVE_LOCK_COMMON_BLOCK; /* size: 0x0018 */

typedef struct _NET_BUFFER
{
  union
  {
    struct
    {
      /* 0x0000 */ struct _NET_BUFFER* Next;
      /* 0x0004 */ struct _MDL* CurrentMdl;
      /* 0x0008 */ unsigned long CurrentMdlOffset;
      union
      {
        /* 0x000c */ unsigned long DataLength;
        struct
        {
          /* 0x000c */ unsigned long stDataLength;
          /* 0x0010 */ struct _MDL* MdlChain;
          /* 0x0014 */ unsigned long DataOffset;
        }; /* size: 0x000c */
      }; /* size: 0x000c */
    }; /* size: 0x0018 */
    /* 0x0000 */ union _SLIST_HEADER Link;
  }; /* size: 0x0018 */
  /* 0x0018 */ unsigned short ChecksumBias;
  /* 0x001a */ unsigned short Reserved;
  /* 0x001c */ void* NdisPoolHandle;
  /* 0x0020 */ void* NdisReserved[2];
  /* 0x0028 */ void* ProtocolReserved[6];
  /* 0x0040 */ void* MiniportReserved[4];
  /* 0x0050 */ union _LARGE_INTEGER DataPhysicalAddress;
} NET_BUFFER, *PNET_BUFFER; /* size: 0x0058 */

typedef struct _NET_BUFFER_LIST_CONTEXT
{
  /* 0x0000 */ struct _NET_BUFFER_LIST_CONTEXT* Next;
  /* 0x0004 */ unsigned short Size;
  /* 0x0006 */ unsigned short Offset;
  /* 0x0008 */ unsigned char* ContextData /* zero-length array */;
} NET_BUFFER_LIST_CONTEXT, *PNET_BUFFER_LIST_CONTEXT; /* size: 0x0008 */

typedef struct _KSFILTER_DESCRIPTOR
{
  /* 0x0000 */ const struct _KSFILTER_DISPATCH* Dispatch;
  /* 0x0004 */ const struct KSAUTOMATION_TABLE_* AutomationTable;
  /* 0x0008 */ unsigned long Version;
  /* 0x000c */ unsigned long Flags;
  /* 0x0010 */ const struct _GUID* ReferenceGuid;
  /* 0x0014 */ unsigned long PinDescriptorsCount;
  /* 0x0018 */ unsigned long PinDescriptorSize;
  /* 0x001c */ const struct _KSPIN_DESCRIPTOR_EX* PinDescriptors;
  /* 0x0020 */ unsigned long CategoriesCount;
  /* 0x0024 */ const struct _GUID* Categories;
  /* 0x0028 */ unsigned long NodeDescriptorsCount;
  /* 0x002c */ unsigned long NodeDescriptorSize;
  /* 0x0030 */ const struct _KSNODE_DESCRIPTOR* NodeDescriptors;
  /* 0x0034 */ unsigned long ConnectionsCount;
  /* 0x0038 */ const struct KSTOPOLOGY_CONNECTION* Connections;
  /* 0x003c */ const struct KSCOMPONENTID* ComponentId;
} KSFILTER_DESCRIPTOR, *PKSFILTER_DESCRIPTOR; /* size: 0x0040 */

typedef struct _NDIS_PNP_CAPABILITIES
{
  /* 0x0000 */ unsigned long Flags;
  /* 0x0004 */ struct _NDIS_PM_WAKE_UP_CAPABILITIES WakeUpCapabilities;
} NDIS_PNP_CAPABILITIES, *PNDIS_PNP_CAPABILITIES; /* size: 0x0010 */

struct sockaddr
{
  /* 0x0000 */ unsigned short sa_family;
  /* 0x0002 */ char sa_data[14];
}; /* size: 0x0010 */

typedef struct _NDIS_PORT
{
  /* 0x0000 */ struct _NDIS_PORT* Next;
  /* 0x0004 */ void* NdisReserved;
  /* 0x0008 */ void* MiniportReserved;
  /* 0x000c */ void* ProtocolReserved;
  /* 0x0010 */ struct _NDIS_PORT_CHARACTERISTICS PortCharacteristics;
} NDIS_PORT, *PNDIS_PORT; /* size: 0x0050 */

typedef struct _NDIS_CO_VC_PTR_BLOCK
{
  /* 0x0000 */ long References;
  /* 0x0004 */ unsigned long CallFlags;
  /* 0x0008 */ unsigned long* pVcFlags;
  /* 0x000c */ unsigned long Lock;
  /* 0x0010 */ void* ClientContext;
  /* 0x0014 */ struct _LIST_ENTRY ClientLink;
  /* 0x001c */ struct _LIST_ENTRY VcLink;
  /* 0x0024 */ struct _NDIS_CO_AF_BLOCK* AfBlock;
  /* 0x0028 */ struct _NDIS_CO_VC_BLOCK* VcBlock;
  /* 0x002c */ struct _NDIS_OPEN_BLOCK* ClientOpen;
  /* 0x0030 */ long OwnsVcBlock;
  /* 0x0034 */ void* CoDeleteVcHandler /* function */;
  /* 0x0038 */ void* DeleteVcContext;
  /* 0x003c */ void* ClModifyCallQoSCompleteHandler /* function */;
  /* 0x0040 */ void* ClIncomingCallQoSChangeHandler /* function */;
  /* 0x0044 */ void* ClCallConnectedHandler /* function */;
  /* 0x0048 */ struct _NDIS_OPEN_BLOCK* CallMgrOpen;
  /* 0x004c */ void* CallMgrContext;
  /* 0x0050 */ struct _LIST_ENTRY CallMgrLink;
  /* 0x0058 */ void* CmActivateVcCompleteHandler /* function */;
  /* 0x005c */ void* CmDeactivateVcCompleteHandler /* function */;
  /* 0x0060 */ void* CmModifyCallQoSHandler /* function */;
  /* 0x0064 */ struct _NDIS_MINIPORT_BLOCK* Miniport;
  /* 0x0068 */ void* MiniportContext;
  /* 0x006c */ void* WCoSendPacketsHandler /* function */;
  /* 0x0070 */ void* WCoDeleteVcHandler /* function */;
  /* 0x0074 */ void* WCoActivateVcHandler /* function */;
  /* 0x0078 */ void* WCoDeactivateVcHandler /* function */;
  /* 0x007c */ void* WCoSendNetBufferListsHandler /* function */;
  /* 0x0080 */ void* CoSendNetBufferListsHandler /* function */;
  /* 0x0084 */ void* CoSendNetBufferListsCompleteHandler /* function */;
  /* 0x0088 */ void* CoSendPacketHandler /* function */;
  /* 0x008c */ void* CoSendPacketCompleteHandler /* function */;
  /* 0x0090 */ void* CoIndicateReceivePacketHandler /* function */;
  /* 0x0094 */ void* CoIndicateReceiveNetBufferListsHandler /* function */;
  /* 0x0098 */ struct _UNICODE_STRING VcInstanceName;
  /* 0x00a0 */ union _LARGE_INTEGER VcIndex;
  /* 0x00a8 */ struct _LIST_ENTRY WmiLink;
  /* 0x00b0 */ unsigned char CallMiniportDeleteVc;
  /* 0x00b1 */ char __PADDING__[7];
} NDIS_CO_VC_PTR_BLOCK, *PNDIS_CO_VC_PTR_BLOCK; /* size: 0x00b8 */

typedef struct _IPV4_HEADER
{
  union
  {
    /* 0x0000 */ unsigned char VersionAndHeaderLength;
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned char HeaderLength : 4; /* bit position: 0 */
      /* 0x0000 */ unsigned char Version : 4; /* bit position: 4 */
    }; /* bitfield */
  }; /* size: 0x0001 */
  union
  {
    /* 0x0001 */ unsigned char TypeOfServiceAndEcnField;
    struct /* bitfield */
    {
      /* 0x0001 */ unsigned char EcnField : 2; /* bit position: 0 */
      /* 0x0001 */ unsigned char TypeOfService : 6; /* bit position: 2 */
    }; /* bitfield */
  }; /* size: 0x0001 */
  /* 0x0002 */ unsigned short TotalLength;
  /* 0x0004 */ unsigned short Identification;
  union
  {
    /* 0x0006 */ unsigned short FlagsAndOffset;
    struct /* bitfield */
    {
      /* 0x0006 */ unsigned short DontUse1 : 5; /* bit position: 0 */
      /* 0x0006 */ unsigned short MoreFragments : 1; /* bit position: 5 */
      /* 0x0006 */ unsigned short DontFragment : 1; /* bit position: 6 */
      /* 0x0006 */ unsigned short Reserved : 1; /* bit position: 7 */
      /* 0x0006 */ unsigned short DontUse2 : 8; /* bit position: 8 */
    }; /* bitfield */
  }; /* size: 0x0002 */
  /* 0x0008 */ unsigned char TimeToLive;
  /* 0x0009 */ unsigned char Protocol;
  /* 0x000a */ unsigned short HeaderChecksum;
  /* 0x000c */ struct in_addr SourceAddress;
  /* 0x0010 */ struct in_addr DestinationAddress;
} IPV4_HEADER, *PIPV4_HEADER; /* size: 0x0014 */

typedef struct _CO_SPECIFIC_PARAMETERS
{
  /* 0x0000 */ unsigned long ParamType;
  /* 0x0004 */ unsigned long Length;
  /* 0x0008 */ unsigned char Parameters[1];
  /* 0x0009 */ char __PADDING__[3];
} CO_SPECIFIC_PARAMETERS, *PCO_SPECIFIC_PARAMETERS; /* size: 0x000c */

typedef struct _CO_CALL_MANAGER_PARAMETERS
{
  /* 0x0000 */ struct _flowspec Transmit;
  /* 0x0020 */ struct _flowspec Receive;
  /* 0x0040 */ struct _CO_SPECIFIC_PARAMETERS CallMgrSpecific;
} CO_CALL_MANAGER_PARAMETERS, *PCO_CALL_MANAGER_PARAMETERS; /* size: 0x004c */

typedef struct _NPI_MODULEID
{
  /* 0x0000 */ unsigned short Length;
  /* 0x0002 */ char Padding_26[2];
  /* 0x0004 */ enum _NPI_MODULEID_TYPE Type;
  union
  {
    /* 0x0008 */ struct _GUID Guid;
    struct
    {
      /* 0x0008 */ struct _LUID IfLuid;
      /* 0x0010 */ long __PADDING__[2];
    }; /* size: 0x0010 */
  }; /* size: 0x0010 */
} NPI_MODULEID, *PNPI_MODULEID; /* size: 0x0018 */

typedef struct _NDIS_CO_VC_BLOCK
{
  /* 0x0000 */ unsigned long References;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ unsigned long Lock;
  /* 0x000c */ struct _NDIS_OPEN_BLOCK* ClientOpen;
  /* 0x0010 */ void* ClientContext;
  /* 0x0014 */ struct _NDIS_CO_VC_PTR_BLOCK* pProxyVcPtr;
  /* 0x0018 */ struct _NDIS_CO_VC_PTR_BLOCK* pClientVcPtr;
  /* 0x001c */ void* CoSendCompleteHandler /* function */;
  /* 0x0020 */ void* CoReceivePacketHandler /* function */;
  /* 0x0024 */ void* CoSendNetBufferListsCompleteHandler /* function */;
  /* 0x0028 */ void* CoReceiveNetBufferListsHandler /* function */;
  /* 0x002c */ struct _NDIS_OPEN_BLOCK* CallMgrOpen;
  /* 0x0030 */ void* CallMgrContext;
  /* 0x0034 */ void* CmActivateVcCompleteHandler /* function */;
  /* 0x0038 */ void* CmDeactivateVcCompleteHandler /* function */;
  /* 0x003c */ void* CmModifyCallQoSHandler /* function */;
  /* 0x0040 */ struct _NDIS_MINIPORT_BLOCK* Miniport;
  /* 0x0044 */ void* MiniportContext;
  /* 0x0048 */ unsigned __int64 VcId;
} NDIS_CO_VC_BLOCK, *PNDIS_CO_VC_BLOCK; /* size: 0x0050 */

typedef union _REFERENCE_OBJECT
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long Deleting : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned long ReferenceCount : 30; /* bit position: 1 */
      /* 0x0000 */ unsigned long Overflow : 1; /* bit position: 31 */
    }; /* bitfield */
    /* 0x0000 */ long Value;
  }; /* size: 0x0004 */
} REFERENCE_OBJECT, *PREFERENCE_OBJECT; /* size: 0x0004 */

struct KS_COMPRESSION
{
  /* 0x0000 */ unsigned long RatioNumerator;
  /* 0x0004 */ unsigned long RatioDenominator;
  /* 0x0008 */ unsigned long RatioConstantMargin;
}; /* size: 0x000c */

struct KSALLOCATOR_FRAMING_EX
{
  /* 0x0000 */ unsigned long CountItems;
  /* 0x0004 */ unsigned long PinFlags;
  /* 0x0008 */ struct KS_COMPRESSION OutputCompression;
  /* 0x0014 */ unsigned long PinWeight;
  /* 0x0018 */ struct KS_FRAMING_ITEM FramingItem[1];
}; /* size: 0x0070 */

typedef struct _NDIS_IPSEC_OFFLOAD_V1_NET_BUFFER_LIST_INFO
{
  union
  {
    struct
    {
      /* 0x0000 */ void* OffloadHandle;
    } /* size: 0x0004 */ Transmit;
    struct
    {
      struct /* bitfield */
      {
        /* 0x0000 */ unsigned short SaDeleteReq : 1; /* bit position: 0 */
        /* 0x0000 */ unsigned short CryptoDone : 1; /* bit position: 1 */
        /* 0x0000 */ unsigned short NextCryptoDone : 1; /* bit position: 2 */
        /* 0x0000 */ unsigned short Pad : 13; /* bit position: 3 */
      }; /* bitfield */
      /* 0x0002 */ unsigned short CryptoStatus;
    } /* size: 0x0004 */ Receive;
  }; /* size: 0x0004 */
} NDIS_IPSEC_OFFLOAD_V1_NET_BUFFER_LIST_INFO, *PNDIS_IPSEC_OFFLOAD_V1_NET_BUFFER_LIST_INFO; /* size: 0x0004 */

typedef struct _NDIS_IPSEC_PACKET_INFO
{
  union
  {
    struct
    {
      /* 0x0000 */ void* OffloadHandle;
      /* 0x0004 */ void* NextOffloadHandle;
    } /* size: 0x0008 */ Transmit;
    struct
    {
      struct /* bitfield */
      {
        /* 0x0000 */ unsigned long SA_DELETE_REQ : 1; /* bit position: 0 */
        /* 0x0000 */ unsigned long CRYPTO_DONE : 1; /* bit position: 1 */
        /* 0x0000 */ unsigned long NEXT_CRYPTO_DONE : 1; /* bit position: 2 */
      }; /* bitfield */
      /* 0x0004 */ unsigned long CryptoStatus;
    } /* size: 0x0008 */ Receive;
  }; /* size: 0x0008 */
} NDIS_IPSEC_PACKET_INFO, *PNDIS_IPSEC_PACKET_INFO; /* size: 0x0008 */

typedef struct _KSGATE
{
  /* 0x0000 */ long Count;
  /* 0x0004 */ struct _KSGATE* NextGate;
} KSGATE, *PKSGATE; /* size: 0x0008 */

struct KSEVENT_SET
{
  /* 0x0000 */ const struct _GUID* Set;
  /* 0x0004 */ unsigned long EventsCount;
  /* 0x0008 */ const struct KSEVENT_ITEM* EventItem;
}; /* size: 0x000c */

struct KSEVENTDATA
{
  /* 0x0000 */ unsigned long NotificationType;
  union
  {
    struct
    {
      /* 0x0004 */ void* Event;
      /* 0x0008 */ unsigned long Reserved[2];
    } /* size: 0x000c */ EventHandle;
    struct
    {
      /* 0x0004 */ void* Semaphore;
      /* 0x0008 */ unsigned long Reserved;
      /* 0x000c */ long Adjustment;
    } /* size: 0x000c */ SemaphoreHandle;
    struct
    {
      /* 0x0004 */ void* Event;
      /* 0x0008 */ long Increment;
      /* 0x000c */ unsigned long Reserved;
    } /* size: 0x000c */ EventObject;
    struct
    {
      /* 0x0004 */ void* Semaphore;
      /* 0x0008 */ long Increment;
      /* 0x000c */ long Adjustment;
    } /* size: 0x000c */ SemaphoreObject;
    struct
    {
      /* 0x0004 */ struct _KDPC* Dpc;
      /* 0x0008 */ unsigned long ReferenceCount;
      /* 0x000c */ unsigned long Reserved;
    } /* size: 0x000c */ Dpc;
    struct
    {
      /* 0x0004 */ struct _WORK_QUEUE_ITEM* WorkQueueItem;
      /* 0x0008 */ enum _WORK_QUEUE_TYPE WorkQueueType;
      /* 0x000c */ unsigned long Reserved;
    } /* size: 0x000c */ WorkItem;
    struct
    {
      /* 0x0004 */ struct _WORK_QUEUE_ITEM* WorkQueueItem;
      /* 0x0008 */ void* KsWorkerObject;
      /* 0x000c */ unsigned long Reserved;
    } /* size: 0x000c */ KsWorkItem;
    struct
    {
      /* 0x0004 */ struct _KSFILTER* Filter;
      /* 0x0008 */ unsigned long Reserved[2];
    } /* size: 0x000c */ KsFilterProcessing;
    struct
    {
      /* 0x0004 */ struct _KSPIN* Pin;
      /* 0x0008 */ unsigned long Reserved[2];
    } /* size: 0x000c */ KsPinProcessing;
    struct
    {
      /* 0x0004 */ void* Unused;
      /* 0x0008 */ long Alignment[2];
    } /* size: 0x000c */ Alignment;
  }; /* size: 0x000c */
}; /* size: 0x0010 */

typedef struct _NDIS_BIND_PATHS
{
  /* 0x0000 */ unsigned int Number;
  /* 0x0004 */ struct _UNICODE_STRING Paths[1];
} NDIS_BIND_PATHS, *PNDIS_BIND_PATHS; /* size: 0x000c */

typedef struct _KSPROCESSPIN_INDEXENTRY
{
  /* 0x0000 */ struct _KSPROCESSPIN** Pins;
  /* 0x0004 */ unsigned long Count;
} KSPROCESSPIN_INDEXENTRY, *PKSPROCESSPIN_INDEXENTRY; /* size: 0x0008 */

typedef struct _KSPROCESSPIN
{
  /* 0x0000 */ struct _KSPIN* Pin;
  /* 0x0004 */ struct _KSSTREAM_POINTER* StreamPointer;
  /* 0x0008 */ struct _KSPROCESSPIN* InPlaceCounterpart;
  /* 0x000c */ struct _KSPROCESSPIN* DelegateBranch;
  /* 0x0010 */ struct _KSPROCESSPIN* CopySource;
  /* 0x0014 */ void* Data;
  /* 0x0018 */ unsigned long BytesAvailable;
  /* 0x001c */ unsigned long BytesUsed;
  /* 0x0020 */ unsigned long Flags;
  /* 0x0024 */ unsigned char Terminate;
  /* 0x0025 */ char __PADDING__[3];
} KSPROCESSPIN, *PKSPROCESSPIN; /* size: 0x0028 */

struct KSIDENTIFIER
{
  union
  {
    struct
    {
      /* 0x0000 */ struct _GUID Set;
      /* 0x0010 */ unsigned long Id;
      /* 0x0014 */ unsigned long Flags;
    }; /* size: 0x0018 */
    struct
    {
      /* 0x0000 */ __int64 Alignment;
      /* 0x0008 */ long __PADDING__[4];
    }; /* size: 0x0018 */
  }; /* size: 0x0018 */
}; /* size: 0x0018 */

struct KSPRIORITY
{
  /* 0x0000 */ unsigned long PriorityClass;
  /* 0x0004 */ unsigned long PrioritySubClass;
}; /* size: 0x0008 */

typedef struct _KSPIN
{
  /* 0x0000 */ const struct _KSPIN_DESCRIPTOR_EX* Descriptor;
  /* 0x0004 */ void* Bag;
  /* 0x0008 */ void* Context;
  /* 0x000c */ unsigned long Id;
  /* 0x0010 */ enum KSPIN_COMMUNICATION Communication;
  /* 0x0014 */ unsigned char ConnectionIsExternal;
  /* 0x0015 */ char Padding_27[3];
  /* 0x0018 */ struct KSIDENTIFIER ConnectionInterface;
  /* 0x0030 */ struct KSIDENTIFIER ConnectionMedium;
  /* 0x0048 */ struct KSPRIORITY ConnectionPriority;
  /* 0x0050 */ union KSDATAFORMAT* ConnectionFormat;
  /* 0x0054 */ struct KSMULTIPLE_ITEM* AttributeList;
  /* 0x0058 */ unsigned long StreamHeaderSize;
  /* 0x005c */ enum KSPIN_DATAFLOW DataFlow;
  /* 0x0060 */ enum KSSTATE DeviceState;
  /* 0x0064 */ enum KSRESET ResetState;
  /* 0x0068 */ enum KSSTATE ClientState;
  /* 0x006c */ long __PADDING__[1];
} KSPIN, *PKSPIN; /* size: 0x0070 */

typedef struct _KSPIN_DESCRIPTOR_EX
{
  /* 0x0000 */ const struct _KSPIN_DISPATCH* Dispatch;
  /* 0x0004 */ const struct KSAUTOMATION_TABLE_* AutomationTable;
  /* 0x0008 */ struct KSPIN_DESCRIPTOR PinDescriptor;
  /* 0x0038 */ unsigned long Flags;
  /* 0x003c */ unsigned long InstancesPossible;
  /* 0x0040 */ unsigned long InstancesNecessary;
  /* 0x0044 */ const struct KSALLOCATOR_FRAMING_EX* AllocatorFraming;
  /* 0x0048 */ void* IntersectHandler /* function */;
  /* 0x004c */ long __PADDING__[1];
} KSPIN_DESCRIPTOR_EX, *PKSPIN_DESCRIPTOR_EX; /* size: 0x0050 */

typedef struct _KSPIN_DISPATCH
{
  /* 0x0000 */ void* Create /* function */;
  /* 0x0004 */ void* Close /* function */;
  /* 0x0008 */ void* Process /* function */;
  /* 0x000c */ void* Reset /* function */;
  /* 0x0010 */ void* SetDataFormat /* function */;
  /* 0x0014 */ void* SetDeviceState /* function */;
  /* 0x0018 */ void* Connect /* function */;
  /* 0x001c */ void* Disconnect /* function */;
  /* 0x0020 */ const struct _KSCLOCK_DISPATCH* Clock;
  /* 0x0024 */ const struct _KSALLOCATOR_DISPATCH* Allocator;
} KSPIN_DISPATCH, *PKSPIN_DISPATCH; /* size: 0x0028 */

typedef struct _NDIS_FRAME_TYPE_AND_OPEN
{
  /* 0x0000 */ unsigned short Type;
  /* 0x0002 */ char Padding_28[2];
  /* 0x0004 */ struct _NDIS_OPEN_BLOCK* Open;
} NDIS_FRAME_TYPE_AND_OPEN, *PNDIS_FRAME_TYPE_AND_OPEN; /* size: 0x0008 */

struct KSMULTIPLE_ITEM
{
  /* 0x0000 */ unsigned long Size;
  /* 0x0004 */ unsigned long Count;
}; /* size: 0x0008 */

struct KSATTRIBUTE_LIST
{
  /* 0x0000 */ unsigned long Count;
  /* 0x0004 */ struct KSATTRIBUTE** Attributes;
}; /* size: 0x0008 */

struct KSATTRIBUTE
{
  /* 0x0000 */ unsigned long Size;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ struct _GUID Attribute;
}; /* size: 0x0018 */

typedef struct _KSCLOCK_DISPATCH
{
  /* 0x0000 */ void* SetTimer /* function */;
  /* 0x0004 */ void* CancelTimer /* function */;
  /* 0x0008 */ void* CorrelatedTime /* function */;
  /* 0x000c */ void* Resolution /* function */;
} KSCLOCK_DISPATCH, *PKSCLOCK_DISPATCH; /* size: 0x0010 */

typedef struct _NDIS_GUID
{
  /* 0x0000 */ struct _GUID Guid;
  union
  {
    /* 0x0010 */ unsigned long Oid;
    /* 0x0010 */ int Status;
  }; /* size: 0x0004 */
  /* 0x0014 */ unsigned long Size;
  /* 0x0018 */ unsigned long Flags;
} NDIS_GUID, *PNDIS_GUID; /* size: 0x001c */

typedef struct _NDIS_PORT_AUTHENTICATION_PARAMETERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ enum _NDIS_PORT_CONTROL_STATE SendControlState;
  /* 0x0008 */ enum _NDIS_PORT_CONTROL_STATE RcvControlState;
  /* 0x000c */ enum _NDIS_PORT_AUTHORIZATION_STATE SendAuthorizationState;
  /* 0x0010 */ enum _NDIS_PORT_AUTHORIZATION_STATE RcvAuthorizationState;
} NDIS_PORT_AUTHENTICATION_PARAMETERS, *PNDIS_PORT_AUTHENTICATION_PARAMETERS; /* size: 0x0014 */

typedef struct _KSALLOCATOR_DISPATCH
{
  /* 0x0000 */ void* InitializeAllocator /* function */;
  /* 0x0004 */ void* DeleteAllocator /* function */;
  /* 0x0008 */ void* Allocate /* function */;
  /* 0x000c */ void* Free /* function */;
} KSALLOCATOR_DISPATCH, *PKSALLOCATOR_DISPATCH; /* size: 0x0010 */

typedef struct _NDIS_RECEIVE_SCALE_PARAMETERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned short Flags;
  /* 0x0006 */ unsigned short BaseCpuNumber;
  /* 0x0008 */ unsigned long HashInformation;
  /* 0x000c */ unsigned short IndirectionTableSize;
  /* 0x000e */ char Padding_29[2];
  /* 0x0010 */ unsigned long IndirectionTableOffset;
  /* 0x0014 */ unsigned short HashSecretKeySize;
  /* 0x0016 */ char Padding_30[2];
  /* 0x0018 */ unsigned long HashSecretKeyOffset;
} NDIS_RECEIVE_SCALE_PARAMETERS, *PNDIS_RECEIVE_SCALE_PARAMETERS; /* size: 0x001c */

struct KSAUTOMATION_TABLE_
{
  /* 0x0000 */ unsigned long PropertySetsCount;
  /* 0x0004 */ unsigned long PropertyItemSize;
  /* 0x0008 */ const struct KSPROPERTY_SET* PropertySets;
  /* 0x000c */ unsigned long MethodSetsCount;
  /* 0x0010 */ unsigned long MethodItemSize;
  /* 0x0014 */ const struct KSMETHOD_SET* MethodSets;
  /* 0x0018 */ unsigned long EventSetsCount;
  /* 0x001c */ unsigned long EventItemSize;
  /* 0x0020 */ const struct KSEVENT_SET* EventSets;
  /* 0x0024 */ void* Alignment;
}; /* size: 0x0028 */

struct KSPROPERTY_SET
{
  /* 0x0000 */ const struct _GUID* Set;
  /* 0x0004 */ unsigned long PropertiesCount;
  /* 0x0008 */ const struct KSPROPERTY_ITEM* PropertyItem;
  /* 0x000c */ unsigned long FastIoCount;
  /* 0x0010 */ const struct KSFASTPROPERTY_ITEM* FastIoTable;
}; /* size: 0x0014 */

struct KSPROPERTY_ITEM
{
  /* 0x0000 */ unsigned long PropertyId;
  union
  {
    /* 0x0004 */ void* GetPropertyHandler /* function */;
    /* 0x0004 */ unsigned char GetSupported;
  }; /* size: 0x0004 */
  /* 0x0008 */ unsigned long MinProperty;
  /* 0x000c */ unsigned long MinData;
  union
  {
    /* 0x0010 */ void* SetPropertyHandler /* function */;
    /* 0x0010 */ unsigned char SetSupported;
  }; /* size: 0x0004 */
  /* 0x0014 */ const struct KSPROPERTY_VALUES* Values;
  /* 0x0018 */ unsigned long RelationsCount;
  /* 0x001c */ const struct KSIDENTIFIER* Relations;
  /* 0x0020 */ void* SupportHandler /* function */;
  /* 0x0024 */ unsigned long SerializedSize;
}; /* size: 0x0028 */

typedef struct _SCATTER_GATHER_ELEMENT
{
  /* 0x0000 */ union _LARGE_INTEGER Address;
  /* 0x0008 */ unsigned long Length;
  /* 0x000c */ unsigned long Reserved;
} SCATTER_GATHER_ELEMENT, *PSCATTER_GATHER_ELEMENT; /* size: 0x0010 */

struct KSPROPERTY_VALUES
{
  /* 0x0000 */ struct KSIDENTIFIER PropTypeSet;
  /* 0x0018 */ unsigned long MembersListCount;
  /* 0x001c */ const struct KSPROPERTY_MEMBERSLIST* MembersList;
}; /* size: 0x0020 */

typedef struct _QUERY
{
  /* 0x0000 */ unsigned long Oid;
  /* 0x0004 */ void* InformationBuffer;
  /* 0x0008 */ unsigned int InformationBufferLength;
  /* 0x000c */ unsigned int BytesWritten;
  /* 0x0010 */ unsigned int BytesNeeded;
} QUERY, *PQUERY; /* size: 0x0014 */

typedef struct _SET
{
  /* 0x0000 */ unsigned long Oid;
  /* 0x0004 */ void* InformationBuffer;
  /* 0x0008 */ unsigned int InformationBufferLength;
  /* 0x000c */ unsigned int BytesRead;
  /* 0x0010 */ unsigned int BytesNeeded;
} SET, *PSET; /* size: 0x0014 */

typedef struct _METHOD
{
  /* 0x0000 */ unsigned long Oid;
  /* 0x0004 */ void* InformationBuffer;
  /* 0x0008 */ unsigned long InputBufferLength;
  /* 0x000c */ unsigned long OutputBufferLength;
  /* 0x0010 */ unsigned long MethodId;
  /* 0x0014 */ unsigned int BytesWritten;
  /* 0x0018 */ unsigned int BytesRead;
  /* 0x001c */ unsigned int BytesNeeded;
} METHOD, *PMETHOD; /* size: 0x0020 */

typedef union _REQUEST_DATA
{
  union
  {
    /* 0x0000 */ struct _QUERY QUERY_INFORMATION;
    /* 0x0000 */ struct _SET SET_INFORMATION;
    /* 0x0000 */ struct _METHOD METHOD_INFORMATION;
  }; /* size: 0x0020 */
} REQUEST_DATA, *PREQUEST_DATA; /* size: 0x0020 */

typedef struct _NDIS_OID_REQUEST
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ enum _NDIS_REQUEST_TYPE RequestType;
  /* 0x0008 */ unsigned long PortNumber;
  /* 0x000c */ unsigned int Timeout;
  /* 0x0010 */ void* RequestId;
  /* 0x0014 */ void* RequestHandle;
  /* 0x0018 */ union _REQUEST_DATA DATA;
  /* 0x0038 */ unsigned char NdisReserved[64];
  /* 0x0078 */ unsigned char MiniportReserved[8];
  /* 0x0080 */ unsigned char SourceReserved[8];
  /* 0x0088 */ unsigned char SupportedRevision;
  /* 0x0089 */ unsigned char Reserved1;
  /* 0x008a */ unsigned short Reserved2;
} NDIS_OID_REQUEST, *PNDIS_OID_REQUEST; /* size: 0x008c */

struct KSFASTPROPERTY_ITEM
{
  /* 0x0000 */ unsigned long PropertyId;
  union
  {
    /* 0x0004 */ void* GetPropertyHandler /* function */;
    /* 0x0004 */ unsigned char GetSupported;
  }; /* size: 0x0004 */
  union
  {
    /* 0x0008 */ void* SetPropertyHandler /* function */;
    /* 0x0008 */ unsigned char SetSupported;
  }; /* size: 0x0004 */
  /* 0x000c */ unsigned long Reserved;
}; /* size: 0x0010 */

struct KSFASTMETHOD_ITEM
{
  /* 0x0000 */ unsigned long MethodId;
  union
  {
    /* 0x0004 */ void* MethodHandler /* function */;
    struct
    {
      /* 0x0004 */ unsigned char MethodSupported;
      /* 0x0005 */ char __PADDING__[3];
    }; /* size: 0x0004 */
  }; /* size: 0x0004 */
}; /* size: 0x0008 */

struct KSP_PIN
{
  /* 0x0000 */ struct KSIDENTIFIER Property;
  /* 0x0018 */ unsigned long PinId;
  /* 0x001c */ unsigned long Reserved;
}; /* size: 0x0020 */

typedef struct _NDIS_BIND_PARAMETERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ struct _UNICODE_STRING* ProtocolSection;
  /* 0x0008 */ struct _UNICODE_STRING* AdapterName;
  /* 0x000c */ struct _DEVICE_OBJECT* PhysicalDeviceObject;
  /* 0x0010 */ enum _NDIS_MEDIUM MediaType;
  /* 0x0014 */ unsigned long MtuSize;
  /* 0x0018 */ unsigned __int64 MaxXmitLinkSpeed;
  /* 0x0020 */ unsigned __int64 XmitLinkSpeed;
  /* 0x0028 */ unsigned __int64 MaxRcvLinkSpeed;
  /* 0x0030 */ unsigned __int64 RcvLinkSpeed;
  /* 0x0038 */ enum _NET_IF_MEDIA_CONNECT_STATE MediaConnectState;
  /* 0x003c */ enum _NET_IF_MEDIA_DUPLEX_STATE MediaDuplexState;
  /* 0x0040 */ unsigned long LookaheadSize;
  /* 0x0044 */ struct _NDIS_PNP_CAPABILITIES* PowerManagementCapabilities;
  /* 0x0048 */ unsigned long SupportedPacketFilters;
  /* 0x004c */ unsigned long MaxMulticastListSize;
  /* 0x0050 */ unsigned short MacAddressLength;
  /* 0x0052 */ unsigned char CurrentMacAddress[32];
  /* 0x0072 */ char Padding_31[2];
  /* 0x0074 */ enum _NDIS_PHYSICAL_MEDIUM PhysicalMediumType;
  /* 0x0078 */ struct _NDIS_RECEIVE_SCALE_CAPABILITIES* RcvScaleCapabilities;
  /* 0x007c */ long Padding_32;
  /* 0x0080 */ union _NET_LUID_LH BoundIfNetluid;
  /* 0x0088 */ unsigned long BoundIfIndex;
  /* 0x008c */ long Padding_33;
  /* 0x0090 */ union _NET_LUID_LH LowestIfNetluid;
  /* 0x0098 */ unsigned long LowestIfIndex;
  /* 0x009c */ enum _NET_IF_ACCESS_TYPE AccessType;
  /* 0x00a0 */ enum _NET_IF_DIRECTION_TYPE DirectionType;
  /* 0x00a4 */ enum _NET_IF_CONNECTION_TYPE ConnectionType;
  /* 0x00a8 */ unsigned short IfType;
  /* 0x00aa */ unsigned char IfConnectorPresent;
  /* 0x00ab */ char Padding_34;
  /* 0x00ac */ struct _NDIS_PORT* ActivePorts;
  /* 0x00b0 */ unsigned long DataBackFillSize;
  /* 0x00b4 */ unsigned long ContextBackFillSize;
  /* 0x00b8 */ unsigned long MacOptions;
  /* 0x00bc */ unsigned int CompartmentId;
  /* 0x00c0 */ struct _NDIS_OFFLOAD* DefaultOffloadConfiguration;
  /* 0x00c4 */ struct _NDIS_TCP_CONNECTION_OFFLOAD* TcpConnectionOffloadCapabilities;
  /* 0x00c8 */ struct _UNICODE_STRING* BoundAdapterName;
  /* 0x00cc */ struct _NDIS_HD_SPLIT_CURRENT_CONFIG* HDSplitCurrentConfig;
} NDIS_BIND_PARAMETERS, *PNDIS_BIND_PARAMETERS; /* size: 0x00d0 */

struct KSSTREAM_HEADER
{
  /* 0x0000 */ unsigned long Size;
  /* 0x0004 */ unsigned long TypeSpecificFlags;
  /* 0x0008 */ struct KSTIME PresentationTime;
  /* 0x0018 */ __int64 Duration;
  /* 0x0020 */ unsigned long FrameExtent;
  /* 0x0024 */ unsigned long DataUsed;
  /* 0x0028 */ void* Data;
  /* 0x002c */ unsigned long OptionsFlags;
}; /* size: 0x0030 */

typedef struct _NDIS_TIMER_ENTRY
{
  /* 0x0000 */ struct _NDIS_TIMER_ENTRY* NextTimer;
  /* 0x0004 */ struct _LIST_ENTRY GlobalLink;
  /* 0x000c */ void* Handle;
  /* 0x0010 */ struct _KTIMER Timer;
  /* 0x0038 */ struct _KDPC Dpc;
  /* 0x0058 */ unsigned long AllocationTag;
  /* 0x005c */ void* TimerFunction /* function */;
  /* 0x0060 */ void* DefaultFunctionContext;
  /* 0x0064 */ void* FunctionContext;
  /* 0x0068 */ struct _NDIS_MINIPORT_BLOCK* Miniport;
  /* 0x006c */ unsigned char Periodic;
  /* 0x006d */ char __PADDING__[3];
} NDIS_TIMER_ENTRY, *PNDIS_TIMER_ENTRY; /* size: 0x0070 */

typedef struct _KSFILTERFACTORY
{
  /* 0x0000 */ const struct _KSFILTER_DESCRIPTOR* FilterDescriptor;
  /* 0x0004 */ void* Bag;
  /* 0x0008 */ void* Context;
} KSFILTERFACTORY, *PKSFILTERFACTORY; /* size: 0x000c */

typedef struct _KSDEVICE_DESCRIPTOR
{
  /* 0x0000 */ const struct _KSDEVICE_DISPATCH* Dispatch;
  /* 0x0004 */ unsigned long FilterDescriptorsCount;
  /* 0x0008 */ const struct _KSFILTER_DESCRIPTOR* const* FilterDescriptors;
  /* 0x000c */ unsigned long Version;
  /* 0x0010 */ unsigned long Flags;
  /* 0x0014 */ void* Alignment;
} KSDEVICE_DESCRIPTOR, *PKSDEVICE_DESCRIPTOR; /* size: 0x0018 */

typedef struct _DMA_ADAPTER
{
  /* 0x0000 */ unsigned short Version;
  /* 0x0002 */ unsigned short Size;
  /* 0x0004 */ struct _DMA_OPERATIONS* DmaOperations;
} DMA_ADAPTER, *PDMA_ADAPTER; /* size: 0x0008 */

typedef struct _KSDEVICE
{
  /* 0x0000 */ const struct _KSDEVICE_DESCRIPTOR* Descriptor;
  /* 0x0004 */ void* Bag;
  /* 0x0008 */ void* Context;
  /* 0x000c */ struct _DEVICE_OBJECT* FunctionalDeviceObject;
  /* 0x0010 */ struct _DEVICE_OBJECT* PhysicalDeviceObject;
  /* 0x0014 */ struct _DEVICE_OBJECT* NextDeviceObject;
  /* 0x0018 */ unsigned char Started;
  /* 0x0019 */ char Padding_35[3];
  /* 0x001c */ enum _SYSTEM_POWER_STATE SystemPowerState;
  /* 0x0020 */ enum _DEVICE_POWER_STATE DevicePowerState;
} KSDEVICE, *PKSDEVICE; /* size: 0x0024 */

typedef struct _NDIS_SG_DMA_BLOCK
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ struct _NDIS_MINIPORT_BLOCK* Miniport;
  /* 0x0008 */ void* MiniportAdapterContext;
  /* 0x000c */ struct _DMA_ADAPTER* DmaAdapterObject;
  /* 0x0010 */ void* ProcessSGListHandler /* function */;
  /* 0x0014 */ void* SharedMemAllocateCompleteHandler /* function */;
  /* 0x0018 */ unsigned long Flags;
  /* 0x001c */ unsigned long MaximumPhysicalMapping;
  /* 0x0020 */ unsigned long ScatterGatherListSize;
  /* 0x0024 */ struct _NPAGED_LOOKASIDE_LIST* SGListLookasideList;
  /* 0x0028 */ long DmaAdapterRefCount;
  /* 0x002c */ struct _KEVENT* DmaResourcesReleasedEvent;
  /* 0x0030 */ void* SharedMemoryPage[2];
  /* 0x0038 */ unsigned long SharedMemoryLeft[2];
  /* 0x0040 */ union _LARGE_INTEGER SharedMemoryAddress[2];
  /* 0x0050 */ struct _DMA_ADAPTER* SavedDmaAdapterObject;
  /* 0x0054 */ struct _MAP_REGISTER_ENTRY* MapRegisters;
  /* 0x0058 */ struct _KEVENT* AllocationEvent;
  /* 0x005c */ unsigned short CurrentMapRegister;
  /* 0x005e */ unsigned short BaseMapRegistersNeeded;
  /* 0x0060 */ unsigned short SGMapRegistersNeeded;
  /* 0x0062 */ char __PADDING__[6];
} NDIS_SG_DMA_BLOCK, *PNDIS_SG_DMA_BLOCK; /* size: 0x0068 */

typedef struct _PERFINFO_GROUPMASK
{
  /* 0x0000 */ unsigned long Masks[8];
} PERFINFO_GROUPMASK, *PPERFINFO_GROUPMASK; /* size: 0x0020 */

typedef struct _NDIS_RECEIVE_SCALE_CAPABILITIES
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long CapabilitiesFlags;
  /* 0x0008 */ unsigned long NumberOfInterruptMessages;
  /* 0x000c */ unsigned long NumberOfReceiveQueues;
} NDIS_RECEIVE_SCALE_CAPABILITIES, *PNDIS_RECEIVE_SCALE_CAPABILITIES; /* size: 0x0010 */

typedef struct _KBUGCHECK_CALLBACK_RECORD
{
  /* 0x0000 */ struct _LIST_ENTRY Entry;
  /* 0x0008 */ void* CallbackRoutine /* function */;
  /* 0x000c */ void* Buffer;
  /* 0x0010 */ unsigned long Length;
  /* 0x0014 */ unsigned char* Component;
  /* 0x0018 */ unsigned long Checksum;
  /* 0x001c */ unsigned char State;
  /* 0x001d */ char __PADDING__[3];
} KBUGCHECK_CALLBACK_RECORD, *PKBUGCHECK_CALLBACK_RECORD; /* size: 0x0020 */

typedef struct _ULONG_REFERENCE
{
  /* 0x0000 */ unsigned long SpinLock;
  /* 0x0004 */ unsigned long ReferenceCount;
  /* 0x0008 */ unsigned char Closing;
  /* 0x0009 */ char __PADDING__[3];
} ULONG_REFERENCE, *PULONG_REFERENCE; /* size: 0x000c */

typedef struct _NDIS_MINIPORT_HANDLERS
{
  /* 0x0000 */ void* RequestContext;
  /* 0x0004 */ void* CancelSendContext;
  /* 0x0008 */ void* IndicateNetBufferListsContext;
  /* 0x000c */ void* SaveIndicateNetBufferListsContext;
  /* 0x0010 */ void* ReturnNetBufferListsContext;
  /* 0x0014 */ void* SendNetBufferListsContext;
  /* 0x0018 */ void* SendNetBufferListsObject;
  /* 0x001c */ void* SendNetBufferListsCompleteContext;
  /* 0x0020 */ void* RequestHandle;
  /* 0x0024 */ void* StatusHandle;
  /* 0x0028 */ void* DevicePnPEventNotifyHandle;
  /* 0x002c */ void* NetPnPEventHandle;
  union
  {
    /* 0x0030 */ void* CancelSendHandler /* function */;
    /* 0x0030 */ void* CancelSendPacketsHandler /* function */;
  }; /* size: 0x0004 */
  /* 0x0034 */ void* SendNetBufferListsCompleteHandler /* function */;
  /* 0x0038 */ void* IndicateNetBufferListsHandler /* function */;
  /* 0x003c */ void* SaveIndicateNetBufferListsHandler /* function */;
  /* 0x0040 */ void* ReturnNetBufferListsHandler /* function */;
  /* 0x0044 */ void* SendNetBufferListsHandler /* function */;
  /* 0x0048 */ void* DirectRequestHandle;
} NDIS_MINIPORT_HANDLERS, *PNDIS_MINIPORT_HANDLERS; /* size: 0x004c */

typedef struct _NDIS_RESTART_GENERAL_ATTRIBUTES
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long MtuSize;
  /* 0x0008 */ unsigned __int64 MaxXmitLinkSpeed;
  /* 0x0010 */ unsigned __int64 MaxRcvLinkSpeed;
  /* 0x0018 */ unsigned long LookaheadSize;
  /* 0x001c */ unsigned long MacOptions;
  /* 0x0020 */ unsigned long SupportedPacketFilters;
  /* 0x0024 */ unsigned long MaxMulticastListSize;
  /* 0x0028 */ struct _NDIS_RECEIVE_SCALE_CAPABILITIES* RecvScaleCapabilities;
  /* 0x002c */ enum _NET_IF_ACCESS_TYPE AccessType;
  /* 0x0030 */ unsigned long Flags;
  /* 0x0034 */ enum _NET_IF_CONNECTION_TYPE ConnectionType;
  /* 0x0038 */ unsigned long SupportedStatistics;
  /* 0x003c */ unsigned long DataBackFillSize;
  /* 0x0040 */ unsigned long ContextBackFillSize;
  /* 0x0044 */ unsigned long* SupportedOidList;
  /* 0x0048 */ unsigned long SupportedOidListLength;
  /* 0x004c */ long __PADDING__[1];
} NDIS_RESTART_GENERAL_ATTRIBUTES, *PNDIS_RESTART_GENERAL_ATTRIBUTES; /* size: 0x0050 */

typedef struct _NDIS_M_PERIODIC_RECEIVES
{
  /* 0x0000 */ struct _NDIS_MINIPORT_BLOCK* NextMiniportBlock;
  /* 0x0004 */ enum _NDIS_M_PERIODIC_RECEIVE_STATE State;
  /* 0x0008 */ unsigned long SpinLock;
  /* 0x000c */ void* LockThread;
  /* 0x0010 */ unsigned long LockDbg;
  /* 0x0014 */ long NumMQueuedNbls;
  /* 0x0018 */ long NumNblsDequeued;
  /* 0x001c */ struct _NET_BUFFER_LIST* QueuedHead;
  /* 0x0020 */ struct _NET_BUFFER_LIST* QueuedTail;
  /* 0x0024 */ struct _NET_BUFFER_LIST* IndicateHead;
  /* 0x0028 */ struct _NET_BUFFER_LIST* IndicateTail;
  /* 0x002c */ unsigned long BoundToIP;
  /* 0x0030 */ unsigned char Paused;
  /* 0x0031 */ char Padding_36[3];
  /* 0x0034 */ long NblsAllocated;
  /* 0x0038 */ unsigned long TrackingQueued;
  /* 0x003c */ unsigned long TrackingDequeued;
  /* 0x0040 */ unsigned long TrackingResources;
  /* 0x0044 */ unsigned long TrackingPending;
  /* 0x0048 */ unsigned long TrackingIndicated;
  /* 0x004c */ unsigned long TrackingEmptied;
} NDIS_M_PERIODIC_RECEIVES, *PNDIS_M_PERIODIC_RECEIVES; /* size: 0x0050 */

typedef struct _NDIS_PCI_DEVICE_CUSTOM_PROPERTIES
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned int DeviceType;
  /* 0x0008 */ unsigned int CurrentSpeedAndMode;
  /* 0x000c */ unsigned int CurrentPayloadSize;
  /* 0x0010 */ unsigned int MaxPayloadSize;
  /* 0x0014 */ unsigned int MaxReadRequestSize;
  /* 0x0018 */ unsigned int CurrentLinkSpeed;
  /* 0x001c */ unsigned int CurrentLinkWidth;
  /* 0x0020 */ unsigned int MaxLinkSpeed;
  /* 0x0024 */ unsigned int MaxLinkWidth;
} NDIS_PCI_DEVICE_CUSTOM_PROPERTIES, *PNDIS_PCI_DEVICE_CUSTOM_PROPERTIES; /* size: 0x0028 */

typedef struct _IO_REMOVE_LOCK
{
  /* 0x0000 */ struct _IO_REMOVE_LOCK_COMMON_BLOCK Common;
} IO_REMOVE_LOCK, *PIO_REMOVE_LOCK; /* size: 0x0018 */

typedef struct _NDIS_MINIPORT_BLOCK
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ struct _NDIS_MINIPORT_BLOCK* NextMiniport;
  /* 0x0008 */ struct _NDIS_MINIPORT_BLOCK* BaseMiniport;
  /* 0x000c */ void* MiniportAdapterContext;
  union
  {
    /* 0x0010 */ struct _UNICODE_STRING Reserved4;
    struct
    {
      /* 0x0010 */ unsigned char MajorNdisVersion;
      /* 0x0011 */ unsigned char MinorNdisVersion;
      /* 0x0012 */ char Padding_37[2];
      /* 0x0014 */ struct _IRP* PendingQueryPowerIrp;
    }; /* size: 0x0006 */
  }; /* size: 0x0008 */
  /* 0x0018 */ struct _KEVENT* PnPEventLockEvent;
  /* 0x001c */ void* OpenQueue;
  /* 0x0020 */ struct _REFERENCE ShortRef;
  /* 0x0028 */ struct _NDIS_OBJECT_HEADER* MediaSpecificAttributes;
  /* 0x002c */ unsigned char LinkStateIndicationFlags;
  /* 0x002d */ unsigned char LockAcquired;
  /* 0x002e */ unsigned char PmodeOpens;
  /* 0x002f */ unsigned char AssignedProcessor;
  /* 0x0030 */ unsigned long Lock;
  /* 0x0034 */ struct _NDIS_REQUEST* MediaRequest;
  union
  {
    /* 0x0038 */ struct _NDIS_MINIPORT_INTERRUPT* Interrupt;
    /* 0x0038 */ struct _NDIS_MINIPORT_INTERRUPT_CHARACTERISTICS* InterruptEx;
  }; /* size: 0x0004 */
  /* 0x003c */ unsigned long Flags;
  /* 0x0040 */ unsigned long PnPFlags;
  /* 0x0044 */ struct _LIST_ENTRY PacketList;
  /* 0x004c */ struct _NDIS_PACKET* FirstPendingPacket;
  /* 0x0050 */ struct _NDIS_PACKET* ReturnPacketsQueue;
  /* 0x0054 */ unsigned long RequestBuffer;
  /* 0x0058 */ void* SetMCastBuffer;
  /* 0x005c */ struct _NDIS_MINIPORT_BLOCK* PrimaryMiniport;
  /* 0x0060 */ void* NextCancelSendNetBufferListsHandler /* function */;
  /* 0x0064 */ void* OidContext;
  /* 0x0068 */ unsigned long SupportedOidListLength;
  /* 0x006c */ struct _CM_RESOURCE_LIST* Resources;
  /* 0x0070 */ struct _NDIS_TIMER WakeUpDpcTimer;
  union
  {
    /* 0x00b8 */ struct _UNICODE_STRING Reserved20;
    struct
    {
      /* 0x00b8 */ enum _NET_IF_MEDIA_CONNECT_STATE MiniportMediaConnectState;
      /* 0x00bc */ enum _NET_IF_MEDIA_DUPLEX_STATE MiniportMediaDuplexState;
    }; /* size: 0x0008 */
  }; /* size: 0x0008 */
  /* 0x00c0 */ struct _UNICODE_STRING SymbolicLinkName;
  /* 0x00c8 */ unsigned long CheckForHangSeconds;
  /* 0x00cc */ unsigned short CFHangTicks;
  /* 0x00ce */ unsigned short CFHangCurrentTick;
  /* 0x00d0 */ int ResetStatus;
  /* 0x00d4 */ void* ResetOpen;
  union
  {
    /* 0x00d8 */ struct _X_FILTER* EthDB;
    /* 0x00d8 */ struct _X_FILTER* NullDB;
  }; /* size: 0x0004 */
  /* 0x00dc */ struct _X_FILTER* TrDB;
  /* 0x00e0 */ void* YYYDB;
  /* 0x00e4 */ void* XXXDB;
  /* 0x00e8 */ void* PacketIndicateHandler /* function */;
  /* 0x00ec */ void* SendCompleteHandler /* function */;
  /* 0x00f0 */ void* SendResourcesHandler /* function */;
  /* 0x00f4 */ void* ResetCompleteHandler /* function */;
  /* 0x00f8 */ enum _NDIS_MEDIUM MediaType;
  /* 0x00fc */ unsigned long AutoNegotiationFlags;
  /* 0x0100 */ enum _NDIS_INTERFACE_TYPE Reserved5;
  /* 0x0104 */ enum _NDIS_INTERFACE_TYPE AdapterType;
  union
  {
    /* 0x0108 */ struct _DEVICE_OBJECT* Reserved6;
    /* 0x0108 */ enum _NET_IF_MEDIA_CONNECT_STATE MediaConnectState;
  }; /* size: 0x0004 */
  union
  {
    /* 0x010c */ struct _DEVICE_OBJECT* Reserved7;
    /* 0x010c */ enum _NET_IF_MEDIA_DUPLEX_STATE MediaDuplexState;
  }; /* size: 0x0004 */
  /* 0x0110 */ unsigned long* SupportedOidList;
  /* 0x0114 */ struct _NDIS_SG_DMA_BLOCK* MiniportSGDmaBlock;
  /* 0x0118 */ struct _NDIS_AF_LIST* CallMgrAfList;
  /* 0x011c */ void* MiniportThread;
  /* 0x0120 */ void* SetInfoBuf;
  /* 0x0124 */ unsigned short SetInfoBufLen;
  /* 0x0126 */ unsigned short MaxSendPackets;
  /* 0x0128 */ int FakeStatus;
  /* 0x012c */ void* LockHandler;
  /* 0x0130 */ struct _NDIS_RECEIVE_SCALE_PARAMETERS* CombinedNdisRSSParameters;
  union
  {
    /* 0x0134 */ struct _NDIS_MINIPORT_TIMER* TimerQueue;
    /* 0x0134 */ struct _NDIS_TIMER_ENTRY* TimerObjectQueue;
  }; /* size: 0x0004 */
  /* 0x0138 */ unsigned int MacOptions;
  /* 0x013c */ struct _NDIS_REQUEST* PendingRequest;
  /* 0x0140 */ unsigned int MaximumLongAddresses;
  /* 0x0144 */ unsigned int MaximumShortAddresses;
  /* 0x0148 */ unsigned int MiniportCurrentLookahead;
  /* 0x014c */ unsigned int MiniportMaximumLookahead;
  union
  {
    /* 0x0150 */ unsigned long Reserved1;
    /* 0x0150 */ struct _X_FILTER* NullMediaFilter;
  }; /* size: 0x0004 */
  /* 0x0154 */ void* DisableInterruptHandler /* function */;
  /* 0x0158 */ void* EnableInterruptHandler /* function */;
  /* 0x015c */ void* SendPacketsHandler /* function */;
  /* 0x0160 */ void* DeferredSendHandler /* function */;
  /* 0x0164 */ void* EthRxIndicateHandler /* function */;
  /* 0x0168 */ void* TrRxIndicateHandler /* function */;
  /* 0x016c */ void* NextSendNetBufferListsHandler /* function */;
  /* 0x0170 */ void* EthRxCompleteHandler /* function */;
  /* 0x0174 */ void* TrRxCompleteHandler /* function */;
  /* 0x0178 */ void* SavedNextSendNetBufferListsHandler /* function */;
  /* 0x017c */ void* StatusHandler /* function */;
  /* 0x0180 */ void* StatusCompleteHandler /* function */;
  /* 0x0184 */ void* TDCompleteHandler /* function */;
  /* 0x0188 */ void* QueryCompleteHandler /* function */;
  /* 0x018c */ void* SetCompleteHandler /* function */;
  /* 0x0190 */ void* WanSendCompleteHandler /* function */;
  /* 0x0194 */ void* WanRcvHandler /* function */;
  /* 0x0198 */ void* WanRcvCompleteHandler /* function */;
  /* 0x019c */ void* IndicateNetBufferListsHandler /* function */;
  /* 0x01a0 */ void* IndicateNetBufferListsContext;
  /* 0x01a4 */ void* SendNetBufferListsCompleteHandler /* function */;
  /* 0x01a8 */ void* NextReturnNetBufferLists /* function */;
  /* 0x01ac */ void* NextReturnNetBufferListsContext;
  /* 0x01b0 */ unsigned __int64 XmitLinkSpeed;
  /* 0x01b8 */ unsigned __int64 RcvLinkSpeed;
  /* 0x01c0 */ enum _NDIS_SUPPORTED_PAUSE_FUNCTIONS PauseFunctions;
  /* 0x01c4 */ enum _NDIS_SUPPORTED_PAUSE_FUNCTIONS MiniportPauseFunctions;
  /* 0x01c8 */ unsigned long MiniportAutoNegotiationFlags;
  /* 0x01cc */ struct _SINGLE_LIST_ENTRY WorkQueue[7];
  /* 0x01e8 */ struct _SINGLE_LIST_ENTRY SingleWorkItems[6];
  /* 0x0200 */ unsigned char SendFlags;
  /* 0x0201 */ unsigned char TrResetRing;
  /* 0x0202 */ unsigned char MP6SupportPM;
  /* 0x0203 */ unsigned char XState;
  /* 0x0204 */ struct _NDIS_LOG* Log;
  /* 0x0208 */ struct _CM_RESOURCE_LIST* AllocatedResources;
  /* 0x020c */ struct _CM_RESOURCE_LIST* AllocatedResourcesTranslated;
  /* 0x0210 */ struct _SINGLE_LIST_ENTRY PatternList;
  /* 0x0214 */ struct _NDIS_PNP_CAPABILITIES PMCapabilities;
  /* 0x0224 */ struct _DEVICE_CAPABILITIES DeviceCaps;
  /* 0x0264 */ unsigned long CombinedWakeUpEnable;
  /* 0x0268 */ unsigned long WakeUpEnable;
  /* 0x026c */ struct _IRP* pIrpWaitWake;
  /* 0x0270 */ enum _SYSTEM_POWER_STATE WaitWakeSystemState;
  /* 0x0274 */ long Padding_38;
  /* 0x0278 */ union _LARGE_INTEGER VcIndex;
  /* 0x0280 */ unsigned long VcCountLock;
  /* 0x0284 */ struct _LIST_ENTRY WmiEnabledVcs;
  /* 0x028c */ struct _NDIS_GUID* pNdisGuidMap;
  /* 0x0290 */ struct _NDIS_GUID* pCustomGuidMap;
  /* 0x0294 */ unsigned short VcCount;
  /* 0x0296 */ unsigned short cNdisGuidMap;
  /* 0x0298 */ unsigned short cCustomGuidMap;
  /* 0x029a */ char Padding_39[6];
  /* 0x02a0 */ struct _NDIS_TIMER MediaDisconnectTimer;
  /* 0x02e8 */ enum _NDIS_PNP_DEVICE_STATE PnPDeviceState;
  /* 0x02ec */ enum _NDIS_PNP_DEVICE_STATE OldPnPDeviceState;
  /* 0x02f0 */ struct _KDPC DeferredDpc;
  /* 0x0310 */ union _LARGE_INTEGER StartTicks;
  /* 0x0318 */ struct _NDIS_PACKET* IndicatedPacket[32];
  /* 0x0398 */ struct _KEVENT* RemoveReadyEvent;
  /* 0x039c */ struct _KEVENT* AllOpensClosedEvent;
  /* 0x03a0 */ struct _KEVENT* AllRequestsCompletedEvent;
  /* 0x03a4 */ unsigned long InitTimeMs;
  /* 0x03a8 */ struct _NDIS_MINIPORT_WORK_ITEM WorkItemBuffer[6];
  /* 0x03f0 */ struct _OID_LIST* OidList;
  /* 0x03f4 */ unsigned short InternalResetCount;
  /* 0x03f6 */ unsigned short MiniportResetCount;
  /* 0x03f8 */ unsigned short MediaSenseConnectCount;
  /* 0x03fa */ unsigned short MediaSenseDisconnectCount;
  /* 0x03fc */ struct _NDIS_PACKET** xPackets;
  /* 0x0400 */ unsigned long UserModeOpenReferences;
  /* 0x0404 */ void* SavedIndicateNetBufferListsHandler /* function */;
  /* 0x0408 */ void* SavedIndicateNetBufferListsContext;
  /* 0x040c */ void* WSendPacketsHandler /* function */;
  /* 0x0410 */ unsigned long MiniportAttributes;
  /* 0x0414 */ unsigned short NumOpens;
  /* 0x0416 */ unsigned short CFHangXTicks;
  /* 0x0418 */ unsigned long RequestCount;
  /* 0x041c */ unsigned long IndicatedPacketsCount;
  /* 0x0420 */ unsigned long PhysicalMediumType;
  /* 0x0424 */ enum _NDIS_MEDIUM MiniportMediaType;
  /* 0x0428 */ struct _NDIS_REQUEST* LastRequest;
  /* 0x042c */ void* FakeMac;
  /* 0x0430 */ unsigned long LockDbg;
  /* 0x0434 */ unsigned long LockDbgX;
  /* 0x0438 */ void* LockThread;
  /* 0x043c */ unsigned long InfoFlags;
  /* 0x0440 */ unsigned long TimerQueueLock;
  /* 0x0444 */ struct _KEVENT* ResetCompletedEvent;
  /* 0x0448 */ struct _KEVENT* QueuedBindingCompletedEvent;
  /* 0x044c */ void* SavedPacketIndicateHandler /* function */;
  /* 0x0450 */ unsigned long RegisteredInterrupts;
  /* 0x0454 */ unsigned long SetOid;
  /* 0x0458 */ struct _KEVENT* WakeUpTimerEvent;
  /* 0x045c */ void* DeviceContext;
  /* 0x0460 */ struct _NDIS_RECEIVE_SCALE_CAPABILITIES RcvScaleCapabilities;
  /* 0x0470 */ unsigned char CombinedRSSParametersBuf[196];
  /* 0x0534 */ long Padding_40;
  /* 0x0538 */ unsigned char RSSParametersBuf[196];
  /* 0x05fc */ unsigned char Miniport5InNdis6Mode;
  /* 0x05fd */ unsigned char Miniport5HasNdis6Component;
  /* 0x05fe */ unsigned char RestoreStackNeeded;
  /* 0x05ff */ char MediaChangeFilters;
  /* 0x0600 */ unsigned char FilterPnPLockAcquired;
  /* 0x0601 */ unsigned char LWFilterAllLoaded;
  /* 0x0602 */ unsigned char CheckPacketFilters;
  /* 0x0603 */ unsigned char ReceiveFilters;
  /* 0x0604 */ void* FilterPnPLockThread;
  /* 0x0608 */ unsigned long FilterPnPLockDbgX;
  /* 0x060c */ unsigned long RecvLock;
  /* 0x0610 */ enum _NDIS_MINIPORT_STATE RecvState;
  /* 0x0614 */ unsigned long OutstandingReceives;
  /* 0x0618 */ void* MiniportRecvLockThread;
  /* 0x061c */ unsigned long RecvLockDbg;
  /* 0x0620 */ void* NextSendPacketsHandler /* function */;
  /* 0x0624 */ void* FinalSendPacketsHandler /* function */;
  /* 0x0628 */ void* LWFilterMutexOwnerThread;
  /* 0x062c */ unsigned long LWFilterMutexOwner;
  /* 0x0630 */ unsigned long LWFilterMutexOwnerCount;
  /* 0x0634 */ struct _NDIS_FILTER_BLOCK* LowestFilter;
  /* 0x0638 */ struct _NDIS_FILTER_BLOCK* HighestFilter;
  /* 0x063c */ void* ShutdownContext;
  union
  {
    /* 0x0640 */ void* ShutdownHandler /* function */;
    /* 0x0640 */ void* ShutdownHandlerEx /* function */;
  }; /* size: 0x0004 */
  /* 0x0644 */ struct _KBUGCHECK_CALLBACK_RECORD BugcheckCallbackRecord;
  /* 0x0664 */ void* TopIndicateNetBufferListsHandler /* function */;
  /* 0x0668 */ void* TopIndicateLoopbackNetBufferListsHandler /* function */;
  /* 0x066c */ void* Ndis5PacketIndicateHandler /* function */;
  /* 0x0670 */ void* MiniportReturnPacketHandler /* function */;
  /* 0x0674 */ void* MiniportReturnPacketContext;
  /* 0x0678 */ void* SynchronousReturnPacketHandler /* function */;
  /* 0x067c */ void* SynchronousReturnPacketContext;
  /* 0x0680 */ void* NextRequestHandler /* function */;
  /* 0x0684 */ void* NextRequestContext;
  /* 0x0688 */ struct _LIST_ENTRY OidRequestList;
  /* 0x0690 */ struct _NDIS_OID_REQUEST* PendingOidRequest;
  /* 0x0694 */ void* NextCoOidRequestHandle;
  /* 0x0698 */ unsigned long Ndis6ProtocolsBound;
  /* 0x069c */ unsigned long PmodeOpen6;
  /* 0x06a0 */ enum _NDIS_MINIPORT_STATE State;
  /* 0x06a4 */ struct _KEVENT* AsyncOpCompletionEvent;
  /* 0x06a8 */ int AsyncOpCompletionStatus;
  /* 0x06ac */ struct _ULONG_REFERENCE Ref;
  /* 0x06b8 */ unsigned __int64 MaxXmitLinkSpeed;
  /* 0x06c0 */ unsigned __int64 MaxRcvLinkSpeed;
  /* 0x06c8 */ unsigned long SupportedPacketFilters;
  /* 0x06cc */ struct _NDIS_MINIPORT_HANDLERS NoFilter;
  /* 0x0718 */ struct _NDIS_MINIPORT_HANDLERS Next;
  /* 0x0764 */ long NumOfPauseRestartRequests;
  /* 0x0768 */ unsigned long FilterPnPFlags;
  /* 0x076c */ unsigned long SupportedStatistics;
  /* 0x0770 */ unsigned long cDpcSendCompletes;
  /* 0x0774 */ unsigned long cDpcRcvIndications;
  /* 0x0778 */ unsigned long cDpcRcvIndicationCalls;
  /* 0x077c */ unsigned long cDpcNbSendCompletes;
  /* 0x0780 */ unsigned long cDpcNblSendCompletes;
  /* 0x0784 */ unsigned long cDpcNblIndications;
  /* 0x0788 */ unsigned long cDpcMaxPacketsIndicated;
  /* 0x078c */ unsigned long cDpcTotalDpcCount;
  /* 0x0790 */ struct _NDIS_RECEIVE_SCALE_CAPABILITIES RecvScaleCapabilities;
  /* 0x07a0 */ struct _NDIS_MINIPORT_ADAPTER_GENERAL_ATTRIBUTES* GeneralAttributes;
  /* 0x07a4 */ struct _LIST_ENTRY PortList;
  /* 0x07ac */ unsigned char* AllocatedPortIndices;
  /* 0x07b0 */ unsigned long AllocatedPortIndicesLength;
  /* 0x07b4 */ unsigned long NumberOfPorts;
  /* 0x07b8 */ unsigned long NumberOfActivePorts;
  /* 0x07bc */ long Padding_41;
  /* 0x07c0 */ unsigned __int64 MiniportXmitLinkSpeed;
  /* 0x07c8 */ unsigned __int64 MiniportRcvLinkSpeed;
  /* 0x07d0 */ struct _KEVENT RestoreStackTimerEvent;
  /* 0x07e0 */ struct _NDIS_TIMER RestoreStackTimer;
  /* 0x0828 */ struct _NDIS_WORK_ITEM RestoreStackWorkItem;
  /* 0x0850 */ unsigned long RestoreStackBindRefCount;
  /* 0x0854 */ unsigned long ProtocolsToBind;
  /* 0x0858 */ struct _NDIS_DPC_TRACKER* DpcTrackers;
  /* 0x085c */ struct _NDIS_DPC_TRACKER* CurrentDpcTracker;
  /* 0x0860 */ unsigned char DpcTrackerIndex;
  /* 0x0861 */ unsigned char SupportedRss;
  /* 0x0862 */ char Padding_42[6];
  /* 0x0868 */ unsigned __int64 DpcWatchDogCycleCount;
  /* 0x0870 */ unsigned long DataBackFillSize;
  /* 0x0874 */ unsigned long ContextBackFillSize;
  /* 0x0878 */ unsigned long SupportedPauseFunctions;
  /* 0x087c */ long Padding_43;
  /* 0x0880 */ struct _NDIS_RESTART_GENERAL_ATTRIBUTES TopFilterRestartAttributes;
  /* 0x08d0 */ struct _NDIS_RECEIVE_SCALE_CAPABILITIES TopRecvScaleCapabilities;
  /* 0x08e0 */ long NumOfOpenPauseRestartRequests;
  /* 0x08e4 */ long MiniportStackPauseCount;
  /* 0x08e8 */ unsigned long NsiOpenReferences;
  /* 0x08ec */ struct _KEVENT* NsiRequestsCompletedEvent;
  /* 0x08f0 */ enum _DEVICE_POWER_STATE QueryPowerDeviceState;
  /* 0x08f4 */ unsigned char MinimumNdisMajorVersion;
  /* 0x08f5 */ unsigned char MinimumNdisMinorVersion;
  /* 0x08f6 */ unsigned short NumOfMinimumVersionDrivers;
  /* 0x08f8 */ struct _NDIS_MINIPORT_STATS* BottomIfStats;
  /* 0x08fc */ struct _NDIS_M_PERIODIC_RECEIVES PeriodicReceiveQueue;
  /* 0x094c */ enum _NDIS_PORT_CONTROL_STATE DefaultSendControlState;
  /* 0x0950 */ enum _NDIS_PORT_CONTROL_STATE DefaultRcvControlState;
  /* 0x0954 */ enum _NDIS_PORT_AUTHORIZATION_STATE DefaultSendAuthorizationState;
  /* 0x0958 */ enum _NDIS_PORT_AUTHORIZATION_STATE DefaultRcvAuthorizationState;
  /* 0x095c */ enum _NDIS_PORT_CONTROL_STATE DefaultPortSendControlState;
  /* 0x0960 */ enum _NDIS_PORT_CONTROL_STATE DefaultPortRcvControlState;
  /* 0x0964 */ enum _NDIS_PORT_AUTHORIZATION_STATE DefaultPortSendAuthorizationState;
  /* 0x0968 */ enum _NDIS_PORT_AUTHORIZATION_STATE DefaultPortRcvAuthorizationState;
  /* 0x096c */ struct _NDIS_PCI_DEVICE_CUSTOM_PROPERTIES PciDeviceCustomProperties;
  /* 0x0994 */ void* TopNdis5PacketIndicateHandler /* function */;
  /* 0x0998 */ unsigned long* ndisSupportedOidList;
  /* 0x099c */ unsigned long ndisSupportedOidListLength;
  /* 0x09a0 */ unsigned long MsiIntCount;
  /* 0x09a4 */ struct _WORK_QUEUE_ITEM MiniportDpcWorkItem;
  /* 0x09b4 */ long Padding_44;
  /* 0x09b8 */ unsigned __int64 InvalidFrames;
  /* 0x09c0 */ long PagingPathCount;
  union
  {
    /* 0x09c4 */ unsigned char BeginSavedFields;
    /* 0x09c4 */ unsigned long NumUserOpens;
  }; /* size: 0x0004 */
  /* 0x09c8 */ struct _NDIS_MINIPORT_OFFLOAD_REG OffloadRegistry;
  /* 0x09cc */ unsigned short MediaDisconnectTimeOut;
  /* 0x09ce */ unsigned short SGMapRegistersNeeded;
  /* 0x09d0 */ unsigned long DriverVerifyFlags;
  /* 0x09d4 */ void* SetBusData /* function */;
  /* 0x09d8 */ void* GetBusData /* function */;
  /* 0x09dc */ void* BusDataContext;
  /* 0x09e0 */ enum _NDIS_INTERFACE_TYPE BusType;
  /* 0x09e4 */ unsigned long BusNumber;
  /* 0x09e8 */ unsigned long SlotNumber;
  /* 0x09ec */ struct _NDIS_EVENT OpenReadyEvent;
  /* 0x09fc */ unsigned long NumAdminOpens;
  /* 0x0a00 */ struct _NDIS_M_DRIVER_BLOCK* DriverHandle;
  /* 0x0a04 */ struct _NDIS_BIND_PATHS* BindPaths;
  /* 0x0a08 */ struct _NDIS_BIND_PATHS* LWFilterList;
  /* 0x0a0c */ struct _NDIS_PROTOCOL_BLOCK** ProtocolsFailToBind;
  /* 0x0a10 */ unsigned long MiniportPhysicalMediumType;
  /* 0x0a14 */ struct _NDIS_FILTER_ATTACH_LIST* LWFilterAttachList;
  /* 0x0a18 */ unsigned long NumFilters;
  /* 0x0a1c */ unsigned int NetLuidIndex;
  /* 0x0a20 */ struct _KMUTANT LWFilterMutex;
  /* 0x0a40 */ void* SecurityDescriptor;
  /* 0x0a44 */ struct _UNICODE_STRING BaseName;
  /* 0x0a4c */ struct _UNICODE_STRING MiniportName;
  /* 0x0a54 */ struct _DEVICE_OBJECT* DeviceObject;
  /* 0x0a58 */ struct _DEVICE_OBJECT* PhysicalDeviceObject;
  /* 0x0a5c */ struct _DEVICE_OBJECT* NextDeviceObject;
  /* 0x0a60 */ struct _NDIS_MINIPORT_BLOCK* NextGlobalMiniport;
  /* 0x0a64 */ struct _UNICODE_STRING* pAdapterInstanceName;
  /* 0x0a68 */ unsigned long PnPCapabilities;
  /* 0x0a6c */ enum _DEVICE_POWER_STATE CurrentDevicePowerState;
  /* 0x0a70 */ void* BusInterface;
  /* 0x0a74 */ unsigned short InstanceNumber;
  /* 0x0a76 */ char Padding_45[2];
  /* 0x0a78 */ void* ConfigurationHandle;
  /* 0x0a7c */ struct _GUID InterfaceGuid;
  /* 0x0a8c */ struct _NDIS_IF_BLOCK* IfBlock;
  /* 0x0a90 */ unsigned int IfIndex;
  /* 0x0a94 */ enum _NET_IF_ADMIN_STATUS AdminStatus;
  /* 0x0a98 */ enum _NET_IF_OPER_STATUS OperStatus;
  /* 0x0a9c */ unsigned long OperStatusFlags;
  union
  {
    /* 0x0aa0 */ void* SendHandler /* function */;
    /* 0x0aa0 */ void* WanSendHandler /* function */;
  }; /* size: 0x0004 */
  /* 0x0aa4 */ struct _NDIS_MINIPORT_OFFLOAD* Offload;
  /* 0x0aa8 */ void* AddDeviceContext;
  /* 0x0aac */ struct _IO_REMOVE_LOCK RemoveLock;
  /* 0x0ac4 */ struct _UNICODE_STRING DevinterfaceNetSymbolicLinkName;
  /* 0x0acc */ unsigned char RssEnable;
  /* 0x0acd */ unsigned char ChimneyEnable;
  /* 0x0ace */ char Padding_46[2];
  /* 0x0ad0 */ unsigned long PhysicalMediumInInf;
  /* 0x0ad4 */ struct _UNICODE_STRING ExportName;
  /* 0x0adc */ struct _UNICODE_STRING FilterClass;
  /* 0x0ae4 */ void* StatusProcessingThread;
  /* 0x0ae8 */ unsigned long StatusProcessingDbgX;
  /* 0x0aec */ struct _UNICODE_STRING FdoName;
  /* 0x0af4 */ struct _NDIS_MINIPORT_BLOCK* NextOrphanedMiniport;
  /* 0x0af8 */ struct _KEVENT PowerEvent;
  /* 0x0b08 */ struct _KEVENT* pPowerEvent;
  /* 0x0b0c */ unsigned long DirectOidRequestCount;
  /* 0x0b10 */ struct _KEVENT* AllDirectRequestsCompletedEvent;
  /* 0x0b14 */ struct _NDIS_HD_SPLIT_CURRENT_CONFIG* HDSplitCurrentConfig;
  /* 0x0b18 */ void* MSIXConfigContext;
  /* 0x0b1c */ void* SetMSIXTableEntry /* function */;
  /* 0x0b20 */ void* MaskMSIXTableEntry /* function */;
  /* 0x0b24 */ void* UnmaskMSIXTableEntry /* function */;
} NDIS_MINIPORT_BLOCK, *PNDIS_MINIPORT_BLOCK; /* size: 0x0b28 */

typedef struct _NDIS_MINIPORT_INTERRUPT
{
  /* 0x0000 */ struct _KINTERRUPT* InterruptObject;
  /* 0x0004 */ unsigned long DpcCountLock;
  /* 0x0008 */ void* Reserved;
  /* 0x000c */ void* MiniportIsr /* function */;
  /* 0x0010 */ void* MiniportDpc /* function */;
  /* 0x0014 */ struct _KDPC InterruptDpc;
  /* 0x0034 */ struct _NDIS_MINIPORT_BLOCK* Miniport;
  /* 0x0038 */ unsigned char DpcCount;
  /* 0x0039 */ unsigned char Filler1;
  /* 0x003a */ char Padding_47[2];
  /* 0x003c */ struct _KEVENT DpcsCompletedEvent;
  /* 0x004c */ unsigned char SharedInterrupt;
  /* 0x004d */ unsigned char IsrRequested;
  /* 0x004e */ char __PADDING__[2];
} NDIS_MINIPORT_INTERRUPT, *PNDIS_MINIPORT_INTERRUPT; /* size: 0x0050 */

struct _KINTERRUPT;

typedef struct _NDIS_FILTER_ATTACH_LIST
{
  /* 0x0000 */ struct _UNICODE_STRING* FilterInstanceName;
  /* 0x0004 */ unsigned long Flags;
} NDIS_FILTER_ATTACH_LIST, *PNDIS_FILTER_ATTACH_LIST; /* size: 0x0008 */

typedef struct _IO_INTERRUPT_MESSAGE_INFO
{
  /* 0x0000 */ unsigned char UnifiedIrql;
  /* 0x0001 */ char Padding_48[3];
  /* 0x0004 */ unsigned long MessageCount;
  /* 0x0008 */ struct _IO_INTERRUPT_MESSAGE_INFO_ENTRY MessageInfo[1];
} IO_INTERRUPT_MESSAGE_INFO, *PIO_INTERRUPT_MESSAGE_INFO; /* size: 0x0030 */

typedef struct _NDIS_FRAME_TYPE_RECORD
{
  /* 0x0000 */ unsigned int NumEntries;
  /* 0x0004 */ struct _NDIS_FRAME_TYPE_AND_OPEN Entry[16];
} NDIS_FRAME_TYPE_RECORD, *PNDIS_FRAME_TYPE_RECORD; /* size: 0x0084 */

typedef struct _X_FILTER
{
  /* 0x0000 */ struct _NDIS_OPEN_BLOCK* OpenList;
  /* 0x0004 */ struct _NDIS_OPEN_BLOCK* NoFTypeOpenList;
  /* 0x0008 */ struct _NDIS_OPEN_BLOCK* FTypeOpenList;
  /* 0x000c */ struct _NDIS_FRAME_TYPE_RECORD FrameTypeRecord;
  /* 0x0090 */ struct _NDIS_RW_LOCK BindListLock;
  /* 0x02a0 */ struct _NDIS_MINIPORT_BLOCK* Miniport;
  /* 0x02a4 */ unsigned int CombinedPacketFilter;
  /* 0x02a8 */ unsigned int OldCombinedPacketFilter;
  /* 0x02ac */ unsigned int MiniportPacketFilter;
  /* 0x02b0 */ unsigned int NumOpens;
  /* 0x02b4 */ unsigned int NumNoETypeOpens;
  /* 0x02b8 */ struct _NDIS_OPEN_BLOCK* MCastSet;
  /* 0x02bc */ struct _NDIS_OPEN_BLOCK* SingleActiveOpen;
  /* 0x02c0 */ unsigned char AdapterAddress[6];
  /* 0x02c6 */ char Padding_49[2];
  union
  {
    struct
    {
      /* 0x02c8 */ unsigned int MaxMulticastAddresses;
      /* 0x02cc */ unsigned char* NextMCastAddressBuf[6];
      /* 0x02d0 */ unsigned char* NextOldMCastAddressBuf[6];
      /* 0x02d4 */ unsigned int NextNumAddresses;
      /* 0x02d8 */ unsigned int NextOldNumAddresses;
      /* 0x02dc */ unsigned char* MiniportMCastAddressBuf[6];
      /* 0x02e0 */ unsigned int MiniportNumAddresses;
      /* 0x02e4 */ unsigned char* MiniportOldMCastAddressBuf[6];
      /* 0x02e8 */ unsigned int MiniportOldNumAddresses;
    }; /* size: 0x0024 */
    struct
    {
      /* 0x02c8 */ unsigned long CombinedFunctionalAddress;
      /* 0x02cc */ unsigned long MiniportFunctionalAddress;
      /* 0x02d0 */ unsigned long CombinedGroupAddress;
      /* 0x02d4 */ unsigned long MiniportGroupAddress;
      /* 0x02d8 */ unsigned int CombinedGroupReferences;
      /* 0x02dc */ unsigned long OldCombinedFunctionalAddress;
      /* 0x02e0 */ unsigned long OldCombinedGroupAddress;
      /* 0x02e4 */ unsigned int OldCombinedGroupReferences;
      /* 0x02e8 */ long __PADDING__[1];
    }; /* size: 0x0024 */
  }; /* size: 0x0024 */
} X_FILTER, *PX_FILTER; /* size: 0x02ec */

typedef struct _NDIS_OPEN_BLOCK
{
  union
  {
    /* 0x0000 */ void* MacHandle;
    /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  }; /* size: 0x0004 */
  /* 0x0004 */ void* BindingHandle;
  /* 0x0008 */ struct _NDIS_MINIPORT_BLOCK* MiniportHandle;
  /* 0x000c */ struct _NDIS_PROTOCOL_BLOCK* ProtocolHandle;
  /* 0x0010 */ void* ProtocolBindingContext;
  /* 0x0014 */ void* NextSendHandler /* function */;
  /* 0x0018 */ void* NextSendContext;
  /* 0x001c */ void* MiniportAdapterContext;
  /* 0x0020 */ unsigned char Reserved1;
  /* 0x0021 */ unsigned char CallingFromNdis6Protocol;
  /* 0x0022 */ unsigned char Reserved3;
  /* 0x0023 */ unsigned char Reserved4;
  /* 0x0024 */ void* NextReturnNetBufferListsHandler /* function */;
  /* 0x0028 */ unsigned long Reserved5;
  /* 0x002c */ void* NextReturnNetBufferListsContext;
  union
  {
    /* 0x0030 */ void* SendHandler /* function */;
    /* 0x0030 */ void* WanSendHandler /* function */;
  }; /* size: 0x0004 */
  /* 0x0034 */ void* TransferDataHandler /* function */;
  /* 0x0038 */ void* SendCompleteHandler /* function */;
  /* 0x003c */ void* TransferDataCompleteHandler /* function */;
  /* 0x0040 */ void* ReceiveHandler /* function */;
  /* 0x0044 */ void* ReceiveCompleteHandler /* function */;
  /* 0x0048 */ void* WanReceiveHandler /* function */;
  /* 0x004c */ void* RequestCompleteHandler /* function */;
  /* 0x0050 */ void* ReceivePacketHandler /* function */;
  /* 0x0054 */ void* SendPacketsHandler /* function */;
  /* 0x0058 */ void* ResetHandler /* function */;
  /* 0x005c */ void* RequestHandler /* function */;
  /* 0x0060 */ void* OidRequestHandler /* function */;
  /* 0x0064 */ void* ResetCompleteHandler /* function */;
  union
  {
    /* 0x0068 */ void* StatusHandler /* function */;
    /* 0x0068 */ void* StatusHandlerEx /* function */;
  }; /* size: 0x0004 */
  /* 0x006c */ void* StatusCompleteHandler /* function */;
  /* 0x0070 */ unsigned long Flags;
  /* 0x0074 */ long References;
  /* 0x0078 */ unsigned long SpinLock;
  /* 0x007c */ void* FilterHandle;
  /* 0x0080 */ unsigned int FrameTypeArraySize;
  /* 0x0084 */ unsigned short FrameTypeArray[4];
  /* 0x008c */ unsigned long ProtocolOptions;
  /* 0x0090 */ unsigned long CurrentLookahead;
  /* 0x0094 */ void* WSendHandler /* function */;
  /* 0x0098 */ void* WTransferDataHandler /* function */;
  /* 0x009c */ void* WSendPacketsHandler /* function */;
  /* 0x00a0 */ void* CancelSendPacketsHandler /* function */;
  /* 0x00a4 */ unsigned long WakeUpEnable;
  /* 0x00a8 */ struct _KEVENT* CloseCompleteEvent;
  /* 0x00ac */ struct _QUEUED_CLOSE QC;
  /* 0x00c0 */ long AfReferences;
  /* 0x00c4 */ struct _NDIS_OPEN_BLOCK* NextGlobalOpen;
  /* 0x00c8 */ struct _NDIS_OPEN_BLOCK* MiniportNextOpen;
  /* 0x00cc */ struct _NDIS_OPEN_BLOCK* ProtocolNextOpen;
  /* 0x00d0 */ struct _UNICODE_STRING* BindDeviceName;
  /* 0x00d4 */ struct _UNICODE_STRING* RootDeviceName;
  /* 0x00d8 */ struct _NDIS_OPEN_BLOCK* FilterNextOpen;
  /* 0x00dc */ unsigned int PacketFilters;
  /* 0x00e0 */ unsigned int OldPacketFilters;
  union
  {
    struct
    {
      /* 0x00e4 */ unsigned int MaxMulticastAddresses;
      /* 0x00e8 */ struct _ETH_MULTICAST_WRAPPER* MCastAddressBuf;
      /* 0x00ec */ unsigned int NumAddresses;
      /* 0x00f0 */ struct _ETH_MULTICAST_WRAPPER* OldMCastAddressBuf;
      /* 0x00f4 */ unsigned int OldNumAddresses;
    }; /* size: 0x0014 */
    struct
    {
      /* 0x00e4 */ unsigned long FunctionalAddress;
      /* 0x00e8 */ unsigned long OldFunctionalAddress;
      /* 0x00ec */ unsigned char UsingGroupAddress;
      /* 0x00ed */ unsigned char OldUsingGroupAddress;
      /* 0x00ee */ char Padding_50[2];
      /* 0x00f0 */ unsigned long FARefCount[32];
      /* 0x0170 */ unsigned long OldFARefCount[32];
      /* 0x01f0 */ unsigned char RSSParametersBuf[196];
      /* 0x02b4 */ struct _NDIS_RECEIVE_SCALE_PARAMETERS* NdisRSSParameters;
      /* 0x02b8 */ struct _SINGLE_LIST_ENTRY PatternList;
      /* 0x02bc */ void* ProtSendNetBufferListsComplete /* function */;
      /* 0x02c0 */ void* NextSendNetBufferListsComplete /* function */;
      /* 0x02c4 */ void* NextSendNetBufferListsCompleteContext;
      /* 0x02c8 */ void* SendCompleteNdisPacketContext;
      /* 0x02cc */ void* SendCompleteNetBufferListsContext;
      /* 0x02d0 */ void* ReceiveNetBufferLists /* function */;
      /* 0x02d4 */ void* ReceiveNetBufferListsContext;
      /* 0x02d8 */ void* SavedSendNBLHandler /* function */;
      /* 0x02dc */ void* SavedSendPacketsHandler /* function */;
      /* 0x02e0 */ void* SavedCancelSendPacketsHandler /* function */;
      union
      {
        /* 0x02e4 */ void* SavedSendHandler /* function */;
        /* 0x02e4 */ void* SavedWanSendHandler /* function */;
      }; /* size: 0x0004 */
      /* 0x02e8 */ void* InitiateOffloadCompleteHandler /* function */;
      /* 0x02ec */ void* TerminateOffloadCompleteHandler /* function */;
      /* 0x02f0 */ void* UpdateOffloadCompleteHandler /* function */;
      /* 0x02f4 */ void* InvalidateOffloadCompleteHandler /* function */;
      /* 0x02f8 */ void* QueryOffloadCompleteHandler /* function */;
      /* 0x02fc */ void* IndicateOffloadEventHandler /* function */;
      /* 0x0300 */ void* TcpOffloadSendCompleteHandler /* function */;
      /* 0x0304 */ void* TcpOffloadReceiveCompleteHandler /* function */;
      /* 0x0308 */ void* TcpOffloadDisconnectCompleteHandler /* function */;
      /* 0x030c */ void* TcpOffloadForwardCompleteHandler /* function */;
      /* 0x0310 */ void* TcpOffloadEventHandler /* function */;
      /* 0x0314 */ void* TcpOffloadReceiveIndicateHandler /* function */;
      /* 0x0318 */ unsigned long ProtocolMajorVersion;
      /* 0x031c */ void** IfBlock;
      /* 0x0320 */ struct _NDIS_SPIN_LOCK PnPStateLock;
      /* 0x0328 */ enum _NDIS_NDIS5_DRIVER_STATE PnPState;
      /* 0x032c */ enum _NDIS_OPEN_TRANSLATION_STATE TranslationState;
      /* 0x0330 */ int OutstandingSends;
      /* 0x0334 */ struct _NDIS_EVENT PauseEvent;
      /* 0x0344 */ void* Ndis5WanSendHandler /* function */;
      /* 0x0348 */ void* ProtSendCompleteHandler /* function */;
      /* 0x034c */ void* OidRequestCompleteHandler /* function */;
      /* 0x0350 */ void* OidRequestCompleteContext;
      /* 0x0354 */ void* SetInfoBuf;
      /* 0x0358 */ unsigned short SetInfoBufLen;
      /* 0x035a */ char Padding_51[2];
      /* 0x035c */ unsigned long RequestBuffer;
      /* 0x0360 */ unsigned long SetInfoOid;
      /* 0x0364 */ void* OidContext;
      /* 0x0368 */ long NumOfPauseRestartRequests;
      /* 0x036c */ enum _NDIS_OPEN_STATE State;
      /* 0x0370 */ struct _NDIS_OPEN_OFFLOAD* Offload;
      /* 0x0374 */ struct _NDIS_STATUS_UNBIND_WORKITEM* StatusUnbindWorkItem;
      /* 0x0378 */ unsigned __int64 DpcStartCycle;
      /* 0x0380 */ unsigned long NumberOfNetBufferLists;
      /* 0x0384 */ unsigned char ReceivedAPacket[32];
      /* 0x03a4 */ void* DirectOidRequestCompleteHandler /* function */;
      /* 0x03a8 */ void* DirectOidRequestHandler /* function */;
      /* 0x03ac */ void* DirectOidRequestCompleteContext;
      /* 0x03b0 */ struct _NDIS_CO_AF_BLOCK* NextAf;
      /* 0x03b4 */ void* MiniportCoCreateVcHandler /* function */;
      /* 0x03b8 */ void* MiniportCoRequestHandler /* function */;
      /* 0x03bc */ void* CoCreateVcHandler /* function */;
      /* 0x03c0 */ void* CoDeleteVcHandler /* function */;
      /* 0x03c4 */ void* CmActivateVcCompleteHandler /* function */;
      /* 0x03c8 */ void* CmDeactivateVcCompleteHandler /* function */;
      /* 0x03cc */ void* CoRequestCompleteHandler /* function */;
      /* 0x03d0 */ void* CoRequestHandler /* function */;
      /* 0x03d4 */ struct _LIST_ENTRY ActiveVcHead;
      /* 0x03dc */ struct _LIST_ENTRY InactiveVcHead;
      /* 0x03e4 */ long PendingAfNotifications;
      /* 0x03e8 */ struct _KEVENT* AfNotifyCompleteEvent;
      /* 0x03ec */ void* MiniportCoOidRequestHandler /* function */;
      /* 0x03f0 */ void* CoOidRequestCompleteHandler /* function */;
      /* 0x03f4 */ void* CoOidRequestHandler /* function */;
    }; /* size: 0x0310 */
  }; /* size: 0x0310 */
} NDIS_OPEN_BLOCK, *PNDIS_OPEN_BLOCK; /* size: 0x03f8 */

typedef struct _NDIS_STATUS_INDICATION
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ void* SourceHandle;
  /* 0x0008 */ unsigned long PortNumber;
  /* 0x000c */ int StatusCode;
  /* 0x0010 */ unsigned long Flags;
  /* 0x0014 */ void* DestinationHandle;
  /* 0x0018 */ void* RequestId;
  /* 0x001c */ void* StatusBuffer;
  /* 0x0020 */ unsigned long StatusBufferSize;
  /* 0x0024 */ struct _GUID Guid;
  /* 0x0034 */ void* NdisReserved[4];
} NDIS_STATUS_INDICATION, *PNDIS_STATUS_INDICATION; /* size: 0x0044 */

typedef struct _NDIS_FILTER_TASK_OFFLOAD
{
  /* 0x0000 */ struct _NDIS_OFFLOAD OffloadCaps;
} NDIS_FILTER_TASK_OFFLOAD, *PNDIS_FILTER_TASK_OFFLOAD; /* size: 0x0090 */

typedef struct _NDIS_IF_RCV_ADDRESS
{
  union
  {
    /* 0x0000 */ unsigned char RodInfo;
    /* 0x0000 */ enum _NET_IF_RCV_ADDRESS_TYPE ifRcvAddressType;
  }; /* size: 0x0004 */
  /* 0x0004 */ unsigned short ifRcvAddressLength;
  /* 0x0006 */ char Padding_52[2];
  /* 0x0008 */ unsigned char ifRcvAddress[32];
} NDIS_IF_RCV_ADDRESS, *PNDIS_IF_RCV_ADDRESS; /* size: 0x0028 */

struct CO_ADDRESS_FAMILY
{
  /* 0x0000 */ unsigned long AddressFamily;
  /* 0x0004 */ unsigned long MajorVersion;
  /* 0x0008 */ unsigned long MinorVersion;
}; /* size: 0x000c */

typedef struct _NDIS_TRACK_MEM
{
  /* 0x0000 */ struct _LIST_ENTRY List;
  /* 0x0008 */ unsigned long Tag;
  /* 0x000c */ unsigned int Length;
  /* 0x0010 */ void* Caller;
  /* 0x0014 */ void* CallersCaller;
} NDIS_TRACK_MEM, *PNDIS_TRACK_MEM; /* size: 0x0018 */

typedef struct _NDIS_FILTER_DRIVER_CHARACTERISTICS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned char MajorNdisVersion;
  /* 0x0005 */ unsigned char MinorNdisVersion;
  /* 0x0006 */ unsigned char MajorDriverVersion;
  /* 0x0007 */ unsigned char MinorDriverVersion;
  /* 0x0008 */ unsigned long Flags;
  /* 0x000c */ struct _UNICODE_STRING FriendlyName;
  /* 0x0014 */ struct _UNICODE_STRING UniqueName;
  /* 0x001c */ struct _UNICODE_STRING ServiceName;
  /* 0x0024 */ void* SetOptionsHandler /* function */;
  /* 0x0028 */ void* SetFilterModuleOptionsHandler /* function */;
  /* 0x002c */ void* AttachHandler /* function */;
  /* 0x0030 */ void* DetachHandler /* function */;
  /* 0x0034 */ void* RestartHandler /* function */;
  /* 0x0038 */ void* PauseHandler /* function */;
  /* 0x003c */ void* SendNetBufferListsHandler /* function */;
  /* 0x0040 */ void* SendNetBufferListsCompleteHandler /* function */;
  /* 0x0044 */ void* CancelSendNetBufferListsHandler /* function */;
  /* 0x0048 */ void* ReceiveNetBufferListsHandler /* function */;
  /* 0x004c */ void* ReturnNetBufferListsHandler /* function */;
  /* 0x0050 */ void* OidRequestHandler /* function */;
  /* 0x0054 */ void* OidRequestCompleteHandler /* function */;
  /* 0x0058 */ void* CancelOidRequestHandler /* function */;
  /* 0x005c */ void* DevicePnPEventNotifyHandler /* function */;
  /* 0x0060 */ void* NetPnPEventHandler /* function */;
  /* 0x0064 */ void* StatusHandler /* function */;
  /* 0x0068 */ void* DirectOidRequestHandler /* function */;
  /* 0x006c */ void* DirectOidRequestCompleteHandler /* function */;
  /* 0x0070 */ void* CancelDirectOidRequestHandler /* function */;
} NDIS_FILTER_DRIVER_CHARACTERISTICS, *PNDIS_FILTER_DRIVER_CHARACTERISTICS; /* size: 0x0074 */

typedef struct _NDIS_PACKET_STACK
{
  /* 0x0000 */ unsigned long IMReserved[2];
  /* 0x0008 */ unsigned long NdisReserved[4];
} NDIS_PACKET_STACK, *PNDIS_PACKET_STACK; /* size: 0x0018 */

typedef struct _NDIS_MINIPORT_DRIVER_CHARACTERISTICS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned char MajorNdisVersion;
  /* 0x0005 */ unsigned char MinorNdisVersion;
  /* 0x0006 */ unsigned char MajorDriverVersion;
  /* 0x0007 */ unsigned char MinorDriverVersion;
  /* 0x0008 */ unsigned long Flags;
  /* 0x000c */ void* SetOptionsHandler /* function */;
  /* 0x0010 */ void* InitializeHandlerEx /* function */;
  /* 0x0014 */ void* HaltHandlerEx /* function */;
  /* 0x0018 */ void* UnloadHandler /* function */;
  /* 0x001c */ void* PauseHandler /* function */;
  /* 0x0020 */ void* RestartHandler /* function */;
  /* 0x0024 */ void* OidRequestHandler /* function */;
  /* 0x0028 */ void* SendNetBufferListsHandler /* function */;
  /* 0x002c */ void* ReturnNetBufferListsHandler /* function */;
  /* 0x0030 */ void* CancelSendHandler /* function */;
  /* 0x0034 */ void* CheckForHangHandlerEx /* function */;
  /* 0x0038 */ void* ResetHandlerEx /* function */;
  /* 0x003c */ void* DevicePnPEventNotifyHandler /* function */;
  /* 0x0040 */ void* ShutdownHandlerEx /* function */;
  /* 0x0044 */ void* CancelOidRequestHandler /* function */;
  /* 0x0048 */ void* DirectOidRequestHandler /* function */;
  /* 0x004c */ void* CancelDirectOidRequestHandler /* function */;
} NDIS_MINIPORT_DRIVER_CHARACTERISTICS, *PNDIS_MINIPORT_DRIVER_CHARACTERISTICS; /* size: 0x0050 */

typedef struct _NDIS51_MINIPORT_CHARACTERISTICS
{
  /* 0x0000 */ unsigned char MajorNdisVersion;
  /* 0x0001 */ unsigned char MinorNdisVersion;
  /* 0x0002 */ unsigned short Filler;
  /* 0x0004 */ unsigned int Reserved;
  /* 0x0008 */ void* CheckForHangHandler /* function */;
  /* 0x000c */ void* DisableInterruptHandler /* function */;
  /* 0x0010 */ void* EnableInterruptHandler /* function */;
  /* 0x0014 */ void* HaltHandler /* function */;
  /* 0x0018 */ void* HandleInterruptHandler /* function */;
  /* 0x001c */ void* InitializeHandler /* function */;
  /* 0x0020 */ void* ISRHandler /* function */;
  /* 0x0024 */ void* QueryInformationHandler /* function */;
  /* 0x0028 */ void* ReconfigureHandler /* function */;
  /* 0x002c */ void* ResetHandler /* function */;
  union
  {
    /* 0x0030 */ void* SendHandler /* function */;
    /* 0x0030 */ void* WanSendHandler /* function */;
  }; /* size: 0x0004 */
  /* 0x0034 */ void* SetInformationHandler /* function */;
  union
  {
    /* 0x0038 */ void* TransferDataHandler /* function */;
    /* 0x0038 */ void* WanTransferDataHandler /* function */;
  }; /* size: 0x0004 */
  /* 0x003c */ void* ReturnPacketHandler /* function */;
  /* 0x0040 */ void* SendPacketsHandler /* function */;
  /* 0x0044 */ void* AllocateCompleteHandler /* function */;
  /* 0x0048 */ void* CoCreateVcHandler /* function */;
  /* 0x004c */ void* CoDeleteVcHandler /* function */;
  /* 0x0050 */ void* CoActivateVcHandler /* function */;
  /* 0x0054 */ void* CoDeactivateVcHandler /* function */;
  /* 0x0058 */ void* CoSendPacketsHandler /* function */;
  /* 0x005c */ void* CoRequestHandler /* function */;
  /* 0x0060 */ void* CancelSendPacketsHandler /* function */;
  /* 0x0064 */ void* PnPEventNotifyHandler /* function */;
  /* 0x0068 */ void* AdapterShutdownHandler /* function */;
  /* 0x006c */ void* Reserved1;
  /* 0x0070 */ void* Reserved2;
  /* 0x0074 */ void* Reserved3;
  /* 0x0078 */ void* Reserved4;
} NDIS51_MINIPORT_CHARACTERISTICS, *PNDIS51_MINIPORT_CHARACTERISTICS; /* size: 0x007c */

typedef struct _NDIS_M_DRIVER_BLOCK
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ struct _NDIS_M_DRIVER_BLOCK* NextDriver;
  /* 0x0008 */ struct _NDIS_MINIPORT_BLOCK* MiniportQueue;
  /* 0x000c */ unsigned char MajorNdisVersion;
  /* 0x000d */ unsigned char MinorNdisVersion;
  /* 0x000e */ unsigned short Flags;
  /* 0x0010 */ struct _NDIS_WRAPPER_HANDLE* NdisDriverInfo;
  /* 0x0014 */ struct _DRIVER_OBJECT* DriverObject;
  /* 0x0018 */ struct _UNICODE_STRING ServiceRegPath;
  /* 0x0020 */ void* MiniportDriverContext;
  /* 0x0024 */ struct _NDIS_PROTOCOL_BLOCK* AssociatedProtocol;
  /* 0x0028 */ struct _LIST_ENTRY DeviceList;
  /* 0x0030 */ struct _NDIS_PENDING_IM_INSTANCE* PendingDeviceList;
  /* 0x0034 */ void* UnloadHandler /* function */;
  union
  {
    /* 0x0038 */ struct _NDIS_MINIPORT_DRIVER_CHARACTERISTICS MiniportDriverCharacteristics;
    /* 0x0038 */ struct _NDIS51_MINIPORT_CHARACTERISTICS MiniportCharacteristics;
  }; /* size: 0x007c */
  /* 0x00b4 */ struct _KEVENT MiniportsRemovedEvent;
  /* 0x00c4 */ struct _REFERENCE Ref;
  /* 0x00cc */ struct _KMUTANT IMStartRemoveMutex;
  /* 0x00ec */ void* IMStartRemoveMutexOwnerThread;
  /* 0x00f0 */ unsigned long DriverVersion;
  /* 0x00f4 */ struct _UNICODE_STRING ServiceName;
  /* 0x00fc */ void* CoCreateVcHandler /* function */;
  /* 0x0100 */ void* CoDeleteVcHandler /* function */;
  /* 0x0104 */ void* CoActivateVcHandler /* function */;
  /* 0x0108 */ void* CoDeactivateVcHandler /* function */;
  /* 0x010c */ void* CoSendNetBufferListsHandler /* function */;
  /* 0x0110 */ void* CoRequestHandler /* function */;
  /* 0x0114 */ void* CoOidRequestHandler /* function */;
  /* 0x0118 */ void* InitiateOffloadHandler /* function */;
  /* 0x011c */ void* TerminateOffloadHandler /* function */;
  /* 0x0120 */ void* UpdateOffloadHandler /* function */;
  /* 0x0124 */ void* InvalidateOffloadHandler /* function */;
  /* 0x0128 */ void* QueryOffloadHandler /* function */;
  /* 0x012c */ void* TcpOffloadSendHandler /* function */;
  /* 0x0130 */ void* TcpOffloadReceiveHandler /* function */;
  /* 0x0134 */ void* TcpOffloadDisconnectHandler /* function */;
  /* 0x0138 */ void* TcpOffloadForwardHandler /* function */;
  /* 0x013c */ void* TcpOffloadReceiveReturnHandler /* function */;
  /* 0x0140 */ struct _NDIS_CO_CALL_MANAGER_OPTIONAL_HANDLERS CallMgrChars;
  /* 0x018c */ void* AddDeviceHandler /* function */;
  /* 0x0190 */ void* RemoveDeviceHandler /* function */;
  /* 0x0194 */ void* FilterResourceRequirementsHandler /* function */;
  /* 0x0198 */ void* StartDeviceHandler /* function */;
} NDIS_M_DRIVER_BLOCK, *PNDIS_M_DRIVER_BLOCK; /* size: 0x019c */

typedef struct _NDIS_COMMON_OPEN_BLOCK
{
  union
  {
    /* 0x0000 */ void* MacHandle;
    /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  }; /* size: 0x0004 */
  /* 0x0004 */ void* BindingHandle;
  /* 0x0008 */ struct _NDIS_MINIPORT_BLOCK* MiniportHandle;
  /* 0x000c */ struct _NDIS_PROTOCOL_BLOCK* ProtocolHandle;
  /* 0x0010 */ void* ProtocolBindingContext;
  /* 0x0014 */ void* NextSendHandler /* function */;
  /* 0x0018 */ void* NextSendContext;
  /* 0x001c */ void* MiniportAdapterContext;
  /* 0x0020 */ unsigned char Reserved1;
  /* 0x0021 */ unsigned char CallingFromNdis6Protocol;
  /* 0x0022 */ unsigned char Reserved3;
  /* 0x0023 */ unsigned char Reserved4;
  /* 0x0024 */ void* NextReturnNetBufferListsHandler /* function */;
  /* 0x0028 */ unsigned long Reserved5;
  /* 0x002c */ void* NextReturnNetBufferListsContext;
  union
  {
    /* 0x0030 */ void* SendHandler /* function */;
    /* 0x0030 */ void* WanSendHandler /* function */;
  }; /* size: 0x0004 */
  /* 0x0034 */ void* TransferDataHandler /* function */;
  /* 0x0038 */ void* SendCompleteHandler /* function */;
  /* 0x003c */ void* TransferDataCompleteHandler /* function */;
  /* 0x0040 */ void* ReceiveHandler /* function */;
  /* 0x0044 */ void* ReceiveCompleteHandler /* function */;
  /* 0x0048 */ void* WanReceiveHandler /* function */;
  /* 0x004c */ void* RequestCompleteHandler /* function */;
  /* 0x0050 */ void* ReceivePacketHandler /* function */;
  /* 0x0054 */ void* SendPacketsHandler /* function */;
  /* 0x0058 */ void* ResetHandler /* function */;
  /* 0x005c */ void* RequestHandler /* function */;
  /* 0x0060 */ void* OidRequestHandler /* function */;
  /* 0x0064 */ void* ResetCompleteHandler /* function */;
  union
  {
    /* 0x0068 */ void* StatusHandler /* function */;
    /* 0x0068 */ void* StatusHandlerEx /* function */;
  }; /* size: 0x0004 */
  /* 0x006c */ void* StatusCompleteHandler /* function */;
  /* 0x0070 */ unsigned long Flags;
  /* 0x0074 */ long References;
  /* 0x0078 */ unsigned long SpinLock;
  /* 0x007c */ void* FilterHandle;
  /* 0x0080 */ unsigned int FrameTypeArraySize;
  /* 0x0084 */ unsigned short FrameTypeArray[4];
  /* 0x008c */ unsigned long ProtocolOptions;
  /* 0x0090 */ unsigned long CurrentLookahead;
  /* 0x0094 */ void* WSendHandler /* function */;
  /* 0x0098 */ void* WTransferDataHandler /* function */;
  /* 0x009c */ void* WSendPacketsHandler /* function */;
  /* 0x00a0 */ void* CancelSendPacketsHandler /* function */;
  /* 0x00a4 */ unsigned long WakeUpEnable;
  /* 0x00a8 */ struct _KEVENT* CloseCompleteEvent;
  /* 0x00ac */ struct _QUEUED_CLOSE QC;
  /* 0x00c0 */ long AfReferences;
  /* 0x00c4 */ struct _NDIS_OPEN_BLOCK* NextGlobalOpen;
  /* 0x00c8 */ struct _NDIS_OPEN_BLOCK* MiniportNextOpen;
  /* 0x00cc */ struct _NDIS_OPEN_BLOCK* ProtocolNextOpen;
  /* 0x00d0 */ struct _UNICODE_STRING* BindDeviceName;
  /* 0x00d4 */ struct _UNICODE_STRING* RootDeviceName;
  /* 0x00d8 */ struct _NDIS_OPEN_BLOCK* FilterNextOpen;
  /* 0x00dc */ unsigned int PacketFilters;
  /* 0x00e0 */ unsigned int OldPacketFilters;
  union
  {
    struct
    {
      /* 0x00e4 */ unsigned int MaxMulticastAddresses;
      /* 0x00e8 */ struct _ETH_MULTICAST_WRAPPER* MCastAddressBuf;
      /* 0x00ec */ unsigned int NumAddresses;
      /* 0x00f0 */ struct _ETH_MULTICAST_WRAPPER* OldMCastAddressBuf;
      /* 0x00f4 */ unsigned int OldNumAddresses;
    }; /* size: 0x0014 */
    struct
    {
      /* 0x00e4 */ unsigned long FunctionalAddress;
      /* 0x00e8 */ unsigned long OldFunctionalAddress;
      /* 0x00ec */ unsigned char UsingGroupAddress;
      /* 0x00ed */ unsigned char OldUsingGroupAddress;
      /* 0x00ee */ char Padding_53[2];
      /* 0x00f0 */ unsigned long FARefCount[32];
      /* 0x0170 */ unsigned long OldFARefCount[32];
      /* 0x01f0 */ unsigned char RSSParametersBuf[196];
      /* 0x02b4 */ struct _NDIS_RECEIVE_SCALE_PARAMETERS* NdisRSSParameters;
      /* 0x02b8 */ struct _SINGLE_LIST_ENTRY PatternList;
      /* 0x02bc */ void* ProtSendNetBufferListsComplete /* function */;
      /* 0x02c0 */ void* NextSendNetBufferListsComplete /* function */;
      /* 0x02c4 */ void* NextSendNetBufferListsCompleteContext;
      /* 0x02c8 */ void* SendCompleteNdisPacketContext;
      /* 0x02cc */ void* SendCompleteNetBufferListsContext;
      /* 0x02d0 */ void* ReceiveNetBufferLists /* function */;
      /* 0x02d4 */ void* ReceiveNetBufferListsContext;
      /* 0x02d8 */ void* SavedSendNBLHandler /* function */;
      /* 0x02dc */ void* SavedSendPacketsHandler /* function */;
      /* 0x02e0 */ void* SavedCancelSendPacketsHandler /* function */;
      union
      {
        /* 0x02e4 */ void* SavedSendHandler /* function */;
        /* 0x02e4 */ void* SavedWanSendHandler /* function */;
      }; /* size: 0x0004 */
      /* 0x02e8 */ void* InitiateOffloadCompleteHandler /* function */;
      /* 0x02ec */ void* TerminateOffloadCompleteHandler /* function */;
      /* 0x02f0 */ void* UpdateOffloadCompleteHandler /* function */;
      /* 0x02f4 */ void* InvalidateOffloadCompleteHandler /* function */;
      /* 0x02f8 */ void* QueryOffloadCompleteHandler /* function */;
      /* 0x02fc */ void* IndicateOffloadEventHandler /* function */;
      /* 0x0300 */ void* TcpOffloadSendCompleteHandler /* function */;
      /* 0x0304 */ void* TcpOffloadReceiveCompleteHandler /* function */;
      /* 0x0308 */ void* TcpOffloadDisconnectCompleteHandler /* function */;
      /* 0x030c */ void* TcpOffloadForwardCompleteHandler /* function */;
      /* 0x0310 */ void* TcpOffloadEventHandler /* function */;
      /* 0x0314 */ void* TcpOffloadReceiveIndicateHandler /* function */;
      /* 0x0318 */ unsigned long ProtocolMajorVersion;
      /* 0x031c */ void** IfBlock;
      /* 0x0320 */ struct _NDIS_SPIN_LOCK PnPStateLock;
      /* 0x0328 */ enum _NDIS_NDIS5_DRIVER_STATE PnPState;
      /* 0x032c */ enum _NDIS_OPEN_TRANSLATION_STATE TranslationState;
      /* 0x0330 */ int OutstandingSends;
      /* 0x0334 */ struct _NDIS_EVENT PauseEvent;
      /* 0x0344 */ void* Ndis5WanSendHandler /* function */;
      /* 0x0348 */ void* ProtSendCompleteHandler /* function */;
      /* 0x034c */ void* OidRequestCompleteHandler /* function */;
      /* 0x0350 */ void* OidRequestCompleteContext;
      /* 0x0354 */ void* SetInfoBuf;
      /* 0x0358 */ unsigned short SetInfoBufLen;
      /* 0x035a */ char Padding_54[2];
      /* 0x035c */ unsigned long RequestBuffer;
      /* 0x0360 */ unsigned long SetInfoOid;
      /* 0x0364 */ void* OidContext;
      /* 0x0368 */ long NumOfPauseRestartRequests;
      /* 0x036c */ enum _NDIS_OPEN_STATE State;
      /* 0x0370 */ struct _NDIS_OPEN_OFFLOAD* Offload;
      /* 0x0374 */ struct _NDIS_STATUS_UNBIND_WORKITEM* StatusUnbindWorkItem;
      /* 0x0378 */ unsigned __int64 DpcStartCycle;
      /* 0x0380 */ unsigned long NumberOfNetBufferLists;
      /* 0x0384 */ unsigned char ReceivedAPacket[32];
      /* 0x03a4 */ void* DirectOidRequestCompleteHandler /* function */;
      /* 0x03a8 */ void* DirectOidRequestHandler /* function */;
      /* 0x03ac */ void* DirectOidRequestCompleteContext;
    }; /* size: 0x02c8 */
  }; /* size: 0x02c8 */
} NDIS_COMMON_OPEN_BLOCK, *PNDIS_COMMON_OPEN_BLOCK; /* size: 0x03b0 */

typedef struct _NDIS_WRAPPER_HANDLE
{
  /* 0x0000 */ struct _DRIVER_OBJECT* DriverObject;
  /* 0x0004 */ struct _UNICODE_STRING ServiceRegPath;
} NDIS_WRAPPER_HANDLE, *PNDIS_WRAPPER_HANDLE; /* size: 0x000c */

typedef struct _NDIS_MINIPORT_STATS
{
  /* 0x0000 */ unsigned __int64 ifHCInOctets;
  /* 0x0008 */ unsigned __int64 ifHCInUcastOctets;
  /* 0x0010 */ unsigned __int64 ifHCInBroadcastOctets;
  /* 0x0018 */ unsigned __int64 ifHCInMulticastOctets;
  /* 0x0020 */ unsigned __int64 ifHCInUcastPkts;
  /* 0x0028 */ unsigned __int64 ifHCInMulticastPkts;
  /* 0x0030 */ unsigned __int64 ifHCInBroadcastPkts;
  /* 0x0038 */ unsigned __int64 ifHCOutOctets;
  /* 0x0040 */ unsigned __int64 ifHCOutUcastPkts;
  /* 0x0048 */ unsigned __int64 ifHCOutMulticastPkts;
  /* 0x0050 */ unsigned __int64 ifHCOutBroadcastPkts;
  /* 0x0058 */ unsigned __int64 ifHCOutUcastOctets;
  /* 0x0060 */ unsigned __int64 ifHCOutMulticastOctets;
  /* 0x0068 */ unsigned __int64 ifHCOutBroadcastOctets;
} NDIS_MINIPORT_STATS, *PNDIS_MINIPORT_STATS; /* size: 0x0070 */

typedef struct _OID_LIST
{
  /* 0x0000 */ unsigned long StatsOidCount;
  /* 0x0004 */ unsigned long FullOidCount;
  /* 0x0008 */ unsigned long* StatsOidArray;
  /* 0x000c */ unsigned long* FullOidArray;
} OID_LIST, *POID_LIST; /* size: 0x0010 */

typedef struct _CO_CALL_PARAMETERS
{
  /* 0x0000 */ unsigned long Flags;
  /* 0x0004 */ struct _CO_CALL_MANAGER_PARAMETERS* CallMgrParameters;
  /* 0x0008 */ struct _CO_MEDIA_PARAMETERS* MediaParameters;
} CO_CALL_PARAMETERS, *PCO_CALL_PARAMETERS; /* size: 0x000c */

typedef struct _CO_MEDIA_PARAMETERS
{
  /* 0x0000 */ unsigned long Flags;
  /* 0x0004 */ unsigned long ReceivePriority;
  /* 0x0008 */ unsigned long ReceiveSizeHint;
  /* 0x000c */ struct _CO_SPECIFIC_PARAMETERS MediaSpecific;
} CO_MEDIA_PARAMETERS, *PCO_MEDIA_PARAMETERS; /* size: 0x0018 */

typedef struct _NDIS_MINIPORT_OFFLOAD_BLOCK_LIST
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ struct _NDIS_MINIPORT_OFFLOAD_BLOCK_LIST* NextBlock;
  /* 0x0008 */ struct _NDIS_MINIPORT_OFFLOAD_BLOCK_LIST* DependentBlockList;
  /* 0x000c */ int Status;
  /* 0x0010 */ void* NdisReserved[2];
  /* 0x0018 */ void** MiniportOffloadContext;
  /* 0x001c */ void* NdisOffloadHandle;
  /* 0x0020 */ void* ProtocolReserved[2];
  /* 0x0028 */ void* MiniportReserved[2];
  /* 0x0030 */ void* ImReserved[2];
  /* 0x0038 */ void* Scratch[2];
  /* 0x0040 */ void* SourceHandle;
  /* 0x0044 */ unsigned long PortNumber;
  /* 0x0048 */ struct _NET_BUFFER_LIST* NetBufferListChain;
} NDIS_MINIPORT_OFFLOAD_BLOCK_LIST, *PNDIS_MINIPORT_OFFLOAD_BLOCK_LIST; /* size: 0x004c */

typedef struct _NDIS_PROTOCOL_OFFLOAD_BLOCK_LIST
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ struct _NDIS_PROTOCOL_OFFLOAD_BLOCK_LIST* NextBlock;
  /* 0x0008 */ struct _NDIS_PROTOCOL_OFFLOAD_BLOCK_LIST* DependentBlockList;
  /* 0x000c */ int Status;
  /* 0x0010 */ void* NdisReserved[3];
  /* 0x001c */ struct _NDIS_OFFLOAD_HANDLE* OffloadHandle;
  /* 0x0020 */ void* ProtocolReserved[2];
  /* 0x0028 */ void* MiniportReserved[2];
  /* 0x0030 */ void* ImReserved[2];
  /* 0x0038 */ void* Scratch[2];
  /* 0x0040 */ void* SourceHandle;
  /* 0x0044 */ unsigned long PortNumber;
  /* 0x0048 */ struct _NET_BUFFER_LIST* NetBufferListChain;
} NDIS_PROTOCOL_OFFLOAD_BLOCK_LIST, *PNDIS_PROTOCOL_OFFLOAD_BLOCK_LIST; /* size: 0x004c */

typedef struct _ETH_MULTICAST_WRAPPER
{
  /* 0x0000 */ unsigned long RefCount;
  /* 0x0004 */ unsigned char MCastAddress[6];
  /* 0x000a */ char __PADDING__[2];
} ETH_MULTICAST_WRAPPER, *PETH_MULTICAST_WRAPPER; /* size: 0x000c */

typedef struct _NDIS_OPEN_OFFLOAD
{
  /* 0x0000 */ struct _NDIS_OFFLOAD_ENCAPSULATION SetEncapsulation;
  /* 0x001c */ unsigned char AlreadySetEncapsulation;
  /* 0x001d */ char Padding_55[3];
  /* 0x0020 */ struct _NDIS_OFFLOAD_ENCAPSULATION XlateEncap;
  struct
  {
    /* 0x003c */ unsigned long Oid;
    /* 0x0040 */ void* Buffer;
    /* 0x0044 */ unsigned long BufferLength;
  } /* size: 0x000c */ Encapsulation;
  struct
  {
    /* 0x0048 */ unsigned long Oid;
    /* 0x004c */ void* Buffer;
    /* 0x0050 */ unsigned long BufferLength;
  } /* size: 0x000c */ Task;
} NDIS_OPEN_OFFLOAD, *PNDIS_OPEN_OFFLOAD; /* size: 0x0054 */

typedef struct _NDIS_CALL_MANAGER_CHARACTERISTICS
{
  /* 0x0000 */ unsigned char MajorVersion;
  /* 0x0001 */ unsigned char MinorVersion;
  /* 0x0002 */ unsigned short Filler;
  /* 0x0004 */ unsigned int Reserved;
  /* 0x0008 */ void* CmCreateVcHandler /* function */;
  /* 0x000c */ void* CmDeleteVcHandler /* function */;
  /* 0x0010 */ void* CmOpenAfHandler /* function */;
  /* 0x0014 */ void* CmCloseAfHandler /* function */;
  /* 0x0018 */ void* CmRegisterSapHandler /* function */;
  /* 0x001c */ void* CmDeregisterSapHandler /* function */;
  /* 0x0020 */ void* CmMakeCallHandler /* function */;
  /* 0x0024 */ void* CmCloseCallHandler /* function */;
  /* 0x0028 */ void* CmIncomingCallCompleteHandler /* function */;
  /* 0x002c */ void* CmAddPartyHandler /* function */;
  /* 0x0030 */ void* CmDropPartyHandler /* function */;
  /* 0x0034 */ void* CmActivateVcCompleteHandler /* function */;
  /* 0x0038 */ void* CmDeactivateVcCompleteHandler /* function */;
  /* 0x003c */ void* CmModifyCallQoSHandler /* function */;
  /* 0x0040 */ void* CmRequestHandler /* function */;
  /* 0x0044 */ void* CmRequestCompleteHandler /* function */;
} NDIS_CALL_MANAGER_CHARACTERISTICS, *PNDIS_CALL_MANAGER_CHARACTERISTICS; /* size: 0x0048 */

typedef struct _DMA_OPERATIONS
{
  /* 0x0000 */ unsigned long Size;
  /* 0x0004 */ void* PutDmaAdapter /* function */;
  /* 0x0008 */ void* AllocateCommonBuffer /* function */;
  /* 0x000c */ void* FreeCommonBuffer /* function */;
  /* 0x0010 */ void* AllocateAdapterChannel /* function */;
  /* 0x0014 */ void* FlushAdapterBuffers /* function */;
  /* 0x0018 */ void* FreeAdapterChannel /* function */;
  /* 0x001c */ void* FreeMapRegisters /* function */;
  /* 0x0020 */ void* MapTransfer /* function */;
  /* 0x0024 */ void* GetDmaAlignment /* function */;
  /* 0x0028 */ void* ReadDmaCounter /* function */;
  /* 0x002c */ void* GetScatterGatherList /* function */;
  /* 0x0030 */ void* PutScatterGatherList /* function */;
  /* 0x0034 */ void* CalculateScatterGatherList /* function */;
  /* 0x0038 */ void* BuildScatterGatherList /* function */;
  /* 0x003c */ void* BuildMdlFromScatterGatherList /* function */;
} DMA_OPERATIONS, *PDMA_OPERATIONS; /* size: 0x0040 */

typedef struct _SCATTER_GATHER_LIST
{
  /* 0x0000 */ unsigned long NumberOfElements;
  /* 0x0004 */ unsigned long Reserved;
  /* 0x0008 */ struct _SCATTER_GATHER_ELEMENT* Elements /* zero-length array */;
} SCATTER_GATHER_LIST, *PSCATTER_GATHER_LIST; /* size: 0x0008 */

typedef struct _MAP_REGISTER_ENTRY
{
  /* 0x0000 */ void* MapRegister;
  /* 0x0004 */ unsigned char WriteToDevice;
  /* 0x0005 */ char __PADDING__[3];
} MAP_REGISTER_ENTRY, *PMAP_REGISTER_ENTRY; /* size: 0x0008 */

typedef struct _NDIS_AF_LIST
{
  /* 0x0000 */ struct _NDIS_AF_LIST* NextAf;
  /* 0x0004 */ struct _NDIS_OPEN_BLOCK* Open;
  /* 0x0008 */ struct CO_ADDRESS_FAMILY AddressFamily;
  /* 0x0014 */ struct _NDIS_CALL_MANAGER_CHARACTERISTICS CmChars;
  /* 0x005c */ struct _NDIS_CO_CALL_MANAGER_OPTIONAL_HANDLERS CallMgrChars;
  /* 0x00a8 */ unsigned long NdisMajorVersion;
} NDIS_AF_LIST, *PNDIS_AF_LIST; /* size: 0x00ac */

typedef struct _NDIS_LOG
{
  /* 0x0000 */ struct _NDIS_MINIPORT_BLOCK* Miniport;
  /* 0x0004 */ unsigned long LogLock;
  /* 0x0008 */ struct _IRP* Irp;
  /* 0x000c */ unsigned int TotalSize;
  /* 0x0010 */ unsigned int CurrentSize;
  /* 0x0014 */ unsigned int InPtr;
  /* 0x0018 */ unsigned int OutPtr;
  /* 0x001c */ unsigned char LogBuf[1];
  /* 0x001d */ char __PADDING__[3];
} NDIS_LOG, *PNDIS_LOG; /* size: 0x0020 */

typedef struct _NDIS_FILTER_PARTIAL_CHARACTERISTICS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ void* SendNetBufferListsHandler /* function */;
  /* 0x000c */ void* SendNetBufferListsCompleteHandler /* function */;
  /* 0x0010 */ void* CancelSendNetBufferListsHandler /* function */;
  /* 0x0014 */ void* ReceiveNetBufferListsHandler /* function */;
  /* 0x0018 */ void* ReturnNetBufferListsHandler /* function */;
} NDIS_FILTER_PARTIAL_CHARACTERISTICS, *PNDIS_FILTER_PARTIAL_CHARACTERISTICS; /* size: 0x001c */

typedef struct _NDIS_FILTER_BLOCK
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ struct _NDIS_FILTER_BLOCK* NextFilter;
  /* 0x0008 */ struct _NDIS_FILTER_DRIVER_BLOCK* FilterDriver;
  /* 0x000c */ void* FilterModuleContext;
  /* 0x0010 */ struct _NDIS_MINIPORT_BLOCK* Miniport;
  /* 0x0014 */ struct _UNICODE_STRING* FilterInstanceName;
  /* 0x0018 */ struct _UNICODE_STRING* FilterFriendlyName;
  /* 0x001c */ struct _NDIS_RW_LOCK ReadWriteLock;
  /* 0x022c */ unsigned long Flags;
  /* 0x0230 */ enum _NDIS_FILTER_STATE State;
  /* 0x0234 */ struct _REFERENCE Ref;
  /* 0x023c */ int FakeStatus;
  /* 0x0240 */ struct _NDIS_FILTER_BLOCK* NextGlobalFilter;
  /* 0x0244 */ struct _NDIS_FILTER_BLOCK* LowerFilter;
  /* 0x0248 */ struct _NDIS_FILTER_BLOCK* HigherFilter;
  /* 0x024c */ struct _FILTER_PAUSE_RESTART_CONTEXT* AsyncOpContext;
  /* 0x0250 */ long NumOfPauseRestartRequests;
  /* 0x0254 */ unsigned long Lock;
  /* 0x0258 */ void* LockThread;
  /* 0x025c */ unsigned long LockDbg;
  /* 0x0260 */ struct _LIST_ENTRY OidRequestList;
  /* 0x0268 */ struct _NDIS_OID_REQUEST* PendingOidRequest;
  /* 0x026c */ struct _REFERENCE PnPRef;
  /* 0x0274 */ enum _NDIS_MEDIUM MediaType;
  /* 0x0278 */ enum _NDIS_PHYSICAL_MEDIUM PhysicalMediaType;
  /* 0x027c */ enum _NET_IF_MEDIA_CONNECT_STATE MediaConnectState;
  /* 0x0280 */ enum _NET_IF_MEDIA_DUPLEX_STATE MediaDuplexState;
  /* 0x0284 */ long Padding_56;
  /* 0x0288 */ unsigned __int64 XmitLinkSpeed;
  /* 0x0290 */ unsigned __int64 RcvLinkSpeed;
  /* 0x0298 */ enum _NDIS_SUPPORTED_PAUSE_FUNCTIONS PauseFunctions;
  /* 0x029c */ unsigned long AutoNegotiationFlags;
  /* 0x02a0 */ unsigned char XState;
  /* 0x02a1 */ unsigned char Reserved1;
  /* 0x02a2 */ unsigned char Reserved2;
  /* 0x02a3 */ unsigned char Reserved3;
  /* 0x02a4 */ enum _NET_IF_MEDIA_CONNECT_STATE MediaConnectStateIndicateUp;
  /* 0x02a8 */ enum _NET_IF_MEDIA_DUPLEX_STATE MediaDuplexStateIndicateUp;
  /* 0x02ac */ long Padding_57;
  /* 0x02b0 */ unsigned __int64 XmitLinkSpeedIndicateUp;
  /* 0x02b8 */ unsigned __int64 RcvLinkSpeedIndicateUp;
  /* 0x02c0 */ enum _NDIS_SUPPORTED_PAUSE_FUNCTIONS PauseFunctionsIndicateUp;
  /* 0x02c4 */ unsigned long AutoNegotiationFlagsIndicateUp;
  /* 0x02c8 */ void* NextRequestHandle;
  /* 0x02cc */ void* NextSendNetBufferListsHandler /* function */;
  /* 0x02d0 */ void* NextSendNetBufferListsContext;
  /* 0x02d4 */ void* NextSendNetBufferListsObject;
  /* 0x02d8 */ void* NextSendNetBufferListsCompleteHandler /* function */;
  /* 0x02dc */ void* NextSendNetBufferListsCompleteContext;
  /* 0x02e0 */ void* NextIndicateReceiveNetBufferListsHandler /* function */;
  /* 0x02e4 */ void* NextIndicateReceiveNetBufferListsContext;
  /* 0x02e8 */ void* NextReturnNetBufferListsHandler /* function */;
  /* 0x02ec */ void* NextReturnNetBufferListsContext;
  /* 0x02f0 */ void* NextIndicateStatusHandle;
  /* 0x02f4 */ void* NextDevicePnPEventNotifyHandle;
  /* 0x02f8 */ void* NextNetPnPEventHandle;
  /* 0x02fc */ void* NextCancelSendNetBufferListsHandler /* function */;
  /* 0x0300 */ void* NextCancelSendNetBufferListsContext;
  /* 0x0304 */ void* SetFilterModuleOptionalHandlers /* function */;
  /* 0x0308 */ struct _NDIS_FILTER_PARTIAL_CHARACTERISTICS Characteristics;
  /* 0x0324 */ struct _NDIS_FILTER_PARTIAL_CHARACTERISTICS SavedCharacteristics;
  /* 0x0340 */ void* OidRequestHandler /* function */;
  /* 0x0344 */ void* OidRequestCompleteHandler /* function */;
  /* 0x0348 */ void* CancelRequestHandler /* function */;
  /* 0x034c */ void* DevicePnPEventNotifyHandler /* function */;
  /* 0x0350 */ void* NetPnPEventHandler /* function */;
  /* 0x0354 */ void* StatusHandler /* function */;
  /* 0x0358 */ void* FilterSendNetBufferListsHandler /* function */;
  /* 0x035c */ void* FilterIndicateReceiveNetBufferListsHandler /* function */;
  /* 0x0360 */ void* FilterCancelSendNetBufferListsHandler /* function */;
  /* 0x0364 */ void* InitiateOffloadCompleteHandler /* function */;
  /* 0x0368 */ void* TerminateOffloadCompleteHandler /* function */;
  /* 0x036c */ void* UpdateOffloadCompleteHandler /* function */;
  /* 0x0370 */ void* InvalidateOffloadCompleteHandler /* function */;
  /* 0x0374 */ void* QueryOffloadCompleteHandler /* function */;
  /* 0x0378 */ void* IndicateOffloadEventHandler /* function */;
  /* 0x037c */ void* TcpOffloadSendCompleteHandler /* function */;
  /* 0x0380 */ void* TcpOffloadReceiveCompleteHandler /* function */;
  /* 0x0384 */ void* TcpOffloadDisconnectCompleteHandler /* function */;
  /* 0x0388 */ void* TcpOffloadForwardCompleteHandler /* function */;
  /* 0x038c */ void* TcpOffloadEventHandler /* function */;
  /* 0x0390 */ void* TcpOffloadReceiveIndicateHandler /* function */;
  /* 0x0394 */ void* InitiateOffloadHandler /* function */;
  /* 0x0398 */ void* TerminateOffloadHandler /* function */;
  /* 0x039c */ void* UpdateOffloadHandler /* function */;
  /* 0x03a0 */ void* InvalidateOffloadHandler /* function */;
  /* 0x03a4 */ void* QueryOffloadHandler /* function */;
  /* 0x03a8 */ void* TcpOffloadSendHandler /* function */;
  /* 0x03ac */ void* TcpOffloadReceiveHandler /* function */;
  /* 0x03b0 */ void* TcpOffloadDisconnectHandler /* function */;
  /* 0x03b4 */ void* TcpOffloadForwardHandler /* function */;
  /* 0x03b8 */ void* TcpOffloadReceiveReturnHandler /* function */;
  /* 0x03bc */ struct _NDIS_FILTER_TASK_OFFLOAD* Offload;
  /* 0x03c0 */ struct _GUID InterfaceGuid;
  /* 0x03d0 */ unsigned long IfIndex;
  /* 0x03d4 */ struct _NDIS_IF_BLOCK* IfBlock;
  /* 0x03d8 */ void* DirectOidRequestHandler /* function */;
  /* 0x03dc */ void* DirectOidRequestCompleteHandler /* function */;
  /* 0x03e0 */ void* NextDirectRequestHandle;
  /* 0x03e4 */ unsigned long DirectOidRequestCount;
  /* 0x03e8 */ void* CancelDirectOidRequestHandler /* function */;
  /* 0x03ec */ long __PADDING__[1];
} NDIS_FILTER_BLOCK, *PNDIS_FILTER_BLOCK; /* size: 0x03f0 */

typedef struct _NDIS_FILTER_DRIVER_BLOCK
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ struct _NDIS_FILTER_DRIVER_BLOCK* NextFilterDriver;
  /* 0x0008 */ struct _DRIVER_OBJECT* DriverObject;
  /* 0x000c */ struct _NDIS_FILTER_BLOCK* FilterQueue;
  /* 0x0010 */ void* FilterDriverContext;
  /* 0x0014 */ unsigned long Lock;
  /* 0x0018 */ unsigned long Flags;
  /* 0x001c */ struct _LIST_ENTRY DeviceList;
  /* 0x0024 */ struct _REFERENCE Ref;
  /* 0x002c */ struct _NDIS_FILTER_DRIVER_CHARACTERISTICS DefaultFilterCharacteristics;
  /* 0x00a0 */ void* InitiateOffloadCompleteHandler /* function */;
  /* 0x00a4 */ void* TerminateOffloadCompleteHandler /* function */;
  /* 0x00a8 */ void* UpdateOffloadCompleteHandler /* function */;
  /* 0x00ac */ void* InvalidateOffloadCompleteHandler /* function */;
  /* 0x00b0 */ void* QueryOffloadCompleteHandler /* function */;
  /* 0x00b4 */ void* IndicateOffloadEventHandler /* function */;
  /* 0x00b8 */ void* TcpOffloadSendCompleteHandler /* function */;
  /* 0x00bc */ void* TcpOffloadReceiveCompleteHandler /* function */;
  /* 0x00c0 */ void* TcpOffloadDisconnectCompleteHandler /* function */;
  /* 0x00c4 */ void* TcpOffloadForwardCompleteHandler /* function */;
  /* 0x00c8 */ void* TcpOffloadEventHandler /* function */;
  /* 0x00cc */ void* TcpOffloadReceiveIndicateHandler /* function */;
  /* 0x00d0 */ void* InitiateOffloadHandler /* function */;
  /* 0x00d4 */ void* TerminateOffloadHandler /* function */;
  /* 0x00d8 */ void* UpdateOffloadHandler /* function */;
  /* 0x00dc */ void* InvalidateOffloadHandler /* function */;
  /* 0x00e0 */ void* QueryOffloadHandler /* function */;
  /* 0x00e4 */ void* TcpOffloadSendHandler /* function */;
  /* 0x00e8 */ void* TcpOffloadReceiveHandler /* function */;
  /* 0x00ec */ void* TcpOffloadDisconnectHandler /* function */;
  /* 0x00f0 */ void* TcpOffloadForwardHandler /* function */;
  /* 0x00f4 */ void* TcpOffloadReceiveReturnHandler /* function */;
  /* 0x00f8 */ void* SetInfoBuf;
  /* 0x00fc */ unsigned long RequestBuffer;
  /* 0x0100 */ unsigned short SetInfoBufLen;
  /* 0x0102 */ char Padding_58[2];
  /* 0x0104 */ enum _NDIS_FILTER_TYPE FilterType;
  /* 0x0108 */ enum _NDIS_FILTER_RUN_TYPE FilterRunType;
  /* 0x010c */ struct _UNICODE_STRING FilterClass;
} NDIS_FILTER_DRIVER_BLOCK, *PNDIS_FILTER_DRIVER_BLOCK; /* size: 0x0114 */

typedef struct _NDIS_FILTER_ATTACH_PARAMETERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long IfIndex;
  /* 0x0008 */ union _NET_LUID_LH NetLuid;
  /* 0x0010 */ struct _UNICODE_STRING* FilterModuleGuidName;
  /* 0x0014 */ unsigned long BaseMiniportIfIndex;
  /* 0x0018 */ struct _UNICODE_STRING* BaseMiniportInstanceName;
  /* 0x001c */ struct _UNICODE_STRING* BaseMiniportName;
  /* 0x0020 */ enum _NET_IF_MEDIA_CONNECT_STATE MediaConnectState;
  /* 0x0024 */ enum _NET_IF_MEDIA_DUPLEX_STATE MediaDuplexState;
  /* 0x0028 */ unsigned __int64 XmitLinkSpeed;
  /* 0x0030 */ unsigned __int64 RcvLinkSpeed;
  /* 0x0038 */ enum _NDIS_MEDIUM MiniportMediaType;
  /* 0x003c */ enum _NDIS_PHYSICAL_MEDIUM MiniportPhysicalMediaType;
  /* 0x0040 */ void* MiniportMediaSpecificAttributes;
  /* 0x0044 */ struct _NDIS_OFFLOAD* DefaultOffloadConfiguration;
  /* 0x0048 */ unsigned short MacAddressLength;
  /* 0x004a */ unsigned char CurrentMacAddress[32];
  /* 0x006a */ char Padding_59[6];
  /* 0x0070 */ union _NET_LUID_LH BaseMiniportNetLuid;
  /* 0x0078 */ unsigned long LowerIfIndex;
  /* 0x007c */ long Padding_60;
  /* 0x0080 */ union _NET_LUID_LH LowerIfNetLuid;
  /* 0x0088 */ unsigned long Flags;
  /* 0x008c */ struct _NDIS_HD_SPLIT_CURRENT_CONFIG* HDSplitCurrentConfig;
} NDIS_FILTER_ATTACH_PARAMETERS, *PNDIS_FILTER_ATTACH_PARAMETERS; /* size: 0x0090 */

typedef struct _NDIS_IF_PROVIDER_CHARACTERISTICS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ void* QueryObjectHandler /* function */;
  /* 0x0008 */ void* SetObjectHandler /* function */;
  /* 0x000c */ void* Reserved1;
  /* 0x0010 */ void* Reserved2;
} NDIS_IF_PROVIDER_CHARACTERISTICS, *PNDIS_IF_PROVIDER_CHARACTERISTICS; /* size: 0x0014 */

typedef struct _NDIS_IF_PROVIDER_BLOCK
{
  /* 0x0000 */ struct _LIST_ENTRY Link;
  /* 0x0008 */ struct _LIST_ENTRY IfList;
  /* 0x0010 */ void* IfProviderContext;
  /* 0x0014 */ struct _NDIS_IF_PROVIDER_CHARACTERISTICS ProviderCharacteristics;
} NDIS_IF_PROVIDER_BLOCK, *PNDIS_IF_PROVIDER_BLOCK; /* size: 0x0028 */

typedef struct _NDIS_IF_NETWORK_BLOCK
{
  /* 0x0000 */ struct _LIST_ENTRY Link;
  /* 0x0008 */ struct _LIST_ENTRY CompartmentLink;
  /* 0x0010 */ struct _GUID NetworkGuid;
  /* 0x0020 */ struct _NDIS_IF_COMPARTMENT_BLOCK* Compartment;
  /* 0x0024 */ struct _LIST_ENTRY InterfaceLink;
  /* 0x002c */ unsigned long Flags;
  /* 0x0030 */ long Ref;
  /* 0x0034 */ struct _NDIS_NSI_NETWORK_RW NetworkInfo;
  /* 0x0244 */ struct _KEVENT* AsyncEvent;
} NDIS_IF_NETWORK_BLOCK, *PNDIS_IF_NETWORK_BLOCK; /* size: 0x0248 */

typedef struct _NDIS_PKT_POOL
{
  /* 0x0000 */ unsigned long Tag;
  /* 0x0004 */ unsigned short PacketLength;
  /* 0x0006 */ unsigned short PktsPerBlock;
  /* 0x0008 */ unsigned short MaxBlocks;
  /* 0x000a */ unsigned short StackSize;
  /* 0x000c */ long BlocksAllocated;
  /* 0x0010 */ unsigned long ProtocolId;
  /* 0x0014 */ unsigned long BlockSize;
  /* 0x0018 */ void* Allocator;
  /* 0x001c */ unsigned long Lock;
  /* 0x0020 */ struct _LIST_ENTRY FreeBlocks;
  /* 0x0028 */ struct _LIST_ENTRY UsedBlocks;
  /* 0x0030 */ struct _LIST_ENTRY AgingBlocks;
  /* 0x0038 */ struct _LIST_ENTRY GlobalPacketPoolList;
  /* 0x0040 */ union _LARGE_INTEGER NextScavengeTick;
} NDIS_PKT_POOL, *PNDIS_PKT_POOL; /* size: 0x0048 */

typedef union _STACK_INDEX
{
  union
  {
    /* 0x0000 */ unsigned __int64 Alignment;
    struct
    {
      /* 0x0000 */ unsigned long XferDataIndex;
      /* 0x0004 */ unsigned long Index;
    }; /* size: 0x0008 */
  }; /* size: 0x0008 */
} STACK_INDEX, *PSTACK_INDEX; /* size: 0x0008 */

typedef struct _NDIS_PKT_POOL_HDR
{
  /* 0x0000 */ struct _LIST_ENTRY List;
  /* 0x0008 */ union _LARGE_INTEGER TimeStamp;
  /* 0x0010 */ union _SLIST_HEADER FreeList;
  /* 0x0018 */ enum _POOL_BLOCK_TYPE State;
  /* 0x001c */ long __PADDING__[1];
} NDIS_PKT_POOL_HDR, *PNDIS_PKT_POOL_HDR; /* size: 0x0020 */

/*
@XFilterLockHandler@8
@_EH4_CallFilterFunc@8
@_EH4_GlobalUnwind@4
@_EH4_LocalUnwind@16
@_EH4_TransferToHandler@8
@__security_check_cookie@4
@ndisDereferenceMDriverRef@4
@ndisDereferencePackage@4
@ndisDereferenceRef@4
@ndisDereferenceULongRef@4
@ndisMDeferredSend@4
@ndisMDeferredSendPackets@4
@ndisMDeferredSendPacketsSG@4
@ndisMDeferredSendSG@4
@ndisMStartWanSends@4
@ndisReferencePackage@4
@ndisReferenceRef@4
@ndisReferenceRefNoCheck@4
@ndisReferenceULongRef@4
@ndisReferenceULongRefNoCheck@4
_AddNetConfigOpsAce@8
_AdjustOffloadContext@12
_AllocateChannel@4
_AllocateDescriptorList@8
_ClearStats@4
_CmRegUtilCreateUcKey@28
_CmRegUtilCreateWstrKey@28
_CmRegUtilOpenExistingUcKey@16
_CmRegUtilOpenExistingWstrKey@16
_CmRegUtilUcValueGetDword@16
_CmRegUtilUcValueGetFullBuffer@20
_CmRegUtilUcValueSetFullBuffer@20
_CmRegUtilUcValueSetUcString@12
_CmRegUtilWstrValueGetDword@16
