enum _SYSTEM_INFORMATION_CLASS;
struct _GUID;
enum _SE_AUDIT_OPERATION;
enum tagTYPEFLAGS;
struct IInternetProtocolSink;
struct _JOBOBJECT_SECURITY_LIMIT_INFORMATION;
struct Windows::AutoPODBase<_LUNICODE_STRING,Windows::Auto<_LUNICODE_STRING> >::is_pointer<_LUNICODE_STRING>;
enum _PROC_THREAD_ATTRIBUTE_NUM;
struct _CRYPTOAPI_BLOB;
struct _SEALING_TIMESTAMP_ATTRIBUTE;
struct _SYSTEM_HANDLE_TABLE_ENTRY_INFO_EX;
struct Windows::Foundation::Collections::IIterable_impl<Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,IInspectable *> *>;
enum _SYSDBG_COMMAND;
struct IPersistPropertyBag;
enum PackageOrigin;
struct XSAVE_CPU_INFO;
enum POWER_INFORMATION_LEVEL;
struct _SD_ENUM_SDS_INPUT;
enum _TOKEN_SECURITY_ATTRIBUTE_OPERATION;
struct _SYSTEM_KERNEL_DEBUGGER_INFORMATION_EX;
struct tagRemBRUSH;
enum _BIN_TYPES;
struct _RTL_CONDITION_VARIABLE;
enum WELL_KNOWN_SID_TYPE;
enum VARENUM;
struct tagSWindowData;
class CAptCallCtrl;
enum DISK_CACHE_RETENTION_PRIORITY;
struct _SYSTEM_CONSOLE_INFORMATION;
enum POWER_ACTION;
struct _NCryptAlgorithmName;
enum _PARTITION_STYLE;
struct tagNMHDR;
struct IWeakReference;
struct IRpcSyntaxNegotiate;
struct tagRECT;
struct tagMCI_OVLY_LOAD_PARMSW;
enum _system_handle_t;
struct _SD_CHANGE_MACHINE_SID_INPUT;
enum SHSTOCKICONID;
struct _SYSTEM_QUERY_TIME_ADJUST_INFORMATION;
struct DLGITEMTEMPLATE;
enum _WRITE_CACHE_ENABLE;
struct IProgressNotify;
enum _tagQUERYOPTION;
struct AsyncIAdviseSink;
struct HMIDI__;
enum _COPYFILE2_MESSAGE_TYPE;

struct __vc_attributes::atl::support_error_infoAttribute;
class Windows::Auto<void *>;
struct __vc_attributes::atl::perf_counterAttribute;
class Microsoft::WRL::ComPtr<ICallingProcessInfo>;
struct _MODULE_TYPE_INFO;
struct tagCInterfaceStubHeader;
struct tagCInterfaceStubVtbl;
struct __vc_attributes::no_injected_textAttribute;
struct __vc_attributes::caseAttribute;
struct __vc_attributes::entryAttribute;
struct _PRINTER_DEFAULTSW;
struct __vc_attributes::event_sourceAttribute;
class CDirSect;
struct __vc_attributes::implementsAttribute;
struct __vc_attributes::last_isAttribute;
struct __vc_attributes::helper_attributes::source_annotation_attributeAttribute;
struct _FORM_INFO_2A;
struct __vc_attributes::helper_attributes::as_stringAttribute;
struct tagMCI_SYSINFO_PARMSW;
struct __vc_attributes::helper_attributes::multi_valueAttribute;
struct __vc_attributes::noncreatableAttribute;
struct Windows::Foundation::Collections::IKeyValuePair_impl<unsigned int,IWeakReference *>;
struct __vc_attributes::appobjectAttribute;
struct __vc_attributes::importidlAttribute;
struct Microsoft::WRL::RuntimeClassFlags<14>;
class CWorldSecurityDescriptor;
struct __vc_attributes::v1_enumAttribute;
struct __vc_attributes::helpcontextAttribute;
class CEnumContextProps;
struct tagOCPFIPARAMS;
struct _PORT_INFO_1A;
class CBasedSStreamPtr;
class CBasedPubStreamPtr;
class CPubMappedStream;
class CPubStream;
struct __vc_attributes::helpfileAttribute;
class CBasedVectBitsPtr;
class Windows::AutoOperatorAmpersandConstHelper<Windows::Rtl::IRtlROFOStream *,Windows::Auto<Windows::Rtl::IRtlROFOStream *> >;
class MapEnumToSQMData<enum Ole32SQMFlags>;
struct __vc_attributes::transmit_asAttribute;
struct _DEVICEDUMP_STRUCTURE_VERSION;
struct _DEVICEDUMP_SUBSECTION_POINTER;
struct _DEVICEDUMP_STORAGEDEVICE_DATA;
struct __vc_attributes::library_blockAttribute;
struct _CrtMemState;
struct tagMCI_STATUS_PARMS;
struct __vc_attributes::ms_unionAttribute;
class RegistryKey::ValueInformationClass<_KEY_VALUE_PARTIAL_INFORMATION_ALIGN64>;
struct _CREATE_DISK;
struct Windows::Foundation::Collections::IVector_impl<Windows::Foundation::Collections::IKeyValuePair<IInspectable *,IInspectable *> *,1>;
struct __vc_attributes::includelibAttribute;
class ARI::AutoPtrAriHeap<_TOKEN_SECURITY_ATTRIBUTES_INFORMATION>;
struct tagMCI_OPEN_PARMSW;
struct _FILE_PIPE_REMOTE_INFORMATION;
struct _FILE_ID_BOTH_DIR_INFO;
class Microsoft::WRL::Details::ComPtrRefBase<Microsoft::WRL::ComPtr<IClipboardBrokerInternal> >;
struct _CERT_QC_STATEMENTS_EXT_INFO;
struct _NETCONNECTINFOSTRUCT;
struct _JOB_INFO_3;
struct IOleDragDropBrokerHost;
struct tagALTTABINFO;
struct _FILE_IS_REMOTE_DEVICE_INFORMATION;
class Windows::AutoOperatorAmpersandConstHelper<_LUTF8_STRING,Windows::Auto<_LUTF8_STRING> >;
struct _CMSG_CTRL_VERIFY_SIGNATURE_EX_PARA;
class CNtfsSTATSTGArray;
struct XMLDOMDocumentEvents;
struct tagContexts;
struct Windows::ErrorHandling::StatusTypeHRESULT;
struct _UMS_SYSTEM_THREAD_INFORMATION;
struct tagOIDData;
struct tagPROPERTYSETHEADER;
class CBrokeredClipDataObject::{dtor}::__l9::<lambda_30e4c9e7787e420af8ecb72a8a05c286>;
struct _STORAGE_DEVICE_RESILIENCY_DESCRIPTOR;
struct MarshalingContextAttributeValue;
struct tagMOUSEHOOKSTRUCTEX;
class CReadOnlyStorage::EnumElements::__l3::<lambda_3fc84acab2c795828ee52d143f002bae>;
struct Windows::Foundation::IReferenceArray_impl<short>;
struct tagMCI_OVLY_OPEN_PARMSA;
struct _TRANSACTION_LIST_INFORMATION;
class CExpParameterValidate;
struct _PSP;
struct _NCRYPT_CIPHER_PADDING_INFO;
struct _INDIRECTPROPERTY;
struct IActivationSecurityInfo;
struct _FSCTL_OFFLOAD_READ_INPUT;
struct _IMAGE_FUNCTION_ENTRY;
struct IEnumRGBQuad;
struct tagMEASUREITEMSTRUCT;
struct _CRYPT_TIMESTAMP_PARA;
struct tagMIXERCONTROLDETAILS_LISTTEXTA;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<CBrokeredClipDataObject> const >;
struct _JOURNAL_SET_KEY_LAST_WRITE_TIME_INFORMATION;
struct _FILE_RENAME_INFO;
struct tagNFFCONTROLBITS;
struct _COUNTED_REASON_CONTEXT;
struct _SHSTOCKICONINFO;
struct INTERFACE_HELPER_CLSID;
struct tagSTGOPTIONS;
struct IComCatalog2;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IEnumFORMATETC> >;
struct _RTL_UNLOAD_EVENT_TRACE;
class Microsoft::WRL::Details::ComPtrRefBase<Microsoft::WRL::ComPtr<IEnumFORMATETC> >;
struct _DISK_RECORD;
class std::bad_alloc;
struct tagMCI_WAVE_OPEN_PARMSW;
struct SysInfo;
struct _ATOM_TABLE_INFORMATION;
struct Windows::Foundation::IReferenceArray<unsigned int>;
class CMemBytes;
struct _exception;
struct _BOOT_ENTROPY_NT_RESULT;
struct _FILE_REMOTE_PROTOCOL_INFORMATION;
struct _OCSP_SIGNED_REQUEST_INFO;
struct VerbList;
struct _GET_DISK_ATTRIBUTES;
struct _SOURCEFILEW;
struct _FILE_SYSTEM_RECOGNITION_INFORMATION;
struct _STORAGE_PRIORITY_HINT_SUPPORT;
struct _UNICODE_PREFIX_TABLE;
class Microsoft::WRL::ComPtr<CFormatOnlyDataObject>;
class BUCL::CConvertToUnsignedType<int>;
struct _PROCESS_SESSION_INFORMATION;
struct _SYSTEM_CONTEXT_SWITCH_INFORMATION;
struct Windows::Foundation::IReferenceArray<Windows::Foundation::TimeSpan>;
struct _MINIDUMP_THREAD_EX_LIST;
struct IFillInfo;
struct _CONTEXT_EX;
struct Windows::Foundation::Collections::IIterator<Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,IInspectable *> *>;
struct INdrVersion;
class Microsoft::WRL::Details::RuntimeClass<Microsoft::WRL::Details::InterfaceList<IUnknown,Microsoft::WRL::Details::Nil>,Microsoft::WRL::RuntimeClassFlags<14>,0,0,0>;
class BUCL::CConvertToSignedType<unsigned char>;
struct _SERVICE_DESCRIPTIONW;
class CLocalAlloc;
struct _BCRYPT_DH_PARAMETER_HEADER;
class SafeIStream;
class BUCL::CIsSignedType<unsigned int>;
struct _CMC_DATA_INFO;
struct Windows::Foundation::Collections::IVector<double>;
struct _tagSTACKFRAME64;
struct CDdeObject::CDataObjectImpl;
struct _MEMORY_COMBINE_INFORMATION;
class Microsoft::WRL::RuntimeClass<Microsoft::WRL::RuntimeClassFlags<2>,IUnknown,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil>;
struct _RGNDATA;
struct tagEMREXTFLOODFILL;
struct _CMSG_SIGNED_AND_ENVELOPED_ENCODE_INFO;
class CMap<unsigned short *,unsigned short * &,unsigned long,unsigned long &>;
class CRefcountedObject;
struct tagRAWINPUTDEVICE;
struct tagRECT16;
struct _KEY_WRITE_TIME_INFORMATION;
struct DDEDATA;
class CFILETIME;
struct tagMethodInfo;
struct IPersistStreamInit;
struct _RTL_VERIFIER_RUNTIME_FLAGS_INFORMATION;
struct _CRYPT_PROVIDER_DEFUSAGE;
struct HAS_INTERFACES;
struct _CRYPT_SEQUENCE_OF_ANY;
struct IOleInPlaceUIWindowVtbl;
class SafeCastHelper<unsigned long,long,1>;
struct _SYSTEM_PROCESSOR_PROFILE_CONTROL_AREA;
struct _WIN32_FIND_STREAM_DATA;
struct tagInstantiationInfoData;
class InstantiationInfo;
struct _FILE_FULL_DIR_INFO;
struct _OFLONGSTRUCTA;
struct _MINIDUMP_TOKEN_INFO_HEADER;
struct _EV_EXTRA_CERT_CHAIN_POLICY_PARA;
class CUrlMonWrapper;
class MAP_KEY_GUID;
class Map<MAP_KEY_GUID,MD_INTERFACE *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>::Assoc;
struct _CERT_REGISTRY_STORE_CLIENT_GPT_PARA;
struct HSPRITE__;
struct _PACKAGE_INFO_REFERENCE;
class Windows::Rtl::AutoString<_LUNICODE_STRING,Windows::Auto<_LUNICODE_STRING> >;
struct _MEMORY_WORKING_SET_EX_INFORMATION;
struct IRunAsClipboard;
struct _TP_POOL_STACK_INFORMATION;
struct Windows::Rtl::IRtlBlobProvider;
struct _RPC_SECURITY_QOS_V4_W;
class InitializeAndReadIsAppContainer::__l3::<lambda_b7c861d8b6348e202f1d29af619d8af4>;
class BUCL::CConvertToUnsignedType<unsigned short>;
struct _NCRYPT_KEY_BLOB_HEADER;
struct tagMCI_ANIM_WINDOW_PARMSA;
struct _PLUGPLAY_CONTROL_TARGET_RELATION_DATA;
class CLimitedWritableStorage::MoveElementTo::__l9::<lambda_66c09707baf813c245783b7b81b2c37e>;
struct DISPLAYCONFIG_SOURCE_DEVICE_NAME;
struct _MANAGEDAPPLICATION;
struct _CAT_MEMBERINFO2;
struct tagEMRCREATEBRUSHINDIRECT;
class CLimitedEnum<IEnumFORMATETC,tagFORMATETC>::Clone::__l3::<lambda_73e982d607c2e23834cd4f112f0eafad>;
struct _JOBOBJECT_BASIC_UI_RESTRICTIONS;
class BUCL::CByteAllocator;
struct tagSTYLEBUFA;
struct _FILE_NUMA_NODE_INFORMATION;
struct _MINIDUMP_USER_STREAM;
class Microsoft::WRL::Details::ComPtrRefBase<Microsoft::WRL::ComPtr<IRuntimeBroker> >;
struct _SECURITY_CAPABILITIES;
class CDragDropBroker;
struct _PROCESS_WINDOW_INFORMATION;
struct _TRANSACTION_NOTIFICATION;
struct _EFS_RPC_BLOB;
struct _COMMTIMEOUTS;
class BUCL::CIsSignedType<unsigned short>;
class CRtlSmartUcsEncoderTraitsBase<CRtlSmartUcsEncoderTraits<_LUNICODE_STRING> >;
struct IConnectionPoint;
struct _CMSG_CMS_SIGNER_INFO;
struct IIdentifyHive;
struct _TOKEN_PRIMARY_GROUP;
class CBasedDeltaListPtr;
struct tagPELARRAY;
struct _PROCESS_DEVICEMAP_INFORMATION_EX;
struct _MINIDUMP_UNLOADED_MODULE_LIST;
struct tagI_RpcProxyCallbackInterface;
struct _SQM_STREAM_ENTRY_EX;
struct tagMCI_VD_PLAY_PARMS;
class CEMfObject;
class Windows::AutoPointerBase<Windows::Rtl::IRtlWOFOStream *,Windows::Auto<Windows::Rtl::IRtlWOFOStream *> >;
class CAutoHandle_Policy<HMENU__ *>;
struct Windows::Foundation::Collections::IMap<HSTRING__ *,unsigned char>;
struct joyinfo_tag;
class Windows::AutoOperatorAmpersandHelper<_UNICODE_STRING,Windows::Auto<_UNICODE_STRING> >;
struct Windows::Foundation::Collections::IIterator<Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,Windows::Foundation::Collections::IVector<HSTRING__ *> *> *>;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IStream> >;
class Windows::AutoOperatorAmpersandConstHelper<Windows::Rtl::IRtlUtf16LEStringBuilder *,Windows::Auto<Windows::Rtl::IRtlUtf16LEStringBuilder *> >;
struct tagMCI_VD_STEP_PARMS;
class COleStaticLock;
struct midiproptimediv_tag;
struct tagWAVEOUTCAPS2A;
struct Windows::Foundation::Collections::IIterable<Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,IWeakReference *> *>;
struct Windows::Foundation::Collections::IMap<HSTRING__ *,Windows::Foundation::Collections::IVector<HSTRING__ *> *>;
struct Windows::Foundation::Collections::IMapView<HSTRING__ *,Windows::Foundation::Collections::IVector<HSTRING__ *> *>;
struct _QUERY_SERVICE_CONFIGA;
struct _STORAGE_IDLE_POWERUP_REASON;
struct Microsoft::WRL::Details::BoolStruct;
struct tagPROPHEADER;
class CArray<CPropertySection *,CPropertySection * &>;
class CPropertySet;
struct _FILE_PROCESS_IDS_USING_FILE_INFORMATION;
struct IUserTokenWithImpersonate;
struct Windows::Foundation::Collections::IVectorView<unsigned int>;
struct Windows::Foundation::Collections::IIterator<Windows::Foundation::Collections::IKeyValuePair<IInspectable *,IInspectable *> *>;
struct _COVERAGE_UNLOADED_MODULE_ENTRY;
struct Windows::Foundation::Collections::IIterator<Windows::Foundation::Collections::IPropertySet *>;
struct _tagCODEBASEHOLD;
struct _TRANSMIT_FILE_BUFFERS;
struct _DSA;
struct _CRT_CRITICAL_SECTION;
class streambuf;
class Microsoft::WRL::ComPtr<IClipboardBroker>;
struct IRemUnknown;
struct Windows::Foundation::Collections::IMap<unsigned int,HSTRING__ *>;
struct _BCRYPT_DH_KEY_BLOB;
class CFileMoniker;
struct IAllowAstaToAstaDeadlockRisk;
struct tagMCI_VD_ESCAPE_PARMSA;
class CLimitedEnum<IEnumSTATSTG,tagSTATSTG>::Next::__l3::<lambda_0e2861488e0205516e72f64d2a93d47e>;
struct HGESTUREINFO__;
struct tagMCI_OVLY_SAVE_PARMSA;
struct _KLDR_DATA_TABLE_ENTRY32;
struct _STORAGE_MINIPORT_DESCRIPTOR;
struct _TXFS_LIST_TRANSACTIONS_ENTRY;
class ITrackingMoniker;
struct tagPSDA;
struct Windows::Foundation::Collections::IMap<unsigned int,IInspectable *>;
struct Windows::Foundation::Collections::IMapView<unsigned int,IInspectable *>;
struct _PLUGPLAY_CONTROL_CONFLICT_STRINGS;
struct _MUTANT_OWNER_INFORMATION;
struct COPYFILE2_EXTENDED_PARAMETERS;
class CBindCtx::CObjList;
struct _DATATYPES_INFO_1W;
struct BITMAPV5HEADER;
struct _PROVIDOR_INFO_2A;
struct _AUTHENTICODE_TS_EXTRA_CERT_CHAIN_POLICY_PARA;
struct Windows::Foundation::Collections::IIterator<Windows::Foundation::Collections::IKeyValuePair<EventRegistrationToken,int> *>;
struct tagMCI_RECORD_PARMS;
struct Windows::Foundation::Collections::MapChangedEventHandler<HSTRING__ *,HSTRING__ *>;
class CArray<CFormatEtc>;
struct Windows::Foundation::Collections::IIterable<Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,HSTRING__ *> *>;
struct tagMIDIOUTCAPSA;
struct _CRYPT_SIGN_MESSAGE_PARA;
struct netent;
struct IPropertySetStorage;
class Microsoft::WRL::ComPtr<IRuntimeBroker>;
struct _SYSDBG_LIVEDUMP_CONTROL;
struct _PATHNAME_BUFFER;
struct timeval;
struct _CONSOLE_SELECTION_INFO;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IGlobalInterfaceTable> const >;
class Microsoft::WRL::Details::FtmBaseMarker;
struct Windows::Foundation::Collections::IIterable_impl<int>;
struct _RTL_GENERIC_TABLE;
struct _FORMAT_EX_PARAMETERS;
struct tagOutgoingActivationData;
struct IClipboardBrokerInternal;
struct tagSOleTlsData;
class RegistryKey::KeyInformationClass<_KEY_FULL_INFORMATION>;
struct tagOFNA;
class Microsoft::WRL::RuntimeClass<Microsoft::WRL::RuntimeClassFlags<2>,IDragDropBroker,Microsoft::WRL::FtmBase,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil>;
struct Windows::Foundation::Collections::IIterable<IInspectable *>;
struct tagMIDIOUTCAPS2W;
struct tMIXERCONTROLDETAILS_UNSIGNED;
struct tagCHARSETINFO;
struct DDEUP;
struct IEnumGeneric;
struct tagPDA;
struct _ICONINFOEXA;
struct _DEDUP_QUERY_FILE_HASHES_INPUT_BUFFER;
struct Windows::Foundation::Collections::IMapView<IInspectable *,IInspectable *>;
struct _callframeinternal_MIDL_TYPE_FORMAT_STRING;
struct Windows::Foundation::Collections::IKeyValuePair<IInspectable *,IInspectable *>;
struct _NOTIFYICONDATAW;
struct tagEMRGLSBOUNDEDRECORD;
struct HWAVEOUT__;
class CNFFMappedStream;
struct Windows::Foundation::Collections::IIterable_impl<Windows::Foundation::Collections::IKeyValuePair<IInspectable *,IInspectable *> *>;
struct _IMAGE_OS2_HEADER;
struct _PRINTER_INFO_2W;
class Microsoft::WRL::Details::ComPtrRefBase<Microsoft::WRL::ComPtr<IClientSecurity> >;
class CNtfsStorageForPropSetStg;
struct tagMONITORINFOEXA;
struct STblHdr;
struct _PS_CREATE_INFO;
struct _TAPE_STATISTICS;
struct _ALPC_CONTEXT_ATTR;
class SafeCastHelper<long,int,0>;
struct Windows::Foundation::Collections::IVectorView<Windows::Foundation::Collections::IPropertySet *>;
class CArray<CPageHolder *,CPageHolder * &>;
class Microsoft::WRL::Wrappers::HandleT<Microsoft::WRL::Wrappers::HandleTraits::EventTraits>;
struct DISPLAYCONFIG_MODE_INFO;
struct Windows::Foundation::Collections::IIterator<Windows::Foundation::Collections::IKeyValuePair<_GUID,HSTRING__ *> *>;
struct _API_SET_VALUE_ARRAY;
struct tagOleMenuGroupWidths;
struct Windows::Foundation::Collections::IIterator<Windows::Foundation::Collections::IKeyValuePair<_GUID,IInspectable *> *>;
struct _SYSTEM_VERIFIER_CANCELLATION_INFORMATION;
struct _DEVICE_DATA_SET_SCRUB_OUTPUT;
struct Windows::Foundation::Collections::IMap<_GUID,HSTRING__ *>;
struct _MEMORY_REGION_INFORMATION;
struct _SYSTEM_NUMA_INFORMATION;
struct _JOB_INFO_2W;
struct _RTL_UNLOAD_EVENT_TRACE64;
class CLimitedStreamBase::Seek::__l3::<lambda_5643932eb74fbaa9d063a0496c989d8d>;
struct SCARD_READERSTATEW;
struct _JOBOBJECT_WAKE_INFORMATION_V1;
struct CMapKeyToValue::CAssoc;
struct _OFNOTIFYEXW;
struct tagSTRINGBINDING;
struct _PLUGPLAY_CONTROL_QUERY_AND_REMOVE_DATA;
struct _STORAGE_READ_CAPACITY;
struct IActivationStageInfo;
struct CONFIRMSAFETY;
struct _FILE_NOTIFY_INFORMATION;
struct Microsoft::WRL::Details::ImplementsHelper<Microsoft::WRL::RuntimeClassFlags<2>,Microsoft::WRL::Details::InterfaceList<IDragOperationInternal,Microsoft::WRL::Details::Nil>,0,0>;
struct Windows::Foundation::IAsyncOperationCompletedHandler_impl<Windows::Foundation::Collections::IVectorView<Windows::Foundation::Collections::IPropertySet *> *>;
struct tagEMRRESIZEPALETTE;
struct tagMCI_WAVE_SET_PARMS;
struct IOleLink;
class CAtom;
struct _TOKEN_SECURITY_ATTRIBUTES_AND_OPERATION_INFORMATION;
struct _MESSAGE_RESOURCE_DATA;
struct _FILE_FS_OBJECTID_INFORMATION;
struct ISimpleBinding;
struct Windows::Foundation::IAsyncOperation_impl<Windows::Foundation::Collections::IVectorView<Windows::Foundation::Collections::IPropertySet *> *>;
struct _CERT_POLICY95_QUALIFIER1;
class CFrameFilter;
struct _POWER_MONITOR_INVOCATION;
struct _STORAGE_FAILURE_PREDICTION_CONFIG;
struct _SYSTEM_FIRMWARE_TABLE_INFORMATION;
struct tagNCCALCSIZE_PARAMS;
struct Windows::Foundation::Collections::IIterator_impl<Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,IInspectable *> *,1>;
struct _TOKEN_SID_INFORMATION;
struct _EVENT_DATA_DESCRIPTOR;
struct _QUERY_SERVICE_LOCK_STATUSA;
class CLimitedWritableStream::Revert::__l3::<lambda_189ac79ee6c9892186c1042c5ee85f98>;
struct tagMCI_SAVE_PARMSA;
struct _TXFS_READ_BACKUP_INFORMATION_OUT;
class CStmBufRead;
struct _CMC_PEND_INFO;
struct IMonikerVtbl;
struct _FILE_REMOTE_PROTOCOL_INFO;
struct _ENLISTMENT_BASIC_INFORMATION;
struct _SYSTEM_MEMORY_LIST_INFORMATION;
struct IStreamVtbl;
struct Windows::Foundation::IAsyncOperationWithProgressCompletedHandler_impl<HSTRING__ *,unsigned __int64>;
struct IInterfaceRelated;
struct tagMIDIINCAPS2A;
struct Windows::Foundation::Collections::IVectorView_impl<double,1>;
struct _TIMER_BASIC_INFORMATION;
struct Windows::Foundation::IAsyncOperationWithProgress_impl<HSTRING__ *,unsigned __int64>;
struct HRSRC__;
class CDwordBag;
struct _MMCKINFO;
struct _REASON_BUFFER;
struct hostent;
struct _SHQUERYRBINFO;
struct _BCRYPT_PROVIDER_NAME;
class Microsoft::WRL::Details::RuntimeClass<Microsoft::WRL::Details::InterfaceList<IClipboardTaskCompletion,Microsoft::WRL::Details::InterfaceList<Microsoft::WRL::FtmBase,Microsoft::WRL::Details::Nil> >,Microsoft::WRL::RuntimeClassFlags<2>,1,0,0>;
union tagBINDPTR;
struct Windows::Foundation::Collections::IIterator_impl<Windows::Foundation::Point,1>;
struct _OCSP_BASIC_RESPONSE_INFO;
struct Microsoft::WRL::RuntimeClassFlags<3>;
struct WSAData;
struct IMultiQI;
struct tagMCI_PLAY_PARMS;
struct _ADDJOB_INFO_1W;
struct tm;
struct _JOB_INFO_1W;
struct tagMCI_GENERIC_PARMS;
struct _REMOTE_PORT_VIEW;
struct _SECURITY_SEED_AND_LENGTH;
struct Microsoft::WRL::Details::ImplementsHelper<Microsoft::WRL::RuntimeClassFlags<2>,Microsoft::WRL::Details::InterfaceList<IWeakReference,Microsoft::WRL::Details::Nil>,0,0>;
class DISABLED_FEATURES;
struct Windows::Foundation::Collections::IVectorView_impl<Windows::Foundation::Collections::IPropertySet *,1>;
struct CDdeObject::CRpcStubBufferImpl;
struct _CRT_FLOAT;
struct Windows::Foundation::Collections::IIterator_impl<Windows::Foundation::Collections::IPropertySet *,1>;
struct _SD_GLOBAL_CHANGE_OUTPUT;
struct HFONT__;
struct _xml_error;
struct tagMIDIINCAPSW;
struct tagOIFI;
class CReadOnlyStorage;
struct tagOFN_NT4A;
struct _DEVICEDUMP_STORAGESTACK_PUBLIC_DUMP;
struct HDESK__;
struct Windows::Foundation::Collections::IIterator_impl<Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,unsigned char> *,1>;
struct _TP_CALLBACK_ENVIRON_V3;
struct _PROVIDOR_INFO_2W;
struct Windows::Foundation::IAsyncOperation_impl<Windows::Foundation::Collections::IVector<HSTRING__ *> *>;
struct _TREEITEM;
struct Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::TimeSpan>;
struct MOVE_FILE_DATA;
struct _IO_RESOURCE_REQUIREMENTS_LIST;
class CLimitedWritableStorage::CopyTo::__l9::<lambda_2bd57c01f5c01d211fff7cdbd9fb7a04>;
struct tagEMRSETMAPPERFLAGS;
struct _PLUGPLAY_CONTROL_RETRIEVE_DOCK_DATA;
struct _EFS_COMPATIBILITY_INFO;
struct _CRYPT_TIMESTAMP_RESPONSE;
struct IFunctionInstance;
struct Windows::Foundation::IAsyncOperation<HSTRING__ *>;
struct tagMCI_WAVE_DELETE_PARMS;
struct _ACL_REVISION_INFORMATION;
struct ANON_OBJECT_HEADER_BIGOBJ;
struct _RegInputEntry;
class COAHolder;
struct _PS_CPU_QUOTA_SET_INFORMATION;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IDataObject> const >;
class CWrapperBase<IUnknown>::{dtor}::__l3::<lambda_42a875bbe008729dc60a27a7ac72dd64>;
struct _REQUEST_OPLOCK_OUTPUT_BUFFER;
struct _VOLUME_DISK_EXTENTS;
struct Windows::Foundation::IAsyncActionWithProgress<double>;
class Windows::Rtl::AutoHandleBase<Windows::Rtl::AutoHandleDefaultTraits<void *>,Windows::Rtl::AutoFileHandle>;
struct _currencyfmtA;
struct _DRIVER_INFO_6A;
struct tagDRAWITEMSTRUCT;
class Map<MAP_KEY_GUID,MD_INTERFACE *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IOSTaskCompletion> >;
struct tagCHOOSEFONTW;
struct _FILE_PIPE_INFORMATION;
struct Windows::Foundation::Collections::IVector_impl<float,1>;
struct HWAVEIN__;
struct Windows::Foundation::Collections::IIterator_impl<double,1>;
struct _CM_KEYBOARD_DEVICE_DATA;
struct ICallInterceptor;
struct _DEVICE_MANAGE_DATA_SET_ATTRIBUTES_OUTPUT;
class CClassObj;
struct Windows::Foundation::Collections::IVector_impl<double,1>;
struct _IMAGE_BASE_RELOCATION;
struct tagMCI_LOAD_PARMSA;
struct _FILE_END_OF_FILE_INFO;
class CLimitedEnum<IEnumFORMATETC,tagFORMATETC>::Skip::__l3::<lambda_9dff625dd1c4d6ba9c83d2455d41f2ed>;
struct IPipeByte;
struct _BIDI_REQUEST_CONTAINER;
struct _CMSG_CMS_RECIPIENT_INFO;
class CPropertyBagEx;
class CExposedDocFile;
class BUCL::CConvertToSignedType<long>;
struct Windows::Foundation::IAsyncOperationCompletedHandler<unsigned int>;
class CActivationFilterContext;
struct _JOBOBJECT_FREEZE_INFORMATION;
struct Windows::Foundation::IAsyncOperationWithProgressCompletedHandler<unsigned __int64,unsigned __int64>;
struct _PROCESS_HANDLE_SNAPSHOT_INFORMATION;
class BUCL::CConvertToUnsignedType<short>;
struct Windows::Foundation::IAsyncOperationCompletedHandler_impl<Windows::Foundation::Collections::IMap<HSTRING__ *,HSTRING__ *> *>;
struct STARTING_VCN_INPUT_BUFFER;
struct _PRINTER_INFO_7W;
struct NTFS_FILE_RECORD_OUTPUT_BUFFER;
class CWrapperBase<IEnumFORMATETC>::{dtor}::__l3::<lambda_e1e2600c944d55816714b568a9d4a76b>;
struct FIND_BY_SID_OUTPUT;
class CLinkable;
struct _STORAGE_PROPERTY_QUERY;
struct Windows::Foundation::Collections::IMap_impl<HSTRING__ *,IInspectable *>;
struct MFT_ENUM_DATA_V1;
struct READ_FILE_USN_DATA;
struct USN_RECORD_V3;
class CRIFTable;
struct USN_JOURNAL_DATA_V2;
struct _SET_DISK_ATTRIBUTES;
struct DELETE_USN_JOURNAL_DATA;
struct SET_POWER_SETTING_VALUE;
struct tagCWPSTRUCT;
struct POWER_STATE_NOTIFY_HANDLER;
class EnumMap<MAP_KEY_GUID,INTERFACE_HELPER_CLSID *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>;
class MAP<XSLOCK,MAP_KEY_GUID,INTERFACE_HELPER_CLSID *>::iterator;
struct HTASK__;
struct PPM_WMI_PERF_STATES_EX;
struct Windows::Foundation::Size;
struct Microsoft::WRL::Details::ImplementsHelper<Microsoft::WRL::RuntimeClassFlags<2>,Microsoft::WRL::Details::InterfaceList<IClipboardTaskCompletion,Microsoft::WRL::Details::InterfaceList<Microsoft::WRL::FtmBase,Microsoft::WRL::Details::Nil> >,0,0>;
struct PPM_PERFSTATE_DOMAIN_EVENT;
struct DRVCONFIGINFOEX;
struct PPM_IDLESTATE_EVENT;
struct SYSTEM_BATTERY_STATE;
struct _LDOUBLE;
struct SHELLHOOKINFO;
struct FLASHWINFO;
struct sockproto;
struct MENUITEMTEMPLATEHEADER;
struct RPC_STATS_VECTOR;
struct RPC_ENDPOINT_TEMPLATEW;
struct RPC_INTERFACE_TEMPLATEA;
class Microsoft::WRL::ComPtr<IClipboardBrokerInternal>;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IInspectable> const >;
struct waveformat_tag;
struct pcmwaveformat_tag;
struct UDATE;
struct _TOKEN_MANDATORY_POLICY;
struct Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<HSTRING__ *> *>;
class CNumInfo;
struct tagSTATPROPSETSTG;
struct ICacheControl;
class Microsoft::WRL::Details::RuntimeClass<Microsoft::WRL::Details::InterfaceList<IDragOperationInternal,Microsoft::WRL::Details::Nil>,Microsoft::WRL::RuntimeClassFlags<2>,1,0,0>;
struct _CHAR_INFO;
struct Microsoft::WRL::Wrappers::HandleTraits::SRWLockExclusiveTraits;
struct HCOLORSPACE__;
struct mmtime_tag;
class CDragDataObject;
struct _BCRYPT_PKCS1_PADDING_INFO;
struct _PSM_APPSTATE_REGISTRATION;
struct _CERT_EXTENSIONS;
struct IDLLHost;
struct _CERT_SYSTEM_STORE_RELOCATE_PARA;
struct _FIND_NAME_HEADER;
class SafeCastHelper<unsigned long,int,1>;
struct tagRemSNB;
struct _PRINTPROCESSOR_INFO_1A;
class CDelayUnlockContainer;
struct NET_ADDRESS_INFO_;
struct tagNC_ADDRESS;
class CSplit_QI;
struct Windows::Foundation::IReferenceArray_impl<_GUID>;
struct _SYSTEM_REF_TRACE_INFORMATION;
class CWrapperBase<IStream>::{dtor}::__l3::<lambda_aa02482f06870b02a731ce2b344eb45f>;
struct Windows::Foundation::Collections::IIterator_impl<Windows::Foundation::Collections::IKeyValuePair<unsigned int,HSTRING__ *> *,1>;
class Microsoft::WRL::Details::ComPtrRefBase<Microsoft::WRL::ComPtr<IMarshal> >;
class CLimitedWritableStorage::CreateStream::__l3::<lambda_c61f443e0a23e506b6ef8e03365cb69a>;
struct OPENCARDNAMEA;
union USN_RECORD_UNION;
struct Windows::Foundation::Collections::IVector<unsigned char>;
class CTLocalAllocPolicy;
struct PPM_WMI_IDLE_STATES_EX;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IClipboardTaskCompletion> const >;
struct Microsoft::WRL::RuntimeClassFlags<2>;
struct IProxyManager;
class Windows::Internal::NativeString<Windows::Internal::CoTaskMemPolicy<unsigned short> >;
struct __MIDL_ICallFrame_0002;
struct tagCInterfaceProxyVtbl;
struct TYPEINFOVTBL;
struct _FILE_STANDARD_LINK_INFORMATION;
struct _RPC_BINDING_VECTOR;
struct _TOKEN_ACCESS_INFORMATION;
struct _DEVICE_DATA_SET_REPAIR_OUTPUT;
class CUserMarshalInfo;
struct _COMPRESSED_DATA_INFO;
struct USN_RANGE_TRACK_OUTPUT;
struct Windows::Foundation::IAsyncActionProgressHandler_impl<double>;
struct _RESOLVED_USERNAME_INFO;
struct _BCRYPT_RSAKEY_BLOB;
struct DICTENTRYHEADER;
struct DICTENTRY;
struct PPM_WMI_IDLE_STATES;
union __m64;
struct IInternalUnknown;
struct _PORT_INFO_3W;
union __m128;
struct _wfinddata32i64_t;
struct _RPC_HTTP_TRANSPORT_CREDENTIALS_V3_W;
struct _STORAGE_MEDIA_SERIAL_NUMBER_DATA;
struct _PSFEATURE_OUTPUT;
struct Windows::Foundation::IAsyncOperationProgressHandler_impl<unsigned int,unsigned int>;
struct _RTL_STACK_CONTEXT;
class Microsoft::WRL::ComPtr<IClientSecurity>;
class CBaseCall;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IClipboardBroker> >;
struct _BEM_REFERENCE;
class ComPsClassFactory;
struct _SET_PARTITION_INFORMATION_EX;
struct POWER_STATE_HANDLER;
class AppRegistration;
class CStdIdentity;
struct ISoftDistExt;
struct tagTYPEATTR;
struct _KEY_FLAGS_INFORMATION;
struct _DISK_GROW_PARTITION;
class LargeIntRegMultiply<int,__int64>;
struct _SHFILEINFOA;
struct tagARRAYDESC;
struct RPC_IMPORT_CONTEXT_P;
class CClipDataObject;
struct IUriBuilder;
struct _mega_MIDL_TYPE_FORMAT_STRING;
struct tagCOMPOSITIONFORM;
struct Windows::Foundation::Collections::IIterable_impl<Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,unsigned char> *>;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<ApartmentShutdownNode> >;
class CComCat::CInnerUnk;
struct IPipeLong;
class CAutoHandle_Policy<HDESK__ *>;
struct _CORE_PRINTER_DRIVERA;
struct READER_SEL_REQUEST;
class CWrapperBase<IUnknown>;
class CPerContext;
struct _PRINTER_INFO_8W;
class CExposedStream;
struct CDdeObject::CUnknownImpl;
struct ASTAIncomingCallData;
struct tagCustomPrivScmInfo;
class CObjectContext;
struct _iinspectable_MIDL_TYPE_FORMAT_STRING;
struct IShellLibrary;
class CDragDropBroker::UnregisterDropTarget::__l6::<lambda_c1ed4ead205aec1127a6b9a1ed24106a>;
struct _PRINTER_INFO_9W;
class CClipboardBroker::ValidateAndAcquireACImpersonationSource::__l14::<lambda_098d792811d0819d6bd5c3e3bf33d64f>;
class ContextInfo;
class iostream;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IMarshalingStream> >;
class CMapStringToPtr;
struct tagMCI_OVLY_WINDOW_PARMSA;
struct RECTS;
struct SExtHashNode;
struct _prop_MIDL_TYPE_FORMAT_STRING;
struct _MnkEqBuf;
struct _iobuf;
struct Windows::Foundation::Collections::IIterator_impl<Windows::Foundation::Collections::IKeyValuePair<IInspectable *,IInspectable *> *,1>;
class CClientCall;
struct tagFINDREPLACEA;
class CClassCache::CDllPathEntry;
class CCliModalLoop;
struct tagMCI_OVLY_LOAD_PARMSA;
class CSrvCallState;
class CSurrogatedObjectList;
struct Windows::Foundation::Collections::IIterable<int>;
struct tagContextStackNode;
class Microsoft::WRL::Details::ComPtrRefBase<Microsoft::WRL::ComPtr<IGlobalInterfaceTable> >;
struct tagInitializeSpyNode;
class SafeCExposedStream;
struct IInitializeSpy;
class CVerifierTlsData;
struct tagWAVEOUTCAPS2W;
class ASTAWaitContext;
class PushLogicalThreadId;
class CBaseMInterfacePointerMarshalingStream;
struct _MINIDUMP_EXCEPTION_INFORMATION64;
struct _MINIDUMP_HEADER;
struct _IMAGEHLP_CBA_EVENTW;
class CNotifyCP;
class CFontEventsCP;
struct FR;
class CFont;
struct Windows::Foundation::Collections::IObservableVector<IInspectable *>;
struct WINTRUST_SGNR_INFO_;
struct IPersistMemory;
struct _CLIENT_ID32;
class XIPersistFile;
struct IMarshallingManager;
struct _IMAGEHLP_SYMBOL64;
struct Microsoft::WRL::Details::ImplementsHelper<Microsoft::WRL::RuntimeClassFlags<2>,Microsoft::WRL::Details::InterfaceList<IClipboardBroker,Microsoft::WRL::Details::Nil>,0,0>;
struct Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,unsigned char>;
struct _IMAGE_DEBUG_INFORMATION;
struct Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,Windows::Foundation::Collections::IVector<HSTRING__ *> *>;
struct _CAT_MEMBERINFO;
struct _IMAGEHLP_SYMBOLW64_PACKAGE;
class CClipboardBroker::CClipboardBrokerMTAHelper;
struct _MINIDUMP_MEMORY64_LIST;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IWeakReference> >;
struct _MINIDUMP_THREAD_INFO_LIST;
struct IPropertyPage2;
struct Windows::Foundation::Collections::IPropertySet;
struct tagQACONTROL;
class BUCL::CConvertToSignedType<unsigned __int64>;
class CStackBuffer;
struct _MINIDUMP_HANDLE_OBJECT_INFORMATION;
struct _CRYPT_PROVIDER_DATA;
struct _WINTRUST_DATA;
struct Windows::Foundation::Collections::IMapView_impl<HSTRING__ *,IWeakReference *>;
struct WINTRUST_FILE_INFO_;
class Windows::AutoPointerBase<Windows::Rtl::IRtlUtf16LEStringBuilder *,Windows::Auto<Windows::Rtl::IRtlUtf16LEStringBuilder *> >;
struct WINTRUST_SIGNATURE_SETTINGS_;
struct tagREMQIRESULT;
struct CDefClient::CUnknownImpl;
struct IDropSourceQueryEx;
struct Windows::Foundation::IReference<HSTRING__ *>;
struct APP_DATA::FreeListElem;
struct APP_DATA::FreeList;
class Windows::Rtl::AutoHandleBase<Windows::Rtl::AutoHandleDefaultTraits<void *>,Windows::Rtl::AutoTxnHandle>::COperatorAmpersandReturnType;
struct Windows::Rtl::_FORMATTED_STREAM_ENUM_MAP;
struct Windows::Rtl::_FORMATTED_STREAM_ENUM_AND_FLAG_MAP;
struct Windows::Foundation::Collections::IKeyValuePair<unsigned int,IInspectable *>;
struct _CRYPT_PROVIDER_PRIVDATA;
class CIPIDTable;
struct _PROVDATA_SIP;
struct SIP_DISPATCH_INFO_;
class CLimitedWritableStorage::SetStateBits::__l3::<lambda_44e307b01f927c912ff6d0aeeff4989a>;
struct _WIN_SPUB_TRUSTED_PUBLISHER_DATA;
struct FMTCACHE;
class CEnumFmt;
struct _IMAGEHLP_CBA_READ_MEMORY;
struct _SPC_FINANCIAL_CRITERIA;
struct Windows::Foundation::Collections::VectorChangedEventHandler_impl<HSTRING__ *>;
struct _MINIDUMP_EXCEPTION_INFORMATION;
struct Windows::Foundation::IReferenceArray<Windows::Foundation::Point>;
struct _IMAGEHLP_STACK_FRAME;
struct midistrmbuffver_tag;
class CLocalMemPtr<unsigned short>;
struct _IMAGEHLP_SYMBOL_PACKAGE;
class CReadOnlyStream::Clone::__l3::<lambda_fb392707ac6bb38f27e8062ecc49a9e6>;
struct Windows::Foundation::Collections::IIterable_impl<float>;
struct Windows::Foundation::Collections::VectorChangedEventHandler<IInspectable *>;
struct _IMAGEHLP_SYMBOLW_PACKAGE;
struct _JOB_INFO_2A;
struct _MINIDUMP_HANDLE_DESCRIPTOR_2;
struct IEnumSTATPROPBAG;
struct _IMAGEHLP_LINEW;
class TStackBuffer<unsigned short *,64>;
struct Microsoft::WRL::Wrappers::HandleTraits::SemaphoreTraits;
struct _MODLOAD_DATA;
struct Windows::Foundation::Collections::VectorChangedEventHandler<float>;
class CBaseInterfaceDataMarshalingStream;
struct _MINIDUMP_THREAD_LIST;
struct Windows::Foundation::Collections::IVector<Windows::Foundation::Collections::IPropertySet *>;
struct Windows::Foundation::Collections::IMap<EventRegistrationToken,int>;
struct _MINIDUMP_MEMORY_LIST;
struct _SPC_INDIRECT_DATA_CONTENT;
struct _MINIDUMP_DIRECTORY;
class ostream_withassign;
class Windows::AutoOperatorAmpersandConstHelper<Windows::Rtl::IRtlRORAStream *,Windows::Auto<Windows::Rtl::IRtlRORAStream *> >;
struct Windows::Foundation::Collections::IKeyValuePair<_GUID,HSTRING__ *>;
struct _SPC_STATEMENT_TYPE;
struct _IMAGEHLP_DEFERRED_SYMBOL_LOAD;
struct _MODLOAD_CVMISC;
struct _IMAGEHLP_SYMBOL_SRC;
class CWrapperBase<IEnumSTATSTG>::{dtor}::__l3::<lambda_44a41d18c69d5b08754dc18f57554c05>;
struct _IMAGEHLP_CBA_EVENT;
struct CMPGUID;
struct _IMAGEHLP_DUPLICATE_SYMBOL64;
struct Windows::Foundation::Collections::IMapView_impl<_GUID,IInspectable *>;
struct _SPC_PE_IMAGE_DATA;
struct Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,HSTRING__ *>;
struct _MINIDUMP_UNLOADED_MODULE;
struct FMT;
struct IAdviseSinkEx;
struct IProvideClassInfo2;
class CNtfsStreamName;
class CProcessExtensionTbl;
struct tagPOINTF;
class CPIDTable;
struct _IMAGEHLP_MODULEW64;
class CDdeServerCallMgr;
struct Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorView<HSTRING__ *> *>;
struct Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorView<Windows::Foundation::Collections::IPropertySet *> *>;
struct tagCALPOLESTR;
struct _IMAGEHLP_SYMBOL64_PACKAGE;
struct _CLILIST;
struct ILockBytesVtbl;
struct IOleInPlaceSiteWindowless;
struct Windows::Foundation::Collections::IMap_impl<unsigned int,IInspectable *>;
struct tagAspectInfo;
struct SHA512_CTX;
struct tagQACONTAINER;
class CClassCache;
struct Windows::Foundation::Collections::IKeyValuePair_impl<HSTRING__ *,IInspectable *>;
struct _MINIDUMP_MISC_INFO_2;
struct _LOADED_IMAGE;
struct SYMSRV_INDEX_INFO;
class CClipboardBroker;
class CTContainer_PolicyLocalMem;
struct DBGHELP_DATA_REPORT_STRUCT;
struct IViewObjectEx;
class Windows::AutoOperatorAmpersandHelper<Windows::Rtl::IRtlWOFOUCSStream *,Windows::Auto<Windows::Rtl::IRtlWOFOUCSStream *> >;
struct IRemUnknown2;
struct ICatInformation;
struct CVectBits;
struct _TAPE_WMI_OPERATIONS;
struct Windows::Foundation::Collections::IVectorView_impl<Windows::Foundation::Point,1>;
struct tagPICTDESC;
struct _TAPE_GET_DRIVE_PARAMETERS;
class CLimitedWritableStream;
struct _WPP_WIN2K_CONTROL_BLOCK;
class PDeSerStream;
struct _ENUM_FLAG_SIZED_INTEGER<enum VARIANT_SERIALIZE_FLAGS>;
struct MAP_SHARED<MAP_KEY_GUID,INTERFACE_HELPER_CLSID *>;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IEnumSTATSTG> const >;
struct _SYSTEM_BASIC_INFORMATION;
class CNtfsEnumSTATSTG;
struct Windows::Foundation::Collections::IVectorView<Windows::Foundation::Collections::IKeyValuePair<IInspectable *,IInspectable *> *>;
class PMemoryAllocator;
struct HCONV__;
class SafeCExposedIterator;
class Windows::Rtl::AutoHandleBase<Windows::Rtl::AutoHandleDefaultTraits<void *>,Windows::Rtl::AutoHandle>;
class CtxEntry;
class CFillLockBytes;
class CDragDropBroker::RegisterDropTarget::__l15::<lambda_5c458abe41e9676fec12ee1a553c1900>;
class CallFrame;
struct Windows::Foundation::IAsyncActionWithProgress_impl<unsigned __int64>;
class Windows::Rtl::AutoHandleBase<Windows::Rtl::AutoHandleDefaultTraits<void *>,Windows::Rtl::AutoKeyHandle>::COperatorAmpersandReturnType;
class CReadOnlyStream::CopyTo::__l9::<lambda_1e81b64dbd65046dfbf530e8509c9118>;
class CClassCache::CWinRTLocalSvrClassEntry;
struct IRunnableObjectVtbl;
struct Windows::Rtl::IRtlFormattableInterface::FormattingLevels;
struct tagMONHSZSTRUCTW;
class CContext;
class ActivationPropertiesIn;
class CEnumStatData;
class CSharedMemHeader;
struct SFreeBlock;
struct Windows::Foundation::IAsyncOperation_impl<unsigned int>;
struct Windows::Foundation::Collections::IVectorView<HSTRING__ *>;
class BUCL::CIsSignedType<__int64>;
struct Windows::Foundation::IAsyncOperationWithProgressCompletedHandler_impl<unsigned __int64,unsigned __int64>;
class CPagedVector;
struct SEntryBuffer;
struct Windows::Foundation::Collections::IIterator_impl<Windows::Foundation::Collections::IKeyValuePair<EventRegistrationToken,int> *,1>;
struct tagMONCBSTRUCT;
class Microsoft::WRL::Details::ComPtrRefBase<Microsoft::WRL::ComPtr<IDropTarget> >;
struct Windows::Foundation::Collections::IMap_impl<HSTRING__ *,HSTRING__ *>;
struct BSTR_INTERNAL;
struct Windows::Foundation::IAsyncOperation_impl<Windows::Foundation::Internal::AggregateType<bool,unsigned char> >;
class PBasicEntry;
class Windows::AutoOperatorAmpersandConstHelper<Windows::Rtl::IRtlUtf8StringBuilder *,Windows::Auto<Windows::Rtl::IRtlUtf8StringBuilder *> >;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IEnumSTATSTG> >;
struct IRpcChannelBufferMarshalingContext;
struct tagCustomPrivResolverInfo;
struct tagMONLINKSTRUCT;
struct SSegment;
struct Windows::Foundation::TimeSpan;
class CEnumCategoriesOfClass;
class CTransactedTimeEntry;
class CBasedDeltaBlockPtrPtr;
class CBasedTransactedStreamPtr;
class CDeltaList;
class CTransactedStream;
struct CDdeObject::CPersistStgImpl;
class CSimpEnumSTATSTG;
struct _IMAGEINFO;
struct _MCGEN_TRACE_CONTEXT;
class CEnumSTATDATA;
struct Windows::Foundation::IAsyncOperationCompletedHandler_impl<unsigned int>;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IDropTarget> const >;
class BUCL::CIsSignedType<long>;
class BUCL::CConvertToSignedType<unsigned short>;
struct DDEADVISE;
class Windows::Rtl::AutoHandleDefaultTraits<void *>;
class Windows::Rtl::CriticalSectionLock;
struct IPropertyStore;
struct IImpersonateClipboardOwner;
class CPtrBlock;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IAgileDataObject> >;
class Windows::Rtl::AutoInterface<Windows::Rtl::IRtlUtf8StringBuilder *,Windows::Auto<Windows::Rtl::IRtlUtf8StringBuilder *> >;
struct tagFORMATETC64;
struct FORMATETCDATA64;
struct FORMATETCDATAARRAY64;
class Windows::Rtl::AutoToken;
class Windows::AutoOperatorAmpersandConstHelper<Windows::Rtl::IRtlWOFOStream *,Windows::Auto<Windows::Rtl::IRtlWOFOStream *> >;
class CArray<CStatData>;
struct Windows::Foundation::Collections::IMap_impl<HSTRING__ *,Windows::Foundation::Collections::IVector<HSTRING__ *> *>;
class Microsoft::WRL::Details::RuntimeClass<Microsoft::WRL::Details::InterfaceList<IClipboardBrokerInternal,Microsoft::WRL::Details::Nil>,Microsoft::WRL::RuntimeClassFlags<2>,1,0,0>;
struct Windows::Foundation::Collections::IIterable<Windows::Foundation::Collections::IPropertySet *>;
struct _SSerializationHeader;
class Microsoft::WRL::Details::ComPtrRefBase<Microsoft::WRL::ComPtr<IClipboardTaskCompletion> >;
class RunSyncOnMTAThread::__l6::<lambda_b9546173b20ee7fe260551f81120f626>;
struct _MONITOR_INFO_1W;
struct _ENCRYPTION_PROTECTOR;
struct _FORM_INFO_2W;
struct _CHANGER_EXCHANGE_MEDIUM;
struct _PRINTER_CONNECTION_INFO_1A;
struct tagAUXCAPS2W;
struct tagAUXCAPSW;
class RegistryKey::ValueInformationClass<_KEY_VALUE_PARTIAL_INFORMATION>;
struct _STORAGE_ACCESS_ALIGNMENT_DESCRIPTOR;
class CTSmartObj<unsigned short *,CTSmartPtr_PolicyComplete<CTContainer_PolicyLocalMem> >;
struct _DEVICE_SEEK_PENALTY_DESCRIPTOR;
struct tagMIXERLINEW;
struct tagMCI_SAVE_PARMSW;
struct XLOCK_LEAF;
struct LEGACY_INTERCEPTOR;
struct _DRIVER_INFO_4A;
class CUnkownOnlyWrapper;
struct tagMCI_ANIM_OPEN_PARMSW;
struct DedicatedAllocator<DISPATCH_CLIENT_FRAME>;
struct FRAME_RemoteInvoke;
struct _STORAGE_PREDICT_FAILURE;
struct _PREVENT_MEDIA_REMOVAL;
struct sockaddr_in;
class Microsoft::WRL::ComPtr<IStorage>;
class CWrapperBase<IStorage>;
struct __MIDL_ILocalObjectExporter_0004;
class CALLFRAME_CACHE<INTERFACE_HELPER_CLSID>;
struct midiproptempo_tag;
struct tagMCI_ANIM_WINDOW_PARMSW;
class Microsoft::WRL::FtmBase;
struct ICallFrameInit;
struct tagMIXERCAPSA;
struct _STORAGE_DEVICE_NUMBER;
struct HMMIO__;
class Microsoft::WRL::Details::MakeAllocator<CClipboardBroker,0>;
struct _ENCRYPTED_FILE_METADATA_SIGNATURE;
class CMemString<CMemString_PolicyCoTaskMem>;
struct _ENCRYPTION_CERTIFICATE_HASH;
struct _EFS_HASH_BLOB;
struct tagMIXERCONTROLDETAILS_LISTTEXTW;
struct _DOC_INFO_1A;
struct _DRIVER_INFO_8A;
struct _STORAGE_EVENT_NOTIFICATION;
struct tagMCI_SEEK_PARMS;
class MAP<XSLOCK,MAP_KEY_GUID,MD_INTERFACE *>;
struct _DEVICEDUMP_PRIVATE_SUBSECTION;
class RunSyncOnMTAThread::__l6::<lambda_d3527ebd2bdbca5ff9e8b7bb2bc980a4>;
struct _SENDCMDINPARAMS;
class Microsoft::WRL::Details::MakeAllocator<CDragOperation,0>;
struct _STORAGE_ALLOCATE_BC_STREAM_OUTPUT;
struct tagCHOOSECOLORW;
class LargeIntRegMultiply<unsigned int,unsigned __int64>;
struct _MONITOR_INFO_2A;
struct tagMCI_LOAD_PARMSW;
struct tagMCI_SYSINFO_PARMSA;
struct _STORAGE_DEVICE_DESCRIPTOR;
struct tagMIXERCAPS2W;
struct _CHANGER_PRODUCT_DATA;
struct _DEVICE_POWER_DESCRIPTOR;
struct tagDVTARGETDEVICE;
struct tagMIXERCAPSW;
struct _PERF_OBJECT_TYPE;
class CReadWithSourceAttributesMarshalingStreamOnBuffer;
struct _IMAGELIST;
struct timecaps_tag;
struct _STORAGE_DEVICE_ID_DESCRIPTOR;
struct DDEACK;
class CLimitedWritableStorage::DestroyElement::__l3::<lambda_b0e4e2ec5d2001c3233b76a477938963>;
struct PRINT_EXECUTION_DATA;
struct _CHANGER_SET_POSITION;
struct HMIXER__;
struct _PRINTER_INFO_5W;
class RunSyncOnMTAThread::__l6::<lambda_c2a7e2dfc7381cd4a28f3c02aada6e36>;
struct _DEVICE_WRITE_AGGREGATION_DESCRIPTOR;
struct _PROPSHEETHEADERA_V2;
struct tagSTATDATA;
class CEnumClassesOfCategories;
struct tagDDECALLDATA;
struct tagVARDESC;
struct tagTLIBATTR;
class CArray<CProperty *,CProperty * &>;
struct tagBIND_OPTS;
class DDE_CHANNEL;
class CDocfileStreamName;
class CPatternTbl;
struct HSTRING__;
struct IShellItem2;
struct _DPA;
struct _MonikerReadStruct;
class CAbstractStream;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IMarshalingStream> const >;
class Microsoft::WRL::RuntimeClass<Microsoft::WRL::RuntimeClassFlags<2>,IDataObject,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil>;
class CTmpMkEqBuf;
struct CaseMapping;
struct IAgileDataObject;
struct IRCEntry;
struct _RegInput;
class std::bad_exception;
class CFastBH;
class CMachineNamesHelper;
class XIUnknown;
struct _GDI_TEB_BATCH32;
struct _TEB32;
class Microsoft::WRL::Details::DontUseNewUseMake;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IMarshal> const >;
class CRtlSmartUcsEncoderTraits<_LUNICODE_STRING>;
struct RTL_FILTER_LUNICODE_STRING_CTX;
class Microsoft::WRL::Details::RuntimeClassBaseT<2>;
class Microsoft::WRL::ComPtr<IDataObject>;
class Windows::Internal::GitPtr;
class CClipClientDataWrapper;
struct Microsoft::WRL::RuntimeClassFlags<4>;
class Microsoft::WRL::RuntimeClass<Microsoft::WRL::RuntimeClassFlags<2>,IClipboardTaskCompletion,Microsoft::WRL::FtmBase,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil>;
class CReadOnlyStream;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IStream> const >;
class Map<MAP_KEY_GUID,INTERFACE_HELPER_CLSID *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>;
class MAP<XSLOCK,MAP_KEY_GUID,INTERFACE_HELPER_CLSID *>;
struct PARAM_ATTRIBUTES;
struct PARAM_DESCRIPTION;
struct Windows::Foundation::Collections::IIterable_impl<Windows::Foundation::Collections::IKeyValuePair<_GUID,HSTRING__ *> *>;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<CDragOperation> >;
class CApartmentHashTable;
class CMapDwordDword;
struct Microsoft::WRL::Details::VerifyInterfaceHelper<3,IMarshal,1,0>;
class CLimitedWritableStream::Clone::__l3::<lambda_7c728cb094bc38d0adac79e38f0da1b9>;
struct Windows::Foundation::Collections::IIterator<unsigned char>;
class CLimitedWritableStream::SetSize::__l3::<lambda_da26fc0bbbf89dff49f846fbc03fa030>;
struct Windows::Foundation::IAsyncOperationWithProgress_impl<unsigned __int64,unsigned __int64>;
class CBrokeredClipDataObject::GetDataHere::__l25::<lambda_f7c4d18b9d69b9011c851bb4052b02ea>;
struct Windows::Foundation::Collections::IIterator<HSTRING__ *>;
struct Windows::Foundation::Collections::IIterable_impl<HSTRING__ *>;
struct Windows::Foundation::Collections::IIterable<HSTRING__ *>;
struct Windows::Foundation::Collections::VectorChangedEventHandler<HSTRING__ *>;
struct Windows::Foundation::Collections::IObservableVector_impl<HSTRING__ *>;
class CSCMergedEnum<IEnumGUID,_GUID>;
struct Windows::Foundation::Collections::IObservableVector<HSTRING__ *>;
struct Windows::Foundation::Collections::IVectorView<int>;
struct Windows::Foundation::Collections::IVector<int>;
struct Windows::Foundation::Collections::IIterator<IInspectable *>;
struct Windows::Foundation::Collections::IIterable_impl<IInspectable *>;
struct Windows::Foundation::Collections::IVectorView<IInspectable *>;
struct Windows::Foundation::Collections::VectorChangedEventHandler_impl<IInspectable *>;
struct Windows::Foundation::Collections::IVectorChangedEventArgs;
struct Windows::Foundation::Collections::IObservableVector_impl<IInspectable *>;
class CPropertySection;
struct Windows::Foundation::Collections::IIterator<Windows::Foundation::Point>;
struct Windows::Foundation::Collections::IVectorView<Windows::Foundation::Point>;
struct Windows::Foundation::Collections::IVector<Windows::Foundation::Point>;
class CNtfsUpdateStreamName;
struct Windows::Foundation::Collections::IVector<unsigned int>;
class CNtfsStorage;
struct Windows::Foundation::Collections::IIterable_impl<Windows::Foundation::Collections::IPropertySet *>;
struct Windows::Foundation::Collections::IIterator<Windows::Foundation::Collections::IIterable<Windows::Foundation::Point> *>;
struct METADC;
struct METAINFO;
struct Windows::Foundation::Collections::IIterable_impl<Windows::Foundation::Collections::IIterable<Windows::Foundation::Point> *>;
class LargeIntRegMultiply<unsigned __int64,unsigned __int64>;
struct Windows::Foundation::Collections::IIterable<Windows::Foundation::Collections::IIterable<Windows::Foundation::Point> *>;
struct Windows::Foundation::Collections::IIterable<Windows::Foundation::Collections::IKeyValuePair<_GUID,HSTRING__ *> *>;
struct Windows::Foundation::Collections::IMapView_impl<_GUID,HSTRING__ *>;
struct Windows::Foundation::Collections::IMapView<_GUID,HSTRING__ *>;
class LargeIntRegMultiply<__int64,__int64>;
struct Windows::Foundation::Collections::IMap_impl<_GUID,HSTRING__ *>;
class AdditionHelper<__int64,unsigned __int64,13>;
struct Windows::Foundation::Collections::IKeyValuePair<_GUID,IInspectable *>;
struct Windows::Foundation::Collections::IIterable_impl<Windows::Foundation::Collections::IKeyValuePair<_GUID,IInspectable *> *>;
struct Windows::Foundation::Collections::IIterable<Windows::Foundation::Collections::IKeyValuePair<_GUID,IInspectable *> *>;
struct Windows::Foundation::Collections::IMapView<_GUID,IInspectable *>;
class CStreamDummy;
struct Windows::Foundation::Collections::IMap_impl<_GUID,IInspectable *>;
struct NEWHEADER;
struct Windows::Foundation::Collections::IMap<_GUID,IInspectable *>;
struct Windows::Foundation::Collections::IIterator<Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,HSTRING__ *> *>;
struct Windows::Foundation::Collections::IIterable_impl<Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,HSTRING__ *> *>;
struct Windows::Foundation::Collections::IMapView_impl<HSTRING__ *,HSTRING__ *>;
struct Windows::Foundation::Collections::MapChangedEventHandler_impl<HSTRING__ *,HSTRING__ *>;
struct tagCATEGORYINFO;
struct Windows::Foundation::Collections::IObservableMap_impl<HSTRING__ *,HSTRING__ *>;
struct Windows::Foundation::Collections::IObservableMap<HSTRING__ *,HSTRING__ *>;
struct Windows::Foundation::Collections::IIterator<Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,unsigned char> *>;
class CSinkList;
struct Windows::Foundation::Collections::IIterable<Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,unsigned char> *>;
struct Windows::Foundation::Collections::IMapView_impl<HSTRING__ *,unsigned char>;
struct Windows::Foundation::Collections::IMapView<HSTRING__ *,unsigned char>;
class SafeCExposedDocFile;
struct Windows::Foundation::Collections::IMap_impl<HSTRING__ *,unsigned char>;
struct Windows::Foundation::Collections::IIterable_impl<Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,Windows::Foundation::Collections::IVector<HSTRING__ *> *> *>;
struct Windows::Foundation::Collections::IIterable<Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,Windows::Foundation::Collections::IVector<HSTRING__ *> *> *>;
struct Windows::Foundation::Collections::IMapView_impl<HSTRING__ *,Windows::Foundation::Collections::IVector<HSTRING__ *> *>;
struct Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,IWeakReference *>;
struct Windows::Foundation::Collections::IIterator<Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,IWeakReference *> *>;
struct Windows::Foundation::Collections::IIterable_impl<Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,IWeakReference *> *>;
class CSeekPointer;
struct Windows::Foundation::Collections::IMapView<HSTRING__ *,IWeakReference *>;
class TXLargeIntegerWrapper<_LARGE_INTEGER,long,__int64>;
struct Windows::Foundation::Collections::IMap_impl<HSTRING__ *,IWeakReference *>;
struct Windows::Foundation::Collections::IMap<HSTRING__ *,IWeakReference *>;
struct tagFontPropSetTable;
struct Windows::Foundation::Collections::IMap_impl<IInspectable *,IInspectable *>;
struct Windows::Foundation::Collections::IMap<IInspectable *,IInspectable *>;
struct Windows::Foundation::Collections::IIterator<Windows::Foundation::Collections::IKeyValuePair<unsigned int,HSTRING__ *> *>;
struct Windows::Foundation::Collections::IIterable<Windows::Foundation::Collections::IKeyValuePair<unsigned int,HSTRING__ *> *>;
struct Windows::Foundation::Collections::IMapView_impl<unsigned int,HSTRING__ *>;
struct Windows::Foundation::Collections::IMapView<unsigned int,HSTRING__ *>;
struct Windows::Foundation::Collections::IMap_impl<unsigned int,HSTRING__ *>;
struct Windows::Foundation::Collections::IIterable_impl<Windows::Foundation::Collections::IKeyValuePair<unsigned int,IInspectable *> *>;
struct Windows::Foundation::Collections::IIterable<Windows::Foundation::Collections::IKeyValuePair<unsigned int,IInspectable *> *>;
struct Windows::Foundation::Collections::IMapView_impl<unsigned int,IInspectable *>;
struct Windows::Foundation::Collections::IKeyValuePair<unsigned int,IWeakReference *>;
struct Windows::Foundation::Collections::IIterator<Windows::Foundation::Collections::IKeyValuePair<unsigned int,IWeakReference *> *>;
struct Windows::Foundation::Collections::IIterable_impl<Windows::Foundation::Collections::IKeyValuePair<unsigned int,IWeakReference *> *>;
struct Windows::Foundation::Collections::IMapView<unsigned int,IWeakReference *>;
class CSafeBYTEArray;
struct Windows::Foundation::Collections::IMap_impl<unsigned int,IWeakReference *>;
struct Windows::Foundation::Collections::IMap<unsigned int,IWeakReference *>;
struct Windows::Foundation::Collections::IKeyValuePair<EventRegistrationToken,int>;
struct Windows::Foundation::Collections::IIterable_impl<Windows::Foundation::Collections::IKeyValuePair<EventRegistrationToken,int> *>;
struct Windows::Foundation::Collections::IIterable<Windows::Foundation::Collections::IKeyValuePair<EventRegistrationToken,int> *>;
struct Windows::Foundation::Collections::IMapView_impl<EventRegistrationToken,int>;
struct Windows::Foundation::Collections::IMapView<EventRegistrationToken,int>;
struct Windows::Foundation::Collections::IMap_impl<EventRegistrationToken,int>;
struct Windows::Foundation::Collections::IVector<Windows::Foundation::Collections::IKeyValuePair<IInspectable *,IInspectable *> *>;
class Microsoft::WRL::ComPtr<INotARealInterface>;
struct Windows::Foundation::IAsyncOperationCompletedHandler_impl<HSTRING__ *>;
struct _DELAYLOAD_PROC_DESCRIPTOR;
struct _DELAYLOAD_INFO;
struct Windows::Foundation::IAsyncOperationCompletedHandler<HSTRING__ *>;
struct Windows::Foundation::IAsyncActionProgressHandler<double>;
struct Windows::Foundation::IAsyncActionWithProgressCompletedHandler_impl<double>;
struct Windows::Foundation::IAsyncActionWithProgressCompletedHandler<double>;
struct Windows::Foundation::IAsyncActionWithProgress_impl<double>;
class exception;
struct Windows::Foundation::IAsyncActionProgressHandler_impl<unsigned __int64>;
struct Windows::Foundation::IAsyncActionWithProgressCompletedHandler_impl<unsigned __int64>;
struct Windows::Foundation::IAsyncActionWithProgressCompletedHandler<unsigned __int64>;
struct Windows::Foundation::IAsyncActionWithProgress<unsigned __int64>;
struct Windows::Foundation::IAsyncOperationProgressHandler<unsigned int,unsigned int>;
struct Windows::Foundation::IAsyncOperationWithProgressCompletedHandler<unsigned int,unsigned int>;
struct Windows::Foundation::IAsyncOperationWithProgress_impl<unsigned int,unsigned int>;
struct Windows::Foundation::IAsyncOperationWithProgressCompletedHandler<HSTRING__ *,unsigned __int64>;
struct Windows::Foundation::IAsyncOperationWithProgress<HSTRING__ *,unsigned __int64>;
struct Windows::Foundation::IAsyncOperation<unsigned int>;
struct Windows::Foundation::IAsyncOperationProgressHandler_impl<unsigned __int64,unsigned __int64>;
struct Windows::Foundation::IAsyncOperationProgressHandler<unsigned __int64,unsigned __int64>;
struct Windows::Foundation::IAsyncOperationWithProgress<unsigned __int64,unsigned __int64>;
struct Windows::Foundation::IAsyncOperationCompletedHandler_impl<Windows::Foundation::Collections::IMap<HSTRING__ *,IInspectable *> *>;
struct Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IMap<HSTRING__ *,IInspectable *> *>;
struct Windows::Foundation::IAsyncOperation_impl<Windows::Foundation::Collections::IMap<HSTRING__ *,IInspectable *> *>;
struct Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IMap<HSTRING__ *,IInspectable *> *>;
struct Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IMap<HSTRING__ *,HSTRING__ *> *>;
struct Windows::Foundation::IAsyncOperation_impl<Windows::Foundation::Collections::IMap<HSTRING__ *,HSTRING__ *> *>;
struct Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IMap<HSTRING__ *,HSTRING__ *> *>;
struct Windows::Foundation::IAsyncOperationCompletedHandler_impl<Windows::Foundation::Internal::AggregateType<bool,unsigned char> >;
struct Windows::Foundation::IAsyncOperationCompletedHandler<bool>;
struct Windows::Foundation::IAsyncOperation<bool>;
struct Windows::Foundation::IAsyncOperationCompletedHandler_impl<Windows::Foundation::TimeSpan>;
struct Windows::Foundation::IAsyncOperation_impl<Windows::Foundation::TimeSpan>;
struct Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVector<HSTRING__ *> *>;
struct Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVector<HSTRING__ *> *>;
struct Windows::Foundation::IAsyncOperationCompletedHandler_impl<Windows::Foundation::Collections::IVectorView<HSTRING__ *> *>;
struct Windows::Foundation::IAsyncOperation_impl<Windows::Foundation::Collections::IVectorView<HSTRING__ *> *>;
class SafeInt<unsigned long,SafeIntInternal::SafeIntExceptionHandler<SafeIntException> >;
struct Windows::Foundation::IAsyncOperationCompletedHandler_impl<Windows::Foundation::Collections::IVector<unsigned int> *>;
struct Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVector<unsigned int> *>;
struct Windows::Foundation::IAsyncOperation_impl<Windows::Foundation::Collections::IVector<unsigned int> *>;
struct _PROPSHEETHEADERW_V2;
struct Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVector<unsigned int> *>;
struct Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Foundation::Collections::IPropertySet *> *>;
struct Windows::Foundation::IEventHandler_impl<IInspectable *>;
struct Windows::Foundation::IEventHandler<IInspectable *>;
struct _EVENT_DESCRIPTOR;
class CPictioFileStream;
struct _EVENT_FILTER_DESCRIPTOR;
class CComActivator;
struct IStandardActivator;
struct Windows::Foundation::Collections::IIterator_impl<unsigned char,1>;
struct Windows::Foundation::Collections::IVectorView_impl<unsigned char,1>;
struct Windows::Foundation::Collections::IVector_impl<unsigned char,1>;
struct Windows::Foundation::Collections::IIterator_impl<HSTRING__ *,1>;
struct Windows::Foundation::Collections::IVectorView_impl<HSTRING__ *,1>;
struct Windows::Foundation::Collections::IIterator_impl<int,1>;
struct Windows::Foundation::Collections::IVector_impl<int,1>;
struct Windows::Foundation::Collections::IIterator_impl<IInspectable *,1>;
struct Windows::Foundation::Collections::IVectorView_impl<IInspectable *,1>;
struct _APPINFO_PROCESS_INFORMATION;
struct Windows::Foundation::Collections::IVector_impl<IInspectable *,1>;
struct Windows::Foundation::Collections::IIterator_impl<unsigned int,1>;
struct _ais_MIDL_TYPE_FORMAT_STRING;
struct Windows::Foundation::Collections::IVectorView_impl<unsigned int,1>;
struct Windows::Foundation::Collections::IVector_impl<unsigned int,1>;
struct Windows::Foundation::Collections::IVector_impl<Windows::Foundation::Collections::IPropertySet *,1>;
struct Windows::Foundation::Collections::IIterator_impl<Windows::Foundation::Collections::IIterable<Windows::Foundation::Point> *,1>;
struct Windows::Foundation::Collections::IIterable_impl<Windows::Foundation::Point>;
struct Windows::Foundation::Collections::IIterator_impl<Windows::Foundation::Collections::IKeyValuePair<_GUID,IInspectable *> *,1>;
struct Windows::Foundation::Collections::IKeyValuePair_impl<_GUID,IInspectable *>;
struct Windows::Foundation::Collections::IIterator_impl<Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,HSTRING__ *> *,1>;
struct Windows::Foundation::Collections::IKeyValuePair_impl<HSTRING__ *,HSTRING__ *>;
struct Windows::Foundation::Collections::IKeyValuePair_impl<HSTRING__ *,unsigned char>;
struct Windows::Foundation::Collections::IIterator_impl<Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,Windows::Foundation::Collections::IVector<HSTRING__ *> *> *,1>;
class CAutoHandle_Policy<HBITMAP__ *>;
struct Windows::Foundation::Collections::IKeyValuePair_impl<HSTRING__ *,Windows::Foundation::Collections::IVector<HSTRING__ *> *>;
struct Windows::Foundation::Collections::IIterator_impl<Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,IWeakReference *> *,1>;
struct Windows::Foundation::Collections::IKeyValuePair_impl<HSTRING__ *,IWeakReference *>;
struct Windows::Foundation::Collections::IKeyValuePair_impl<unsigned int,HSTRING__ *>;
class CAutoHandle_Policy<_IMAGELIST *>;
struct Windows::Foundation::Collections::IIterator_impl<Windows::Foundation::Collections::IKeyValuePair<unsigned int,IInspectable *> *,1>;
class CLimitedStreamBase;
struct Windows::Foundation::Collections::IKeyValuePair_impl<unsigned int,IInspectable *>;
struct Windows::Foundation::Collections::IKeyValuePair_impl<EventRegistrationToken,int>;
struct EventRegistrationToken;
struct Windows::Foundation::Collections::IVectorView_impl<Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,IInspectable *> *,1>;
struct Windows::Foundation::Collections::IVectorView_impl<Windows::Foundation::Collections::IKeyValuePair<IInspectable *,IInspectable *> *,1>;
struct tagSExtEntry;
struct WireThatPart1;
struct WireThatPart2;
union WireThat;
class CRpcChannelBuffer::CServerCallMgr;
class IInternalChannelBuffer;
class CAptRpcChnl;
class CCliModalLoop::SuspendPointerMessageReorderingForCallout;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IClientSecurity> >;
struct SystemPageEntry;
struct SystemBlockHeader;
class CWriteMarshalingStreamOnBuffer;
class CBaseMarshalingStreamOnBuffer;
class CContinue;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IEnumFORMATETC> const >;
class CLimitedEnum<IEnumFORMATETC,tagFORMATETC>;
class CAbstractMarshalingStream;
class CarefulBufferReader;
class CPunkForRelease;
class CReadOnlyStorage::OpenStream::__l3::<lambda_06753d44fabdf6f1be7cf845dfdc4a1d>;
struct IRpcProxyBufferVtbl;
class CLimitedStreamBase::Read::__l3::<lambda_1d3e9cec5d0be582368322f4bdd08717>;
class CLimitedWritableStorage::Commit::__l3::<lambda_26e00a44b5e75a8212ee43acc259a440>;
struct IRpcChannelBufferVtbl;
class CTContainer_PolicyHeapMem;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<CClipboardBroker::CClipboardBrokerMTAHelper> >;
class Microsoft::WRL::ComPtr<CClipboardBroker>;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IDropTarget> >;
class Microsoft::WRL::ComPtr<IOleDragDropBrokerHost>;
struct IUnknownVtbl;
struct tagProxyFileInfo;
struct Microsoft::WRL::Details::VerifyInterfaceHelper<2,IClipboardBrokerInternal,0,0>;
struct IPSFactoryBufferVtbl;
struct Microsoft::WRL::Details::VerifyInterfaceHelper<2,IDragDropBroker,0,0>;
class RunSyncOnMTAThread::__l6::<lambda_e4d9963fca444867e81b31e07eea7c19>;
struct _winrt_mega_MIDL_TYPE_FORMAT_STRING;
struct _winrt_mega_MIDL_PROC_FORMAT_STRING;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IOSTaskCompletion> const >;
struct IDragOperationInternal;
struct _iinspectablederived_MIDL_TYPE_FORMAT_STRING;
struct _iinspectablederived_MIDL_PROC_FORMAT_STRING;
struct _iinspectable_MIDL_PROC_FORMAT_STRING;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<CDragOperation> const >;
struct tagOLEMENUITEM;
struct IRunningObjectTableVtbl;
class CDefObject::CAdvSinkImpl;
class CBrokeredClipDataObject::GetData::__l18::<lambda_9038f5cd04fe423d0b355f35137b03f8>;
struct IConnectionPointContainer;
struct tagWIN16BITMAP;
struct tagOLEPRESSTMHDR;
struct IEnumConnectionPoints;
struct IEnumConnectionPointsVtbl;
class CEnumSTATPROPSETSTG;
struct IConnectionPointVtbl;
struct _DROPFILES;
struct IEnumConnections;
struct IEnumConnectionsVtbl;
class CReadOnlyStorage::OpenStorage::__l3::<lambda_376f20a7f761b1a914870a4c37a2c6eb>;
struct tagCONNECTDATA;
class CLimitedWritableStorage::CreateStorage::__l3::<lambda_3d0d8c632c493a1367d4ad18dac4126c>;
class CLimitedWritableStream::Commit::__l3::<lambda_43c76ecaff64e893b92a200899338256>;
struct _mega_MIDL_EXPR_FORMAT_STRING;
class CLimitedWritableStorage::Stat::__l3::<lambda_5a7ee79f1a5dbf5525cf96804f60dee2>;
struct IStorageVtbl;
class CEnumFmt10;
class CLimitedWritableStream::Write::__l3::<lambda_b1d64bc0ad19ef9da31864aa0a7d08ca>;
class CLimitedStreamBase::Stat::__l3::<lambda_b251297daad7f949bc4e8db897efd8f3>;
class CLimitedStreamBase::LockRegion::__l3::<lambda_f6246093c18836eeef48690633d1932f>;
class CClipDataObject::CacheDataPointer::__l48::<lambda_325c8d3d6db6c6641124978038457cb8>;
struct IClipboardTaskCompletion;
struct std::nothrow_t;
struct CDdeObject::COleItemContainerImpl;
struct IEnumUnknownVtbl;
struct IOlePackagerLinkNotify;
struct IImageList;
class CRefStabilize;
struct _CLINFO;
struct _mega_MIDL_PROC_FORMAT_STRING;
struct IAdviseSink2Vtbl;
class CPoint;
struct IFillLockBytesVtbl;
struct SDDInfo;
struct IContinueVtbl;
struct IViewObjectVtbl;
struct INFO;
class CFunctionDiscoveryNotificationWrapper;
struct IBindCtxVtbl;
class CBrokeredClipDataObject;
struct Microsoft::WRL::Details::ImplementsHelper<Microsoft::WRL::RuntimeClassFlags<2>,Microsoft::WRL::Details::InterfaceList<IDataObject,Microsoft::WRL::Details::Nil>,0,0>;
class Microsoft::WRL::Details::ComPtrRefBase<Microsoft::WRL::ComPtr<IClipboardBroker> >;
struct IEnumOLEVERBVtbl;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IAgileDataObject> const >;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IAllowAstaToAstaDeadlockRisk> const >;
class RunSyncOnMTAThread::__l6::<lambda_52178b04d071d74c34a4fe65e5d50597>;
class RenderFormat::__l29::<lambda_02c50d60fc17d1863d52e4e4970132e8>;
struct AsyncIAdviseSinkVtbl;
class CStatData;
struct CArray<CStatData>::ArrayNode;
struct IOleCache2Vtbl;
class Microsoft::WRL::Details::RuntimeClass<Microsoft::WRL::Details::InterfaceList<IClipboardBroker,Microsoft::WRL::Details::Nil>,Microsoft::WRL::RuntimeClassFlags<2>,1,0,0>;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<CClipboardBroker::CClipboardBrokerExternalReference> >;
struct Microsoft::WRL::Details::ImplementsHelper<Microsoft::WRL::RuntimeClassFlags<2>,Microsoft::WRL::Details::InterfaceList<IClipboardBrokerInternal,Microsoft::WRL::Details::Nil>,0,0>;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IImpersonateClipboardOwner> >;
struct IEnumStringVtbl;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IClipboardBrokerInternal> const >;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<CClipboardBroker::CClipboardBrokerMTAHelper> const >;
class Microsoft::WRL::ComPtr<IUnwrappableDataObject>;
struct ISequentialStreamVtbl;
struct IOlePresObj;
class ios;
class CArray<CCacheNode>;
class Microsoft::WRL::ComPtr<IGlobalInterfaceTable>;
class Windows::Internal::Details::Git;
struct IEnumSTATDATAVtbl;
class RegistryKey::ValueInformationClass<_KEY_VALUE_FULL_INFORMATION>;
class Windows::Internal::GitPtrImpl<Windows::Internal::GitPtr>;
struct MarshallingChannel;
struct InterfaceWalkerFree;
struct DISPATCH_INTERCEPTOR;
struct IClassFactoryVtbl;
struct DedicatedAllocator<DISPATCH_SERVER_FRAME>;
struct IDataObjectVtbl;
class CALLFRAME_CACHE_ENTRY<INTERFACE_HELPER_CLSID>;
struct INTERPRETER_OPT_FLAGS;
struct __MIDL_ICallFrame_0001;
struct MD_METHOD;
struct ITypeLibVtbl;
struct IAdviseSinkVtbl;
struct AsyncIAdviseSink2Vtbl;
struct IInterceptorBase;
class Map<MAP_KEY_GUID,TYPEINFOVTBL *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>::Assoc;
struct IEnumMonikerVtbl;
struct IEnumFORMATETCVtbl;
struct MAP_SHARED<MAP_KEY_GUID,MD_INTERFACE *>;
struct IRecordInfoVtbl;
struct IOleInPlaceActiveObjectVtbl;
struct ITypeCompVtbl;
struct _prop_MIDL_PROC_FORMAT_STRING;
struct IEnumSTATPROPSETSTGVtbl;
struct IEnumSTATPROPSTGVtbl;
struct ICallFactoryVtbl;
class HashGUID;
class HashInt;
class HashVoidPtr;
struct AllocateThrow;
struct SAFEARRAY_INTERNAL;
struct HREG;
struct __MIDL_ICallFrame_0004;
struct _OA_SAFEARRAY_USER_MARSHAL_ROUTINE_TRIPLE;
struct OLEAUTOMATION_FUNCTIONS;
struct OAUTIL;
struct MD_INTERFACE;
struct MD_PARAM;
struct MD_INTERFACE_CACHE;
struct INTERPRETER_OPT_FLAGS2;
struct NDR_PROC_HEADER_EXTS;
struct INTERPRETER_FLAGS;
class MAP<XSLOCK,MAP_KEY_GUID,MD_INTERFACE *>::iterator;
struct MAP_HASHER<MAP_KEY_GUID>;
class Interceptor;
struct ICallFrame;
struct DedicatedAllocator<CallFrame>;
struct ICallUnmarshal;
struct IUnkInner;
struct IMarshalSomeone;
struct SSimpleWalker;
struct LEGACY_FRAME;
struct DISPATCH_FRAME;
struct DISPATCH_CLIENT_FRAME;
struct FRAME_Invoke;
struct DISPATCH_SERVER_FRAME;
class Map<MAP_KEY_GUID,INTERFACE_HELPER_CLSID *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>::Assoc;
class EnumMap<MAP_KEY_GUID,TYPEINFOVTBL *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>;
class MAP<XSLOCK,MAP_KEY_GUID,TYPEINFOVTBL *>::iterator;
class Enum;
class ClassRegistration;
struct FRAME_GetTypeInfoCount;
struct FRAME_GetTypeInfo;
struct FRAME_GetIDsOfNames;
struct _callframeinternal_MIDL_PROC_FORMAT_STRING;
struct IDispatchVtbl;
class CSafeBindCtx;
class CSafeMoniker;
class CReadMInterfacePointerWithSourceAttributesMarshalingStream;
class CReadInterfaceDataFromInternalSourceMarshalingStream;
class CWriteInterfaceDataMarshalingStream;
class CEndPointAtom;
class ProcessToken;
class CThreadCheck;
struct _IMAGELISTDRAWPARAMS;
struct tagTVITEMEXW;
struct CONFIRM_CONFLICT_ITEM;
struct IFunctionDiscoveryNotification;
struct CONFLICT_ITEM_METADATA;
struct _RESOLVED_USERNAME_LIST;
class CancellableCall;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IDataObject> >;
class CFormatOnlyDataObject;
class Microsoft::WRL::Details::RuntimeClass<Microsoft::WRL::Details::InterfaceList<IDataObject,Microsoft::WRL::Details::Nil>,Microsoft::WRL::RuntimeClassFlags<2>,1,0,0>;
class Microsoft::WRL::ComPtr<IDropTarget>;
class CPrivDragDrop;
struct IPrivDragDrop;
class CInterfaceFromWindowProp;
class Microsoft::WRL::Details::ComPtrRefBase<Microsoft::WRL::ComPtr<IDataObject> >;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<CFormatOnlyDataObject> const >;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<CFormatOnlyDataObject> >;
struct Microsoft::WRL::Details::ImplementsHelper<Microsoft::WRL::RuntimeClassFlags<2>,Microsoft::WRL::Details::InterfaceList<Microsoft::WRL::FtmBase,Microsoft::WRL::Details::Nil>,1,1>;
class Microsoft::WRL::Details::MakeAllocator<CFormatOnlyDataObject,0>;
struct Microsoft::WRL::Details::VerifyInterfaceHelper<2,IClipboardTaskCompletion,0,0>;
struct Microsoft::WRL::Details::VerifyInterfaceHelper<2,IDataObject,0,0>;
struct Microsoft::WRL::Details::VerifyInterfaceHelper<2,Microsoft::WRL::FtmBase,1,1>;
struct CDdeObject::COleObjectImpl;
struct CDdeObject::CProxyManagerImpl;
class CDdeConnectionTable;
class CDdeObject;
class CPackagerMoniker;
struct tagDISPATCHDATA;
struct tagOLE1DISPATCHDATA;
struct tagDDEDISPATCHDATA;
struct DDEPOKE;
struct _OLETARGETDEVICE;
struct tagSRVRDISPATCHDATA;
class CDDEServer;
struct CDefClient::COleClientSiteImpl;
struct CDefClient::CAdviseSinkImpl;
class CDefClient;
struct tagDOCDISPATCHDATA;
class CMapDwordPtr;
struct _HOSTNAMES;
class CDAHolder;
struct MEMSTM;
struct IUnwrappableDataObject;
class CDragDefaultCursors;
class CForcedDropTarget;
struct CompObjHdr;
class CompObjStmData;
struct __CRT_LIST_ENTRY;
struct _CRT_CRITICAL_SECTION_DEBUG;
class ostream;
class istream_withassign;
class COleCache::CCacheUnkImpl;
class COleCache::CCacheViewImpl;
class COleCache::CAdviseSinkImpl;
class COleCache;
class CEnumFormatEtc;
class CFormatEtc;
struct CArray<CFormatEtc>::ArrayNode;
class CGenObject;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IGlobalInterfaceTable> >;
class RegistryKey;
class RegistryKey::ValueInformationClass<_KEY_VALUE_BASIC_INFORMATION>;
class RegistryKey::KeyInformationClass<_KEY_BASIC_INFORMATION>;
class RegistryKey::KeyInformationClass<_KEY_NODE_INFORMATION>;
class RegistryKey::KeyInformationClass<_KEY_NAME_INFORMATION>;
class RegistryKey::KeyInformationClass<_KEY_CACHED_INFORMATION>;
class RegistryKey::KeyInformationClass<_KEY_FLAGS_INFORMATION>;
class RegistryKey::KeyInformationClass<_KEY_VIRTUALIZATION_INFORMATION>;
class RegistryKey::KeyInformationClass<_KEY_HANDLE_TAGS_INFORMATION>;
class Microsoft::WRL::ComPtr<IClipboardTaskCompletion>;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IClipboardTaskCompletion> >;
struct IClipboardBroker;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IClipboardBroker> const >;
class Quirks;
class Microsoft::WRL::ComPtr<IAgileDataObject>;
class Microsoft::WRL::ComPtr<IAllowAstaToAstaDeadlockRisk>;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IAllowAstaToAstaDeadlockRisk> >;
class RemoveClipboardDataObject::__l15::<lambda_c248d166ff38255224592560a2bc49d2>;
class RunSyncOnMTAThread::__l6::<lambda_583c40b2f0e13cd1205ef1308ce4cb3b>;
class RenderFormat::__l40::<lambda_d3db58fcfa6e491247d9837852f5b90f>;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<ICallingProcessInfo> const >;
class CClipboardBroker::CClipboardBrokerExternalReference;
class Microsoft::WRL::RuntimeClass<Microsoft::WRL::RuntimeClassFlags<2>,IClipboardBroker,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil>;
class Microsoft::WRL::ComPtr<CClipboardBroker::CClipboardBrokerExternalReference>;
class Microsoft::WRL::RuntimeClass<Microsoft::WRL::RuntimeClassFlags<2>,IClipboardBrokerInternal,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil>;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IImpersonateClipboardOwner> const >;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IClipboardBrokerInternal> >;
class Microsoft::WRL::ComPtr<CClipboardBroker::CClipboardBrokerMTAHelper>;
class CBrokerInstanceHolder;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IRuntimeBroker> const >;
class ClipboardBrokerFactory;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<CClipboardBroker> const >;
class Microsoft::WRL::Details::RuntimeClass<Microsoft::WRL::Details::InterfaceList<IDragDropBroker,Microsoft::WRL::Details::InterfaceList<Microsoft::WRL::FtmBase,Microsoft::WRL::Details::Nil> >,Microsoft::WRL::RuntimeClassFlags<2>,1,0,0>;
struct Microsoft::WRL::Details::ImplementsHelper<Microsoft::WRL::RuntimeClassFlags<2>,Microsoft::WRL::Details::InterfaceList<IDragDropBroker,Microsoft::WRL::Details::InterfaceList<Microsoft::WRL::FtmBase,Microsoft::WRL::Details::Nil> >,0,0>;
struct IDragDropBroker;
class Microsoft::WRL::ComPtr<CDragDropBroker>;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<CDragDropBroker> const >;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<CDragDropBroker> >;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IOleDragDropBrokerHost> const >;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IOleDragDropBrokerHost> >;
class Microsoft::WRL::ComPtr<IDragDropBroker>;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IDragDropBroker> const >;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IClientSecurity> const >;
class Microsoft::WRL::Details::MakeAllocator<CClipboardBroker::CClipboardBrokerExternalReference,0>;
class Microsoft::WRL::Details::MakeAllocator<CClipboardBroker::CClipboardBrokerMTAHelper,0>;
class Microsoft::WRL::Details::MakeAllocator<CDragDropBroker,0>;
struct Microsoft::WRL::Details::VerifyInterfaceHelper<2,IClipboardBroker,0,0>;
class RunSyncOnMTAThread::__l6::<lambda_22dc3191a88abed9f8b6647e376e48cc>;
class RunSyncOnMTAThread::__l6::<lambda_49bd6d31e72285254afbcbbda8284e88>;
class CClipboardBroker::SetClipboard::__l27::<lambda_107f176cb6c6e46ea85d99435f3e4ef2>;
class CClipboardBroker::SetClipboard::__l43::<lambda_f4b567f3a52bce907549bd3683adae93>;
class RunSyncOnMTAThread::__l6::<lambda_fc44a47bd6a321eacb10e8c8a7b99b7d>;
struct IOSTaskCompletion;
class Microsoft::WRL::ComPtr<IOSTaskCompletion>;
class Microsoft::WRL::Details::ComPtrRefBase<Microsoft::WRL::ComPtr<IOSTaskCompletion> >;
class ScheduleClipboardWorkWithPLM::__l15::<lambda_a1bbb6d7f7670319de1cc3d840fc6b53>;
class ClipboardDataObjectTask;
class CContainer_PolicySysFree;
class CAutoHandle_HGLOBALPolicy;
class CTContainer_PolicyCoTaskMem;
class CAutoHandle_Policy<void *>;
class CAutoHandle_Policy<HKEY__ *>;
class CAutoHandle_Policy<HACCEL__ *>;
class CAutoHandle_Policy<HWND__ *>;
class CAutoHandle_Policy<HICON__ *>;
class CAutoHandle_Policy<HWINSTA__ *>;
class CAutoHandle_Policy<HBRUSH__ *>;
class CAutoHandle_Policy<HFONT__ *>;
class CAutoHandle_Policy<HPALETTE__ *>;
class CAutoHandle_Policy<HPEN__ *>;
class CAutoHandle_Policy<HRGN__ *>;
class CAutoHandle_Policy<HDC__ *>;
class Microsoft::WRL::ComPtr<IStream>;
class CWrapperBase<IStream>;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<ClipboardDataObjectTask> >;
class Microsoft::WRL::Details::ComPtrRefBase<Microsoft::WRL::ComPtr<IStream> >;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IStorage> const >;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IStorage> >;
class Microsoft::WRL::Details::ComPtrRefBase<Microsoft::WRL::ComPtr<IEnumSTATSTG> >;
class Microsoft::WRL::Details::ComPtrRefBase<Microsoft::WRL::ComPtr<ClipboardDataObjectTask> >;
class Microsoft::WRL::Details::MakeAllocator<ClipboardDataObjectTask,0>;
class CLimitedEnum<IEnumSTATSTG,tagSTATSTG>::Reset::__l3::<lambda_110396d210f0cab77c6f05edf336ec9c>;
class CReadOnlyStorage::Stat::__l3::<lambda_258276e669b26aafa9d5af3604e91821>;
class CLimitedEnum<IEnumSTATSTG,tagSTATSTG>::Skip::__l3::<lambda_275c330a7dbd73c4a7cb996df3f1f53b>;
class CWrapperBase<IStorage>::{dtor}::__l3::<lambda_2c526b8f9b5c4fec0fd82394fba04bff>;
class CLimitedEnum<IEnumFORMATETC,tagFORMATETC>::Next::__l3::<lambda_43608e43e12d4445c570d9a4073a7add>;
class CBrokeredClipDataObject::QueryGetData::__l9::<lambda_4374bd87bfc76f1acaee4c6e94e7c6be>;
class CBrokeredClipDataObject::EnumFormatEtc::__l9::<lambda_507d21d5b830ceb6eb9e23fcb05140d1>;
class CLimitedEnum<IEnumFORMATETC,tagFORMATETC>::Reset::__l3::<lambda_52fcfe8b208db4e8db7a2d757b99428c>;
class CLimitedWritableStorage::OpenStream::__l3::<lambda_5552023244521873519ffd30326ef4c4>;
class CBrokeredClipDataObject::SetData::__l24::<lambda_67fbb9ab64f5f8be2889f05e118aa56e>;
class CLimitedStreamBase::UnlockRegion::__l3::<lambda_680a47e758b2515dcc39d2c534a5080c>;
class CReadOnlyStorage::CopyTo::__l12::<lambda_7a396053b5f75b9165421f75e2641942>;
class CLimitedEnum<IEnumSTATSTG,tagSTATSTG>::Clone::__l3::<lambda_d2536559bd92546989d14f1eea499887>;
class CLimitedWritableStorage::Revert::__l3::<lambda_eaa0262d9db74d8aa862f753b9b0a590>;
class CLimitedWritableStorage::EnumElements::__l3::<lambda_f2ad4e3fec543e133d024405e626b57e>;
class CClass;
class CGenericObject;
struct SYNTHESIZED_MAP;
class CEnumFormatEtcDataArray;
class CEnumHolder;
struct IEnumHolder;
struct IEnumCallback;
class CDragOperation;
class Microsoft::WRL::RuntimeClass<Microsoft::WRL::RuntimeClassFlags<2>,IDragOperationInternal,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil>;
class CDropTarget;
class Microsoft::WRL::ComPtr<CDragOperation>;
struct Microsoft::WRL::Details::VerifyInterfaceHelper<2,IDragOperationInternal,0,0>;
struct tagOLEMENU;
class CPaccelEnum;
class CDataAdviseCache;
class CAggId;
class CDefObject::CPrivUnknown;
class CDefObject;
union _ASSEMBLY_VERSION;
struct _ACTIVATION_CONTEXT_DATA_COM_SERVER_REDIRECTION;
class CDefClassFactory;
class CDefLink;
struct USERPREFS;
struct PICTINFO;
struct tagWIN16METAFILEPICT;
struct tagHDIBFILEHDR;
class PSStream;
class CPropSetName;
class CPropertySetStorage;
struct tagSTATPROPBAG;
struct IPropertyBagEx;
class CSTATPROPBAGArray;
class CEnumSTATPROPBAG;
class CConnectionPoint;
class CBasedSeekPointerPtr;
class CUpdate;
class CBasedDeltaBlockPtr;
struct SDeltaBlock;
class CWrappedDocFile;
class CNtfsStream;
class CRootPubDocFile;
class CDocfileUnmarshalFactory;
struct CExposedIterator;
struct SCopyVars;
struct SDfMarshalPacket;
class Microsoft::WRL::ComPtr<IMarshalingStream>;
class CHandle;
class CStmHandle;
class CDirectStream;
class CPtrCache;
class TStackBuffer<tagPROPVARIANT,64>;
class TStackBuffer<unsigned long,64>;
class CComCat;
struct ICatRegister;
class CEnumCategories;
class CsCatInfo;
class CSCMergedEnum<IEnumCATEGORYINFO,tagCATEGORYINFO>;
struct tagCLASS_DATA;
class CProperty;
struct CMap<unsigned short *,unsigned short * &,unsigned long,unsigned long &>::CAssoc;
struct FONTFACEDATA;
struct FCR;
struct CFont::Load::__l2::FONTDATA;
struct CFont::Save::__l2::FONTDATA;
struct ICacheStream;
class CPicture;
class SafeIntException;
class SafeIntInternal::SafeIntExceptionHandler<SafeIntException>;
class SafeIntInternal::SafeIntExceptionHandler<SafeIntInternal::SafeIntWin32Exception>;
class LargeIntRegMultiply<unsigned __int64,unsigned int>;
class LargeIntRegMultiply<unsigned __int64,int>;
class LargeIntRegMultiply<unsigned __int64,__int64>;
class LargeIntRegMultiply<int,unsigned __int64>;
class LargeIntRegMultiply<unsigned int,__int64>;
class LargeIntRegMultiply<__int64,int>;
class LargeIntRegMultiply<__int64,unsigned __int64>;
class MultiplicationHelper<unsigned __int64,unsigned __int64,5>;
class MultiplicationHelper<unsigned __int64,__int64,7>;
class MultiplicationHelper<__int64,__int64,11>;
class MultiplicationHelper<__int64,unsigned __int64,15>;
class SubtractionHelper<__int64,unsigned __int64,21>;
class SafeInt<long,SafeIntInternal::SafeIntExceptionHandler<SafeIntException> >;
class CBmpLoader;
struct WMFHEADER;
struct DESCRIPTOR;
class SafeCastHelper<unsigned short,unsigned short,0>;
class SafeCastHelper<long,long,0>;
class SafeCastHelper<unsigned long,unsigned long,0>;
class MultiplicationHelper<unsigned short,unsigned short,2>;
class MultiplicationHelper<long,long,1>;
class AdditionHelper<long,long,6>;
class MultiplicationHelper<unsigned long,unsigned long,3>;
class MultiplicationHelper<unsigned long,unsigned int,3>;
class AdditionHelper<unsigned long,unsigned int,1>;
class BinaryAndHelper<long,int,0>;
struct CPageHolderTemplate;
class CPageHolder;
class COlePropertySheet;
class CArray<_GUID,_GUID &>;
struct DLGTEMPLATEEX;
class SafeCastHelper<unsigned long,unsigned int,0>;
struct IDataTransfer;
struct IImageFilter;
struct ISyncAdvise;
class CUnknown;
struct _GDI_TEB_BATCH64;
struct _APPINFO_STARTUPINFO;
struct _TEB64;
struct _ais_MIDL_PROC_FORMAT_STRING;
class BUCL::CMultiplier<unsigned long,BUCL::Rtl::CCallDisposition>;
class CRtlSmartUcsEncoderTraits<_LUTF8_STRING>;
class CRtlSmartUcsEncoderTraitsBase<CRtlSmartUcsEncoderTraits<_LUTF8_STRING> >;
class Windows::AutoOperatorAmpersandHelper<_LUNICODE_STRING,Windows::Auto<_LUNICODE_STRING> >;
struct RTL_FILTER_LUNICODE_STRING_FILTER;
class CTCoAllocPolicy;
class CTHeapAllocPolicy;
class CTSmartPtr<unsigned short,CTContainer_PolicyLocalMem>;
class CTGlobalAllocPolicy;
class CTSmartPtr_PolicyComplete<CTContainer_PolicyLocalMem>;
struct CMemString_PolicyCoTaskMem;
class ARI::ProcessToken::AutoSysAppId;
struct CMemString_PolicyLocalMem;
class Common::AutoPtr<_TOKEN_SECURITY_ATTRIBUTES_INFORMATION,&ARI::AutoPtrAriHeapDeallocate<_TOKEN_SECURITY_ATTRIBUTES_INFORMATION> >;
struct CMemString_PolicyAutoMem;
class Windows::Internal::ResourceString;
class OLE_TYPEMGR;
class CDateInfo;
struct APP_DATA;
struct INotARealInterface;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<INotARealInterface> const >;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<INotARealInterface> >;
struct $_TypeDescriptor$_extraBytes_24;
struct $_s__CatchableTypeArray$_extraBytes_8;
union FT;

typedef enum _SYSTEM_INFORMATION_CLASS
{
  SystemBasicInformation = 0,
  SystemProcessorInformation = 1,
  SystemPerformanceInformation = 2,
  SystemTimeOfDayInformation = 3,
  SystemPathInformation = 4,
  SystemProcessInformation = 5,
  SystemCallCountInformation = 6,
  SystemDeviceInformation = 7,
  SystemProcessorPerformanceInformation = 8,
  SystemFlagsInformation = 9,
  SystemCallTimeInformation = 10,
  SystemModuleInformation = 11,
  SystemLocksInformation = 12,
  SystemStackTraceInformation = 13,
  SystemPagedPoolInformation = 14,
  SystemNonPagedPoolInformation = 15,
  SystemHandleInformation = 16,
  SystemObjectInformation = 17,
  SystemPageFileInformation = 18,
  SystemVdmInstemulInformation = 19,
  SystemVdmBopInformation = 20,
  SystemFileCacheInformation = 21,
  SystemPoolTagInformation = 22,
  SystemInterruptInformation = 23,
  SystemDpcBehaviorInformation = 24,
  SystemFullMemoryInformation = 25,
  SystemLoadGdiDriverInformation = 26,
  SystemUnloadGdiDriverInformation = 27,
  SystemTimeAdjustmentInformation = 28,
  SystemSummaryMemoryInformation = 29,
  SystemMirrorMemoryInformation = 30,
  SystemPerformanceTraceInformation = 31,
  SystemObsolete0 = 32,
  SystemExceptionInformation = 33,
  SystemCrashDumpStateInformation = 34,
  SystemKernelDebuggerInformation = 35,
  SystemContextSwitchInformation = 36,
  SystemRegistryQuotaInformation = 37,
  SystemExtendServiceTableInformation = 38,
  SystemPrioritySeperation = 39,
  SystemVerifierAddDriverInformation = 40,
  SystemVerifierRemoveDriverInformation = 41,
  SystemProcessorIdleInformation = 42,
  SystemLegacyDriverInformation = 43,
  SystemCurrentTimeZoneInformation = 44,
  SystemLookasideInformation = 45,
  SystemTimeSlipNotification = 46,
  SystemSessionCreate = 47,
  SystemSessionDetach = 48,
  SystemSessionInformation = 49,
  SystemRangeStartInformation = 50,
  SystemVerifierInformation = 51,
  SystemVerifierThunkExtend = 52,
  SystemSessionProcessInformation = 53,
  SystemLoadGdiDriverInSystemSpace = 54,
  SystemNumaProcessorMap = 55,
  SystemPrefetcherInformation = 56,
  SystemExtendedProcessInformation = 57,
  SystemRecommendedSharedDataAlignment = 58,
  SystemComPlusPackage = 59,
  SystemNumaAvailableMemory = 60,
  SystemProcessorPowerInformation = 61,
  SystemEmulationBasicInformation = 62,
  SystemEmulationProcessorInformation = 63,
  SystemExtendedHandleInformation = 64,
  SystemLostDelayedWriteInformation = 65,
  SystemBigPoolInformation = 66,
  SystemSessionPoolTagInformation = 67,
  SystemSessionMappedViewInformation = 68,
  SystemHotpatchInformation = 69,
  SystemObjectSecurityMode = 70,
  SystemWatchdogTimerHandler = 71,
  SystemWatchdogTimerInformation = 72,
  SystemLogicalProcessorInformation = 73,
  SystemWow64SharedInformationObsolete = 74,
  SystemRegisterFirmwareTableInformationHandler = 75,
  SystemFirmwareTableInformation = 76,
  SystemModuleInformationEx = 77,
  SystemVerifierTriageInformation = 78,
  SystemSuperfetchInformation = 79,
  SystemMemoryListInformation = 80,
  SystemFileCacheInformationEx = 81,
  SystemThreadPriorityClientIdInformation = 82,
  SystemProcessorIdleCycleTimeInformation = 83,
  SystemVerifierCancellationInformation = 84,
  SystemProcessorPowerInformationEx = 85,
  SystemRefTraceInformation = 86,
  SystemSpecialPoolInformation = 87,
  SystemProcessIdInformation = 88,
  SystemErrorPortInformation = 89,
  SystemBootEnvironmentInformation = 90,
  SystemHypervisorInformation = 91,
  SystemVerifierInformationEx = 92,
  SystemTimeZoneInformation = 93,
  SystemImageFileExecutionOptionsInformation = 94,
  SystemCoverageInformation = 95,
  SystemPrefetchPatchInformation = 96,
  SystemVerifierFaultsInformation = 97,
  SystemSystemPartitionInformation = 98,
  SystemSystemDiskInformation = 99,
  SystemProcessorPerformanceDistribution = 100,
  SystemNumaProximityNodeInformation = 101,
  SystemDynamicTimeZoneInformation = 102,
  SystemCodeIntegrityInformation = 103,
  SystemProcessorMicrocodeUpdateInformation = 104,
  SystemProcessorBrandString = 105,
  SystemVirtualAddressInformation = 106,
  SystemLogicalProcessorAndGroupInformation = 107,
  SystemProcessorCycleTimeInformation = 108,
  SystemStoreInformation = 109,
  SystemRegistryAppendString = 110,
  SystemAitSamplingValue = 111,
  SystemVhdBootInformation = 112,
  SystemCpuQuotaInformation = 113,
  SystemNativeBasicInformation = 114,
  SystemErrorPortTimeouts = 115,
  SystemLowPriorityIoInformation = 116,
  SystemBootEntropyInformation = 117,
  SystemVerifierCountersInformation = 118,
  SystemPagedPoolInformationEx = 119,
  SystemSystemPtesInformationEx = 120,
  SystemNodeDistanceInformation = 121,
  SystemAcpiAuditInformation = 122,
  SystemBasicPerformanceInformation = 123,
  SystemQueryPerformanceCounterInformation = 124,
  SystemSessionBigPoolInformation = 125,
  SystemBootGraphicsInformation = 126,
  SystemScrubPhysicalMemoryInformation = 127,
  SystemBadPageInformation = 128,
  SystemProcessorProfileControlArea = 129,
  SystemCombinePhysicalMemoryInformation = 130,
  SystemEntropyInterruptTimingInformation = 131,
  SystemConsoleInformation = 132,
  SystemPlatformBinaryInformation = 133,
  SystemPolicyInformation = 134,
  SystemHypervisorProcessorCountInformation = 135,
  SystemDeviceDataInformation = 136,
  SystemDeviceDataEnumerationInformation = 137,
  SystemMemoryTopologyInformation = 138,
  SystemMemoryChannelInformation = 139,
  SystemBootLogoInformation = 140,
  SystemProcessorPerformanceInformationEx = 141,
  SystemSpare0 = 142,
  SystemSecureBootPolicyInformation = 143,
  SystemPageFileInformationEx = 144,
  SystemSecureBootInformation = 145,
  SystemEntropyInterruptTimingRawInformation = 146,
  SystemPortableWorkspaceEfiLauncherInformation = 147,
  SystemFullProcessInformation = 148,
  SystemKernelDebuggerInformationEx = 149,
  SystemBootMetadataInformation = 150,
  SystemSoftRebootInformation = 151,
  SystemElamCertificateInformation = 152,
  SystemOfflineDumpConfigInformation = 153,
  SystemProcessorFeaturesInformation = 154,
  SystemRegistryReconciliationInformation = 155,
  SystemEdidInformation = 156,
  MaxSystemInfoClass = 157,
} SYSTEM_INFORMATION_CLASS, *PSYSTEM_INFORMATION_CLASS;

typedef struct _GUID
{
  /* 0x0000 */ unsigned long Data1;
  /* 0x0004 */ unsigned short Data2;
  /* 0x0006 */ unsigned short Data3;
  /* 0x0008 */ unsigned char Data4[8];
} GUID, *PGUID; /* size: 0x0010 */

typedef enum _SE_AUDIT_OPERATION
{
  AuditPrivilegeObject = 0,
  AuditPrivilegeService = 1,
  AuditAccessCheck = 2,
  AuditOpenObject = 3,
  AuditOpenObjectWithTransaction = 4,
  AuditCloseObject = 5,
  AuditDeleteObject = 6,
  AuditOpenObjectForDelete = 7,
  AuditOpenObjectForDeleteWithTransaction = 8,
  AuditCloseNonObject = 9,
  AuditOpenNonObject = 10,
  AuditObjectReference = 11,
  AuditHandleCreation = 12,
} SE_AUDIT_OPERATION, *PSE_AUDIT_OPERATION;

enum tagTYPEFLAGS
{
  TYPEFLAG_FAPPOBJECT = 1,
  TYPEFLAG_FCANCREATE = 2,
  TYPEFLAG_FLICENSED = 4,
  TYPEFLAG_FPREDECLID = 8,
  TYPEFLAG_FHIDDEN = 16,
  TYPEFLAG_FCONTROL = 32,
  TYPEFLAG_FDUAL = 64,
  TYPEFLAG_FNONEXTENSIBLE = 128,
  TYPEFLAG_FOLEAUTOMATION = 256,
  TYPEFLAG_FRESTRICTED = 512,
  TYPEFLAG_FAGGREGATABLE = 1024,
  TYPEFLAG_FREPLACEABLE = 2048,
  TYPEFLAG_FDISPATCHABLE = 4096,
  TYPEFLAG_FREVERSEBIND = 8192,
  TYPEFLAG_FPROXY = 16384,
};

struct IInternetProtocolSink
{
}; /* size: 0x0004 */

typedef struct _JOBOBJECT_SECURITY_LIMIT_INFORMATION
{
  /* 0x0000 */ unsigned long SecurityLimitFlags;
  /* 0x0004 */ void* JobToken;
  /* 0x0008 */ struct _TOKEN_GROUPS* SidsToDisable;
  /* 0x000c */ struct _TOKEN_PRIVILEGES* PrivilegesToDelete;
  /* 0x0010 */ struct _TOKEN_GROUPS* RestrictedSids;
} JOBOBJECT_SECURITY_LIMIT_INFORMATION, *PJOBOBJECT_SECURITY_LIMIT_INFORMATION; /* size: 0x0014 */

struct Windows::AutoPODBase<_LUNICODE_STRING,Windows::Auto<_LUNICODE_STRING> >::is_pointer<_LUNICODE_STRING>
{
}; /* size: 0x0001 */

typedef enum _PROC_THREAD_ATTRIBUTE_NUM
{
  ProcThreadAttributeParentProcess = 0,
  ProcThreadAttributeHandleList = 2,
  ProcThreadAttributeGroupAffinity = 3,
  ProcThreadAttributePreferredNode = 4,
  ProcThreadAttributeIdealProcessor = 5,
  ProcThreadAttributeUmsThread = 6,
  ProcThreadAttributeMitigationPolicy = 7,
  ProcThreadAttributeSecurityCapabilities = 9,
  ProcThreadAttributeProtectionLevel = 11,
} PROC_THREAD_ATTRIBUTE_NUM, *PPROC_THREAD_ATTRIBUTE_NUM;

typedef struct _CRYPTOAPI_BLOB
{
  /* 0x0000 */ unsigned long cbData;
  /* 0x0004 */ unsigned char* pbData;
} CRYPTOAPI_BLOB, *PCRYPTOAPI_BLOB; /* size: 0x0008 */

typedef struct _SEALING_TIMESTAMP_ATTRIBUTE
{
  /* 0x0000 */ unsigned long version;
  /* 0x0004 */ unsigned long signerIndex;
  /* 0x0008 */ struct _CRYPTOAPI_BLOB sealTimeStampToken;
} SEALING_TIMESTAMP_ATTRIBUTE, *PSEALING_TIMESTAMP_ATTRIBUTE; /* size: 0x0010 */

typedef struct _SYSTEM_HANDLE_TABLE_ENTRY_INFO_EX
{
  /* 0x0000 */ void* Object;
  /* 0x0004 */ unsigned long UniqueProcessId;
  /* 0x0008 */ unsigned long HandleValue;
  /* 0x000c */ unsigned long GrantedAccess;
  /* 0x0010 */ unsigned short CreatorBackTraceIndex;
  /* 0x0012 */ unsigned short ObjectTypeIndex;
  /* 0x0014 */ unsigned long HandleAttributes;
  /* 0x0018 */ unsigned long Reserved;
} SYSTEM_HANDLE_TABLE_ENTRY_INFO_EX, *PSYSTEM_HANDLE_TABLE_ENTRY_INFO_EX; /* size: 0x001c */

struct Windows::Foundation::Collections::IIterable_impl<Windows::Foundation::Collections::IKeyValuePair<HSTRING__ *,IInspectable *> *>
{
}; /* size: 0x0004 */

typedef enum _SYSDBG_COMMAND
{
  SysDbgQueryModuleInformation = 0,
  SysDbgQueryTraceInformation = 1,
  SysDbgSetTracepoint = 2,
  SysDbgSetSpecialCall = 3,
  SysDbgClearSpecialCalls = 4,
  SysDbgQuerySpecialCalls = 5,
  SysDbgBreakPoint = 6,
  SysDbgQueryVersion = 7,
  SysDbgReadVirtual = 8,
  SysDbgWriteVirtual = 9,
  SysDbgReadPhysical = 10,
  SysDbgWritePhysical = 11,
  SysDbgReadControlSpace = 12,
  SysDbgWriteControlSpace = 13,
  SysDbgReadIoSpace = 14,
  SysDbgWriteIoSpace = 15,
  SysDbgReadMsr = 16,
  SysDbgWriteMsr = 17,
  SysDbgReadBusData = 18,
  SysDbgWriteBusData = 19,
  SysDbgCheckLowMemory = 20,
  SysDbgEnableKernelDebugger = 21,
  SysDbgDisableKernelDebugger = 22,
  SysDbgGetAutoKdEnable = 23,
  SysDbgSetAutoKdEnable = 24,
  SysDbgGetPrintBufferSize = 25,
  SysDbgSetPrintBufferSize = 26,
  SysDbgGetKdUmExceptionEnable = 27,
  SysDbgSetKdUmExceptionEnable = 28,
  SysDbgGetTriageDump = 29,
  SysDbgGetKdBlockEnable = 30,
  SysDbgSetKdBlockEnable = 31,
  SysDbgRegisterForUmBreakInfo = 32,
  SysDbgGetUmBreakPid = 33,
  SysDbgClearUmBreakPid = 34,
  SysDbgGetUmAttachPid = 35,
  SysDbgClearUmAttachPid = 36,
  SysDbgGetLiveKernelDump = 37,
} SYSDBG_COMMAND, *PSYSDBG_COMMAND;

struct IPersistPropertyBag
{
}; /* size: 0x0004 */

enum PackageOrigin
{
  PackageOrigin_Unknown = 0,
  PackageOrigin_Unsigned = 1,
  PackageOrigin_Inbox = 2,
  PackageOrigin_Store = 3,
  PackageOrigin_DeveloperUnsigned = 4,
  PackageOrigin_DeveloperSigned = 5,
  PackageOrigin_LineOfBusiness = 6,
};

struct XSAVE_CPU_INFO
{
  /* 0x0000 */ unsigned char Processor;
  /* 0x0001 */ char Padding_0;
  /* 0x0002 */ unsigned short Family;
  /* 0x0004 */ unsigned short Model;
  /* 0x0006 */ unsigned short Stepping;
  /* 0x0008 */ unsigned short ExtendedModel;
  /* 0x000a */ char Padding_1[2];
  /* 0x000c */ unsigned long ExtendedFamily;
  /* 0x0010 */ unsigned __int64 MicrocodeVersion;
  /* 0x0018 */ unsigned long Reserved;
  /* 0x001c */ long __PADDING__[1];
}; /* size: 0x0020 */

enum POWER_INFORMATION_LEVEL
{
  SystemPowerPolicyAc = 0,
  SystemPowerPolicyDc = 1,
  VerifySystemPolicyAc = 2,
  VerifySystemPolicyDc = 3,
  SystemPowerCapabilities = 4,
  SystemBatteryState = 5,
  SystemPowerStateHandler = 6,
  ProcessorStateHandler = 7,
  SystemPowerPolicyCurrent = 8,
  AdministratorPowerPolicy = 9,
  SystemReserveHiberFile = 10,
  ProcessorInformation = 11,
  SystemPowerInformation = 12,
  ProcessorStateHandler2 = 13,
  LastWakeTime = 14,
  LastSleepTime = 15,
  SystemExecutionState = 16,
  SystemPowerStateNotifyHandler = 17,
  ProcessorPowerPolicyAc = 18,
  ProcessorPowerPolicyDc = 19,
  VerifyProcessorPowerPolicyAc = 20,
  VerifyProcessorPowerPolicyDc = 21,
  ProcessorPowerPolicyCurrent = 22,
  SystemPowerStateLogging = 23,
  SystemPowerLoggingEntry = 24,
  SetPowerSettingValue = 25,
  NotifyUserPowerSetting = 26,
  PowerInformationLevelUnused0 = 27,
  SystemMonitorHiberBootPowerOff = 28,
  SystemVideoState = 29,
  TraceApplicationPowerMessage = 30,
  TraceApplicationPowerMessageEnd = 31,
  ProcessorPerfStates = 32,
  ProcessorIdleStates = 33,
  ProcessorCap = 34,
  SystemWakeSource = 35,
  SystemHiberFileInformation = 36,
  TraceServicePowerMessage = 37,
  ProcessorLoad = 38,
  PowerShutdownNotification = 39,
  MonitorCapabilities = 40,
  SessionPowerInit = 41,
  SessionDisplayState = 42,
  PowerRequestCreate = 43,
  PowerRequestAction = 44,
  GetPowerRequestList = 45,
  ProcessorInformationEx = 46,
  NotifyUserModeLegacyPowerEvent = 47,
  GroupPark = 48,
  ProcessorIdleDomains = 49,
  WakeTimerList = 50,
  SystemHiberFileSize = 51,
  ProcessorIdleStatesHv = 52,
  ProcessorPerfStatesHv = 53,
  ProcessorPerfCapHv = 54,
  ProcessorSetIdle = 55,
  LogicalProcessorIdling = 56,
  UserPresence = 57,
  PowerSettingNotificationName = 58,
  GetPowerSettingValue = 59,
  IdleResiliency = 60,
  SessionRITState = 61,
  SessionConnectNotification = 62,
  SessionPowerCleanup = 63,
  SessionLockState = 64,
  SystemHiberbootState = 65,
  PlatformInformation = 66,
  PdcInvocation = 67,
  MonitorInvocation = 68,
  FirmwareTableInformationRegistered = 69,
  SetShutdownSelectedTime = 70,
  SuspendResumeInvocation = 71,
  PlmPowerRequestCreate = 72,
  ScreenOff = 73,
  CsDeviceNotification = 74,
  PlatformRole = 75,
  LastResumePerformance = 76,
  DisplayBurst = 77,
  ExitLatencySamplingPercentage = 78,
  RegisterSpmPowerSettings = 79,
  PlatformIdleStates = 80,
  ProcessorIdleVeto = 81,
  PlatformIdleVeto = 82,
  SystemBatteryStatePrecise = 83,
  ThermalEvent = 84,
  PowerInformationLevelMaximum = 85,
};

typedef struct _SD_ENUM_SDS_INPUT
{
  /* 0x0000 */ unsigned __int64 StartingOffset;
  /* 0x0008 */ unsigned __int64 MaxSDEntriesToReturn;
} SD_ENUM_SDS_INPUT, *PSD_ENUM_SDS_INPUT; /* size: 0x0010 */

typedef enum _TOKEN_SECURITY_ATTRIBUTE_OPERATION
{
  TOKEN_SECURITY_ATTRIBUTE_OPERATION_NONE = 0,
  TOKEN_SECURITY_ATTRIBUTE_OPERATION_REPLACE_ALL = 1,
  TOKEN_SECURITY_ATTRIBUTE_OPERATION_ADD = 2,
  TOKEN_SECURITY_ATTRIBUTE_OPERATION_DELETE = 3,
  TOKEN_SECURITY_ATTRIBUTE_OPERATION_REPLACE = 4,
} TOKEN_SECURITY_ATTRIBUTE_OPERATION, *PTOKEN_SECURITY_ATTRIBUTE_OPERATION;

typedef struct _SYSTEM_KERNEL_DEBUGGER_INFORMATION_EX
{
  /* 0x0000 */ unsigned char DebuggerAllowed;
  /* 0x0001 */ unsigned char DebuggerEnabled;
  /* 0x0002 */ unsigned char DebuggerPresent;
} SYSTEM_KERNEL_DEBUGGER_INFORMATION_EX, *PSYSTEM_KERNEL_DEBUGGER_INFORMATION_EX; /* size: 0x0003 */

struct tagRemBRUSH
{
  /* 0x0000 */ unsigned long cbData;
  /* 0x0004 */ unsigned char data[1];
  /* 0x0005 */ char __PADDING__[3];
}; /* size: 0x0008 */

typedef enum _BIN_TYPES
{
  RequestSize = 0,
  RequestLocation = 1,
} BIN_TYPES, *PBIN_TYPES;

typedef struct _RTL_CONDITION_VARIABLE
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long WakeCount : 3; /* bit position: 0 */
      /* 0x0000 */ unsigned long Waking : 1; /* bit position: 3 */
    }; /* bitfield */
    /* 0x0000 */ unsigned long Value;
    /* 0x0000 */ void* Ptr;
  }; /* size: 0x0004 */
} RTL_CONDITION_VARIABLE, *PRTL_CONDITION_VARIABLE; /* size: 0x0004 */

enum WELL_KNOWN_SID_TYPE
{
  WinNullSid = 0,
  WinWorldSid = 1,
  WinLocalSid = 2,
  WinCreatorOwnerSid = 3,
  WinCreatorGroupSid = 4,
  WinCreatorOwnerServerSid = 5,
  WinCreatorGroupServerSid = 6,
  WinNtAuthoritySid = 7,
  WinDialupSid = 8,
  WinNetworkSid = 9,
  WinBatchSid = 10,
  WinInteractiveSid = 11,
  WinServiceSid = 12,
  WinAnonymousSid = 13,
  WinProxySid = 14,
  WinEnterpriseControllersSid = 15,
  WinSelfSid = 16,
  WinAuthenticatedUserSid = 17,
  WinRestrictedCodeSid = 18,
  WinTerminalServerSid = 19,
  WinRemoteLogonIdSid = 20,
  WinLogonIdsSid = 21,
  WinLocalSystemSid = 22,
  WinLocalServiceSid = 23,
  WinNetworkServiceSid = 24,
  WinBuiltinDomainSid = 25,
  WinBuiltinAdministratorsSid = 26,
  WinBuiltinUsersSid = 27,
  WinBuiltinGuestsSid = 28,
  WinBuiltinPowerUsersSid = 29,
  WinBuiltinAccountOperatorsSid = 30,
  WinBuiltinSystemOperatorsSid = 31,
  WinBuiltinPrintOperatorsSid = 32,
  WinBuiltinBackupOperatorsSid = 33,
  WinBuiltinReplicatorSid = 34,
  WinBuiltinPreWindows2000CompatibleAccessSid = 35,
  WinBuiltinRemoteDesktopUsersSid = 36,
  WinBuiltinNetworkConfigurationOperatorsSid = 37,
  WinAccountAdministratorSid = 38,
  WinAccountGuestSid = 39,
  WinAccountKrbtgtSid = 40,
  WinAccountDomainAdminsSid = 41,
  WinAccountDomainUsersSid = 42,
  WinAccountDomainGuestsSid = 43,
  WinAccountComputersSid = 44,
  WinAccountControllersSid = 45,
  WinAccountCertAdminsSid = 46,
  WinAccountSchemaAdminsSid = 47,
  WinAccountEnterpriseAdminsSid = 48,
  WinAccountPolicyAdminsSid = 49,
  WinAccountRasAndIasServersSid = 50,
  WinNTLMAuthenticationSid = 51,
  WinDigestAuthenticationSid = 52,
  WinSChannelAuthenticationSid = 53,
  WinThisOrganizationSid = 54,
  WinOtherOrganizationSid = 55,
  WinBuiltinIncomingForestTrustBuildersSid = 56,
  WinBuiltinPerfMonitoringUsersSid = 57,
  WinBuiltinPerfLoggingUsersSid = 58,
  WinBuiltinAuthorizationAccessSid = 59,
  WinBuiltinTerminalServerLicenseServersSid = 60,
  WinBuiltinDCOMUsersSid = 61,
  WinBuiltinIUsersSid = 62,
  WinIUserSid = 63,
  WinBuiltinCryptoOperatorsSid = 64,
  WinUntrustedLabelSid = 65,
  WinLowLabelSid = 66,
  WinMediumLabelSid = 67,
  WinHighLabelSid = 68,
  WinSystemLabelSid = 69,
  WinWriteRestrictedCodeSid = 70,
  WinCreatorOwnerRightsSid = 71,
  WinCacheablePrincipalsGroupSid = 72,
  WinNonCacheablePrincipalsGroupSid = 73,
  WinEnterpriseReadonlyControllersSid = 74,
  WinAccountReadonlyControllersSid = 75,
  WinBuiltinEventLogReadersGroup = 76,
  WinNewEnterpriseReadonlyControllersSid = 77,
  WinBuiltinCertSvcDComAccessGroup = 78,
  WinMediumPlusLabelSid = 79,
  WinLocalLogonSid = 80,
  WinConsoleLogonSid = 81,
  WinThisOrganizationCertificateSid = 82,
  WinApplicationPackageAuthoritySid = 83,
  WinBuiltinAnyPackageSid = 84,
  WinCapabilityInternetClientSid = 85,
  WinCapabilityInternetClientServerSid = 86,
  WinCapabilityPrivateNetworkClientServerSid = 87,
  WinCapabilityPicturesLibrarySid = 88,
  WinCapabilityVideosLibrarySid = 89,
  WinCapabilityMusicLibrarySid = 90,
  WinCapabilityDocumentsLibrarySid = 91,
  WinCapabilitySharedUserCertificatesSid = 92,
  WinCapabilityEnterpriseAuthenticationSid = 93,
  WinCapabilityRemovableStorageSid = 94,
  WinBuiltinRDSRemoteAccessServersSid = 95,
  WinBuiltinRDSEndpointServersSid = 96,
  WinBuiltinRDSManagementServersSid = 97,
  WinUserModeDriversSid = 98,
  WinBuiltinHyperVAdminsSid = 99,
  WinAccountCloneableControllersSid = 100,
  WinBuiltinAccessControlAssistanceOperatorsSid = 101,
  WinBuiltinRemoteManagementUsersSid = 102,
  WinAuthenticationAuthorityAssertedSid = 103,
  WinAuthenticationServiceAssertedSid = 104,
  WinLocalAccountSid = 105,
  WinLocalAccountAndAdministratorSid = 106,
  WinAccountProtectedUsersSid = 107,
};

enum VARENUM
{
  VT_EMPTY = 0,
  VT_NULL = 1,
  VT_I2 = 2,
  VT_I4 = 3,
  VT_R4 = 4,
  VT_R8 = 5,
  VT_CY = 6,
  VT_DATE = 7,
  VT_BSTR = 8,
  VT_DISPATCH = 9,
  VT_ERROR = 10,
  VT_BOOL = 11,
  VT_VARIANT = 12,
  VT_UNKNOWN = 13,
  VT_DECIMAL = 14,
  VT_I1 = 16,
  VT_UI1 = 17,
  VT_UI2 = 18,
  VT_UI4 = 19,
  VT_I8 = 20,
  VT_UI8 = 21,
  VT_INT = 22,
  VT_UINT = 23,
  VT_VOID = 24,
  VT_HRESULT = 25,
  VT_PTR = 26,
  VT_SAFEARRAY = 27,
  VT_CARRAY = 28,
  VT_USERDEFINED = 29,
  VT_LPSTR = 30,
  VT_LPWSTR = 31,
  VT_RECORD = 36,
  VT_INT_PTR = 37,
  VT_UINT_PTR = 38,
  VT_FILETIME = 64,
  VT_BLOB = 65,
  VT_STREAM = 66,
  VT_STORAGE = 67,
  VT_STREAMED_OBJECT = 68,
  VT_STORED_OBJECT = 69,
  VT_BLOB_OBJECT = 70,
  VT_CF = 71,
  VT_CLSID = 72,
  VT_VERSIONED_STREAM = 73,
  VT_BSTR_BLOB = 4095,
  VT_VECTOR = 4096,
  VT_ARRAY = 8192,
  VT_BYREF = 16384,
  VT_RESERVED = 0xffff8000,
  VT_ILLEGAL = 0xffffffff,
  VT_ILLEGALMASKED = 4095,
  VT_TYPEMASK = 4095,
};

struct tagSWindowData
{
  /* 0x0000 */ struct HWND__* hWnd;
  /* 0x0004 */ unsigned int wFirstMsg;
  /* 0x0008 */ unsigned int wLastMsg;
}; /* size: 0x000c */

class CAptCallCtrl
{
  /* 0x0000 */ struct IMessageFilter* _pMF;
  /* 0x0004 */ int _fInMsgFilter;
  /* 0x0008 */ class CCliModalLoop* _pTopCML;
  /* 0x000c */ struct tagSWindowData _WD[2];
}; /* size: 0x0024 */

enum DISK_CACHE_RETENTION_PRIORITY
{
  EqualPriority = 0,
  KeepPrefetchedData = 1,
  KeepReadData = 2,
};

typedef struct _SYSTEM_CONSOLE_INFORMATION
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned long DriverLoaded : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned long Spare : 31; /* bit position: 1 */
  }; /* bitfield */
} SYSTEM_CONSOLE_INFORMATION, *PSYSTEM_CONSOLE_INFORMATION; /* size: 0x0004 */

enum POWER_ACTION
{
  PowerActionNone = 0,
  PowerActionReserved = 1,
  PowerActionSleep = 2,
  PowerActionHibernate = 3,
  PowerActionShutdown = 4,
  PowerActionShutdownReset = 5,
  PowerActionShutdownOff = 6,
  PowerActionWarmEject = 7,
};

typedef struct _NCryptAlgorithmName
{
  /* 0x0000 */ wchar_t* pszName;
  /* 0x0004 */ unsigned long dwClass;
  /* 0x0008 */ unsigned long dwAlgOperations;
  /* 0x000c */ unsigned long dwFlags;
} NCryptAlgorithmName, *PNCryptAlgorithmName; /* size: 0x0010 */

typedef enum _PARTITION_STYLE
{
  PARTITION_STYLE_MBR = 0,
  PARTITION_STYLE_GPT = 1,
  PARTITION_STYLE_RAW = 2,
} PARTITION_STYLE, *PPARTITION_STYLE;

struct tagNMHDR
{
  /* 0x0000 */ struct HWND__* hwndFrom;
  /* 0x0004 */ unsigned int idFrom;
  /* 0x0008 */ unsigned int code;
}; /* size: 0x000c */

struct IWeakReference
{
}; /* size: 0x0004 */

struct IRpcSyntaxNegotiate
{
}; /* size: 0x0004 */

struct tagRECT
{
  /* 0x0000 */ long left;
  /* 0x0004 */ long top;
  /* 0x0008 */ long right;
  /* 0x000c */ long bottom;
}; /* size: 0x0010 */

struct tagMCI_OVLY_LOAD_PARMSW
{
  /* 0x0000 */ unsigned long dwCallback;
  /* 0x0004 */ const wchar_t* lpfilename;
  /* 0x0008 */ struct tagRECT rc;
}; /* size: 0x0018 */

typedef enum _system_handle_t
{
  SYSTEM_HANDLE_FILE = 0,
  SYSTEM_HANDLE_SEMAPHORE = 1,
  SYSTEM_HANDLE_EVENT = 2,
  SYSTEM_HANDLE_MUTEX = 3,
  SYSTEM_HANDLE_PROCESS = 4,
  SYSTEM_HANDLE_TOKEN = 5,
  SYSTEM_HANDLE_INVALID = 255,
} system_handle_t, *Psystem_handle_t;

typedef struct _SD_CHANGE_MACHINE_SID_INPUT
{
  /* 0x0000 */ unsigned short CurrentMachineSIDOffset;
  /* 0x0002 */ unsigned short CurrentMachineSIDLength;
  /* 0x0004 */ unsigned short NewMachineSIDOffset;
  /* 0x0006 */ unsigned short NewMachineSIDLength;
} SD_CHANGE_MACHINE_SID_INPUT, *PSD_CHANGE_MACHINE_SID_INPUT; /* size: 0x0008 */

enum SHSTOCKICONID
{
  SIID_DOCNOASSOC = 0,
  SIID_DOCASSOC = 1,
  SIID_APPLICATION = 2,
  SIID_FOLDER = 3,
  SIID_FOLDEROPEN = 4,
  SIID_DRIVE525 = 5,
  SIID_DRIVE35 = 6,
  SIID_DRIVEREMOVE = 7,
  SIID_DRIVEFIXED = 8,
  SIID_DRIVENET = 9,
  SIID_DRIVENETDISABLED = 10,
  SIID_DRIVECD = 11,
  SIID_DRIVERAM = 12,
  SIID_WORLD = 13,
  SIID_SERVER = 15,
  SIID_PRINTER = 16,
  SIID_MYNETWORK = 17,
  SIID_FIND = 22,
  SIID_HELP = 23,
  SIID_SHARE = 28,
  SIID_LINK = 29,
  SIID_SLOWFILE = 30,
  SIID_RECYCLER = 31,
  SIID_RECYCLERFULL = 32,
  SIID_MEDIACDAUDIO = 40,
  SIID_LOCK = 47,
  SIID_AUTOLIST = 49,
  SIID_PRINTERNET = 50,
  SIID_SERVERSHARE = 51,
  SIID_PRINTERFAX = 52,
  SIID_PRINTERFAXNET = 53,
  SIID_PRINTERFILE = 54,
  SIID_STACK = 55,
  SIID_MEDIASVCD = 56,
  SIID_STUFFEDFOLDER = 57,
  SIID_DRIVEUNKNOWN = 58,
  SIID_DRIVEDVD = 59,
  SIID_MEDIADVD = 60,
  SIID_MEDIADVDRAM = 61,
  SIID_MEDIADVDRW = 62,
  SIID_MEDIADVDR = 63,
  SIID_MEDIADVDROM = 64,
  SIID_MEDIACDAUDIOPLUS = 65,
  SIID_MEDIACDRW = 66,
  SIID_MEDIACDR = 67,
  SIID_MEDIACDBURN = 68,
  SIID_MEDIABLANKCD = 69,
  SIID_MEDIACDROM = 70,
  SIID_AUDIOFILES = 71,
  SIID_IMAGEFILES = 72,
  SIID_VIDEOFILES = 73,
  SIID_MIXEDFILES = 74,
  SIID_FOLDERBACK = 75,
  SIID_FOLDERFRONT = 76,
  SIID_SHIELD = 77,
  SIID_WARNING = 78,
  SIID_INFO = 79,
  SIID_ERROR = 80,
  SIID_KEY = 81,
  SIID_SOFTWARE = 82,
  SIID_RENAME = 83,
  SIID_DELETE = 84,
  SIID_MEDIAAUDIODVD = 85,
  SIID_MEDIAMOVIEDVD = 86,
  SIID_MEDIAENHANCEDCD = 87,
  SIID_MEDIAENHANCEDDVD = 88,
  SIID_MEDIAHDDVD = 89,
  SIID_MEDIABLURAY = 90,
  SIID_MEDIAVCD = 91,
  SIID_MEDIADVDPLUSR = 92,
  SIID_MEDIADVDPLUSRW = 93,
  SIID_DESKTOPPC = 94,
  SIID_MOBILEPC = 95,
  SIID_USERS = 96,
  SIID_MEDIASMARTMEDIA = 97,
  SIID_MEDIACOMPACTFLASH = 98,
  SIID_DEVICECELLPHONE = 99,
  SIID_DEVICECAMERA = 100,
  SIID_DEVICEVIDEOCAMERA = 101,
  SIID_DEVICEAUDIOPLAYER = 102,
  SIID_NETWORKCONNECT = 103,
  SIID_INTERNET = 104,
  SIID_ZIPFILE = 105,
  SIID_SETTINGS = 106,
  SIID_DRIVEHDDVD = 132,
  SIID_DRIVEBD = 133,
  SIID_MEDIAHDDVDROM = 134,
  SIID_MEDIAHDDVDR = 135,
  SIID_MEDIAHDDVDRAM = 136,
  SIID_MEDIABDROM = 137,
  SIID_MEDIABDR = 138,
  SIID_MEDIABDRE = 139,
  SIID_CLUSTEREDDRIVE = 140,
  SIID_MAX_ICONS = 175,
};

typedef struct _SYSTEM_QUERY_TIME_ADJUST_INFORMATION
{
  /* 0x0000 */ unsigned long TimeAdjustment;
  /* 0x0004 */ unsigned long TimeIncrement;
  /* 0x0008 */ unsigned char Enable;
  /* 0x0009 */ char __PADDING__[3];
} SYSTEM_QUERY_TIME_ADJUST_INFORMATION, *PSYSTEM_QUERY_TIME_ADJUST_INFORMATION; /* size: 0x000c */

struct DLGITEMTEMPLATE
{
  /* 0x0000 */ unsigned long style;
  /* 0x0004 */ unsigned long dwExtendedStyle;
  /* 0x0008 */ short x;
  /* 0x000a */ short y;
  /* 0x000c */ short cx;
  /* 0x000e */ short cy;
  /* 0x0010 */ unsigned short id;
}; /* size: 0x0012 */

typedef enum _WRITE_CACHE_ENABLE
{
  WriteCacheEnableUnknown = 0,
  WriteCacheDisabled = 1,
  WriteCacheEnabled = 2,
} WRITE_CACHE_ENABLE, *PWRITE_CACHE_ENABLE;

struct IProgressNotify
{
}; /* size: 0x0004 */

typedef enum _tagQUERYOPTION
{
  QUERY_EXPIRATION_DATE = 1,
  QUERY_TIME_OF_LAST_CHANGE = 2,
  QUERY_CONTENT_ENCODING = 3,
  QUERY_CONTENT_TYPE = 4,
  QUERY_REFRESH = 5,
  QUERY_RECOMBINE = 6,
  QUERY_CAN_NAVIGATE = 7,
  QUERY_USES_NETWORK = 8,
  QUERY_IS_CACHED = 9,
  QUERY_IS_INSTALLEDENTRY = 10,
  QUERY_IS_CACHED_OR_MAPPED = 11,
  QUERY_USES_CACHE = 12,
  QUERY_IS_SECURE = 13,
  QUERY_IS_SAFE = 14,
  QUERY_USES_HISTORYFOLDER = 15,
  QUERY_IS_CACHED_AND_USABLE_OFFLINE = 16,
} tagQUERYOPTION, *PtagQUERYOPTION;

struct AsyncIAdviseSink
{
}; /* size: 0x0004 */

struct HMIDI__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

typedef enum _COPYFILE2_MESSAGE_TYPE
{
  COPYFILE2_CALLBACK_NONE = 0,
  COPYFILE2_CALLBACK_CHUNK_STARTED = 1,
  COPYFILE2_CALLBACK_CHUNK_FINISHED = 2,
  COPYFILE2_CALLBACK_STREAM_STARTED = 3,
  COPYFILE2_CALLBACK_STREAM_FINISHED = 4,
  COPYFILE2_CALLBACK_POLL_CONTINUE = 5,
  COPYFILE2_CALLBACK_ERROR = 6,
  COPYFILE2_CALLBACK_MAX = 7,
} COPYFILE2_MESSAGE_TYPE, *PCOPYFILE2_MESSAGE_TYPE;

typedef struct _UNICODE_STRING
{
  /* 0x0000 */ unsigned short Length;
  /* 0x0002 */ unsigned short MaximumLength;
  /* 0x0004 */ unsigned short* Buffer;
} UNICODE_STRING, *PUNICODE_STRING; /* size: 0x0008 */

typedef struct _ALPC_SERVER_INFORMATION
{
  union
  {
    struct
    {
      /* 0x0000 */ void* ThreadHandle;
    } /* size: 0x0004 */ In;
    struct
    {
      /* 0x0000 */ unsigned char ThreadBlocked;
      /* 0x0001 */ char Padding_2[3];
      /* 0x0004 */ void* ConnectedProcessId;
      /* 0x0008 */ struct _UNICODE_STRING ConnectionPortName;
    } /* size: 0x0010 */ Out;
  }; /* size: 0x0010 */
} ALPC_SERVER_INFORMATION, *PALPC_SERVER_INFORMATION; /* size: 0x0010 */

typedef struct _XSTATE_CONTEXT
{
  /* 0x0000 */ unsigned __int64 Mask;
  /* 0x0008 */ unsigned long Length;
  /* 0x000c */ unsigned long Reserved1;
  /* 0x0010 */ struct _XSAVE_AREA* Area;
  /* 0x0014 */ unsigned long Reserved2;
  /* 0x0018 */ void* Buffer;
  /* 0x001c */ unsigned long Reserved3;
} XSTATE_CONTEXT, *PXSTATE_CONTEXT; /* size: 0x0020 */

typedef enum _PRINTER_OPTION_FLAGS
{
  PRINTER_OPTION_NO_CACHE = 1,
  PRINTER_OPTION_CACHE = 2,
  PRINTER_OPTION_CLIENT_CHANGE = 4,
  PRINTER_OPTION_NO_CLIENT_DATA = 8,
} PRINTER_OPTION_FLAGS, *PPRINTER_OPTION_FLAGS;

typedef struct _LUID
{
  /* 0x0000 */ unsigned long LowPart;
  /* 0x0004 */ long HighPart;
} LUID, *PLUID; /* size: 0x0008 */

typedef struct _LUID_AND_ATTRIBUTES
{
  /* 0x0000 */ struct _LUID Luid;
  /* 0x0008 */ unsigned long Attributes;
} LUID_AND_ATTRIBUTES, *PLUID_AND_ATTRIBUTES; /* size: 0x000c */

class CDirEntry
{
}; /* size: 0x0080 */

enum SYSGEOTYPE
{
  GEO_NATION = 1,
  GEO_LATITUDE = 2,
  GEO_LONGITUDE = 3,
  GEO_ISO2 = 4,
  GEO_ISO3 = 5,
  GEO_RFC1766 = 6,
  GEO_LCID = 7,
  GEO_FRIENDLYNAME = 8,
  GEO_OFFICIALNAME = 9,
  GEO_TIMEZONES = 10,
  GEO_OFFICIALLANGUAGES = 11,
  GEO_ISO_UN_NUMBER = 12,
  GEO_PARENT = 13,
};

typedef union _LARGE_INTEGER
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned long LowPart;
      /* 0x0004 */ long HighPart;
    }; /* size: 0x0008 */
    struct
    {
      /* 0x0000 */ unsigned long LowPart;
      /* 0x0004 */ long HighPart;
    } /* size: 0x0008 */ u;
    /* 0x0000 */ __int64 QuadPart;
  }; /* size: 0x0008 */
} LARGE_INTEGER, *PLARGE_INTEGER; /* size: 0x0008 */

typedef struct _CLUSTER_RANGE
{
  /* 0x0000 */ union _LARGE_INTEGER StartingCluster;
  /* 0x0008 */ union _LARGE_INTEGER ClusterCount;
} CLUSTER_RANGE, *PCLUSTER_RANGE; /* size: 0x0010 */

typedef struct _FILE_REFERENCE_RANGE
{
  /* 0x0000 */ unsigned __int64 StartingFileReferenceNumber;
  /* 0x0008 */ unsigned __int64 EndingFileReferenceNumber;
} FILE_REFERENCE_RANGE, *PFILE_REFERENCE_RANGE; /* size: 0x0010 */

typedef enum _DPFLTR_TYPE
{
  DPFLTR_SYSTEM_ID = 0,
  DPFLTR_SMSS_ID = 1,
  DPFLTR_SETUP_ID = 2,
  DPFLTR_NTFS_ID = 3,
  DPFLTR_FSTUB_ID = 4,
  DPFLTR_CRASHDUMP_ID = 5,
  DPFLTR_CDAUDIO_ID = 6,
  DPFLTR_CDROM_ID = 7,
  DPFLTR_CLASSPNP_ID = 8,
  DPFLTR_DISK_ID = 9,
  DPFLTR_REDBOOK_ID = 10,
  DPFLTR_STORPROP_ID = 11,
  DPFLTR_SCSIPORT_ID = 12,
  DPFLTR_SCSIMINIPORT_ID = 13,
  DPFLTR_CONFIG_ID = 14,
  DPFLTR_I8042PRT_ID = 15,
  DPFLTR_SERMOUSE_ID = 16,
  DPFLTR_LSERMOUS_ID = 17,
  DPFLTR_KBDHID_ID = 18,
  DPFLTR_MOUHID_ID = 19,
  DPFLTR_KBDCLASS_ID = 20,
  DPFLTR_MOUCLASS_ID = 21,
  DPFLTR_TWOTRACK_ID = 22,
  DPFLTR_WMILIB_ID = 23,
  DPFLTR_ACPI_ID = 24,
  DPFLTR_AMLI_ID = 25,
  DPFLTR_HALIA64_ID = 26,
  DPFLTR_VIDEO_ID = 27,
  DPFLTR_SVCHOST_ID = 28,
  DPFLTR_VIDEOPRT_ID = 29,
  DPFLTR_TCPIP_ID = 30,
  DPFLTR_DMSYNTH_ID = 31,
  DPFLTR_NTOSPNP_ID = 32,
  DPFLTR_FASTFAT_ID = 33,
  DPFLTR_SAMSS_ID = 34,
  DPFLTR_PNPMGR_ID = 35,
  DPFLTR_NETAPI_ID = 36,
  DPFLTR_SCSERVER_ID = 37,
  DPFLTR_SCCLIENT_ID = 38,
  DPFLTR_SERIAL_ID = 39,
  DPFLTR_SERENUM_ID = 40,
  DPFLTR_UHCD_ID = 41,
  DPFLTR_RPCPROXY_ID = 42,
  DPFLTR_AUTOCHK_ID = 43,
  DPFLTR_DCOMSS_ID = 44,
  DPFLTR_UNIMODEM_ID = 45,
  DPFLTR_SIS_ID = 46,
  DPFLTR_FLTMGR_ID = 47,
  DPFLTR_WMICORE_ID = 48,
  DPFLTR_BURNENG_ID = 49,
  DPFLTR_IMAPI_ID = 50,
  DPFLTR_SXS_ID = 51,
  DPFLTR_FUSION_ID = 52,
  DPFLTR_IDLETASK_ID = 53,
  DPFLTR_SOFTPCI_ID = 54,
  DPFLTR_TAPE_ID = 55,
  DPFLTR_MCHGR_ID = 56,
  DPFLTR_IDEP_ID = 57,
  DPFLTR_PCIIDE_ID = 58,
  DPFLTR_FLOPPY_ID = 59,
  DPFLTR_FDC_ID = 60,
  DPFLTR_TERMSRV_ID = 61,
  DPFLTR_W32TIME_ID = 62,
  DPFLTR_PREFETCHER_ID = 63,
  DPFLTR_RSFILTER_ID = 64,
  DPFLTR_FCPORT_ID = 65,
  DPFLTR_PCI_ID = 66,
  DPFLTR_DMIO_ID = 67,
  DPFLTR_DMCONFIG_ID = 68,
  DPFLTR_DMADMIN_ID = 69,
  DPFLTR_WSOCKTRANSPORT_ID = 70,
  DPFLTR_VSS_ID = 71,
  DPFLTR_PNPMEM_ID = 72,
  DPFLTR_PROCESSOR_ID = 73,
  DPFLTR_DMSERVER_ID = 74,
  DPFLTR_SR_ID = 75,
  DPFLTR_INFINIBAND_ID = 76,
  DPFLTR_IHVDRIVER_ID = 77,
  DPFLTR_IHVVIDEO_ID = 78,
  DPFLTR_IHVAUDIO_ID = 79,
  DPFLTR_IHVNETWORK_ID = 80,
  DPFLTR_IHVSTREAMING_ID = 81,
  DPFLTR_IHVBUS_ID = 82,
  DPFLTR_HPS_ID = 83,
  DPFLTR_RTLTHREADPOOL_ID = 84,
  DPFLTR_LDR_ID = 85,
  DPFLTR_TCPIP6_ID = 86,
  DPFLTR_ISAPNP_ID = 87,
  DPFLTR_SHPC_ID = 88,
  DPFLTR_STORPORT_ID = 89,
  DPFLTR_STORMINIPORT_ID = 90,
  DPFLTR_PRINTSPOOLER_ID = 91,
  DPFLTR_VSSDYNDISK_ID = 92,
  DPFLTR_VERIFIER_ID = 93,
  DPFLTR_VDS_ID = 94,
  DPFLTR_VDSBAS_ID = 95,
  DPFLTR_VDSDYN_ID = 96,
  DPFLTR_VDSDYNDR_ID = 97,
  DPFLTR_VDSLDR_ID = 98,
  DPFLTR_VDSUTIL_ID = 99,
  DPFLTR_DFRGIFC_ID = 100,
  DPFLTR_DEFAULT_ID = 101,
  DPFLTR_MM_ID = 102,
  DPFLTR_DFSC_ID = 103,
  DPFLTR_WOW64_ID = 104,
  DPFLTR_ALPC_ID = 105,
  DPFLTR_WDI_ID = 106,
  DPFLTR_PERFLIB_ID = 107,
  DPFLTR_KTM_ID = 108,
  DPFLTR_IOSTRESS_ID = 109,
  DPFLTR_HEAP_ID = 110,
  DPFLTR_WHEA_ID = 111,
  DPFLTR_USERGDI_ID = 112,
  DPFLTR_MMCSS_ID = 113,
  DPFLTR_TPM_ID = 114,
  DPFLTR_THREADORDER_ID = 115,
  DPFLTR_ENVIRON_ID = 116,
  DPFLTR_EMS_ID = 117,
  DPFLTR_WDT_ID = 118,
  DPFLTR_FVEVOL_ID = 119,
  DPFLTR_NDIS_ID = 120,
  DPFLTR_NVCTRACE_ID = 121,
  DPFLTR_LUAFV_ID = 122,
  DPFLTR_APPCOMPAT_ID = 123,
  DPFLTR_USBSTOR_ID = 124,
  DPFLTR_SBP2PORT_ID = 125,
  DPFLTR_COVERAGE_ID = 126,
  DPFLTR_CACHEMGR_ID = 127,
  DPFLTR_MOUNTMGR_ID = 128,
  DPFLTR_CFR_ID = 129,
  DPFLTR_TXF_ID = 130,
  DPFLTR_KSECDD_ID = 131,
  DPFLTR_FLTREGRESS_ID = 132,
  DPFLTR_MPIO_ID = 133,
  DPFLTR_MSDSM_ID = 134,
  DPFLTR_UDFS_ID = 135,
  DPFLTR_PSHED_ID = 136,
  DPFLTR_STORVSP_ID = 137,
  DPFLTR_LSASS_ID = 138,
  DPFLTR_SSPICLI_ID = 139,
  DPFLTR_CNG_ID = 140,
  DPFLTR_EXFAT_ID = 141,
  DPFLTR_FILETRACE_ID = 142,
  DPFLTR_XSAVE_ID = 143,
  DPFLTR_SE_ID = 144,
  DPFLTR_DRIVEEXTENDER_ID = 145,
  DPFLTR_POWER_ID = 146,
  DPFLTR_CRASHDUMPXHCI_ID = 147,
  DPFLTR_GPIO_ID = 148,
  DPFLTR_REFS_ID = 149,
  DPFLTR_WER_ID = 150,
  DPFLTR_ENDOFTABLE_ID = 151,
} DPFLTR_TYPE, *PDPFLTR_TYPE;

typedef struct _LANA_ENUM
{
  /* 0x0000 */ unsigned char length;
  /* 0x0001 */ unsigned char lana[255];
} LANA_ENUM, *PLANA_ENUM; /* size: 0x0100 */

enum ACTIVATION_PROPERTIES::eFlags
{
  fFOR_SCM = 1,
  fSURROGATE = 4,
  fDO_NOT_LOAD = 8,
  fRELOAD_DARWIN = 16,
  fLSVR_ONLY = 32,
};

struct IInternetSession
{
}; /* size: 0x0004 */

typedef struct __PUBLIC_OBJECT_TYPE_INFORMATION
{
  /* 0x0000 */ struct _UNICODE_STRING TypeName;
  /* 0x0008 */ unsigned long Reserved[22];
} _PUBLIC_OBJECT_TYPE_INFORMATION, *P_PUBLIC_OBJECT_TYPE_INFORMATION; /* size: 0x0060 */

struct READER_SEL_RESPONSE
{
  /* 0x0000 */ unsigned long cbReaderNameOffset;
  /* 0x0004 */ unsigned long cchReaderNameLength;
  /* 0x0008 */ unsigned long cbCardNameOffset;
  /* 0x000c */ unsigned long cchCardNameLength;
}; /* size: 0x0010 */

typedef enum _PS_ATTRIBUTE_NUM
{
  PsAttributeParentProcess = 0,
  PsAttributeDebugObject = 1,
  PsAttributeToken = 2,
  PsAttributeClientId = 3,
  PsAttributeTebAddress = 4,
  PsAttributeImageName = 5,
  PsAttributeImageInfo = 6,
  PsAttributeMemoryReserve = 7,
  PsAttributePriorityClass = 8,
  PsAttributeErrorMode = 9,
  PsAttributeStdHandleInfo = 10,
  PsAttributeHandleList = 11,
  PsAttributeGroupAffinity = 12,
  PsAttributePreferredNode = 13,
  PsAttributeIdealProcessor = 14,
  PsAttributeUmsThread = 15,
  PsAttributeMitigationOptions = 16,
  PsAttributeProtectionLevel = 17,
  PsAttributeMax = 18,
} PS_ATTRIBUTE_NUM, *PPS_ATTRIBUTE_NUM;

struct tagMCI_OVLY_WINDOW_PARMSW
{
  /* 0x0000 */ unsigned long dwCallback;
  /* 0x0004 */ struct HWND__* hWnd;
  /* 0x0008 */ unsigned int nCmdShow;
  /* 0x000c */ const wchar_t* lpstrText;
}; /* size: 0x0010 */

typedef enum _PROCESSINFOCLASS
{
  ProcessBasicInformation = 0,
  ProcessQuotaLimits = 1,
  ProcessIoCounters = 2,
  ProcessVmCounters = 3,
  ProcessTimes = 4,
  ProcessBasePriority = 5,
  ProcessRaisePriority = 6,
  ProcessDebugPort = 7,
  ProcessExceptionPort = 8,
  ProcessAccessToken = 9,
  ProcessLdtInformation = 10,
  ProcessLdtSize = 11,
  ProcessDefaultHardErrorMode = 12,
  ProcessIoPortHandlers = 13,
  ProcessPooledUsageAndLimits = 14,
  ProcessWorkingSetWatch = 15,
  ProcessUserModeIOPL = 16,
  ProcessEnableAlignmentFaultFixup = 17,
  ProcessPriorityClass = 18,
  ProcessWx86Information = 19,
  ProcessHandleCount = 20,
  ProcessAffinityMask = 21,
  ProcessPriorityBoost = 22,
  ProcessDeviceMap = 23,
  ProcessSessionInformation = 24,
  ProcessForegroundInformation = 25,
  ProcessWow64Information = 26,
  ProcessImageFileName = 27,
  ProcessLUIDDeviceMapsEnabled = 28,
  ProcessBreakOnTermination = 29,
  ProcessDebugObjectHandle = 30,
  ProcessDebugFlags = 31,
  ProcessHandleTracing = 32,
  ProcessIoPriority = 33,
  ProcessExecuteFlags = 34,
  ProcessTlsInformation = 35,
  ProcessCookie = 36,
  ProcessImageInformation = 37,
  ProcessCycleTime = 38,
  ProcessPagePriority = 39,
  ProcessInstrumentationCallback = 40,
  ProcessThreadStackAllocation = 41,
  ProcessWorkingSetWatchEx = 42,
  ProcessImageFileNameWin32 = 43,
  ProcessImageFileMapping = 44,
  ProcessAffinityUpdateMode = 45,
  ProcessMemoryAllocationMode = 46,
  ProcessGroupInformation = 47,
  ProcessTokenVirtualizationEnabled = 48,
  ProcessOwnerInformation = 49,
  ProcessWindowInformation = 50,
  ProcessHandleInformation = 51,
  ProcessMitigationPolicy = 52,
  ProcessDynamicFunctionTableInformation = 53,
  ProcessHandleCheckingMode = 54,
  ProcessKeepAliveCount = 55,
  ProcessRevokeFileHandles = 56,
  ProcessWorkingSetControl = 57,
  ProcessHandleTable = 58,
  ProcessCheckStackExtentsMode = 59,
  ProcessCommandLineInformation = 60,
  ProcessProtectionInformation = 61,
  MaxProcessInfoClass = 62,
} PROCESSINFOCLASS, *PPROCESSINFOCLASS;

struct DISPLAYCONFIG_PATH_SOURCE_INFO
{
  /* 0x0000 */ struct _LUID adapterId;
  /* 0x0008 */ unsigned int id;
  /* 0x000c */ unsigned int modeInfoIdx;
  /* 0x0010 */ unsigned int statusFlags;
}; /* size: 0x0014 */

enum DISPLAYCONFIG_VIDEO_OUTPUT_TECHNOLOGY
{
  DISPLAYCONFIG_OUTPUT_TECHNOLOGY_OTHER = -1,
  DISPLAYCONFIG_OUTPUT_TECHNOLOGY_HD15 = 0,
  DISPLAYCONFIG_OUTPUT_TECHNOLOGY_SVIDEO = 1,
  DISPLAYCONFIG_OUTPUT_TECHNOLOGY_COMPOSITE_VIDEO = 2,
  DISPLAYCONFIG_OUTPUT_TECHNOLOGY_COMPONENT_VIDEO = 3,
  DISPLAYCONFIG_OUTPUT_TECHNOLOGY_DVI = 4,
  DISPLAYCONFIG_OUTPUT_TECHNOLOGY_HDMI = 5,
  DISPLAYCONFIG_OUTPUT_TECHNOLOGY_LVDS = 6,
  DISPLAYCONFIG_OUTPUT_TECHNOLOGY_D_JPN = 8,
  DISPLAYCONFIG_OUTPUT_TECHNOLOGY_SDI = 9,
  DISPLAYCONFIG_OUTPUT_TECHNOLOGY_DISPLAYPORT_EXTERNAL = 10,
  DISPLAYCONFIG_OUTPUT_TECHNOLOGY_DISPLAYPORT_EMBEDDED = 11,
  DISPLAYCONFIG_OUTPUT_TECHNOLOGY_UDI_EXTERNAL = 12,
  DISPLAYCONFIG_OUTPUT_TECHNOLOGY_UDI_EMBEDDED = 13,
  DISPLAYCONFIG_OUTPUT_TECHNOLOGY_SDTVDONGLE = 14,
  DISPLAYCONFIG_OUTPUT_TECHNOLOGY_MIRACAST = 15,
  DISPLAYCONFIG_OUTPUT_TECHNOLOGY_INTERNAL = -2147483648,
  DISPLAYCONFIG_OUTPUT_TECHNOLOGY_FORCE_UINT32 = -1,
};

enum DISPLAYCONFIG_ROTATION
{
  DISPLAYCONFIG_ROTATION_IDENTITY = 1,
  DISPLAYCONFIG_ROTATION_ROTATE90 = 2,
  DISPLAYCONFIG_ROTATION_ROTATE180 = 3,
  DISPLAYCONFIG_ROTATION_ROTATE270 = 4,
  DISPLAYCONFIG_ROTATION_FORCE_UINT32 = -1,
};

enum DISPLAYCONFIG_SCALING
{
  DISPLAYCONFIG_SCALING_IDENTITY = 1,
  DISPLAYCONFIG_SCALING_CENTERED = 2,
  DISPLAYCONFIG_SCALING_STRETCHED = 3,
  DISPLAYCONFIG_SCALING_ASPECTRATIOCENTEREDMAX = 4,
  DISPLAYCONFIG_SCALING_CUSTOM = 5,
  DISPLAYCONFIG_SCALING_PREFERRED = 128,
  DISPLAYCONFIG_SCALING_FORCE_UINT32 = -1,
};

struct DISPLAYCONFIG_RATIONAL
{
  /* 0x0000 */ unsigned int Numerator;
  /* 0x0004 */ unsigned int Denominator;
}; /* size: 0x0008 */

enum DISPLAYCONFIG_SCANLINE_ORDERING
{
  DISPLAYCONFIG_SCANLINE_ORDERING_UNSPECIFIED = 0,
  DISPLAYCONFIG_SCANLINE_ORDERING_PROGRESSIVE = 1,
  DISPLAYCONFIG_SCANLINE_ORDERING_INTERLACED = 2,
  DISPLAYCONFIG_SCANLINE_ORDERING_INTERLACED_UPPERFIELDFIRST = 2,
  DISPLAYCONFIG_SCANLINE_ORDERING_INTERLACED_LOWERFIELDFIRST = 3,
  DISPLAYCONFIG_SCANLINE_ORDERING_FORCE_UINT32 = -1,
};

struct DISPLAYCONFIG_PATH_TARGET_INFO
{
  /* 0x0000 */ struct _LUID adapterId;
  /* 0x0008 */ unsigned int id;
  /* 0x000c */ unsigned int modeInfoIdx;
  /* 0x0010 */ enum DISPLAYCONFIG_VIDEO_OUTPUT_TECHNOLOGY outputTechnology;
  /* 0x0014 */ enum DISPLAYCONFIG_ROTATION rotation;
  /* 0x0018 */ enum DISPLAYCONFIG_SCALING scaling;
  /* 0x001c */ struct DISPLAYCONFIG_RATIONAL refreshRate;
  /* 0x0024 */ enum DISPLAYCONFIG_SCANLINE_ORDERING scanLineOrdering;
  /* 0x0028 */ int targetAvailable;
  /* 0x002c */ unsigned int statusFlags;
}; /* size: 0x0030 */

struct DISPLAYCONFIG_PATH_INFO
{
  /* 0x0000 */ struct DISPLAYCONFIG_PATH_SOURCE_INFO sourceInfo;
  /* 0x0014 */ struct DISPLAYCONFIG_PATH_TARGET_INFO targetInfo;
  /* 0x0044 */ unsigned int flags;
}; /* size: 0x0048 */

enum SE_WS_APPX_SIGNATURE_ORIGIN
{
  SE_WS_APPX_SIGNATURE_ORIGIN_NOT_VALIDATED = 0,
  SE_WS_APPX_SIGNATURE_ORIGIN_UNKNOWN = 1,
  SE_WS_APPX_SIGNATURE_ORIGIN_APPSTORE = 2,
  SE_WS_APPX_SIGNATURE_ORIGIN_WINDOWS = 3,
};

typedef struct _FILE_ID_GLOBAL_TX_DIR_INFORMATION
{
  /* 0x0000 */ unsigned long NextEntryOffset;
  /* 0x0004 */ unsigned long FileIndex;
  /* 0x0008 */ union _LARGE_INTEGER CreationTime;
  /* 0x0010 */ union _LARGE_INTEGER LastAccessTime;
  /* 0x0018 */ union _LARGE_INTEGER LastWriteTime;
  /* 0x0020 */ union _LARGE_INTEGER ChangeTime;
  /* 0x0028 */ union _LARGE_INTEGER EndOfFile;
  /* 0x0030 */ union _LARGE_INTEGER AllocationSize;
  /* 0x0038 */ unsigned long FileAttributes;
  /* 0x003c */ unsigned long FileNameLength;
  /* 0x0040 */ union _LARGE_INTEGER FileId;
  /* 0x0048 */ struct _GUID LockingTransactionId;
  /* 0x0058 */ unsigned long TxInfoFlags;
  /* 0x005c */ wchar_t FileName[1];
  /* 0x005e */ char __PADDING__[2];
} FILE_ID_GLOBAL_TX_DIR_INFORMATION, *PFILE_ID_GLOBAL_TX_DIR_INFORMATION; /* size: 0x0060 */

typedef struct _KEY_TRUST_INFORMATION
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned long TrustedKey : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned long Reserved : 31; /* bit position: 1 */
  }; /* bitfield */
} KEY_TRUST_INFORMATION, *PKEY_TRUST_INFORMATION; /* size: 0x0004 */

typedef struct _CRYPT_CONTEXTS
{
  /* 0x0000 */ unsigned long cContexts;
  /* 0x0004 */ wchar_t** rgpszContexts;
} CRYPT_CONTEXTS, *PCRYPT_CONTEXTS; /* size: 0x0008 */

typedef struct _SERVICE_PREFERRED_NODE_INFO
{
  /* 0x0000 */ unsigned short usPreferredNode;
  /* 0x0002 */ unsigned char fDelete;
  /* 0x0003 */ char __PADDING__[1];
} SERVICE_PREFERRED_NODE_INFO, *PSERVICE_PREFERRED_NODE_INFO; /* size: 0x0004 */

typedef enum _tagPARSEACTION
{
  PARSE_CANONICALIZE = 1,
  PARSE_FRIENDLY = 2,
  PARSE_SECURITY_URL = 3,
  PARSE_ROOTDOCUMENT = 4,
  PARSE_DOCUMENT = 5,
  PARSE_ANCHOR = 6,
  PARSE_ENCODE_IS_UNESCAPE = 7,
  PARSE_DECODE_IS_ESCAPE = 8,
  PARSE_PATH_FROM_URL = 9,
  PARSE_URL_FROM_PATH = 10,
  PARSE_MIME = 11,
  PARSE_SERVER = 12,
  PARSE_SCHEMA = 13,
  PARSE_SITE = 14,
  PARSE_DOMAIN = 15,
  PARSE_LOCATION = 16,
  PARSE_SECURITY_DOMAIN = 17,
  PARSE_ESCAPE = 18,
  PARSE_UNESCAPE = 19,
} tagPARSEACTION, *PtagPARSEACTION;

typedef enum _SUITE_TYPE
{
  SmallBusiness = 0,
  Enterprise = 1,
  BackOffice = 2,
  CommunicationServer = 3,
  TerminalServer = 4,
  SmallBusinessRestricted = 5,
  EmbeddedNT = 6,
  DataCenter = 7,
  SingleUserTS = 8,
  Personal = 9,
  Blade = 10,
  EmbeddedRestricted = 11,
  SecurityAppliance = 12,
  StorageServer = 13,
  ComputeServer = 14,
  WHServer = 15,
  PhoneNT = 16,
  MaxSuiteType = 17,
} SUITE_TYPE, *PSUITE_TYPE;

typedef struct _IMAGE_CE_RUNTIME_FUNCTION_ENTRY
{
  /* 0x0000 */ unsigned long FuncStart;
  struct /* bitfield */
  {
    /* 0x0004 */ unsigned long PrologLen : 8; /* bit position: 0 */
    /* 0x0004 */ unsigned long FuncLen : 22; /* bit position: 8 */
    /* 0x0004 */ unsigned long ThirtyTwoBit : 1; /* bit position: 30 */
    /* 0x0004 */ unsigned long ExceptionFlag : 1; /* bit position: 31 */
  }; /* bitfield */
} IMAGE_CE_RUNTIME_FUNCTION_ENTRY, *PIMAGE_CE_RUNTIME_FUNCTION_ENTRY; /* size: 0x0008 */

struct RPC_ENDPOINT_TEMPLATEA
{
  /* 0x0000 */ unsigned long Version;
  /* 0x0004 */ unsigned char* ProtSeq;
  /* 0x0008 */ unsigned char* Endpoint;
  /* 0x000c */ void* SecurityDescriptor;
  /* 0x0010 */ unsigned long Backlog;
}; /* size: 0x0014 */

typedef enum _STORAGE_QUERY_TYPE
{
  PropertyStandardQuery = 0,
  PropertyExistsQuery = 1,
  PropertyMaskQuery = 2,
  PropertyQueryMaxDefined = 3,
} STORAGE_QUERY_TYPE, *PSTORAGE_QUERY_TYPE;

typedef struct _SYSTEM_ENTROPY_TIMING_INFORMATION
{
  /* 0x0000 */ void* EntropyRoutine /* function */;
  /* 0x0004 */ void* InitializationRoutine /* function */;
  /* 0x0008 */ void* InitializationContext;
} SYSTEM_ENTROPY_TIMING_INFORMATION, *PSYSTEM_ENTROPY_TIMING_INFORMATION; /* size: 0x000c */

class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<CClipboardBroker::CClipboardBrokerExternalReference> const >;

class Windows::Auto<Windows::Rtl::IRtlBlobProvider *>
{
}; /* size: 0x0004 */

struct IHttpNegotiate2
{
}; /* size: 0x0004 */

enum DISPLAYCONFIG_DEVICE_INFO_TYPE
{
  DISPLAYCONFIG_DEVICE_INFO_GET_SOURCE_NAME = 1,
  DISPLAYCONFIG_DEVICE_INFO_GET_TARGET_NAME = 2,
  DISPLAYCONFIG_DEVICE_INFO_GET_TARGET_PREFERRED_MODE = 3,
  DISPLAYCONFIG_DEVICE_INFO_GET_ADAPTER_NAME = 4,
  DISPLAYCONFIG_DEVICE_INFO_SET_TARGET_PERSISTENCE = 5,
  DISPLAYCONFIG_DEVICE_INFO_GET_TARGET_BASE_TYPE = 6,
  DISPLAYCONFIG_DEVICE_INFO_FORCE_UINT32 = -1,
};

typedef struct _IMAGE_THUNK_DATA32
{
  union
  {
    union
    {
      /* 0x0000 */ unsigned long ForwarderString;
      /* 0x0000 */ unsigned long Function;
      /* 0x0000 */ unsigned long Ordinal;
      /* 0x0000 */ unsigned long AddressOfData;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ u1;
} IMAGE_THUNK_DATA32, *PIMAGE_THUNK_DATA32; /* size: 0x0004 */

typedef enum _WPP_FLAG_LEN_ENUM
{
  WPP_FLAG_LEN = 1,
} WPP_FLAG_LEN_ENUM, *PWPP_FLAG_LEN_ENUM;

struct Windows::Foundation::IReference_impl<Windows::Foundation::Internal::AggregateType<bool,unsigned char> >
{
}; /* size: 0x0004 */

typedef struct _IMAGE_FILE_HEADER
{
  /* 0x0000 */ unsigned short Machine;
  /* 0x0002 */ unsigned short NumberOfSections;
  /* 0x0004 */ unsigned long TimeDateStamp;
  /* 0x0008 */ unsigned long PointerToSymbolTable;
  /* 0x000c */ unsigned long NumberOfSymbols;
  /* 0x0010 */ unsigned short SizeOfOptionalHeader;
  /* 0x0012 */ unsigned short Characteristics;
} IMAGE_FILE_HEADER, *PIMAGE_FILE_HEADER; /* size: 0x0014 */

struct tagTOGGLEKEYS
{
  /* 0x0000 */ unsigned int cbSize;
  /* 0x0004 */ unsigned long dwFlags;
}; /* size: 0x0008 */

typedef enum _PLUGPLAY_CONTROL_CLASS
{
  PlugPlayControlEnumerateDevice = 0,
  PlugPlayControlRegisterNewDevice = 1,
  PlugPlayControlDeregisterDevice = 2,
  PlugPlayControlInitializeDevice = 3,
  PlugPlayControlStartDevice = 4,
  PlugPlayControlUnlockDevice = 5,
  PlugPlayControlQueryAndRemoveDevice = 6,
  PlugPlayControlUserResponse = 7,
  PlugPlayControlGenerateLegacyDevice = 8,
  PlugPlayControlGetInterfaceDeviceList = 9,
  PlugPlayControlProperty = 10,
  PlugPlayControlDeviceClassAssociation = 11,
  PlugPlayControlGetRelatedDevice = 12,
  PlugPlayControlGetInterfaceDeviceAlias = 13,
  PlugPlayControlDeviceStatus = 14,
  PlugPlayControlGetDeviceDepth = 15,
  PlugPlayControlQueryDeviceRelations = 16,
  PlugPlayControlTargetDeviceRelation = 17,
  PlugPlayControlQueryConflictList = 18,
  PlugPlayControlRetrieveDock = 19,
  PlugPlayControlResetDevice = 20,
  PlugPlayControlHaltDevice = 21,
  PlugPlayControlGetBlockedDriverList = 22,
  PlugPlayControlGetDeviceInterfaceEnabled = 23,
  MaxPlugPlayControl = 24,
} PLUGPLAY_CONTROL_CLASS, *PPLUGPLAY_CONTROL_CLASS;

class CBasedGlobalContextPtr
{
  /* 0x0000 */ unsigned long _p;
}; /* size: 0x0004 */

class Windows::Auto<_UNICODE_STRING>
{
}; /* size: 0x0008 */

enum ReplacesCorHdrNumericDefines
{
  COMIMAGE_FLAGS_ILONLY = 1,
  COMIMAGE_FLAGS_32BITREQUIRED = 2,
  COMIMAGE_FLAGS_IL_LIBRARY = 4,
  COMIMAGE_FLAGS_STRONGNAMESIGNED = 8,
  COMIMAGE_FLAGS_NATIVE_ENTRYPOINT = 16,
  COMIMAGE_FLAGS_TRACKDEBUGDATA = 0x10000,
  COR_VERSION_MAJOR_V2 = 2,
  COR_VERSION_MAJOR = 2,
  COR_VERSION_MINOR = 5,
  COR_DELETED_NAME_LENGTH = 8,
  COR_VTABLEGAP_NAME_LENGTH = 8,
  NATIVE_TYPE_MAX_CB = 1,
  COR_ILMETHOD_SECT_SMALL_MAX_DATASIZE = 255,
  IMAGE_COR_MIH_METHODRVA = 1,
  IMAGE_COR_MIH_EHRVA = 2,
  IMAGE_COR_MIH_BASICBLOCK = 8,
  COR_VTABLE_32BIT = 1,
  COR_VTABLE_64BIT = 2,
  COR_VTABLE_FROM_UNMANAGED = 4,
  COR_VTABLE_FROM_UNMANAGED_RETAIN_APPDOMAIN = 8,
  COR_VTABLE_CALL_MOST_DERIVED = 16,
  IMAGE_COR_EATJ_THUNK_SIZE = 32,
  MAX_CLASS_NAME = 1024,
  MAX_PACKAGE_NAME = 1024,
};

struct tagSERIALKEYSA
{
  /* 0x0000 */ unsigned int cbSize;
  /* 0x0004 */ unsigned long dwFlags;
  /* 0x0008 */ char* lpszActivePort;
  /* 0x000c */ char* lpszPort;
  /* 0x0010 */ unsigned int iBaudRate;
  /* 0x0014 */ unsigned int iPortState;
  /* 0x0018 */ unsigned int iActive;
}; /* size: 0x001c */

class CStdClassFactory
{
  /* 0x0000 */ long Padding_3;
  /* 0x0004 */ unsigned long _cRefs;
  /* 0x0008 */ unsigned long _dwIndex;
}; /* size: 0x000c */

typedef enum __vc_attributes::pointer_defaultAttribute::type_e
{
  ptr = 0,
  ref = 1,
  unique = 2,
} _vc_attributes::pointer_defaultAttribute::type_e, *P_vc_attributes::pointer_defaultAttribute::type_e;

typedef struct _TIME_FIELDS
{
  /* 0x0000 */ short Year;
  /* 0x0002 */ short Month;
  /* 0x0004 */ short Day;
  /* 0x0006 */ short Hour;
  /* 0x0008 */ short Minute;
  /* 0x000a */ short Second;
  /* 0x000c */ short Milliseconds;
  /* 0x000e */ short Weekday;
} TIME_FIELDS, *PTIME_FIELDS; /* size: 0x0010 */

typedef struct _RTL_TIME_ZONE_INFORMATION
{
  /* 0x0000 */ long Bias;
  /* 0x0004 */ wchar_t StandardName[32];
  /* 0x0044 */ struct _TIME_FIELDS StandardStart;
  /* 0x0054 */ long StandardBias;
  /* 0x0058 */ wchar_t DaylightName[32];
  /* 0x0098 */ struct _TIME_FIELDS DaylightStart;
  /* 0x00a8 */ long DaylightBias;
} RTL_TIME_ZONE_INFORMATION, *PRTL_TIME_ZONE_INFORMATION; /* size: 0x00ac */

typedef struct _RTL_DYNAMIC_TIME_ZONE_INFORMATION
{
  /* 0x0000 */ struct _RTL_TIME_ZONE_INFORMATION tzi;
  /* 0x00ac */ wchar_t TimeZoneKeyName[128];
  /* 0x01ac */ unsigned char DynamicDaylightTimeDisabled;
  /* 0x01ad */ char __PADDING__[3];
} RTL_DYNAMIC_TIME_ZONE_INFORMATION, *PRTL_DYNAMIC_TIME_ZONE_INFORMATION; /* size: 0x01b0 */

class Windows::AutoOperatorAmpersandHelper<Windows::Rtl::IRtlWORAStream *,Windows::Auto<Windows::Rtl::IRtlWORAStream *> >;

typedef enum _SYSTEM_VA_TYPE
{
  SystemVaTypeAll = 0,
  SystemVaTypeNonPagedPool = 1,
  SystemVaTypePagedPool = 2,
  SystemVaTypeSystemCache = 3,
  SystemVaTypeSystemPtes = 4,
  SystemVaTypeSessionSpace = 5,
  SystemVaTypeMax = 6,
} SYSTEM_VA_TYPE, *PSYSTEM_VA_TYPE;

typedef enum _INTERFACE_TYPE
{
  InterfaceTypeUndefined = -1,
  Internal = 0,
  Isa = 1,
  Eisa = 2,
  MicroChannel = 3,
  TurboChannel = 4,
  PCIBus = 5,
  VMEBus = 6,
  NuBus = 7,
  PCMCIABus = 8,
  CBus = 9,
  MPIBus = 10,
  MPSABus = 11,
  ProcessorInternal = 12,
  InternalPowerBus = 13,
  PNPISABus = 14,
  PNPBus = 15,
  Vmcs = 16,
  ACPIBus = 17,
  MaximumInterfaceType = 18,
} INTERFACE_TYPE, *PINTERFACE_TYPE;

typedef struct _SYSTEM_VERIFIER_INFORMATION
{
  /* 0x0000 */ unsigned long NextEntryOffset;
  /* 0x0004 */ unsigned long Level;
  /* 0x0008 */ struct _UNICODE_STRING DriverName;
  /* 0x0010 */ unsigned long RaiseIrqls;
  /* 0x0014 */ unsigned long AcquireSpinLocks;
  /* 0x0018 */ unsigned long SynchronizeExecutions;
  /* 0x001c */ unsigned long AllocationsAttempted;
  /* 0x0020 */ unsigned long AllocationsSucceeded;
  /* 0x0024 */ unsigned long AllocationsSucceededSpecialPool;
  /* 0x0028 */ unsigned long AllocationsWithNoTag;
  /* 0x002c */ unsigned long TrimRequests;
  /* 0x0030 */ unsigned long Trims;
  /* 0x0034 */ unsigned long AllocationsFailed;
  /* 0x0038 */ unsigned long AllocationsFailedDeliberately;
  /* 0x003c */ unsigned long Loads;
  /* 0x0040 */ unsigned long Unloads;
  /* 0x0044 */ unsigned long UnTrackedPool;
  /* 0x0048 */ unsigned long CurrentPagedPoolAllocations;
  /* 0x004c */ unsigned long CurrentNonPagedPoolAllocations;
  /* 0x0050 */ unsigned long PeakPagedPoolAllocations;
  /* 0x0054 */ unsigned long PeakNonPagedPoolAllocations;
  /* 0x0058 */ unsigned long PagedPoolUsageInBytes;
  /* 0x005c */ unsigned long NonPagedPoolUsageInBytes;
  /* 0x0060 */ unsigned long PeakPagedPoolUsageInBytes;
  /* 0x0064 */ unsigned long PeakNonPagedPoolUsageInBytes;
} SYSTEM_VERIFIER_INFORMATION, *PSYSTEM_VERIFIER_INFORMATION; /* size: 0x0068 */

typedef struct _RASTERIZER_STATUS
{
  /* 0x0000 */ short nSize;
  /* 0x0002 */ short wFlags;
  /* 0x0004 */ short nLanguageID;
} RASTERIZER_STATUS, *PRASTERIZER_STATUS; /* size: 0x0006 */

struct ICallFrameWalker
{
}; /* size: 0x0004 */

enum tagProcessType
{
  ProcessTypeNormal = 0,
  ProcessTypeService = 1,
  ProcessTypeComPlus = 2,
  ProcessTypeLegacySurrogate = 3,
  ProcessTypeComPlusService = 4,
};

class CBasedPubDocFilePtr
{
  /* 0x0000 */ unsigned long _p;
}; /* size: 0x0004 */

typedef struct _CERT_FORTEZZA_DATA_PROP
{
  /* 0x0000 */ unsigned char SerialNumber[8];
  /* 0x0008 */ int CertIndex;
  /* 0x000c */ unsigned char CertLabel[36];
} CERT_FORTEZZA_DATA_PROP, *PCERT_FORTEZZA_DATA_PROP; /* size: 0x0030 */

struct tagNEWTEXTMETRICA
{
  /* 0x0000 */ long tmHeight;
  /* 0x0004 */ long tmAscent;
  /* 0x0008 */ long tmDescent;
  /* 0x000c */ long tmInternalLeading;
  /* 0x0010 */ long tmExternalLeading;
  /* 0x0014 */ long tmAveCharWidth;
  /* 0x0018 */ long tmMaxCharWidth;
  /* 0x001c */ long tmWeight;
  /* 0x0020 */ long tmOverhang;
  /* 0x0024 */ long tmDigitizedAspectX;
  /* 0x0028 */ long tmDigitizedAspectY;
  /* 0x002c */ unsigned char tmFirstChar;
  /* 0x002d */ unsigned char tmLastChar;
  /* 0x002e */ unsigned char tmDefaultChar;
  /* 0x002f */ unsigned char tmBreakChar;
  /* 0x0030 */ unsigned char tmItalic;
  /* 0x0031 */ unsigned char tmUnderlined;
  /* 0x0032 */ unsigned char tmStruckOut;
  /* 0x0033 */ unsigned char tmPitchAndFamily;
  /* 0x0034 */ unsigned char tmCharSet;
  /* 0x0035 */ char Padding_4[3];
  /* 0x0038 */ unsigned long ntmFlags;
  /* 0x003c */ unsigned int ntmSizeEM;
  /* 0x0040 */ unsigned int ntmCellHeight;
  /* 0x0044 */ unsigned int ntmAvgWidth;
}; /* size: 0x0048 */

struct tagFONTSIGNATURE
{
  /* 0x0000 */ unsigned long fsUsb[4];
  /* 0x0010 */ unsigned long fsCsb[2];
}; /* size: 0x0018 */

struct tagNEWTEXTMETRICEXA
{
  /* 0x0000 */ struct tagNEWTEXTMETRICA ntmTm;
  /* 0x0048 */ struct tagFONTSIGNATURE ntmFontSig;
}; /* size: 0x0060 */

struct Windows::Foundation::Collections::IVectorView<unsigned char>
{
}; /* size: 0x0004 */

typedef enum _KPROFILE_SOURCE
{
  ProfileTime = 0,
  ProfileAlignmentFixup = 1,
  ProfileTotalIssues = 2,
  ProfilePipelineDry = 3,
  ProfileLoadInstructions = 4,
  ProfilePipelineFrozen = 5,
  ProfileBranchInstructions = 6,
  ProfileTotalNonissues = 7,
  ProfileDcacheMisses = 8,
  ProfileIcacheMisses = 9,
  ProfileCacheMisses = 10,
  ProfileBranchMispredictions = 11,
  ProfileStoreInstructions = 12,
  ProfileFpInstructions = 13,
  ProfileIntegerInstructions = 14,
  Profile2Issue = 15,
  Profile3Issue = 16,
  Profile4Issue = 17,
  ProfileSpecialInstructions = 18,
  ProfileTotalCycles = 19,
  ProfileIcacheIssues = 20,
  ProfileDcacheAccesses = 21,
  ProfileMemoryBarrierCycles = 22,
  ProfileLoadLinkedIssues = 23,
  ProfileMaximum = 24,
} KPROFILE_SOURCE, *PKPROFILE_SOURCE;

typedef struct _MINIDUMP_VM_POST_READ_CALLBACK
{
  /* 0x0000 */ unsigned __int64 Offset;
  /* 0x0008 */ void* Buffer;
  /* 0x000c */ unsigned long Size;
  /* 0x0010 */ unsigned long Completed;
  /* 0x0014 */ HRESULT Status;
} MINIDUMP_VM_POST_READ_CALLBACK, *PMINIDUMP_VM_POST_READ_CALLBACK; /* size: 0x0018 */

struct IOleCache2
{
}; /* size: 0x0004 */

class Microsoft::WRL::Details::WeakReference
{
  /* 0x0000 */ long Padding_5[3];
  /* 0x000c */ volatile long strongRefCount_;
  /* 0x0010 */ struct IUnknown* unknown_;
}; /* size: 0x0014 */

typedef enum _INSTALLSPECTYPE
{
  APPNAME = 1,
  FILEEXT = 2,
  PROGID = 3,
  COMCLASS = 4,
} INSTALLSPECTYPE, *PINSTALLSPECTYPE;

typedef struct _FLOATING_SAVE_AREA
{
  /* 0x0000 */ unsigned long ControlWord;
  /* 0x0004 */ unsigned long StatusWord;
  /* 0x0008 */ unsigned long TagWord;
  /* 0x000c */ unsigned long ErrorOffset;
  /* 0x0010 */ unsigned long ErrorSelector;
  /* 0x0014 */ unsigned long DataOffset;
  /* 0x0018 */ unsigned long DataSelector;
  /* 0x001c */ unsigned char RegisterArea[80];
  /* 0x006c */ unsigned long Spare0;
} FLOATING_SAVE_AREA, *PFLOATING_SAVE_AREA; /* size: 0x0070 */

typedef struct _CONTEXT
{
  /* 0x0000 */ unsigned long ContextFlags;
  /* 0x0004 */ unsigned long Dr0;
  /* 0x0008 */ unsigned long Dr1;
  /* 0x000c */ unsigned long Dr2;
  /* 0x0010 */ unsigned long Dr3;
  /* 0x0014 */ unsigned long Dr6;
  /* 0x0018 */ unsigned long Dr7;
  /* 0x001c */ struct _FLOATING_SAVE_AREA FloatSave;
  /* 0x008c */ unsigned long SegGs;
  /* 0x0090 */ unsigned long SegFs;
  /* 0x0094 */ unsigned long SegEs;
  /* 0x0098 */ unsigned long SegDs;
  /* 0x009c */ unsigned long Edi;
  /* 0x00a0 */ unsigned long Esi;
  /* 0x00a4 */ unsigned long Ebx;
  /* 0x00a8 */ unsigned long Edx;
  /* 0x00ac */ unsigned long Ecx;
  /* 0x00b0 */ unsigned long Eax;
  /* 0x00b4 */ unsigned long Ebp;
  /* 0x00b8 */ unsigned long Eip;
  /* 0x00bc */ unsigned long SegCs;
  /* 0x00c0 */ unsigned long EFlags;
  /* 0x00c4 */ unsigned long Esp;
  /* 0x00c8 */ unsigned long SegSs;
  /* 0x00cc */ unsigned char ExtendedRegisters[512];
} CONTEXT, *PCONTEXT; /* size: 0x02cc */

typedef struct _MINIDUMP_THREAD_CALLBACK
{
  /* 0x0000 */ unsigned long ThreadId;
  /* 0x0004 */ void* ThreadHandle;
  /* 0x0008 */ struct _CONTEXT Context;
  /* 0x02d4 */ unsigned long SizeOfContext;
  /* 0x02d8 */ unsigned __int64 StackBase;
  /* 0x02e0 */ unsigned __int64 StackEnd;
} MINIDUMP_THREAD_CALLBACK, *PMINIDUMP_THREAD_CALLBACK; /* size: 0x02e8 */

typedef struct _MINIDUMP_THREAD_EX_CALLBACK
{
  /* 0x0000 */ unsigned long ThreadId;
  /* 0x0004 */ void* ThreadHandle;
  /* 0x0008 */ struct _CONTEXT Context;
  /* 0x02d4 */ unsigned long SizeOfContext;
  /* 0x02d8 */ unsigned __int64 StackBase;
  /* 0x02e0 */ unsigned __int64 StackEnd;
  /* 0x02e8 */ unsigned __int64 BackingStoreBase;
  /* 0x02f0 */ unsigned __int64 BackingStoreEnd;
} MINIDUMP_THREAD_EX_CALLBACK, *PMINIDUMP_THREAD_EX_CALLBACK; /* size: 0x02f8 */

struct tagVS_FIXEDFILEINFO
{
  /* 0x0000 */ unsigned long dwSignature;
  /* 0x0004 */ unsigned long dwStrucVersion;
  /* 0x0008 */ unsigned long dwFileVersionMS;
  /* 0x000c */ unsigned long dwFileVersionLS;
  /* 0x0010 */ unsigned long dwProductVersionMS;
  /* 0x0014 */ unsigned long dwProductVersionLS;
  /* 0x0018 */ unsigned long dwFileFlagsMask;
  /* 0x001c */ unsigned long dwFileFlags;
  /* 0x0020 */ unsigned long dwFileOS;
  /* 0x0024 */ unsigned long dwFileType;
  /* 0x0028 */ unsigned long dwFileSubtype;
  /* 0x002c */ unsigned long dwFileDateMS;
  /* 0x0030 */ unsigned long dwFileDateLS;
}; /* size: 0x0034 */

typedef struct _MINIDUMP_MODULE_CALLBACK
{
  /* 0x0000 */ wchar_t* FullPath;
  /* 0x0004 */ unsigned __int64 BaseOfImage;
  /* 0x000c */ unsigned long SizeOfImage;
  /* 0x0010 */ unsigned long CheckSum;
  /* 0x0014 */ unsigned long TimeDateStamp;
  /* 0x0018 */ struct tagVS_FIXEDFILEINFO VersionInfo;
  /* 0x004c */ void* CvRecord;
  /* 0x0050 */ unsigned long SizeOfCvRecord;
  /* 0x0054 */ void* MiscRecord;
  /* 0x0058 */ unsigned long SizeOfMiscRecord;
} MINIDUMP_MODULE_CALLBACK, *PMINIDUMP_MODULE_CALLBACK; /* size: 0x005c */

typedef struct _MINIDUMP_INCLUDE_THREAD_CALLBACK
{
  /* 0x0000 */ unsigned long ThreadId;
} MINIDUMP_INCLUDE_THREAD_CALLBACK, *PMINIDUMP_INCLUDE_THREAD_CALLBACK; /* size: 0x0004 */

typedef struct _MINIDUMP_INCLUDE_MODULE_CALLBACK
{
  /* 0x0000 */ unsigned __int64 BaseOfImage;
} MINIDUMP_INCLUDE_MODULE_CALLBACK, *PMINIDUMP_INCLUDE_MODULE_CALLBACK; /* size: 0x0008 */

typedef struct _MINIDUMP_IO_CALLBACK
{
  /* 0x0000 */ void* Handle;
  /* 0x0004 */ unsigned __int64 Offset;
  /* 0x000c */ void* Buffer;
  /* 0x0010 */ unsigned long BufferBytes;
} MINIDUMP_IO_CALLBACK, *PMINIDUMP_IO_CALLBACK; /* size: 0x0014 */

typedef struct _MINIDUMP_READ_MEMORY_FAILURE_CALLBACK
{
  /* 0x0000 */ unsigned __int64 Offset;
  /* 0x0008 */ unsigned long Bytes;
  /* 0x000c */ HRESULT FailureStatus;
} MINIDUMP_READ_MEMORY_FAILURE_CALLBACK, *PMINIDUMP_READ_MEMORY_FAILURE_CALLBACK; /* size: 0x0010 */

typedef struct _MINIDUMP_VM_QUERY_CALLBACK
{
  /* 0x0000 */ unsigned __int64 Offset;
} MINIDUMP_VM_QUERY_CALLBACK, *PMINIDUMP_VM_QUERY_CALLBACK; /* size: 0x0008 */

typedef struct _MINIDUMP_VM_PRE_READ_CALLBACK
{
  /* 0x0000 */ unsigned __int64 Offset;
  /* 0x0008 */ void* Buffer;
  /* 0x000c */ unsigned long Size;
} MINIDUMP_VM_PRE_READ_CALLBACK, *PMINIDUMP_VM_PRE_READ_CALLBACK; /* size: 0x0010 */

typedef struct _MINIDUMP_CALLBACK_INPUT
{
  /* 0x0000 */ unsigned long ProcessId;
  /* 0x0004 */ void* ProcessHandle;
  /* 0x0008 */ unsigned long CallbackType;
  union
  {
    /* 0x000c */ HRESULT Status;
    /* 0x000c */ struct _MINIDUMP_THREAD_CALLBACK Thread;
    /* 0x000c */ struct _MINIDUMP_THREAD_EX_CALLBACK ThreadEx;
    /* 0x000c */ struct _MINIDUMP_MODULE_CALLBACK Module;
    /* 0x000c */ struct _MINIDUMP_INCLUDE_THREAD_CALLBACK IncludeThread;
    /* 0x000c */ struct _MINIDUMP_INCLUDE_MODULE_CALLBACK IncludeModule;
    /* 0x000c */ struct _MINIDUMP_IO_CALLBACK Io;
    /* 0x000c */ struct _MINIDUMP_READ_MEMORY_FAILURE_CALLBACK ReadMemoryFailure;
    /* 0x000c */ unsigned long SecondaryFlags;
    /* 0x000c */ struct _MINIDUMP_VM_QUERY_CALLBACK VmQuery;
    /* 0x000c */ struct _MINIDUMP_VM_PRE_READ_CALLBACK VmPreRead;
    struct
    {
      /* 0x000c */ struct _MINIDUMP_VM_POST_READ_CALLBACK VmPostRead;
      /* 0x0024 */ long __PADDING__[184];
    }; /* size: 0x02f8 */
  }; /* size: 0x02f8 */
} MINIDUMP_CALLBACK_INPUT, *PMINIDUMP_CALLBACK_INPUT; /* size: 0x0304 */

typedef enum _RUNLEVEL
{
  RUNLEVEL_LUA = 0,
  RUNLEVEL_HIGHEST = 1,
  RUNLEVEL_ADMIN = 2,
  RUNLEVEL_MAX_NON_UIA = 3,
  RUNLEVEL_LUA_UIA = 16,
  RUNLEVEL_HIGHEST_UIA = 17,
  RUNLEVEL_ADMIN_UIA = 18,
  RUNLEVEL_MAX = 19,
} RUNLEVEL, *PRUNLEVEL;

typedef struct _CMSG_CTRL_DEL_SIGNER_UNAUTH_ATTR_PARA
{
  /* 0x0000 */ unsigned long cbSize;
  /* 0x0004 */ unsigned long dwSignerIndex;
  /* 0x0008 */ unsigned long dwUnauthAttrIndex;
} CMSG_CTRL_DEL_SIGNER_UNAUTH_ATTR_PARA, *PCMSG_CTRL_DEL_SIGNER_UNAUTH_ATTR_PARA; /* size: 0x000c */

typedef enum __MIDL_IInternetSecurityManager_0001
{
  PUAF_DEFAULT = 0,
  PUAF_NOUI = 1,
  PUAF_ISFILE = 2,
  PUAF_WARN_IF_DENIED = 4,
  PUAF_FORCEUI_FOREGROUND = 8,
  PUAF_CHECK_TIFS = 16,
  PUAF_DONTCHECKBOXINDIALOG = 32,
  PUAF_TRUSTED = 64,
  PUAF_ACCEPT_WILDCARD_SCHEME = 128,
  PUAF_ENFORCERESTRICTED = 256,
  PUAF_NOSAVEDFILECHECK = 512,
  PUAF_REQUIRESAVEDFILECHECK = 1024,
  PUAF_DONT_USE_CACHE = 4096,
  PUAF_RESERVED1 = 8192,
  PUAF_RESERVED2 = 16384,
  PUAF_LMZ_UNLOCKED = 0x10000,
  PUAF_LMZ_LOCKED = 0x20000,
  PUAF_DEFAULTZONEPOL = 0x40000,
  PUAF_NPL_USE_LOCKED_IF_RESTRICTED = 0x80000,
  PUAF_NOUIIFLOCKED = 0x100000,
  PUAF_DRAGPROTOCOLCHECK = 0x200000,
} _MIDL_IInternetSecurityManager_0001, *P_MIDL_IInternetSecurityManager_0001;

struct HUMPD__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct IObjContext
{
}; /* size: 0x0004 */

struct NUMPARSE
{
  /* 0x0000 */ int cDig;
  /* 0x0004 */ unsigned long dwInFlags;
  /* 0x0008 */ unsigned long dwOutFlags;
  /* 0x000c */ int cchUsed;
  /* 0x0010 */ int nBaseShift;
  /* 0x0014 */ int nPwr10;
}; /* size: 0x0018 */

enum PROXY_PHASE
{
  PROXY_CALCSIZE = 0,
  PROXY_GETBUFFER = 1,
  PROXY_MARSHAL = 2,
  PROXY_SENDRECEIVE = 3,
  PROXY_UNMARSHAL = 4,
};

typedef struct _POINTL
{
  /* 0x0000 */ long x;
  /* 0x0004 */ long y;
} POINTL, *PPOINTL; /* size: 0x0008 */

typedef struct _RECTL
{
  /* 0x0000 */ long left;
  /* 0x0004 */ long top;
  /* 0x0008 */ long right;
  /* 0x000c */ long bottom;
} RECTL, *PRECTL; /* size: 0x0010 */

struct tagEMRTEXT
{
  /* 0x0000 */ struct _POINTL ptlReference;
  /* 0x0008 */ unsigned long nChars;
  /* 0x000c */ unsigned long offString;
  /* 0x0010 */ unsigned long fOptions;
  /* 0x0014 */ struct _RECTL rcl;
  /* 0x0024 */ unsigned long offDx;
}; /* size: 0x0028 */

struct tagDEVNAMES
{
  /* 0x0000 */ unsigned short wDriverOffset;
  /* 0x0002 */ unsigned short wDeviceOffset;
  /* 0x0004 */ unsigned short wOutputOffset;
  /* 0x0006 */ unsigned short wDefault;
}; /* size: 0x0008 */

struct _HMAPPER;

typedef struct _POWER_SESSION_TIMEOUTS
{
  /* 0x0000 */ unsigned long InputTimeout;
  /* 0x0004 */ unsigned long DisplayTimeout;
} POWER_SESSION_TIMEOUTS, *PPOWER_SESSION_TIMEOUTS; /* size: 0x0008 */

typedef enum _IDL_CS_CONVERT
{
  IDL_CS_NO_CONVERT = 0,
  IDL_CS_IN_PLACE_CONVERT = 1,
  IDL_CS_NEW_BUFFER_CONVERT = 2,
} IDL_CS_CONVERT, *PIDL_CS_CONVERT;

typedef struct _PS_ATTRIBUTE
{
  /* 0x0000 */ unsigned long Attribute;
  /* 0x0004 */ unsigned long Size;
  union
  {
    /* 0x0008 */ unsigned long Value;
    /* 0x0008 */ void* ValuePtr;
  }; /* size: 0x0004 */
  /* 0x000c */ unsigned long* ReturnLength;
} PS_ATTRIBUTE, *PPS_ATTRIBUTE; /* size: 0x0010 */

struct tagOutgoingCallData
{
  /* 0x0000 */ unsigned long dwServerPID;
  /* 0x0004 */ unsigned long dwServerTID;
}; /* size: 0x0008 */

typedef struct _TOKEN_ELEVATION
{
  /* 0x0000 */ unsigned long TokenIsElevated;
} TOKEN_ELEVATION, *PTOKEN_ELEVATION; /* size: 0x0004 */

typedef enum _BUS_DATA_TYPE
{
  ConfigurationSpaceUndefined = -1,
  Cmos = 0,
  EisaConfiguration = 1,
  Pos = 2,
  CbusConfiguration = 3,
  PCIConfiguration = 4,
  VMEConfiguration = 5,
  NuBusConfiguration = 6,
  PCMCIAConfiguration = 7,
  MPIConfiguration = 8,
  MPSAConfiguration = 9,
  PNPISAConfiguration = 10,
  SgiInternalConfiguration = 11,
  MaximumBusDataType = 12,
} BUS_DATA_TYPE, *PBUS_DATA_TYPE;

typedef enum __vc_attributes::helper_attributes::v1_alttypeAttribute::type_e
{
  eBoolean = 0,
  eInteger = 1,
  eFloat = 2,
  eDouble = 3,
} _vc_attributes::helper_attributes::v1_alttypeAttribute::type_e, *P_vc_attributes::helper_attributes::v1_alttypeAttribute::type_e;

typedef struct _FSCTL_OFFLOAD_WRITE_OUTPUT
{
  /* 0x0000 */ unsigned long Size;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ unsigned __int64 LengthWritten;
} FSCTL_OFFLOAD_WRITE_OUTPUT, *PFSCTL_OFFLOAD_WRITE_OUTPUT; /* size: 0x0010 */

enum tagSTGC
{
  STGC_DEFAULT = 0,
  STGC_OVERWRITE = 1,
  STGC_ONLYIFCURRENT = 2,
  STGC_DANGEROUSLYCOMMITMERELYTODISKCACHE = 4,
  STGC_CONSOLIDATE = 8,
};

typedef struct _SYSTEM_PROCESSOR_IDLE_INFORMATION
{
  /* 0x0000 */ unsigned __int64 IdleTime;
  /* 0x0008 */ unsigned __int64 C1Time;
  /* 0x0010 */ unsigned __int64 C2Time;
  /* 0x0018 */ unsigned __int64 C3Time;
  /* 0x0020 */ unsigned long C1Transitions;
  /* 0x0024 */ unsigned long C2Transitions;
  /* 0x0028 */ unsigned long C3Transitions;
  /* 0x002c */ unsigned long Padding;
} SYSTEM_PROCESSOR_IDLE_INFORMATION, *PSYSTEM_PROCESSOR_IDLE_INFORMATION; /* size: 0x0030 */

typedef enum _RTL_PATH_TYPE
{
  RtlPathTypeUnknown = 0,
  RtlPathTypeUncAbsolute = 1,
  RtlPathTypeDriveAbsolute = 2,
  RtlPathTypeDriveRelative = 3,
  RtlPathTypeRooted = 4,
  RtlPathTypeRelative = 5,
  RtlPathTypeLocalDevice = 6,
  RtlPathTypeRootLocalDevice = 7,
} RTL_PATH_TYPE, *PRTL_PATH_TYPE;

typedef enum __vc_attributes::event_receiverAttribute::type_e
{
  native = 0,
  com = 1,
  managed = 2,
} _vc_attributes::event_receiverAttribute::type_e, *P_vc_attributes::event_receiverAttribute::type_e;

struct IPropertyPage
{
}; /* size: 0x0004 */

struct IBindStatusCallbackEx
{
}; /* size: 0x0004 */

typedef struct _SHFILEINFOW
{
  /* 0x0000 */ struct HICON__* hIcon;
  /* 0x0004 */ int iIcon;
  /* 0x0008 */ unsigned long dwAttributes;
  /* 0x000c */ wchar_t szDisplayName[260];
  /* 0x0214 */ wchar_t szTypeName[80];
} SHFILEINFOW, *PSHFILEINFOW; /* size: 0x02b4 */

class Windows::Rtl::StringTraits<_LUTF8_STRING>
{
}; /* size: 0x0001 */

typedef struct _FILE_ATTRIBUTE_TAG_INFORMATION
{
  /* 0x0000 */ unsigned long FileAttributes;
  /* 0x0004 */ unsigned long ReparseTag;
} FILE_ATTRIBUTE_TAG_INFORMATION, *PFILE_ATTRIBUTE_TAG_INFORMATION; /* size: 0x0008 */

class Windows::Auto<Windows::Rtl::IRtlFormattableInterface *>
{
}; /* size: 0x0004 */

typedef enum _WORKER_FACTORY_CALLBACK_CLASS
{
  WorkerFactoryCallbackNormal = 0,
  WorkerFactoryCallbackLongRunning = 1,
  WorkerFactoryCallbackIndependent = 2,
  WorkerFactoryCallbackDetectedUnrecoverableError = 3,
} WORKER_FACTORY_CALLBACK_CLASS, *PWORKER_FACTORY_CALLBACK_CLASS;

typedef struct _IMAGEHLP_LINEW64
{
  /* 0x0000 */ unsigned long SizeOfStruct;
  /* 0x0004 */ void* Key;
  /* 0x0008 */ unsigned long LineNumber;
  /* 0x000c */ wchar_t* FileName;
  /* 0x0010 */ unsigned __int64 Address;
} IMAGEHLP_LINEW64, *PIMAGEHLP_LINEW64; /* size: 0x0018 */

class CBasedMarshalListPtr
{
  /* 0x0000 */ unsigned long _p;
}; /* size: 0x0004 */

struct Windows::Foundation::IReference<int>
{
}; /* size: 0x0004 */

enum SYSTEM_POWER_CONDITION
{
  PoAc = 0,
  PoDc = 1,
  PoHot = 2,
  PoConditionMaximum = 3,
};

enum ACTCTX_COMPATIBILITY_ELEMENT_TYPE
{
  ACTCTX_COMPATIBILITY_ELEMENT_TYPE_UNKNOWN = 0,
  ACTCTX_COMPATIBILITY_ELEMENT_TYPE_OS = 1,
  ACTCTX_COMPATIBILITY_ELEMENT_TYPE_MITIGATION = 2,
};

typedef struct _COMPATIBILITY_CONTEXT_ELEMENT
{
  /* 0x0000 */ struct _GUID Id;
  /* 0x0010 */ enum ACTCTX_COMPATIBILITY_ELEMENT_TYPE Type;
} COMPATIBILITY_CONTEXT_ELEMENT, *PCOMPATIBILITY_CONTEXT_ELEMENT; /* size: 0x0014 */

typedef struct _RTL_SMART_LBLOB_WRITING_CONTEXT
{
  /* 0x0000 */ unsigned char* CurrentEncodingPosition;
  /* 0x0004 */ unsigned char* EndEncodingPosition;
  /* 0x0008 */ unsigned long BytesWrittenOrRequired;
  /* 0x000c */ unsigned long LongestLegalLength;
  /* 0x0010 */ struct _LBLOB* BufferInUse;
  /* 0x0014 */ struct _LBLOB* FixedSizeBuffer;
  /* 0x0018 */ struct _LBLOB* DynamicBuffer;
  /* 0x001c */ struct _LBLOB** ReturnedBufferUsed;
  /* 0x0020 */ void* ResizePolicy /* function */;
  /* 0x0024 */ void* Reserved1;
  /* 0x0028 */ void* Reserved2;
} RTL_SMART_LBLOB_WRITING_CONTEXT, *PRTL_SMART_LBLOB_WRITING_CONTEXT; /* size: 0x002c */

class Windows::Rtl::CRTL_SMART_LBLOB_WRITING_CONTEXT
{
  /* 0x0000 */ struct _RTL_SMART_LBLOB_WRITING_CONTEXT m_WritingContext;
}; /* size: 0x002c */

enum tagAPTKIND
{
  APTKIND_NEUTRALTHREADED = 1,
  APTKIND_MULTITHREADED = 2,
  APTKIND_APARTMENTTHREADED = 4,
  APTKIND_APPLICATION_STA = 8,
};

enum tagTYPEKIND
{
  TKIND_ENUM = 0,
  TKIND_RECORD = 1,
  TKIND_MODULE = 2,
  TKIND_INTERFACE = 3,
  TKIND_DISPATCH = 4,
  TKIND_COCLASS = 5,
  TKIND_ALIAS = 6,
  TKIND_UNION = 7,
  TKIND_MAX = 8,
};

typedef struct _SYSTEM_POWER_LOGGING_ENTRY
{
  /* 0x0000 */ unsigned long Reason;
  /* 0x0004 */ unsigned long States;
} SYSTEM_POWER_LOGGING_ENTRY, *PSYSTEM_POWER_LOGGING_ENTRY; /* size: 0x0008 */

class Microsoft::WRL::RuntimeClass<Microsoft::WRL::RuntimeClassFlags<2>,IWeakReference,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil>
{
}; /* size: 0x000c */

typedef enum _MUTANT_INFORMATION_CLASS
{
  MutantBasicInformation = 0,
  MutantOwnerInformation = 1,
} MUTANT_INFORMATION_CLASS, *PMUTANT_INFORMATION_CLASS;

struct tagBITMAPINFOHEADER
{
  /* 0x0000 */ unsigned long biSize;
  /* 0x0004 */ long biWidth;
  /* 0x0008 */ long biHeight;
  /* 0x000c */ unsigned short biPlanes;
  /* 0x000e */ unsigned short biBitCount;
  /* 0x0010 */ unsigned long biCompression;
  /* 0x0014 */ unsigned long biSizeImage;
  /* 0x0018 */ long biXPelsPerMeter;
  /* 0x001c */ long biYPelsPerMeter;
  /* 0x0020 */ unsigned long biClrUsed;
  /* 0x0024 */ unsigned long biClrImportant;
}; /* size: 0x0028 */

typedef enum __vc_attributes::moduleAttribute::type_e
{
  dll = 1,
  exe = 2,
  service = 3,
  unspecified = 4,
  EXE = 2,
  SERVICE = 3,
} _vc_attributes::moduleAttribute::type_e, *P_vc_attributes::moduleAttribute::type_e;

typedef struct _EISA_IRQ_DESCRIPTOR
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned char Interrupt : 4; /* bit position: 0 */
    /* 0x0000 */ unsigned char Reserved : 1; /* bit position: 4 */
    /* 0x0000 */ unsigned char LevelTriggered : 1; /* bit position: 5 */
    /* 0x0000 */ unsigned char Shared : 1; /* bit position: 6 */
    /* 0x0000 */ unsigned char MoreEntries : 1; /* bit position: 7 */
  }; /* bitfield */
} EISA_IRQ_DESCRIPTOR, *PEISA_IRQ_DESCRIPTOR; /* size: 0x0001 */

class COleConditionVariable
{
  /* 0x0000 */ struct _RTL_CONDITION_VARIABLE _cv;
}; /* size: 0x0004 */

struct PPM_THERMAL_POLICY_EVENT
{
  /* 0x0000 */ unsigned char Mode;
  /* 0x0001 */ char Padding_6[7];
  /* 0x0008 */ unsigned __int64 Processors;
}; /* size: 0x0010 */

enum tagBINDSTATUS
{
  BINDSTATUS_FINDINGRESOURCE = 1,
  BINDSTATUS_CONNECTING = 2,
  BINDSTATUS_REDIRECTING = 3,
  BINDSTATUS_BEGINDOWNLOADDATA = 4,
  BINDSTATUS_DOWNLOADINGDATA = 5,
  BINDSTATUS_ENDDOWNLOADDATA = 6,
  BINDSTATUS_BEGINDOWNLOADCOMPONENTS = 7,
  BINDSTATUS_INSTALLINGCOMPONENTS = 8,
  BINDSTATUS_ENDDOWNLOADCOMPONENTS = 9,
  BINDSTATUS_USINGCACHEDCOPY = 10,
  BINDSTATUS_SENDINGREQUEST = 11,
  BINDSTATUS_CLASSIDAVAILABLE = 12,
  BINDSTATUS_MIMETYPEAVAILABLE = 13,
  BINDSTATUS_CACHEFILENAMEAVAILABLE = 14,
  BINDSTATUS_BEGINSYNCOPERATION = 15,
  BINDSTATUS_ENDSYNCOPERATION = 16,
  BINDSTATUS_BEGINUPLOADDATA = 17,
  BINDSTATUS_UPLOADINGDATA = 18,
  BINDSTATUS_ENDUPLOADDATA = 19,
  BINDSTATUS_PROTOCOLCLASSID = 20,
  BINDSTATUS_ENCODING = 21,
  BINDSTATUS_VERIFIEDMIMETYPEAVAILABLE = 22,
  BINDSTATUS_CLASSINSTALLLOCATION = 23,
  BINDSTATUS_DECODING = 24,
  BINDSTATUS_LOADINGMIMEHANDLER = 25,
  BINDSTATUS_CONTENTDISPOSITIONATTACH = 26,
  BINDSTATUS_FILTERREPORTMIMETYPE = 27,
  BINDSTATUS_CLSIDCANINSTANTIATE = 28,
  BINDSTATUS_IUNKNOWNAVAILABLE = 29,
  BINDSTATUS_DIRECTBIND = 30,
  BINDSTATUS_RAWMIMETYPE = 31,
  BINDSTATUS_PROXYDETECTING = 32,
  BINDSTATUS_ACCEPTRANGES = 33,
  BINDSTATUS_COOKIE_SENT = 34,
  BINDSTATUS_COMPACT_POLICY_RECEIVED = 35,
  BINDSTATUS_COOKIE_SUPPRESSED = 36,
  BINDSTATUS_COOKIE_STATE_UNKNOWN = 37,
  BINDSTATUS_COOKIE_STATE_ACCEPT = 38,
  BINDSTATUS_COOKIE_STATE_REJECT = 39,
  BINDSTATUS_COOKIE_STATE_PROMPT = 40,
  BINDSTATUS_COOKIE_STATE_LEASH = 41,
  BINDSTATUS_COOKIE_STATE_DOWNGRADE = 42,
  BINDSTATUS_POLICY_HREF = 43,
  BINDSTATUS_P3P_HEADER = 44,
  BINDSTATUS_SESSION_COOKIE_RECEIVED = 45,
  BINDSTATUS_PERSISTENT_COOKIE_RECEIVED = 46,
  BINDSTATUS_SESSION_COOKIES_ALLOWED = 47,
  BINDSTATUS_CACHECONTROL = 48,
  BINDSTATUS_CONTENTDISPOSITIONFILENAME = 49,
  BINDSTATUS_MIMETEXTPLAINMISMATCH = 50,
  BINDSTATUS_PUBLISHERAVAILABLE = 51,
  BINDSTATUS_DISPLAYNAMEAVAILABLE = 52,
  BINDSTATUS_SSLUX_NAVBLOCKED = 53,
  BINDSTATUS_SERVER_MIMETYPEAVAILABLE = 54,
  BINDSTATUS_SNIFFED_CLASSIDAVAILABLE = 55,
  BINDSTATUS_64BIT_PROGRESS = 56,
  BINDSTATUS_LAST = 56,
  BINDSTATUS_RESERVED_0 = 57,
  BINDSTATUS_RESERVED_1 = 58,
  BINDSTATUS_RESERVED_2 = 59,
  BINDSTATUS_RESERVED_3 = 60,
  BINDSTATUS_RESERVED_4 = 61,
  BINDSTATUS_RESERVED_5 = 62,
  BINDSTATUS_RESERVED_6 = 63,
  BINDSTATUS_RESERVED_7 = 64,
  BINDSTATUS_RESERVED_8 = 65,
  BINDSTATUS_RESERVED_9 = 66,
  BINDSTATUS_RESERVED_A = 67,
  BINDSTATUS_RESERVED_B = 68,
  BINDSTATUS_RESERVED_C = 69,
  BINDSTATUS_RESERVED_D = 70,
  BINDSTATUS_RESERVED_E = 71,
  BINDSTATUS_LAST_PRIVATE = 71,
};

typedef enum __MIDL_IUri_0001
{
  Uri_PROPERTY_ABSOLUTE_URI = 0,
  Uri_PROPERTY_STRING_START = 0,
  Uri_PROPERTY_AUTHORITY = 1,
  Uri_PROPERTY_DISPLAY_URI = 2,
  Uri_PROPERTY_DOMAIN = 3,
  Uri_PROPERTY_EXTENSION = 4,
  Uri_PROPERTY_FRAGMENT = 5,
  Uri_PROPERTY_HOST = 6,
  Uri_PROPERTY_PASSWORD = 7,
  Uri_PROPERTY_PATH = 8,
  Uri_PROPERTY_PATH_AND_QUERY = 9,
  Uri_PROPERTY_QUERY = 10,
  Uri_PROPERTY_RAW_URI = 11,
  Uri_PROPERTY_SCHEME_NAME = 12,
  Uri_PROPERTY_USER_INFO = 13,
  Uri_PROPERTY_USER_NAME = 14,
  Uri_PROPERTY_STRING_LAST = 14,
  Uri_PROPERTY_HOST_TYPE = 15,
  Uri_PROPERTY_DWORD_START = 15,
  Uri_PROPERTY_PORT = 16,
  Uri_PROPERTY_SCHEME = 17,
  Uri_PROPERTY_ZONE = 18,
  Uri_PROPERTY_DWORD_LAST = 18,
} _MIDL_IUri_0001, *P_MIDL_IUri_0001;

class GenericStream
{
  /* 0x0000 */ long Padding_7[2];
  /* 0x0008 */ long _clRefs;
  /* 0x000c */ long _lOffset;
  /* 0x0010 */ long _cbDataSize;
  /* 0x0014 */ unsigned long _cbBufferSize;
  /* 0x0018 */ struct tagInterfaceData* _pifData;
  /* 0x001c */ int _fFree;
  /* 0x0020 */ unsigned long _copyAlignment;
}; /* size: 0x0024 */

typedef struct _SYMBOL_INFO
{
  /* 0x0000 */ unsigned long SizeOfStruct;
  /* 0x0004 */ unsigned long TypeIndex;
  /* 0x0008 */ unsigned __int64 Reserved[2];
  /* 0x0018 */ unsigned long Index;
  /* 0x001c */ unsigned long Size;
  /* 0x0020 */ unsigned __int64 ModBase;
  /* 0x0028 */ unsigned long Flags;
  /* 0x002c */ long Padding_8;
  /* 0x0030 */ unsigned __int64 Value;
  /* 0x0038 */ unsigned __int64 Address;
  /* 0x0040 */ unsigned long Register;
  /* 0x0044 */ unsigned long Scope;
  /* 0x0048 */ unsigned long Tag;
  /* 0x004c */ unsigned long NameLen;
  /* 0x0050 */ unsigned long MaxNameLen;
  /* 0x0054 */ char Name[1];
  /* 0x0055 */ char __PADDING__[3];
} SYMBOL_INFO, *PSYMBOL_INFO; /* size: 0x0058 */

typedef struct _SYMBOL_INFO_PACKAGE
{
  /* 0x0000 */ struct _SYMBOL_INFO si;
  /* 0x0058 */ char name[2001];
  /* 0x0829 */ char __PADDING__[7];
} SYMBOL_INFO_PACKAGE, *PSYMBOL_INFO_PACKAGE; /* size: 0x0830 */

struct tagLOGFONTA
{
  /* 0x0000 */ long lfHeight;
  /* 0x0004 */ long lfWidth;
  /* 0x0008 */ long lfEscapement;
  /* 0x000c */ long lfOrientation;
  /* 0x0010 */ long lfWeight;
  /* 0x0014 */ unsigned char lfItalic;
  /* 0x0015 */ unsigned char lfUnderline;
  /* 0x0016 */ unsigned char lfStrikeOut;
  /* 0x0017 */ unsigned char lfCharSet;
  /* 0x0018 */ unsigned char lfOutPrecision;
  /* 0x0019 */ unsigned char lfClipPrecision;
  /* 0x001a */ unsigned char lfQuality;
  /* 0x001b */ unsigned char lfPitchAndFamily;
  /* 0x001c */ char lfFaceName[32];
}; /* size: 0x003c */

struct tagENUMLOGFONTEXA
{
  /* 0x0000 */ struct tagLOGFONTA elfLogFont;
  /* 0x003c */ unsigned char elfFullName[64];
  /* 0x007c */ unsigned char elfStyle[32];
  /* 0x009c */ unsigned char elfScript[32];
}; /* size: 0x00bc */

enum tagQACONTAINERFLAGS
{
  QACONTAINER_SHOWHATCHING = 1,
  QACONTAINER_SHOWGRABHANDLES = 2,
  QACONTAINER_USERMODE = 4,
  QACONTAINER_DISPLAYASDEFAULT = 8,
  QACONTAINER_UIDEAD = 16,
  QACONTAINER_AUTOCLIP = 32,
  QACONTAINER_MESSAGEREFLECT = 64,
  QACONTAINER_SUPPORTSMNEMONICS = 128,
};

typedef enum _JOURNAL_CHANGE_INFORMATION_CLASS
{
  JournalCreateKey = 0,
  JournalDeleteKey = 1,
  JournalRenameKey = 2,
  JournalSetValue = 3,
  JournalDeleteValue = 4,
  JournalSetKeySecurity = 5,
  JournalSetKeyUserFlags = 6,
  JournalSetLastWriteTime = 7,
  JournalBeginTransaction = 8,
  JournalCommitTransaction = 9,
  JournalAbortTransaction = 10,
  MaxJournalChangeAction = 11,
} JOURNAL_CHANGE_INFORMATION_CLASS, *PJOURNAL_CHANGE_INFORMATION_CLASS;

typedef struct _KEY_VALUE_FULL_INFORMATION
{
  /* 0x0000 */ unsigned long TitleIndex;
  /* 0x0004 */ unsigned long Type;
  /* 0x0008 */ unsigned long DataOffset;
  /* 0x000c */ unsigned long DataLength;
  /* 0x0010 */ unsigned long NameLength;
  /* 0x0014 */ wchar_t Name[1];
  /* 0x0016 */ char __PADDING__[2];
} KEY_VALUE_FULL_INFORMATION, *PKEY_VALUE_FULL_INFORMATION; /* size: 0x0018 */

typedef struct _IMAGEHLP_SYMBOLW64
{
  /* 0x0000 */ unsigned long SizeOfStruct;
  /* 0x0004 */ long Padding_9;
  /* 0x0008 */ unsigned __int64 Address;
  /* 0x0010 */ unsigned long Size;
  /* 0x0014 */ unsigned long Flags;
  /* 0x0018 */ unsigned long MaxNameLength;
  /* 0x001c */ wchar_t Name[1];
  /* 0x001e */ char __PADDING__[2];
} IMAGEHLP_SYMBOLW64, *PIMAGEHLP_SYMBOLW64; /* size: 0x0020 */

typedef enum _LDR_DLL_LOAD_REASON
{
  LoadReasonStaticDependency = 0,
  LoadReasonStaticForwarderDependency = 1,
  LoadReasonDynamicForwarderDependency = 2,
  LoadReasonDelayloadDependency = 3,
  LoadReasonDynamicLoad = 4,
  LoadReasonAsImageLoad = 5,
  LoadReasonAsDataLoad = 6,
  LoadReasonUnknown = -1,
} LDR_DLL_LOAD_REASON, *PLDR_DLL_LOAD_REASON;

struct tagPROPSPEC
{
  /* 0x0000 */ unsigned long ulKind;
  union
  {
    /* 0x0004 */ unsigned long propid;
    /* 0x0004 */ wchar_t* lpwstr;
  }; /* size: 0x0004 */
}; /* size: 0x0008 */

enum RO_INIT_TYPE
{
  RO_INIT_SINGLETHREADED = 0,
  RO_INIT_MULTITHREADED = 1,
};

typedef struct _CRYPT_ALGORITHM_IDENTIFIER
{
  /* 0x0000 */ char* pszObjId;
  /* 0x0004 */ struct _CRYPTOAPI_BLOB Parameters;
} CRYPT_ALGORITHM_IDENTIFIER, *PCRYPT_ALGORITHM_IDENTIFIER; /* size: 0x000c */

typedef struct _CRYPT_ECC_CMS_SHARED_INFO
{
  /* 0x0000 */ struct _CRYPT_ALGORITHM_IDENTIFIER Algorithm;
  /* 0x000c */ struct _CRYPTOAPI_BLOB EntityUInfo;
  /* 0x0014 */ unsigned char rgbSuppPubInfo[4];
} CRYPT_ECC_CMS_SHARED_INFO, *PCRYPT_ECC_CMS_SHARED_INFO; /* size: 0x0018 */

typedef struct _PLUGPLAY_CONTROL_CONFLICT_ENTRY
{
  /* 0x0000 */ unsigned long DeviceInstance;
  /* 0x0004 */ unsigned long DeviceFlags;
  /* 0x0008 */ unsigned long ResourceType;
  /* 0x000c */ long Padding_10;
  /* 0x0010 */ unsigned __int64 ResourceStart;
  /* 0x0018 */ unsigned __int64 ResourceEnd;
  /* 0x0020 */ unsigned long ResourceFlags;
  /* 0x0024 */ long __PADDING__[1];
} PLUGPLAY_CONTROL_CONFLICT_ENTRY, *PPLUGPLAY_CONTROL_CONFLICT_ENTRY; /* size: 0x0028 */

typedef struct _PLUGPLAY_CONTROL_CONFLICT_LIST
{
  /* 0x0000 */ unsigned long Reserved1;
  /* 0x0004 */ unsigned long Reserved2;
  /* 0x0008 */ unsigned long ConflictsCounted;
  /* 0x000c */ unsigned long ConflictsListed;
  /* 0x0010 */ unsigned long RequiredBufferSize;
  /* 0x0014 */ long Padding_11;
  /* 0x0018 */ struct _PLUGPLAY_CONTROL_CONFLICT_ENTRY ConflictEntry[1];
} PLUGPLAY_CONTROL_CONFLICT_LIST, *PPLUGPLAY_CONTROL_CONFLICT_LIST; /* size: 0x0040 */

struct tagREMINTERFACEREF
{
  /* 0x0000 */ struct _GUID ipid;
  /* 0x0010 */ unsigned long cPublicRefs;
  /* 0x0014 */ unsigned long cPrivateRefs;
}; /* size: 0x0018 */

typedef enum _AUDIT_EVENT_TYPE
{
  AuditEventObjectAccess = 0,
  AuditEventDirectoryServiceAccess = 1,
} AUDIT_EVENT_TYPE, *PAUDIT_EVENT_TYPE;

typedef struct _SE_AUDIT_INFO
{
  /* 0x0000 */ unsigned long Size;
  /* 0x0004 */ enum _AUDIT_EVENT_TYPE AuditType;
  /* 0x0008 */ enum _SE_AUDIT_OPERATION AuditOperation;
  /* 0x000c */ unsigned long AuditFlags;
  /* 0x0010 */ struct _UNICODE_STRING SubsystemName;
  /* 0x0018 */ struct _UNICODE_STRING ObjectTypeName;
  /* 0x0020 */ struct _UNICODE_STRING ObjectName;
  /* 0x0028 */ void* HandleId;
  /* 0x002c */ struct _GUID* TransactionId;
  /* 0x0030 */ struct _LUID* OperationId;
  /* 0x0034 */ unsigned char ObjectCreation;
  /* 0x0035 */ unsigned char GenerateOnClose;
  /* 0x0036 */ char __PADDING__[2];
} SE_AUDIT_INFO, *PSE_AUDIT_INFO; /* size: 0x0038 */

typedef struct _HISTOGRAM_BUCKET
{
  /* 0x0000 */ unsigned long Reads;
  /* 0x0004 */ unsigned long Writes;
} HISTOGRAM_BUCKET, *PHISTOGRAM_BUCKET; /* size: 0x0008 */

typedef enum _TP_TRACE_TYPE
{
  TpTraceThreadPriority = 1,
  TpTraceThreadAffinity = 2,
  MaxTpTraceType = 3,
} TP_TRACE_TYPE, *PTP_TRACE_TYPE;

typedef struct _SERVICE_STATUS_PROCESS
{
  /* 0x0000 */ unsigned long dwServiceType;
  /* 0x0004 */ unsigned long dwCurrentState;
  /* 0x0008 */ unsigned long dwControlsAccepted;
  /* 0x000c */ unsigned long dwWin32ExitCode;
  /* 0x0010 */ unsigned long dwServiceSpecificExitCode;
  /* 0x0014 */ unsigned long dwCheckPoint;
  /* 0x0018 */ unsigned long dwWaitHint;
  /* 0x001c */ unsigned long dwProcessId;
  /* 0x0020 */ unsigned long dwServiceFlags;
} SERVICE_STATUS_PROCESS, *PSERVICE_STATUS_PROCESS; /* size: 0x0024 */

typedef struct _SERVICE_NOTIFY_2W
{
  /* 0x0000 */ unsigned long dwVersion;
  /* 0x0004 */ void* pfnNotifyCallback /* function */;
  /* 0x0008 */ void* pContext;
  /* 0x000c */ unsigned long dwNotificationStatus;
  /* 0x0010 */ struct _SERVICE_STATUS_PROCESS ServiceStatus;
  /* 0x0034 */ unsigned long dwNotificationTriggered;
  /* 0x0038 */ wchar_t* pszServiceNames;
} SERVICE_NOTIFY_2W, *PSERVICE_NOTIFY_2W; /* size: 0x003c */

enum tagOLERENDER
{
  OLERENDER_NONE = 0,
  OLERENDER_DRAW = 1,
  OLERENDER_FORMAT = 2,
  OLERENDER_ASIS = 3,
};

struct INoMarshal
{
}; /* size: 0x0004 */

typedef struct _DRIVER_INFO_4W
{
  /* 0x0000 */ unsigned long cVersion;
  /* 0x0004 */ wchar_t* pName;
  /* 0x0008 */ wchar_t* pEnvironment;
  /* 0x000c */ wchar_t* pDriverPath;
  /* 0x0010 */ wchar_t* pDataFile;
  /* 0x0014 */ wchar_t* pConfigFile;
  /* 0x0018 */ wchar_t* pHelpFile;
  /* 0x001c */ wchar_t* pDependentFiles;
  /* 0x0020 */ wchar_t* pMonitorName;
  /* 0x0024 */ wchar_t* pDefaultDataType;
  /* 0x0028 */ wchar_t* pszzPreviousNames;
} DRIVER_INFO_4W, *PDRIVER_INFO_4W; /* size: 0x002c */

typedef enum __vc_attributes::event_sourceAttribute::type_e
{
  native = 0,
  com = 1,
  managed = 2,
} _vc_attributes::event_sourceAttribute::type_e, *P_vc_attributes::event_sourceAttribute::type_e;

typedef struct _IMAGE_SYMBOL_EX
{
  union
  {
    union
    {
      /* 0x0000 */ unsigned char ShortName[8];
      struct
      {
        /* 0x0000 */ unsigned long Short;
        /* 0x0004 */ unsigned long Long;
      } /* size: 0x0008 */ Name;
      /* 0x0000 */ unsigned long LongName[2];
    }; /* size: 0x0008 */
  } /* size: 0x0008 */ N;
  /* 0x0008 */ unsigned long Value;
  /* 0x000c */ long SectionNumber;
  /* 0x0010 */ unsigned short Type;
  /* 0x0012 */ unsigned char StorageClass;
  /* 0x0013 */ unsigned char NumberOfAuxSymbols;
} IMAGE_SYMBOL_EX, *PIMAGE_SYMBOL_EX; /* size: 0x0014 */

struct _TP_JOB;

struct servent
{
  /* 0x0000 */ char* s_name;
  /* 0x0004 */ char** s_aliases;
  /* 0x0008 */ short s_port;
  /* 0x000a */ char Padding_12[2];
  /* 0x000c */ char* s_proto;
}; /* size: 0x0010 */

enum tagMKREDUCE
{
  MKRREDUCE_ONE = 0x30000,
  MKRREDUCE_TOUSER = 0x20000,
  MKRREDUCE_THROUGHUSER = 0x10000,
  MKRREDUCE_ALL = 0,
};

class CMarshalList
{
  /* 0x0000 */ class CBasedMarshalListPtr _pmlNext;
  /* 0x0004 */ void* _pvBase;
  /* 0x0008 */ unsigned long _cntxid;
}; /* size: 0x000c */

struct tagWAVEINCAPS2W
{
  /* 0x0000 */ unsigned short wMid;
  /* 0x0002 */ unsigned short wPid;
  /* 0x0004 */ unsigned int vDriverVersion;
  /* 0x0008 */ wchar_t szPname[32];
  /* 0x0048 */ unsigned long dwFormats;
  /* 0x004c */ unsigned short wChannels;
  /* 0x004e */ unsigned short wReserved1;
  /* 0x0050 */ struct _GUID ManufacturerGuid;
  /* 0x0060 */ struct _GUID ProductGuid;
  /* 0x0070 */ struct _GUID NameGuid;
}; /* size: 0x0080 */

enum POWER_STATE_HANDLER_TYPE
{
  PowerStateSleeping1 = 0,
  PowerStateSleeping2 = 1,
  PowerStateSleeping3 = 2,
  PowerStateSleeping4 = 3,
  PowerStateShutdownOff = 4,
  PowerStateShutdownReset = 5,
  PowerStateSleeping4Firmware = 6,
  PowerStateMaximum = 7,
};

struct IComClassInfo2
{
}; /* size: 0x0004 */

struct Windows::Rtl::_FORMATTED_STREAM_FLAG_MAP
{
  /* 0x0000 */ unsigned long Count;
  /* 0x0004 */ const struct Windows::Rtl::_FORMATTED_STREAM_FLAG_MAP_ENTRY* Entries;
}; /* size: 0x0008 */

struct tagACTCTX_SECTION_KEYED_DATA_2600
{
  /* 0x0000 */ unsigned long cbSize;
  /* 0x0004 */ unsigned long ulDataFormatVersion;
  /* 0x0008 */ void* lpData;
  /* 0x000c */ unsigned long ulLength;
  /* 0x0010 */ void* lpSectionGlobalData;
  /* 0x0014 */ unsigned long ulSectionGlobalDataLength;
  /* 0x0018 */ void* lpSectionBase;
  /* 0x001c */ unsigned long ulSectionTotalLength;
  /* 0x0020 */ void* hActCtx;
  /* 0x0024 */ unsigned long ulAssemblyRosterIndex;
}; /* size: 0x0028 */

enum tagPROPBAG2_TYPE
{
  PROPBAG2_TYPE_UNDEFINED = 0,
  PROPBAG2_TYPE_DATA = 1,
  PROPBAG2_TYPE_URL = 2,
  PROPBAG2_TYPE_OBJECT = 3,
  PROPBAG2_TYPE_STREAM = 4,
  PROPBAG2_TYPE_STORAGE = 5,
  PROPBAG2_TYPE_MONIKER = 6,
};

typedef struct _IO_COUNTERS
{
  /* 0x0000 */ unsigned __int64 ReadOperationCount;
  /* 0x0008 */ unsigned __int64 WriteOperationCount;
  /* 0x0010 */ unsigned __int64 OtherOperationCount;
  /* 0x0018 */ unsigned __int64 ReadTransferCount;
  /* 0x0020 */ unsigned __int64 WriteTransferCount;
  /* 0x0028 */ unsigned __int64 OtherTransferCount;
} IO_COUNTERS, *PIO_COUNTERS; /* size: 0x0030 */

struct tagAXISINFOA
{
  /* 0x0000 */ long axMinValue;
  /* 0x0004 */ long axMaxValue;
  /* 0x0008 */ unsigned char axAxisName[16];
}; /* size: 0x0018 */

typedef enum _PROPOP
{
  PROPOP_IGNORE = 1,
  PROPOP_DELETE = 2,
  PROPOP_INSERT = 3,
  PROPOP_MOVE = 4,
  PROPOP_UPDATE = 5,
} PROPOP, *PPROPOP;

struct tagPROPERTY_INFORMATION
{
  /* 0x0000 */ unsigned long pid;
  /* 0x0004 */ unsigned long cbprop;
  /* 0x0008 */ enum _PROPOP operation;
}; /* size: 0x000c */

typedef union _userSTGMEDIUM::_STGMEDIUM_UNION::__MIDL_IAdviseSink_0003
{
  union
  {
    /* 0x0000 */ struct _userHMETAFILEPICT* hMetaFilePict;
    /* 0x0000 */ struct _userHENHMETAFILE* hHEnhMetaFile;
    /* 0x0000 */ struct _GDI_OBJECT* hGdiHandle;
    /* 0x0000 */ struct _userHGLOBAL* hGlobal;
    /* 0x0000 */ wchar_t* lpszFileName;
    /* 0x0000 */ struct _BYTE_BLOB* pstm;
    /* 0x0000 */ struct _BYTE_BLOB* pstg;
  }; /* size: 0x0004 */
} userSTGMEDIUM::_STGMEDIUM_UNION::__MIDL_IAdviseSink_0003, *PuserSTGMEDIUM::_STGMEDIUM_UNION::__MIDL_IAdviseSink_0003; /* size: 0x0004 */

enum OLETLS_PREVENT_RUNDOWN_MITIGATION
{
  NoMitigationInEffect = 0,
  MarshalingWithInParameterMitigation = 1,
  MarshalingWithInprocOutParameterMitigation = 2,
  MarshalingWithOutofprocOutParameterMitigation = 3,
  MarshalingWithMshlflagsTablestrong = 4,
  UnmarshalingWithInParameterMitigation = 5,
  UnmarshalingWithInprocOutParameterMitigation = 6,
  UnmarshalingWithOutofprocOutParameterMitigation = 7,
};

typedef struct _IMAGE_BOUND_FORWARDER_REF
{
  /* 0x0000 */ unsigned long TimeDateStamp;
  /* 0x0004 */ unsigned short OffsetModuleName;
  /* 0x0006 */ unsigned short Reserved;
} IMAGE_BOUND_FORWARDER_REF, *PIMAGE_BOUND_FORWARDER_REF; /* size: 0x0008 */

typedef enum _tagINTERNETFEATURELIST
{
  FEATURE_OBJECT_CACHING = 0,
  FEATURE_ZONE_ELEVATION = 1,
  FEATURE_MIME_HANDLING = 2,
  FEATURE_MIME_SNIFFING = 3,
  FEATURE_WINDOW_RESTRICTIONS = 4,
  FEATURE_WEBOC_POPUPMANAGEMENT = 5,
  FEATURE_BEHAVIORS = 6,
  FEATURE_DISABLE_MK_PROTOCOL = 7,
  FEATURE_LOCALMACHINE_LOCKDOWN = 8,
  FEATURE_SECURITYBAND = 9,
  FEATURE_RESTRICT_ACTIVEXINSTALL = 10,
  FEATURE_VALIDATE_NAVIGATE_URL = 11,
  FEATURE_RESTRICT_FILEDOWNLOAD = 12,
  FEATURE_ADDON_MANAGEMENT = 13,
  FEATURE_PROTOCOL_LOCKDOWN = 14,
  FEATURE_HTTP_USERNAME_PASSWORD_DISABLE = 15,
  FEATURE_SAFE_BINDTOOBJECT = 16,
  FEATURE_UNC_SAVEDFILECHECK = 17,
  FEATURE_GET_URL_DOM_FILEPATH_UNENCODED = 18,
  FEATURE_TABBED_BROWSING = 19,
  FEATURE_SSLUX = 20,
  FEATURE_DISABLE_NAVIGATION_SOUNDS = 21,
  FEATURE_DISABLE_LEGACY_COMPRESSION = 22,
  FEATURE_FORCE_ADDR_AND_STATUS = 23,
  FEATURE_XMLHTTP = 24,
  FEATURE_DISABLE_TELNET_PROTOCOL = 25,
  FEATURE_FEEDS = 26,
  FEATURE_BLOCK_INPUT_PROMPTS = 27,
  FEATURE_ENTRY_COUNT = 28,
} tagINTERNETFEATURELIST, *PtagINTERNETFEATURELIST;

typedef struct _RC_CONFIG
{
  /* 0x0000 */ unsigned long dwSignature;
  /* 0x0004 */ unsigned long dwLength;
  /* 0x0008 */ unsigned long dwRCConfigVersion;
  /* 0x000c */ unsigned long dwFilePathType;
  /* 0x0010 */ unsigned long dwFileType;
  /* 0x0014 */ unsigned long dwSystemAttributes;
  /* 0x0018 */ unsigned long dwUltimateFallbackLocation;
  /* 0x001c */ unsigned long dwServiceCheckSum[4];
  /* 0x002c */ unsigned long dwChecksum[4];
  /* 0x003c */ unsigned long dwReserved1;
  /* 0x0040 */ unsigned long dwReserved2;
  /* 0x0044 */ unsigned long dwMUIFileNameOffset;
  /* 0x0048 */ unsigned long dwMUIFileNameLength;
  /* 0x004c */ unsigned long dwMUIFilePathOffset;
  /* 0x0050 */ unsigned long dwMUIFilePathLength;
  /* 0x0054 */ unsigned long dwMainResNameTypesOffset;
  /* 0x0058 */ unsigned long dwMainResNameTypesLength;
  /* 0x005c */ unsigned long dwMainResIDTypesOffset;
  /* 0x0060 */ unsigned long dwMainResIDTypesLength;
  /* 0x0064 */ unsigned long dwMUIResNameTypesOffset;
  /* 0x0068 */ unsigned long dwMUIResNameTypesLength;
  /* 0x006c */ unsigned long dwMUIResIDTypesOffset;
  /* 0x0070 */ unsigned long dwMUIResIDTypesLength;
  /* 0x0074 */ unsigned long dwLanguageOffset;
  /* 0x0078 */ unsigned long dwLanguageLength;
  /* 0x007c */ unsigned long dwUltimateFallbackLanguageOffset;
  /* 0x0080 */ unsigned long dwUltimateFallbackLanguageLength;
} RC_CONFIG, *PRC_CONFIG; /* size: 0x0084 */

typedef struct _BINARY_CONTAINER
{
  /* 0x0000 */ unsigned long cbBuf;
  /* 0x0004 */ unsigned char* pData;
} BINARY_CONTAINER, *PBINARY_CONTAINER; /* size: 0x0008 */

enum tagUASFLAGS
{
  UAS_NORMAL = 0,
  UAS_BLOCKED = 1,
  UAS_NOPARENTENABLE = 2,
  UAS_MASK = 3,
};

typedef enum _APPCONTAINER_SID_TYPE
{
  NotAppContainerSidType = 0,
  ChildAppContainerSidType = 1,
  ParentAppContainerSidType = 2,
  InvalidAppContainerSidType = 3,
  MaxAppContainerSidType = 4,
} APPCONTAINER_SID_TYPE, *PAPPCONTAINER_SID_TYPE;

struct IBindCallbackRedirect
{
}; /* size: 0x0004 */

class CMarshalImplPStream
{
  /* 0x0000 */ long Padding_13;
  /* 0x0004 */ struct IPersistStream* m_pPS;
}; /* size: 0x0008 */

struct IProcessInitControl
{
}; /* size: 0x0004 */

struct tWAVEFORMATEX
{
  /* 0x0000 */ unsigned short wFormatTag;
  /* 0x0002 */ unsigned short nChannels;
  /* 0x0004 */ unsigned long nSamplesPerSec;
  /* 0x0008 */ unsigned long nAvgBytesPerSec;
  /* 0x000c */ unsigned short nBlockAlign;
  /* 0x000e */ unsigned short wBitsPerSample;
  /* 0x0010 */ unsigned short cbSize;
}; /* size: 0x0012 */

typedef enum _DMA_WIDTH
{
  Width8Bits = 0,
  Width16Bits = 1,
  Width32Bits = 2,
  Width64Bits = 3,
  WidthNoWrap = 4,
  MaximumDmaWidth = 5,
} DMA_WIDTH, *PDMA_WIDTH;

struct tagContextProperty
{
  /* 0x0000 */ struct _GUID policyId;
  /* 0x0010 */ unsigned long flags;
  /* 0x0014 */ struct IUnknown* pUnk;
}; /* size: 0x0018 */

typedef struct _CALL_FRAME
{
  /* 0x0000 */ void* ReturnAddress;
  /* 0x0004 */ void* Param1;
  /* 0x0008 */ void* Param2;
  /* 0x000c */ void* CompatibilityArea;
} CALL_FRAME, *PCALL_FRAME; /* size: 0x0010 */

class Windows::Rtl::AutoHandleBase<Windows::Rtl::AutoHandleDefaultTraits<void *>,Windows::Rtl::AutoHandle>::COperatorAmpersandReturnType;

typedef enum _TAG_UNNAMED_1
{
  sfImage = 0,
  sfDbg = 1,
  sfPdb = 2,
  sfMpd = 3,
  sfMax = 4,
} TAG_UNNAMED_1, *PTAG_UNNAMED_1;

struct tagLOGFONTW
{
  /* 0x0000 */ long lfHeight;
  /* 0x0004 */ long lfWidth;
  /* 0x0008 */ long lfEscapement;
  /* 0x000c */ long lfOrientation;
  /* 0x0010 */ long lfWeight;
  /* 0x0014 */ unsigned char lfItalic;
  /* 0x0015 */ unsigned char lfUnderline;
  /* 0x0016 */ unsigned char lfStrikeOut;
  /* 0x0017 */ unsigned char lfCharSet;
  /* 0x0018 */ unsigned char lfOutPrecision;
  /* 0x0019 */ unsigned char lfClipPrecision;
  /* 0x001a */ unsigned char lfQuality;
  /* 0x001b */ unsigned char lfPitchAndFamily;
  /* 0x001c */ wchar_t lfFaceName[32];
}; /* size: 0x005c */

struct tagENUMLOGFONTEXW
{
  /* 0x0000 */ struct tagLOGFONTW elfLogFont;
  /* 0x005c */ wchar_t elfFullName[64];
  /* 0x00dc */ wchar_t elfStyle[32];
  /* 0x011c */ wchar_t elfScript[32];
}; /* size: 0x015c */

typedef struct __BCRYPT_KEY_LENGTHS_STRUCT
{
  /* 0x0000 */ unsigned long dwMinLength;
  /* 0x0004 */ unsigned long dwMaxLength;
  /* 0x0008 */ unsigned long dwIncrement;
} _BCRYPT_KEY_LENGTHS_STRUCT, *P_BCRYPT_KEY_LENGTHS_STRUCT; /* size: 0x000c */

typedef enum __MIDL_IBindStatusCallback_0006
{
  BSCF_FIRSTDATANOTIFICATION = 1,
  BSCF_INTERMEDIATEDATANOTIFICATION = 2,
  BSCF_LASTDATANOTIFICATION = 4,
  BSCF_DATAFULLYAVAILABLE = 8,
  BSCF_AVAILABLEDATASIZEUNKNOWN = 16,
  BSCF_SKIPDRAINDATAFORFILEURLS = 32,
  BSCF_64BITLENGTHDOWNLOAD = 64,
} _MIDL_IBindStatusCallback_0006, *P_MIDL_IBindStatusCallback_0006;

enum DISPLAYCONFIG_PIXELFORMAT
{
  DISPLAYCONFIG_PIXELFORMAT_8BPP = 1,
  DISPLAYCONFIG_PIXELFORMAT_16BPP = 2,
  DISPLAYCONFIG_PIXELFORMAT_24BPP = 3,
  DISPLAYCONFIG_PIXELFORMAT_32BPP = 4,
  DISPLAYCONFIG_PIXELFORMAT_NONGDI = 5,
  DISPLAYCONFIG_PIXELFORMAT_FORCE_UINT32 = -1,
};

typedef enum _MINIDUMP_CALLBACK_TYPE
{
  ModuleCallback = 0,
  ThreadCallback = 1,
  ThreadExCallback = 2,
  IncludeThreadCallback = 3,
  IncludeModuleCallback = 4,
  MemoryCallback = 5,
  CancelCallback = 6,
  WriteKernelMinidumpCallback = 7,
  KernelMinidumpStatusCallback = 8,
  RemoveMemoryCallback = 9,
  IncludeVmRegionCallback = 10,
  IoStartCallback = 11,
  IoWriteAllCallback = 12,
  IoFinishCallback = 13,
  ReadMemoryFailureCallback = 14,
  SecondaryFlagsCallback = 15,
  IsProcessSnapshotCallback = 16,
  VmStartCallback = 17,
  VmQueryCallback = 18,
  VmPreReadCallback = 19,
  VmPostReadCallback = 20,
} MINIDUMP_CALLBACK_TYPE, *PMINIDUMP_CALLBACK_TYPE;

typedef struct _SYSTEMTIME
{
  /* 0x0000 */ unsigned short wYear;
  /* 0x0002 */ unsigned short wMonth;
  /* 0x0004 */ unsigned short wDayOfWeek;
  /* 0x0006 */ unsigned short wDay;
  /* 0x0008 */ unsigned short wHour;
  /* 0x000a */ unsigned short wMinute;
  /* 0x000c */ unsigned short wSecond;
  /* 0x000e */ unsigned short wMilliseconds;
} SYSTEMTIME, *PSYSTEMTIME; /* size: 0x0010 */

typedef struct _TIME_ZONE_INFORMATION
{
  /* 0x0000 */ long Bias;
  /* 0x0004 */ wchar_t StandardName[32];
  /* 0x0044 */ struct _SYSTEMTIME StandardDate;
  /* 0x0054 */ long StandardBias;
  /* 0x0058 */ wchar_t DaylightName[32];
  /* 0x0098 */ struct _SYSTEMTIME DaylightDate;
  /* 0x00a8 */ long DaylightBias;
} TIME_ZONE_INFORMATION, *PTIME_ZONE_INFORMATION; /* size: 0x00ac */

struct Windows::ErrorHandling::StatusTypeNTSTATUS
{
}; /* size: 0x0001 */

enum RTL_BSD_ITEM_TYPE
{
  RtlBsdItemVersionNumber = 0,
  RtlBsdItemProductType = 1,
  RtlBsdItemAabEnabled = 2,
  RtlBsdItemAabTimeout = 3,
  RtlBsdItemBootGood = 4,
  RtlBsdItemBootShutdown = 5,
  RtlBsdSleepInProgress = 6,
  RtlBsdPowerTransition = 7,
  RtlBsdItemBootAttemptCount = 8,
  RtlBsdItemBootCheckpoint = 9,
  RtlBsdItemMax = 10,
};

struct IDirectWriterLock
{
}; /* size: 0x0004 */

typedef enum _SAFER_POLICY_INFO_CLASS
{
  SaferPolicyLevelList = 1,
  SaferPolicyEnableTransparentEnforcement = 2,
  SaferPolicyDefaultLevel = 3,
  SaferPolicyEvaluateUserScope = 4,
  SaferPolicyScopeFlags = 5,
  SaferPolicyDefaultLevelFlags = 6,
  SaferPolicyAuthenticodeEnabled = 7,
} SAFER_POLICY_INFO_CLASS, *PSAFER_POLICY_INFO_CLASS;

typedef enum _TAG_UNNAMED_2
{
  sevInfo = 0,
  sevProblem = 1,
  sevAttn = 2,
  sevFatal = 3,
  sevMax = 4,
} TAG_UNNAMED_2, *PTAG_UNNAMED_2;

typedef struct _WNF_TYPE_ID
{
  /* 0x0000 */ struct _GUID TypeId;
} WNF_TYPE_ID, *PWNF_TYPE_ID; /* size: 0x0010 */

typedef struct _tagSOFTDISTINFO
{
  /* 0x0000 */ unsigned long cbSize;
  /* 0x0004 */ unsigned long dwFlags;
  /* 0x0008 */ unsigned long dwAdState;
  /* 0x000c */ wchar_t* szTitle;
  /* 0x0010 */ wchar_t* szAbstract;
  /* 0x0014 */ wchar_t* szHREF;
  /* 0x0018 */ unsigned long dwInstalledVersionMS;
  /* 0x001c */ unsigned long dwInstalledVersionLS;
  /* 0x0020 */ unsigned long dwUpdateVersionMS;
  /* 0x0024 */ unsigned long dwUpdateVersionLS;
  /* 0x0028 */ unsigned long dwAdvertisedVersionMS;
  /* 0x002c */ unsigned long dwAdvertisedVersionLS;
  /* 0x0030 */ unsigned long dwReserved;
} tagSOFTDISTINFO, *PtagSOFTDISTINFO; /* size: 0x0034 */

typedef enum _SYSTEM_PIXEL_FORMAT
{
  SystemPixelFormatUnknown = 0,
  SystemPixelFormatR8G8B8 = 1,
  SystemPixelFormatR8G8B8X8 = 2,
  SystemPixelFormatB8G8R8 = 3,
  SystemPixelFormatB8G8R8X8 = 4,
} SYSTEM_PIXEL_FORMAT, *PSYSTEM_PIXEL_FORMAT;

typedef struct _SYSTEM_BOOT_GRAPHICS_INFORMATION
{
  /* 0x0000 */ union _LARGE_INTEGER FrameBuffer;
  /* 0x0008 */ unsigned long Width;
  /* 0x000c */ unsigned long Height;
  /* 0x0010 */ unsigned long PixelStride;
  /* 0x0014 */ unsigned long Flags;
  /* 0x0018 */ enum _SYSTEM_PIXEL_FORMAT Format;
  /* 0x001c */ long __PADDING__[1];
} SYSTEM_BOOT_GRAPHICS_INFORMATION, *PSYSTEM_BOOT_GRAPHICS_INFORMATION; /* size: 0x0020 */

class Windows::Rtl::AutoHandle
{
}; /* size: 0x0004 */

enum TrustLevel
{
  BaseTrust = 0,
  PartialTrust = 1,
  FullTrust = 2,
};

struct tagLocationInfoData
{
  /* 0x0000 */ wchar_t* machineName;
  /* 0x0004 */ unsigned long processId;
  /* 0x0008 */ unsigned long apartmentId;
  /* 0x000c */ unsigned long contextId;
}; /* size: 0x0010 */

class CBasedContextPtr
{
  /* 0x0000 */ unsigned long _p;
}; /* size: 0x0004 */

class CContextList
{
  /* 0x0000 */ class CBasedContextPtr _pctxHead;
  /* 0x0004 */ long _cReferences;
}; /* size: 0x0008 */

class Windows::AutoOperatorAmpersandHelper<Windows::Rtl::IRtlROFOStream *,Windows::Auto<Windows::Rtl::IRtlROFOStream *> >;

struct tagPALETTEENTRY
{
  /* 0x0000 */ unsigned char peRed;
  /* 0x0001 */ unsigned char peGreen;
  /* 0x0002 */ unsigned char peBlue;
  /* 0x0003 */ unsigned char peFlags;
}; /* size: 0x0004 */

enum tagBINDSTRING
{
  BINDSTRING_HEADERS = 1,
  BINDSTRING_ACCEPT_MIMES = 2,
  BINDSTRING_EXTRA_URL = 3,
  BINDSTRING_LANGUAGE = 4,
  BINDSTRING_USERNAME = 5,
  BINDSTRING_PASSWORD = 6,
  BINDSTRING_UA_PIXELS = 7,
  BINDSTRING_UA_COLOR = 8,
  BINDSTRING_OS = 9,
  BINDSTRING_USER_AGENT = 10,
  BINDSTRING_ACCEPT_ENCODINGS = 11,
  BINDSTRING_POST_COOKIE = 12,
  BINDSTRING_POST_DATA_MIME = 13,
  BINDSTRING_URL = 14,
  BINDSTRING_IID = 15,
  BINDSTRING_FLAG_BIND_TO_OBJECT = 16,
  BINDSTRING_PTR_BIND_CONTEXT = 17,
  BINDSTRING_XDR_ORIGIN = 18,
  BINDSTRING_DOWNLOADPATH = 19,
  BINDSTRING_ROOTDOC_URL = 20,
  BINDSTRING_INITIAL_FILENAME = 21,
  BINDSTRING_PROXY_USERNAME = 22,
  BINDSTRING_PROXY_PASSWORD = 23,
};

typedef enum _TAG_UNNAMED_3
{
  hdBase = 0,
  hdSym = 1,
  hdSrc = 2,
  hdMax = 3,
} TAG_UNNAMED_3, *PTAG_UNNAMED_3;

typedef struct _SYSTEM_FIRMWARE_TABLE_HANDLER
{
  /* 0x0000 */ unsigned long ProviderSignature;
  /* 0x0004 */ unsigned char Register;
  /* 0x0005 */ char Padding_14[3];
  /* 0x0008 */ void* FirmwareTableHandler /* function */;
  /* 0x000c */ void* DriverObject;
} SYSTEM_FIRMWARE_TABLE_HANDLER, *PSYSTEM_FIRMWARE_TABLE_HANDLER; /* size: 0x0010 */

typedef struct _SYSTEM_SECUREBOOT_INFORMATION
{
  /* 0x0000 */ unsigned char SecureBootEnabled;
  /* 0x0001 */ unsigned char SecureBootCapable;
} SYSTEM_SECUREBOOT_INFORMATION, *PSYSTEM_SECUREBOOT_INFORMATION; /* size: 0x0002 */

class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IUnwrappableDataObject> >
{
}; /* size: 0x0004 */

class Windows::ErrorHandling::Rtl::CBaseFrame<Windows::ErrorHandling::Rtl::CVoidRaiseFrame>
{
}; /* size: 0x0001 */

class CAutoHandle<void *>
{
}; /* size: 0x0004 */

enum ORIENTATION_PREFERENCE
{
  ORIENTATION_PREFERENCE_NONE = 0,
  ORIENTATION_PREFERENCE_LANDSCAPE = 1,
  ORIENTATION_PREFERENCE_PORTRAIT = 2,
  ORIENTATION_PREFERENCE_LANDSCAPE_FLIPPED = 4,
  ORIENTATION_PREFERENCE_PORTRAIT_FLIPPED = 8,
};

union tagCY
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned long Lo;
      /* 0x0004 */ long Hi;
    }; /* size: 0x0008 */
    /* 0x0000 */ __int64 int64;
  }; /* size: 0x0008 */
}; /* size: 0x0008 */

struct tagDEC
{
  /* 0x0000 */ unsigned short wReserved;
  union
  {
    struct
    {
      /* 0x0002 */ unsigned char scale;
      /* 0x0003 */ unsigned char sign;
    }; /* size: 0x0002 */
    /* 0x0002 */ unsigned short signscale;
  }; /* size: 0x0002 */
  /* 0x0004 */ unsigned long Hi32;
  union
  {
    struct
    {
      /* 0x0008 */ unsigned long Lo32;
      /* 0x000c */ unsigned long Mid32;
    }; /* size: 0x0008 */
    /* 0x0008 */ unsigned __int64 Lo64;
  }; /* size: 0x0008 */
}; /* size: 0x0010 */

struct tagVARIANT
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned short vt;
      /* 0x0002 */ unsigned short wReserved1;
      /* 0x0004 */ unsigned short wReserved2;
      /* 0x0006 */ unsigned short wReserved3;
      union
      {
        /* 0x0008 */ __int64 llVal;
        /* 0x0008 */ long lVal;
        /* 0x0008 */ unsigned char bVal;
        /* 0x0008 */ short iVal;
        /* 0x0008 */ float fltVal;
        /* 0x0008 */ double dblVal;
        /* 0x0008 */ short boolVal;
        /* 0x0008 */ long scode;
        /* 0x0008 */ union tagCY cyVal;
        /* 0x0008 */ double date;
        /* 0x0008 */ wchar_t* bstrVal;
        /* 0x0008 */ struct IUnknown* punkVal;
        /* 0x0008 */ struct IDispatch* pdispVal;
        /* 0x0008 */ struct tagSAFEARRAY* parray;
        /* 0x0008 */ unsigned char* pbVal;
        /* 0x0008 */ short* piVal;
        /* 0x0008 */ long* plVal;
        /* 0x0008 */ __int64* pllVal;
        /* 0x0008 */ float* pfltVal;
        /* 0x0008 */ double* pdblVal;
        /* 0x0008 */ short* pboolVal;
        /* 0x0008 */ long* pscode;
        /* 0x0008 */ union tagCY* pcyVal;
        /* 0x0008 */ double* pdate;
        /* 0x0008 */ wchar_t** pbstrVal;
        /* 0x0008 */ struct IUnknown** ppunkVal;
        /* 0x0008 */ struct IDispatch** ppdispVal;
        /* 0x0008 */ struct tagSAFEARRAY** pparray;
        /* 0x0008 */ struct tagVARIANT* pvarVal;
        /* 0x0008 */ void* byref;
        /* 0x0008 */ char cVal;
        /* 0x0008 */ unsigned short uiVal;
        /* 0x0008 */ unsigned long ulVal;
        /* 0x0008 */ unsigned __int64 ullVal;
        /* 0x0008 */ int intVal;
        /* 0x0008 */ unsigned int uintVal;
        /* 0x0008 */ struct tagDEC* pdecVal;
        /* 0x0008 */ char* pcVal;
        /* 0x0008 */ unsigned short* puiVal;
        /* 0x0008 */ unsigned long* pulVal;
        /* 0x0008 */ unsigned __int64* pullVal;
        /* 0x0008 */ int* pintVal;
        /* 0x0008 */ unsigned int* puintVal;
        struct
        {
          /* 0x0008 */ void* pvRecord;
          /* 0x000c */ struct IRecordInfo* pRecInfo;
        }; /* size: 0x0008 */
      }; /* size: 0x0008 */
    }; /* size: 0x0010 */
    /* 0x0000 */ struct tagDEC decVal;
  }; /* size: 0x0010 */
}; /* size: 0x0010 */

struct tagPARAMDESCEX
{
  /* 0x0000 */ unsigned long cBytes;
  /* 0x0004 */ long Padding_15;
  /* 0x0008 */ struct tagVARIANT varDefaultValue;
}; /* size: 0x0018 */

typedef enum _FP_IEEE_OPERATION_CODE
{
  FpCodeUnspecified = 0,
  FpCodeAdd = 1,
  FpCodeSubtract = 2,
  FpCodeMultiply = 3,
  FpCodeDivide = 4,
  FpCodeSquareRoot = 5,
  FpCodeRemainder = 6,
  FpCodeCompare = 7,
  FpCodeConvert = 8,
  FpCodeRound = 9,
  FpCodeTruncate = 10,
  FpCodeFloor = 11,
  FpCodeCeil = 12,
  FpCodeAcos = 13,
  FpCodeAsin = 14,
  FpCodeAtan = 15,
  FpCodeAtan2 = 16,
  FpCodeCabs = 17,
  FpCodeCos = 18,
  FpCodeCosh = 19,
  FpCodeExp = 20,
  FpCodeFabs = 21,
  FpCodeFmod = 22,
  FpCodeFrexp = 23,
  FpCodeHypot = 24,
  FpCodeLdexp = 25,
  FpCodeLog = 26,
  FpCodeLog10 = 27,
  FpCodeModf = 28,
  FpCodePow = 29,
  FpCodeSin = 30,
  FpCodeSinh = 31,
  FpCodeTan = 32,
  FpCodeTanh = 33,
  FpCodeY0 = 34,
  FpCodeY1 = 35,
  FpCodeYn = 36,
} FP_IEEE_OPERATION_CODE, *PFP_IEEE_OPERATION_CODE;

struct tagEMR
{
  /* 0x0000 */ unsigned long iType;
  /* 0x0004 */ unsigned long nSize;
}; /* size: 0x0008 */

struct tagEMRPOLYDRAW
{
  /* 0x0000 */ struct tagEMR emr;
  /* 0x0008 */ struct _RECTL rclBounds;
  /* 0x0018 */ unsigned long cptl;
  /* 0x001c */ struct _POINTL aptl[1];
  /* 0x0024 */ unsigned char abTypes[1];
  /* 0x0025 */ char __PADDING__[3];
}; /* size: 0x0028 */

struct AsyncIRemUnknown2
{
}; /* size: 0x0004 */

enum tagOLEDCFLAGS
{
  OLEDC_NODRAW = 1,
  OLEDC_PAINTBKGND = 2,
  OLEDC_OFFSCREEN = 4,
};

typedef struct _MINIDUMP_THREAD_INFO
{
  /* 0x0000 */ unsigned int ThreadId;
  /* 0x0004 */ unsigned int DumpFlags;
  /* 0x0008 */ unsigned int DumpError;
  /* 0x000c */ unsigned int ExitStatus;
  /* 0x0010 */ unsigned __int64 CreateTime;
  /* 0x0018 */ unsigned __int64 ExitTime;
  /* 0x0020 */ unsigned __int64 KernelTime;
  /* 0x0028 */ unsigned __int64 UserTime;
  /* 0x0030 */ unsigned __int64 StartAddress;
  /* 0x0038 */ unsigned __int64 Affinity;
} MINIDUMP_THREAD_INFO, *PMINIDUMP_THREAD_INFO; /* size: 0x0040 */

struct Windows::Foundation::IAsyncOperationProgressHandler_impl<HSTRING__ *,unsigned __int64>
{
}; /* size: 0x0004 */

struct tagCASCODE
{
  /* 0x0000 */ unsigned long cElems;
  /* 0x0004 */ long* pElems;
}; /* size: 0x0008 */

struct Windows::Foundation::IReference<_GUID>
{
}; /* size: 0x0004 */

enum tagLIBFLAGS
{
  LIBFLAG_FRESTRICTED = 1,
  LIBFLAG_FCONTROL = 2,
  LIBFLAG_FHIDDEN = 4,
  LIBFLAG_FHASDISKIMAGE = 8,
};

typedef struct _PROCESS_STACK_ALLOCATION_INFORMATION
{
  /* 0x0000 */ unsigned long ReserveSize;
  /* 0x0004 */ unsigned long ZeroBits;
  /* 0x0008 */ void* StackBase;
} PROCESS_STACK_ALLOCATION_INFORMATION, *PPROCESS_STACK_ALLOCATION_INFORMATION; /* size: 0x000c */

struct Microsoft::WRL::Wrappers::HandleTraits::SRWLockSharedTraits
{
}; /* size: 0x0001 */

enum tagCOMCALLTYPE
{
  CALLTYPE_OUTGOING_CALL = 0,
  CALLTYPE_INCOMING_CALL = 1,
  CALLTYPE_ACTIVATION = 2,
};

typedef struct _WIN_TRUST_ACTDATA_SUBJECT_ONLY
{
  /* 0x0000 */ struct _GUID* SubjectType;
  /* 0x0004 */ void* Subject;
} WIN_TRUST_ACTDATA_SUBJECT_ONLY, *PWIN_TRUST_ACTDATA_SUBJECT_ONLY; /* size: 0x0008 */

typedef enum _MINIDUMP_HANDLE_OBJECT_INFORMATION_TYPE
{
  MiniHandleObjectInformationNone = 0,
  MiniThreadInformation1 = 1,
  MiniMutantInformation1 = 2,
  MiniMutantInformation2 = 3,
  MiniProcessInformation1 = 4,
  MiniProcessInformation2 = 5,
  MiniEventInformation1 = 6,
  MiniSectionInformation1 = 7,
  MiniHandleObjectInformationTypeMax = 8,
} MINIDUMP_HANDLE_OBJECT_INFORMATION_TYPE, *PMINIDUMP_HANDLE_OBJECT_INFORMATION_TYPE;

struct tagCLIPDATA
{
  /* 0x0000 */ unsigned long cbSize;
  /* 0x0004 */ long ulClipFmt;
  /* 0x0008 */ unsigned char* pClipData;
}; /* size: 0x000c */

typedef enum _RTL_RXACT_OPERATION
{
  RtlRXactOperationDelete = 1,
  RtlRXactOperationSetValue = 2,
  RtlRXactOperationDelAttribute = 3,
  RtlRXactOperationSetAttribute = 4,
} RTL_RXACT_OPERATION, *PRTL_RXACT_OPERATION;

struct tagEMRCREATEDIBPATTERNBRUSHPT
{
  /* 0x0000 */ struct tagEMR emr;
  /* 0x0008 */ unsigned long ihBrush;
  /* 0x000c */ unsigned long iUsage;
  /* 0x0010 */ unsigned long offBmi;
  /* 0x0014 */ unsigned long cbBmi;
  /* 0x0018 */ unsigned long offBits;
  /* 0x001c */ unsigned long cbBits;
}; /* size: 0x0020 */

typedef struct _DISPLAY_DEVICEW
{
  /* 0x0000 */ unsigned long cb;
  /* 0x0004 */ wchar_t DeviceName[32];
  /* 0x0044 */ wchar_t DeviceString[128];
  /* 0x0144 */ unsigned long StateFlags;
  /* 0x0148 */ wchar_t DeviceID[128];
  /* 0x0248 */ wchar_t DeviceKey[128];
} DISPLAY_DEVICEW, *PDISPLAY_DEVICEW; /* size: 0x0348 */

typedef struct _DRIVER_INFO_3W
{
  /* 0x0000 */ unsigned long cVersion;
  /* 0x0004 */ wchar_t* pName;
  /* 0x0008 */ wchar_t* pEnvironment;
  /* 0x000c */ wchar_t* pDriverPath;
  /* 0x0010 */ wchar_t* pDataFile;
  /* 0x0014 */ wchar_t* pConfigFile;
  /* 0x0018 */ wchar_t* pHelpFile;
  /* 0x001c */ wchar_t* pDependentFiles;
  /* 0x0020 */ wchar_t* pMonitorName;
  /* 0x0024 */ wchar_t* pDefaultDataType;
} DRIVER_INFO_3W, *PDRIVER_INFO_3W; /* size: 0x0028 */

typedef enum _IRQ_PRIORITY
{
  IrqPriorityUndefined = 0,
  IrqPriorityLow = 1,
  IrqPriorityNormal = 2,
  IrqPriorityHigh = 3,
} IRQ_PRIORITY, *PIRQ_PRIORITY;

typedef struct _OBJECT_DIRECTORY_INFORMATION
{
  /* 0x0000 */ struct _UNICODE_STRING Name;
  /* 0x0008 */ struct _UNICODE_STRING TypeName;
} OBJECT_DIRECTORY_INFORMATION, *POBJECT_DIRECTORY_INFORMATION; /* size: 0x0010 */

struct IErrorLog
{
}; /* size: 0x0004 */

enum tagREADYSTATE
{
  READYSTATE_UNINITIALIZED = 0,
  READYSTATE_LOADING = 1,
  READYSTATE_LOADED = 2,
  READYSTATE_INTERACTIVE = 3,
  READYSTATE_COMPLETE = 4,
};

typedef struct _PROPSHEETPAGEW_V2
{
  /* 0x0000 */ unsigned long dwSize;
  /* 0x0004 */ unsigned long dwFlags;
  /* 0x0008 */ struct HINSTANCE__* hInstance;
  union
  {
    /* 0x000c */ const wchar_t* pszTemplate;
    /* 0x000c */ const struct DLGTEMPLATE* pResource;
  }; /* size: 0x0004 */
  union
  {
    /* 0x0010 */ struct HICON__* hIcon;
    /* 0x0010 */ const wchar_t* pszIcon;
  }; /* size: 0x0004 */
  /* 0x0014 */ const wchar_t* pszTitle;
  /* 0x0018 */ void* pfnDlgProc /* function */;
  /* 0x001c */ long lParam;
  /* 0x0020 */ void* pfnCallback /* function */;
  /* 0x0024 */ unsigned int* pcRefParent;
  /* 0x0028 */ const wchar_t* pszHeaderTitle;
  /* 0x002c */ const wchar_t* pszHeaderSubTitle;
} PROPSHEETPAGEW_V2, *PPROPSHEETPAGEW_V2; /* size: 0x0030 */

typedef union _FOUR_PART_VERSION
{
  union
  {
    /* 0x0000 */ unsigned __int64 Version64;
    struct
    {
      /* 0x0000 */ unsigned long BuildAndRevision;
      /* 0x0004 */ unsigned long MajorAndMinor;
    } /* size: 0x0008 */ Version32;
    struct
    {
      /* 0x0000 */ unsigned short Revision;
      /* 0x0002 */ unsigned short Build;
      /* 0x0004 */ unsigned short Minor;
      /* 0x0006 */ unsigned short Major;
    } /* size: 0x0008 */ Version16;
  }; /* size: 0x0008 */
} FOUR_PART_VERSION, *PFOUR_PART_VERSION; /* size: 0x0008 */

struct DISPLAYCONFIG_DEVICE_INFO_HEADER
{
  /* 0x0000 */ enum DISPLAYCONFIG_DEVICE_INFO_TYPE type;
  /* 0x0004 */ unsigned int size;
  /* 0x0008 */ struct _LUID adapterId;
  /* 0x0010 */ unsigned int id;
}; /* size: 0x0014 */

struct DISPLAYCONFIG_TARGET_DEVICE_NAME_FLAGS
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned int friendlyNameFromEdid : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned int friendlyNameForced : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned int edidIdsValid : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned int reserved : 29; /* bit position: 3 */
    }; /* bitfield */
    /* 0x0000 */ unsigned int value;
  }; /* size: 0x0004 */
}; /* size: 0x0004 */

struct DISPLAYCONFIG_TARGET_DEVICE_NAME
{
  /* 0x0000 */ struct DISPLAYCONFIG_DEVICE_INFO_HEADER header;
  /* 0x0014 */ struct DISPLAYCONFIG_TARGET_DEVICE_NAME_FLAGS flags;
  /* 0x0018 */ enum DISPLAYCONFIG_VIDEO_OUTPUT_TECHNOLOGY outputTechnology;
  /* 0x001c */ unsigned short edidManufactureId;
  /* 0x001e */ unsigned short edidProductCodeId;
  /* 0x0020 */ unsigned int connectorInstance;
  /* 0x0024 */ wchar_t monitorFriendlyDeviceName[64];
  /* 0x00a4 */ wchar_t monitorDevicePath[128];
}; /* size: 0x01a4 */

struct tagKERNINGPAIR
{
  /* 0x0000 */ unsigned short wFirst;
  /* 0x0002 */ unsigned short wSecond;
  /* 0x0004 */ int iKernAmount;
}; /* size: 0x0008 */

enum PO_FIXED_WAKE_SOURCE_TYPE
{
  FixedWakeSourcePowerButton = 0,
  FixedWakeSourceSleepButton = 1,
  FixedWakeSourceRtc = 2,
  FixedWakeSourceDozeToHibernate = 3,
};

typedef struct _STARTUPINFOW
{
  /* 0x0000 */ unsigned long cb;
  /* 0x0004 */ wchar_t* lpReserved;
  /* 0x0008 */ wchar_t* lpDesktop;
  /* 0x000c */ wchar_t* lpTitle;
  /* 0x0010 */ unsigned long dwX;
  /* 0x0014 */ unsigned long dwY;
  /* 0x0018 */ unsigned long dwXSize;
  /* 0x001c */ unsigned long dwYSize;
  /* 0x0020 */ unsigned long dwXCountChars;
  /* 0x0024 */ unsigned long dwYCountChars;
  /* 0x0028 */ unsigned long dwFillAttribute;
  /* 0x002c */ unsigned long dwFlags;
  /* 0x0030 */ unsigned short wShowWindow;
  /* 0x0032 */ unsigned short cbReserved2;
  /* 0x0034 */ unsigned char* lpReserved2;
  /* 0x0038 */ void* hStdInput;
  /* 0x003c */ void* hStdOutput;
  /* 0x0040 */ void* hStdError;
} STARTUPINFOW, *PSTARTUPINFOW; /* size: 0x0044 */

typedef enum _THREADINFOCLASS
{
  ThreadBasicInformation = 0,
  ThreadTimes = 1,
  ThreadPriority = 2,
  ThreadBasePriority = 3,
  ThreadAffinityMask = 4,
  ThreadImpersonationToken = 5,
  ThreadDescriptorTableEntry = 6,
  ThreadEnableAlignmentFaultFixup = 7,
  ThreadEventPair_Reusable = 8,
  ThreadQuerySetWin32StartAddress = 9,
  ThreadZeroTlsCell = 10,
  ThreadPerformanceCount = 11,
  ThreadAmILastThread = 12,
  ThreadIdealProcessor = 13,
  ThreadPriorityBoost = 14,
  ThreadSetTlsArrayAddress = 15,
  ThreadIsIoPending = 16,
  ThreadHideFromDebugger = 17,
  ThreadBreakOnTermination = 18,
  ThreadSwitchLegacyState = 19,
  ThreadIsTerminated = 20,
  ThreadLastSystemCall = 21,
  ThreadIoPriority = 22,
  ThreadCycleTime = 23,
  ThreadPagePriority = 24,
  ThreadActualBasePriority = 25,
  ThreadTebInformation = 26,
  ThreadCSwitchMon = 27,
  ThreadCSwitchPmu = 28,
  ThreadWow64Context = 29,
  ThreadGroupInformation = 30,
  ThreadUmsInformation = 31,
  ThreadCounterProfiling = 32,
  ThreadIdealProcessorEx = 33,
  ThreadCpuAccountingInformation = 34,
  ThreadSuspendCount = 35,
  MaxThreadInfoClass = 36,
} THREADINFOCLASS, *PTHREADINFOCLASS;

typedef enum _SAFER_OBJECT_INFO_CLASS
{
  SaferObjectLevelId = 1,
  SaferObjectScopeId = 2,
  SaferObjectFriendlyName = 3,
  SaferObjectDescription = 4,
  SaferObjectBuiltin = 5,
  SaferObjectDisallowed = 6,
  SaferObjectDisableMaxPrivilege = 7,
  SaferObjectInvertDeletedPrivileges = 8,
  SaferObjectDeletedPrivileges = 9,
  SaferObjectDefaultOwner = 10,
  SaferObjectSidsToDisable = 11,
  SaferObjectRestrictedSidsInverted = 12,
  SaferObjectRestrictedSidsAdded = 13,
  SaferObjectAllIdentificationGuids = 14,
  SaferObjectSingleIdentification = 15,
  SaferObjectExtendedError = 16,
} SAFER_OBJECT_INFO_CLASS, *PSAFER_OBJECT_INFO_CLASS;

struct tagCADBL
{
  /* 0x0000 */ unsigned long cElems;
  /* 0x0004 */ double* pElems;
}; /* size: 0x0008 */

class Windows::ErrorHandling::CBaseFrame
{
}; /* size: 0x0001 */

enum DCOM_ENDPOINT_FLAGS
{
  fUseInternetPorts = 1,
};

typedef struct _IMAGEHLP_DUPLICATE_SYMBOL
{
  /* 0x0000 */ unsigned long SizeOfStruct;
  /* 0x0004 */ unsigned long NumberOfDups;
  /* 0x0008 */ struct _IMAGEHLP_SYMBOL* Symbol;
  /* 0x000c */ unsigned long SelectedSymbol;
} IMAGEHLP_DUPLICATE_SYMBOL, *PIMAGEHLP_DUPLICATE_SYMBOL; /* size: 0x0010 */

typedef enum _TOKEN_INFORMATION_CLASS
{
  TokenUser = 1,
  TokenGroups = 2,
  TokenPrivileges = 3,
  TokenOwner = 4,
  TokenPrimaryGroup = 5,
  TokenDefaultDacl = 6,
  TokenSource = 7,
  TokenType = 8,
  TokenImpersonationLevel = 9,
  TokenStatistics = 10,
  TokenRestrictedSids = 11,
  TokenSessionId = 12,
  TokenGroupsAndPrivileges = 13,
  TokenSessionReference = 14,
  TokenSandBoxInert = 15,
  TokenAuditPolicy = 16,
  TokenOrigin = 17,
  TokenElevationType = 18,
  TokenLinkedToken = 19,
  TokenElevation = 20,
  TokenHasRestrictions = 21,
  TokenAccessInformation = 22,
  TokenVirtualizationAllowed = 23,
  TokenVirtualizationEnabled = 24,
  TokenIntegrityLevel = 25,
  TokenUIAccess = 26,
  TokenMandatoryPolicy = 27,
  TokenLogonSid = 28,
  TokenIsAppContainer = 29,
  TokenCapabilities = 30,
  TokenAppContainerSid = 31,
  TokenAppContainerNumber = 32,
  TokenUserClaimAttributes = 33,
  TokenDeviceClaimAttributes = 34,
  TokenRestrictedUserClaimAttributes = 35,
  TokenRestrictedDeviceClaimAttributes = 36,
  TokenDeviceGroups = 37,
  TokenRestrictedDeviceGroups = 38,
  TokenSecurityAttributes = 39,
  TokenIsRestricted = 40,
  TokenProcessTrustLevel = 41,
  MaxTokenInfoClass = 42,
} TOKEN_INFORMATION_CLASS, *PTOKEN_INFORMATION_CLASS;

typedef struct _MINIDUMP_HANDLE_DESCRIPTOR
{
  /* 0x0000 */ unsigned __int64 Handle;
  /* 0x0008 */ unsigned long TypeNameRva;
  /* 0x000c */ unsigned long ObjectNameRva;
  /* 0x0010 */ unsigned int Attributes;
  /* 0x0014 */ unsigned int GrantedAccess;
  /* 0x0018 */ unsigned int HandleCount;
  /* 0x001c */ unsigned int PointerCount;
} MINIDUMP_HANDLE_DESCRIPTOR, *PMINIDUMP_HANDLE_DESCRIPTOR; /* size: 0x0020 */

typedef struct _RTL_RXACT_LOG
{
  /* 0x0000 */ unsigned long OperationCount;
  /* 0x0004 */ unsigned long LogSize;
  /* 0x0008 */ unsigned long LogSizeInUse;
} RTL_RXACT_LOG, *PRTL_RXACT_LOG; /* size: 0x000c */

enum tagMKSYS
{
  MKSYS_NONE = 0,
  MKSYS_GENERICCOMPOSITE = 1,
  MKSYS_FILEMONIKER = 2,
  MKSYS_ANTIMONIKER = 3,
  MKSYS_ITEMMONIKER = 4,
  MKSYS_POINTERMONIKER = 5,
  MKSYS_CLASSMONIKER = 7,
  MKSYS_OBJREFMONIKER = 8,
  MKSYS_SESSIONMONIKER = 9,
  MKSYS_LUAMONIKER = 10,
};

typedef enum _BOOT_ENTROPY_SOURCE_ID
{
  BootEntropySourceNone = 0,
  BootEntropySourceSeedfile = 1,
  BootEntropySourceExternal = 2,
  BootEntropySourceTpm = 3,
  BootEntropySourceRdrand = 4,
  BootEntropySourceTime = 5,
  BootEntropySourceAcpiOem0 = 6,
  BootEntropySourceUefi = 7,
  BootEntropySourceCng = 8,
  BootMaxEntropySources = 8,
} BOOT_ENTROPY_SOURCE_ID, *PBOOT_ENTROPY_SOURCE_ID;

typedef struct _FILE_FS_DEVICE_INFORMATION
{
  /* 0x0000 */ unsigned long DeviceType;
  /* 0x0004 */ unsigned long Characteristics;
} FILE_FS_DEVICE_INFORMATION, *PFILE_FS_DEVICE_INFORMATION; /* size: 0x0008 */

struct ITypeLib2
{
}; /* size: 0x0004 */

typedef enum _FILE_INFO_BY_HANDLE_CLASS
{
  FileBasicInfo = 0,
  FileStandardInfo = 1,
  FileNameInfo = 2,
  FileRenameInfo = 3,
  FileDispositionInfo = 4,
  FileAllocationInfo = 5,
  FileEndOfFileInfo = 6,
  FileStreamInfo = 7,
  FileCompressionInfo = 8,
  FileAttributeTagInfo = 9,
  FileIdBothDirectoryInfo = 10,
  FileIdBothDirectoryRestartInfo = 11,
  FileIoPriorityHintInfo = 12,
  FileRemoteProtocolInfo = 13,
  FileFullDirectoryInfo = 14,
  FileFullDirectoryRestartInfo = 15,
  FileStorageInfo = 16,
  FileAlignmentInfo = 17,
  FileIdInfo = 18,
  FileIdExtdDirectoryInfo = 19,
  FileIdExtdDirectoryRestartInfo = 20,
  MaximumFileInfoByHandleClass = 21,
} FILE_INFO_BY_HANDLE_CLASS, *PFILE_INFO_BY_HANDLE_CLASS;

struct AsyncIUnknown
{
}; /* size: 0x0004 */

typedef struct _FILE_PIPE_CLIENT_PROCESS_BUFFER
{
  /* 0x0000 */ void* ClientSession;
  /* 0x0004 */ void* ClientProcess;
} FILE_PIPE_CLIENT_PROCESS_BUFFER, *PFILE_PIPE_CLIENT_PROCESS_BUFFER; /* size: 0x0008 */

typedef enum _TIMER_INFORMATION_CLASS
{
  TimerBasicInformation = 0,
} TIMER_INFORMATION_CLASS, *PTIMER_INFORMATION_CLASS;

struct ISerializableParent
{
}; /* size: 0x0004 */

struct tagCALPWSTR
{
  /* 0x0000 */ unsigned long cElems;
  /* 0x0004 */ wchar_t** pElems;
}; /* size: 0x0008 */

enum tagPOINTER_DEVICE_CURSOR_TYPE
{
  POINTER_DEVICE_CURSOR_TYPE_UNKNOWN = 0,
  POINTER_DEVICE_CURSOR_TYPE_TIP = 1,
  POINTER_DEVICE_CURSOR_TYPE_ERASER = 2,
  POINTER_DEVICE_CURSOR_TYPE_MAX = -1,
};

typedef struct _SYSTEM_POWER_INFORMATION
{
  /* 0x0000 */ unsigned long MaxIdlenessAllowed;
  /* 0x0004 */ unsigned long Idleness;
  /* 0x0008 */ unsigned long TimeRemaining;
  /* 0x000c */ unsigned char CoolingMode;
  /* 0x000d */ char __PADDING__[3];
} SYSTEM_POWER_INFORMATION, *PSYSTEM_POWER_INFORMATION; /* size: 0x0010 */

enum tagPOINTER_BUTTON_CHANGE_TYPE
{
  POINTER_CHANGE_NONE = 0,
  POINTER_CHANGE_FIRSTBUTTON_DOWN = 1,
  POINTER_CHANGE_FIRSTBUTTON_UP = 2,
  POINTER_CHANGE_SECONDBUTTON_DOWN = 3,
  POINTER_CHANGE_SECONDBUTTON_UP = 4,
  POINTER_CHANGE_THIRDBUTTON_DOWN = 5,
  POINTER_CHANGE_THIRDBUTTON_UP = 6,
  POINTER_CHANGE_FOURTHBUTTON_DOWN = 7,
  POINTER_CHANGE_FOURTHBUTTON_UP = 8,
  POINTER_CHANGE_FIFTHBUTTON_DOWN = 9,
  POINTER_CHANGE_FIFTHBUTTON_UP = 10,
};

typedef struct _wireSAFEARR_VARIANT
{
  /* 0x0000 */ unsigned long Size;
  /* 0x0004 */ struct _wireVARIANT** aVariant;
} wireSAFEARR_VARIANT, *PwireSAFEARR_VARIANT; /* size: 0x0008 */

typedef struct _RTL_TRACE_ENUMERATE
{
  /* 0x0000 */ struct _RTL_TRACE_DATABASE* Database;
  /* 0x0004 */ unsigned long Index;
  /* 0x0008 */ struct _RTL_TRACE_BLOCK* Block;
} RTL_TRACE_ENUMERATE, *PRTL_TRACE_ENUMERATE; /* size: 0x000c */

enum tagCOINIT
{
  COINIT_APARTMENTTHREADED = 2,
  COINIT_MULTITHREADED = 0,
  COINIT_DISABLE_OLE1DDE = 4,
  COINIT_SPEED_OVER_MEMORY = 8,
};

typedef struct _THREAD_TEB_INFORMATION
{
  /* 0x0000 */ void* TebInformation;
  /* 0x0004 */ unsigned long TebOffset;
  /* 0x0008 */ unsigned long BytesToRead;
} THREAD_TEB_INFORMATION, *PTHREAD_TEB_INFORMATION; /* size: 0x000c */

class Windows::Rtl::AutoInterface<Windows::Rtl::IRtlWOUCSStream *,Windows::Auto<Windows::Rtl::IRtlWOUCSStream *> >
{
}; /* size: 0x0004 */

typedef enum _PNP_VETO_TYPE
{
  PNP_VetoTypeUnknown = 0,
  PNP_VetoLegacyDevice = 1,
  PNP_VetoPendingClose = 2,
  PNP_VetoWindowsApp = 3,
  PNP_VetoWindowsService = 4,
  PNP_VetoOutstandingOpen = 5,
  PNP_VetoDevice = 6,
  PNP_VetoDriver = 7,
  PNP_VetoIllegalDeviceRequest = 8,
  PNP_VetoInsufficientPower = 9,
  PNP_VetoNonDisableable = 10,
  PNP_VetoLegacyDriver = 11,
  PNP_VetoInsufficientRights = 12,
} PNP_VETO_TYPE, *PPNP_VETO_TYPE;

typedef enum _WATCHDOG_INFORMATION_CLASS
{
  WdInfoTimeoutValue = 0,
  WdInfoResetTimer = 1,
  WdInfoStopTimer = 2,
  WdInfoStartTimer = 3,
  WdInfoTriggerAction = 4,
  WdInfoState = 5,
  WdInfoTriggerReset = 6,
  WdInfoNop = 7,
} WATCHDOG_INFORMATION_CLASS, *PWATCHDOG_INFORMATION_CLASS;

typedef struct _QUAD
{
  union
  {
    /* 0x0000 */ __int64 UseThisFieldToCopy;
    /* 0x0000 */ double DoNotUseThisField;
  }; /* size: 0x0008 */
} QUAD, *PQUAD; /* size: 0x0008 */

struct tagMOUSEINPUT
{
  /* 0x0000 */ long dx;
  /* 0x0004 */ long dy;
  /* 0x0008 */ unsigned long mouseData;
  /* 0x000c */ unsigned long dwFlags;
  /* 0x0010 */ unsigned long time;
  /* 0x0014 */ unsigned long dwExtraInfo;
}; /* size: 0x0018 */

typedef struct _PRINTER_INFO_2A
{
  /* 0x0000 */ char* pServerName;
  /* 0x0004 */ char* pPrinterName;
  /* 0x0008 */ char* pShareName;
  /* 0x000c */ char* pPortName;
  /* 0x0010 */ char* pDriverName;
  /* 0x0014 */ char* pComment;
  /* 0x0018 */ char* pLocation;
  /* 0x001c */ struct _devicemodeA* pDevMode;
  /* 0x0020 */ char* pSepFile;
  /* 0x0024 */ char* pPrintProcessor;
  /* 0x0028 */ char* pDatatype;
  /* 0x002c */ char* pParameters;
  /* 0x0030 */ void* pSecurityDescriptor;
  /* 0x0034 */ unsigned long Attributes;
  /* 0x0038 */ unsigned long Priority;
  /* 0x003c */ unsigned long DefaultPriority;
  /* 0x0040 */ unsigned long StartTime;
  /* 0x0044 */ unsigned long UntilTime;
  /* 0x0048 */ unsigned long Status;
  /* 0x004c */ unsigned long cJobs;
  /* 0x0050 */ unsigned long AveragePPM;
} PRINTER_INFO_2A, *PPRINTER_INFO_2A; /* size: 0x0054 */

typedef enum _OBJECT_INFORMATION_CLASS
{
  ObjectBasicInformation = 0,
  ObjectNameInformation = 1,
  ObjectTypeInformation = 2,
  ObjectTypesInformation = 3,
  ObjectHandleFlagInformation = 4,
  ObjectSessionInformation = 5,
  MaxObjectInfoClass = 6,
} OBJECT_INFORMATION_CLASS, *POBJECT_INFORMATION_CLASS;

typedef struct _CMSG_RC4_AUX_INFO
{
  /* 0x0000 */ unsigned long cbSize;
  /* 0x0004 */ unsigned long dwBitLen;
} CMSG_RC4_AUX_INFO, *PCMSG_RC4_AUX_INFO; /* size: 0x0008 */

typedef enum _IO_SESSION_STATE
{
  IoSessionStateCreated = 1,
  IoSessionStateInitialized = 2,
  IoSessionStateConnected = 3,
  IoSessionStateDisconnected = 4,
  IoSessionStateDisconnectedLoggedOn = 5,
  IoSessionStateLoggedOn = 6,
  IoSessionStateLoggedOff = 7,
  IoSessionStateTerminated = 8,
  IoSessionStateMax = 9,
} IO_SESSION_STATE, *PIO_SESSION_STATE;

class Windows::Rtl::CriticalSectionLockGrant
{
  /* 0x0000 */ class Windows::Rtl::CriticalSectionLock& m_Lock;
  /* 0x0004 */ BOOL m_fLocked;
}; /* size: 0x0008 */

typedef struct _CERT_POLICY_ID
{
  /* 0x0000 */ unsigned long cCertPolicyElementId;
  /* 0x0004 */ char** rgpszCertPolicyElementId;
} CERT_POLICY_ID, *PCERT_POLICY_ID; /* size: 0x0008 */

enum tagURLTEMPLATE
{
  URLTEMPLATE_CUSTOM = 0,
  URLTEMPLATE_PREDEFINED_MIN = 0x10000,
  URLTEMPLATE_LOW = 0x10000,
  URLTEMPLATE_MEDLOW = 0x10500,
  URLTEMPLATE_MEDIUM = 0x11000,
  URLTEMPLATE_MEDHIGH = 0x11500,
  URLTEMPLATE_HIGH = 0x12000,
  URLTEMPLATE_PREDEFINED_MAX = 0x20000,
};

typedef enum _PROCESS_MITIGATION_POLICY
{
  ProcessDEPPolicy = 0,
  ProcessASLRPolicy = 1,
  ProcessDynamicCodePolicy = 2,
  ProcessStrictHandleCheckPolicy = 3,
  ProcessSystemCallDisablePolicy = 4,
  ProcessMitigationOptionsMask = 5,
  ProcessExtensionPointDisablePolicy = 6,
  ProcessReserved1Policy = 7,
  ProcessSignaturePolicy = 8,
  MaxProcessMitigationPolicy = 9,
} PROCESS_MITIGATION_POLICY, *PPROCESS_MITIGATION_POLICY;

struct tagXFORM
{
  /* 0x0000 */ float eM11;
  /* 0x0004 */ float eM12;
  /* 0x0008 */ float eM21;
  /* 0x000c */ float eM22;
  /* 0x0010 */ float eDx;
  /* 0x0014 */ float eDy;
}; /* size: 0x0018 */

struct tagEMRBITBLT
{
  /* 0x0000 */ struct tagEMR emr;
  /* 0x0008 */ struct _RECTL rclBounds;
  /* 0x0018 */ long xDest;
  /* 0x001c */ long yDest;
  /* 0x0020 */ long cxDest;
  /* 0x0024 */ long cyDest;
  /* 0x0028 */ unsigned long dwRop;
  /* 0x002c */ long xSrc;
  /* 0x0030 */ long ySrc;
  /* 0x0034 */ struct tagXFORM xformSrc;
  /* 0x004c */ unsigned long crBkColorSrc;
  /* 0x0050 */ unsigned long iUsageSrc;
  /* 0x0054 */ unsigned long offBmiSrc;
  /* 0x0058 */ unsigned long cbBmiSrc;
  /* 0x005c */ unsigned long offBitsSrc;
  /* 0x0060 */ unsigned long cbBitsSrc;
}; /* size: 0x0064 */

typedef struct _PLUGPLAY_CONTROL_DEVICE_INTERFACE_ENABLED
{
  /* 0x0000 */ struct _UNICODE_STRING DeviceInterface;
  /* 0x0008 */ unsigned long Flags;
  /* 0x000c */ unsigned char Enabled;
  /* 0x000d */ char __PADDING__[3];
} PLUGPLAY_CONTROL_DEVICE_INTERFACE_ENABLED, *PPLUGPLAY_CONTROL_DEVICE_INTERFACE_ENABLED; /* size: 0x0010 */

struct in_addr
{
  union
  {
    union
    {
      struct
      {
        /* 0x0000 */ unsigned char s_b1;
        /* 0x0001 */ unsigned char s_b2;
        /* 0x0002 */ unsigned char s_b3;
        /* 0x0003 */ unsigned char s_b4;
      } /* size: 0x0004 */ S_un_b;
      struct
      {
        /* 0x0000 */ unsigned short s_w1;
        /* 0x0002 */ unsigned short s_w2;
      } /* size: 0x0004 */ S_un_w;
      /* 0x0000 */ unsigned long S_addr;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ S_un;
}; /* size: 0x0004 */

struct ip_mreq
{
  /* 0x0000 */ struct in_addr imr_multiaddr;
  /* 0x0004 */ struct in_addr imr_interface;
}; /* size: 0x0008 */

typedef enum _RTL_VERIFIER_REDIRECT_TYPE
{
  VerifierGPALookup = 0,
  VerifierDelayloadLookup = 1,
  VerifierLegacyLookup = 2,
  VerifierMaxLookupType = 3,
} RTL_VERIFIER_REDIRECT_TYPE, *PRTL_VERIFIER_REDIRECT_TYPE;

struct tagPOINT
{
  /* 0x0000 */ long x;
  /* 0x0004 */ long y;
}; /* size: 0x0008 */

typedef struct _DRAWPATRECT
{
  /* 0x0000 */ struct tagPOINT ptPosition;
  /* 0x0008 */ struct tagPOINT ptSize;
  /* 0x0010 */ unsigned short wStyle;
  /* 0x0012 */ unsigned short wPattern;
} DRAWPATRECT, *PDRAWPATRECT; /* size: 0x0014 */

enum tagMSHLFLAGS
{
  MSHLFLAGS_NORMAL = 0,
  MSHLFLAGS_TABLESTRONG = 1,
  MSHLFLAGS_TABLEWEAK = 2,
  MSHLFLAGS_NOPING = 4,
  MSHLFLAGS_RESERVED1 = 8,
  MSHLFLAGS_RESERVED2 = 16,
  MSHLFLAGS_RESERVED3 = 32,
  MSHLFLAGS_RESERVED4 = 64,
};

typedef enum _PNP_QUERY_RELATION
{
  PnpQueryEjectRelations = 0,
  PnpQueryRemovalRelations = 1,
  PnpQueryPowerRelations = 2,
  PnpQueryBusRelations = 3,
  PnpQueryTransportRelations = 4,
  MaxPnpQueryRelations = 5,
} PNP_QUERY_RELATION, *PPNP_QUERY_RELATION;

struct tagCABSTR
{
  /* 0x0000 */ unsigned long cElems;
  /* 0x0004 */ wchar_t** pElems;
}; /* size: 0x0008 */

typedef union _userHGLOBAL::__MIDL_IWinTypes_0003
{
  union
  {
    /* 0x0000 */ long hInproc;
    /* 0x0000 */ struct _FLAGGED_BYTE_BLOB* hRemote;
    /* 0x0000 */ __int64 hInproc64;
  }; /* size: 0x0008 */
} userHGLOBAL::__MIDL_IWinTypes_0003, *PuserHGLOBAL::__MIDL_IWinTypes_0003; /* size: 0x0008 */

typedef struct _userHGLOBAL
{
  /* 0x0000 */ long fContext;
  /* 0x0004 */ long Padding_16;
  /* 0x0008 */ union _userHGLOBAL::__MIDL_IWinTypes_0003 u;
} userHGLOBAL, *PuserHGLOBAL; /* size: 0x0010 */

class Windows::AutoOperatorAmpersandHelper<Windows::Rtl::IRtlBlobProvider *,Windows::Auto<Windows::Rtl::IRtlBlobProvider *> >;

typedef enum _JOBOBJECTINFOCLASS
{
  JobObjectBasicAccountingInformation = 1,
  JobObjectBasicLimitInformation = 2,
  JobObjectBasicProcessIdList = 3,
  JobObjectBasicUIRestrictions = 4,
  JobObjectSecurityLimitInformation = 5,
  JobObjectEndOfJobTimeInformation = 6,
  JobObjectAssociateCompletionPortInformation = 7,
  JobObjectBasicAndIoAccountingInformation = 8,
  JobObjectExtendedLimitInformation = 9,
  JobObjectJobSetInformation = 10,
  JobObjectGroupInformation = 11,
  JobObjectNotificationLimitInformation = 12,
  JobObjectLimitViolationInformation = 13,
  JobObjectGroupInformationEx = 14,
  JobObjectCpuRateControlInformation = 15,
  JobObjectCompletionFilter = 16,
  JobObjectCompletionCounter = 17,
  JobObjectFreezeInformation = 18,
  JobObjectExtendedAccountingInformation = 19,
  JobObjectWakeInformation = 20,
  JobObjectBackgroundInformation = 21,
  JobObjectSchedulingRankBiasInformation = 22,
  JobObjectTimerVirtualizationInformation = 23,
  JobObjectCycleTimeNotification = 24,
  JobObjectClearEvent = 25,
  JobObjectInterferenceInformation = 26,
  JobObjectReserved1Information = 18,
  JobObjectReserved2Information = 19,
  JobObjectReserved3Information = 20,
  JobObjectReserved4Information = 21,
  JobObjectReserved5Information = 22,
  JobObjectReserved6Information = 23,
  JobObjectReserved7Information = 24,
  JobObjectReserved8Information = 25,
  JobObjectReserved9Information = 26,
  MaxJobObjectInfoClass = 27,
} JOBOBJECTINFOCLASS, *PJOBOBJECTINFOCLASS;

typedef enum _COMPUTER_NAME_FORMAT
{
  ComputerNameNetBIOS = 0,
  ComputerNameDnsHostname = 1,
  ComputerNameDnsDomain = 2,
  ComputerNameDnsFullyQualified = 3,
  ComputerNamePhysicalNetBIOS = 4,
  ComputerNamePhysicalDnsHostname = 5,
  ComputerNamePhysicalDnsDomain = 6,
  ComputerNamePhysicalDnsFullyQualified = 7,
  ComputerNameMax = 8,
} COMPUTER_NAME_FORMAT, *PCOMPUTER_NAME_FORMAT;

typedef enum _IO_SESSION_EVENT
{
  IoSessionEventIgnore = 0,
  IoSessionEventCreated = 1,
  IoSessionEventTerminated = 2,
  IoSessionEventConnected = 3,
  IoSessionEventDisconnected = 4,
  IoSessionEventLogon = 5,
  IoSessionEventLogoff = 6,
  IoSessionEventMax = 7,
} IO_SESSION_EVENT, *PIO_SESSION_EVENT;

class ServerLocationInfo
{
  /* 0x0000 */ long Padding_17[5];
  /* 0x0014 */ struct tagLocationInfoData _locationInfoData;
  /* 0x0024 */ class CObjectContext* _pObjectContext;
  /* 0x0028 */ struct ISpecialSystemProperties* _pISSP;
}; /* size: 0x002c */

enum tagPOINTER_DEVICE_TYPE
{
  POINTER_DEVICE_TYPE_INTEGRATED_PEN = 1,
  POINTER_DEVICE_TYPE_EXTERNAL_PEN = 2,
  POINTER_DEVICE_TYPE_TOUCH = 3,
  POINTER_DEVICE_TYPE_TOUCH_PAD = 4,
  POINTER_DEVICE_TYPE_MAX = -1,
};

struct tagPOINTER_DEVICE_INFO
{
  /* 0x0000 */ unsigned long displayOrientation;
  /* 0x0004 */ void* device;
  /* 0x0008 */ enum tagPOINTER_DEVICE_TYPE pointerDeviceType;
  /* 0x000c */ struct HMONITOR__* monitor;
  /* 0x0010 */ unsigned long startingCursorId;
  /* 0x0014 */ unsigned short maxActiveContacts;
  /* 0x0016 */ wchar_t productString[520];
  /* 0x0426 */ char __PADDING__[2];
}; /* size: 0x0428 */

class Windows::AutoOperatorAmpersandHelper<_LUTF8_STRING,Windows::Auto<_LUTF8_STRING> >;

typedef struct _PUBLIC_OBJECT_BASIC_INFORMATION
{
  /* 0x0000 */ unsigned long Attributes;
  /* 0x0004 */ unsigned long GrantedAccess;
  /* 0x0008 */ unsigned long HandleCount;
  /* 0x000c */ unsigned long PointerCount;
  /* 0x0010 */ unsigned long Reserved[10];
} PUBLIC_OBJECT_BASIC_INFORMATION, *PPUBLIC_OBJECT_BASIC_INFORMATION; /* size: 0x0038 */

typedef enum _FILE_INFORMATION_CLASS
{
  FileDirectoryInformation = 1,
  FileFullDirectoryInformation = 2,
  FileBothDirectoryInformation = 3,
  FileBasicInformation = 4,
  FileStandardInformation = 5,
  FileInternalInformation = 6,
  FileEaInformation = 7,
  FileAccessInformation = 8,
  FileNameInformation = 9,
  FileRenameInformation = 10,
  FileLinkInformation = 11,
  FileNamesInformation = 12,
  FileDispositionInformation = 13,
  FilePositionInformation = 14,
  FileFullEaInformation = 15,
  FileModeInformation = 16,
  FileAlignmentInformation = 17,
  FileAllInformation = 18,
  FileAllocationInformation = 19,
  FileEndOfFileInformation = 20,
  FileAlternateNameInformation = 21,
  FileStreamInformation = 22,
  FilePipeInformation = 23,
  FilePipeLocalInformation = 24,
  FilePipeRemoteInformation = 25,
  FileMailslotQueryInformation = 26,
  FileMailslotSetInformation = 27,
  FileCompressionInformation = 28,
  FileObjectIdInformation = 29,
  FileCompletionInformation = 30,
  FileMoveClusterInformation = 31,
  FileQuotaInformation = 32,
  FileReparsePointInformation = 33,
  FileNetworkOpenInformation = 34,
  FileAttributeTagInformation = 35,
  FileTrackingInformation = 36,
  FileIdBothDirectoryInformation = 37,
  FileIdFullDirectoryInformation = 38,
  FileValidDataLengthInformation = 39,
  FileShortNameInformation = 40,
  FileIoCompletionNotificationInformation = 41,
  FileIoStatusBlockRangeInformation = 42,
  FileIoPriorityHintInformation = 43,
  FileSfioReserveInformation = 44,
  FileSfioVolumeInformation = 45,
  FileHardLinkInformation = 46,
  FileProcessIdsUsingFileInformation = 47,
  FileNormalizedNameInformation = 48,
  FileNetworkPhysicalNameInformation = 49,
  FileIdGlobalTxDirectoryInformation = 50,
  FileIsRemoteDeviceInformation = 51,
  FileUnusedInformation = 52,
  FileNumaNodeInformation = 53,
  FileStandardLinkInformation = 54,
  FileRemoteProtocolInformation = 55,
  FileRenameInformationBypassAccessCheck = 56,
  FileLinkInformationBypassAccessCheck = 57,
  FileVolumeNameInformation = 58,
  FileIdInformation = 59,
  FileIdExtdDirectoryInformation = 60,
  FileReplaceCompletionInformation = 61,
  FileHardLinkFullIdInformation = 62,
  FileMaximumInformation = 63,
} FILE_INFORMATION_CLASS, *PFILE_INFORMATION_CLASS;

class CBool
{
  /* 0x0000 */ int value;
}; /* size: 0x0004 */

typedef enum _TAG_UNNAMED_4
{
  Value = 1,
} TAG_UNNAMED_4, *PTAG_UNNAMED_4;

class Windows::AutoPointerBase<Windows::Rtl::IRtlRORAStream *,Windows::Auto<Windows::Rtl::IRtlRORAStream *> >
{
  /* 0x0000 */ struct Windows::Rtl::IRtlRORAStream* m_Data;
}; /* size: 0x0004 */

typedef enum _ALPC_PORT_INFORMATION_CLASS
{
  AlpcBasicInformation = 0,
  AlpcPortInformation = 1,
  AlpcAssociateCompletionPortInformation = 2,
  AlpcConnectedSIDInformation = 3,
  AlpcServerInformation = 4,
  AlpcMessageZoneInformation = 5,
  AlpcRegisterCompletionListInformation = 6,
  AlpcUnregisterCompletionListInformation = 7,
  AlpcAdjustCompletionListConcurrencyCountInformation = 8,
  AlpcRegisterCallbackInformation = 9,
  AlpcCompletionListRundownInformation = 10,
  AlpcWaitForPortReferences = 11,
} ALPC_PORT_INFORMATION_CLASS, *PALPC_PORT_INFORMATION_CLASS;

typedef struct _APPLICATIONLAUNCH_SETTING_VALUE
{
  /* 0x0000 */ union _LARGE_INTEGER ActivationTime;
  /* 0x0008 */ unsigned long Flags;
  /* 0x000c */ unsigned long ButtonInstanceID;
} APPLICATIONLAUNCH_SETTING_VALUE, *PAPPLICATIONLAUNCH_SETTING_VALUE; /* size: 0x0010 */

struct DISPLAYCONFIG_2DREGION
{
  /* 0x0000 */ unsigned int cx;
  /* 0x0004 */ unsigned int cy;
}; /* size: 0x0008 */

class Windows::Rtl::AutoInterface<Windows::Rtl::IRtlWOFOUCSStream *,Windows::Auto<Windows::Rtl::IRtlWOFOUCSStream *> >
{
}; /* size: 0x0004 */

enum tagVARFLAGS
{
  VARFLAG_FREADONLY = 1,
  VARFLAG_FSOURCE = 2,
  VARFLAG_FBINDABLE = 4,
  VARFLAG_FREQUESTEDIT = 8,
  VARFLAG_FDISPLAYBIND = 16,
  VARFLAG_FDEFAULTBIND = 32,
  VARFLAG_FHIDDEN = 64,
  VARFLAG_FRESTRICTED = 128,
  VARFLAG_FDEFAULTCOLLELEM = 256,
  VARFLAG_FUIDEFAULT = 512,
  VARFLAG_FNONBROWSABLE = 1024,
  VARFLAG_FREPLACEABLE = 2048,
  VARFLAG_FIMMEDIATEBIND = 4096,
};

class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<ClipboardDataObjectTask> const >;

typedef enum _TAG_UNNAMED_5
{
  Value = 1,
} TAG_UNNAMED_5, *PTAG_UNNAMED_5;

class CBasedGlobalFileStreamPtr
{
  /* 0x0000 */ unsigned long _p;
}; /* size: 0x0004 */

typedef struct _MEMORY_BASIC_INFORMATION64
{
  /* 0x0000 */ unsigned __int64 BaseAddress;
  /* 0x0008 */ unsigned __int64 AllocationBase;
  /* 0x0010 */ unsigned long AllocationProtect;
  /* 0x0014 */ unsigned long __alignment1;
  /* 0x0018 */ unsigned __int64 RegionSize;
  /* 0x0020 */ unsigned long State;
  /* 0x0024 */ unsigned long Protect;
  /* 0x0028 */ unsigned long Type;
  /* 0x002c */ unsigned long __alignment2;
} MEMORY_BASIC_INFORMATION64, *PMEMORY_BASIC_INFORMATION64; /* size: 0x0030 */

typedef enum __MIDL_IBindStatusCallback_0002
{
  BINDINFOF_URLENCODESTGMEDDATA = 1,
  BINDINFOF_URLENCODEDEXTRAINFO = 2,
} _MIDL_IBindStatusCallback_0002, *P_MIDL_IBindStatusCallback_0002;

struct IOleInPlaceActiveObject
{
}; /* size: 0x0004 */

enum tagACTIVATIONTYPE
{
  ACTIVATIONTYPE_UNCATEGORIZED = 0,
  ACTIVATIONTYPE_FROM_MONIKER = 1,
  ACTIVATIONTYPE_FROM_DATA = 2,
  ACTIVATIONTYPE_FROM_STORAGE = 4,
  ACTIVATIONTYPE_FROM_STREAM = 8,
  ACTIVATIONTYPE_FROM_FILE = 16,
};

struct IOleControlSite
{
}; /* size: 0x0004 */

typedef struct _CRYPT_RC4_KEY_STATE
{
  /* 0x0000 */ unsigned char Key[16];
  /* 0x0010 */ unsigned char SBox[256];
  /* 0x0110 */ unsigned char i;
  /* 0x0111 */ unsigned char j;
} CRYPT_RC4_KEY_STATE, *PCRYPT_RC4_KEY_STATE; /* size: 0x0112 */

typedef struct _CERT_POLICY_INFO
{
  /* 0x0000 */ char* pszPolicyIdentifier;
  /* 0x0004 */ unsigned long cPolicyQualifier;
  /* 0x0008 */ struct _CERT_POLICY_QUALIFIER_INFO* rgPolicyQualifier;
} CERT_POLICY_INFO, *PCERT_POLICY_INFO; /* size: 0x000c */

struct HKEY__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

typedef enum _SC_STATUS_TYPE
{
  SC_STATUS_PROCESS_INFO = 0,
} SC_STATUS_TYPE, *PSC_STATUS_TYPE;

typedef enum _FP__IEEE_FORMAT
{
  FpFormatFp32 = 0,
  FpFormatFp64 = 1,
  FpFormatFp80 = 2,
  FpFormatFp128 = 3,
  FpFormatI16 = 4,
  FpFormatI32 = 5,
  FpFormatI64 = 6,
  FpFormatU16 = 7,
  FpFormatU32 = 8,
  FpFormatU64 = 9,
  FpFormatCompare = 10,
  FpFormatString = 11,
} FP__IEEE_FORMAT, *PFP__IEEE_FORMAT;

struct IPartitionProperty
{
}; /* size: 0x0004 */

typedef struct _SYSDBG_BUS_DATA
{
  /* 0x0000 */ unsigned long Address;
  /* 0x0004 */ void* Buffer;
  /* 0x0008 */ unsigned long Request;
  /* 0x000c */ enum _BUS_DATA_TYPE BusDataType;
  /* 0x0010 */ unsigned long BusNumber;
  /* 0x0014 */ unsigned long SlotNumber;
} SYSDBG_BUS_DATA, *PSYSDBG_BUS_DATA; /* size: 0x0018 */

typedef enum _TAG_UNNAMED_6
{
  Value = 1,
} TAG_UNNAMED_6, *PTAG_UNNAMED_6;

struct IDestInfo
{
}; /* size: 0x0004 */

struct IRpcChannelBuffer
{
}; /* size: 0x0004 */

typedef struct _CERT_TRUST_STATUS
{
  /* 0x0000 */ unsigned long dwErrorStatus;
  /* 0x0004 */ unsigned long dwInfoStatus;
} CERT_TRUST_STATUS, *PCERT_TRUST_STATUS; /* size: 0x0008 */

typedef struct _CERT_CHAIN_ELEMENT
{
  /* 0x0000 */ unsigned long cbSize;
  /* 0x0004 */ const struct _CERT_CONTEXT* pCertContext;
  /* 0x0008 */ struct _CERT_TRUST_STATUS TrustStatus;
  /* 0x0010 */ struct _CERT_REVOCATION_INFO* pRevocationInfo;
  /* 0x0014 */ struct _CTL_USAGE* pIssuanceUsage;
  /* 0x0018 */ struct _CTL_USAGE* pApplicationUsage;
  /* 0x001c */ const wchar_t* pwszExtendedErrorInfo;
} CERT_CHAIN_ELEMENT, *PCERT_CHAIN_ELEMENT; /* size: 0x0020 */

typedef struct _KCRM_PROTOCOL_BLOB
{
  /* 0x0000 */ struct _GUID ProtocolId;
  /* 0x0010 */ unsigned long StaticInfoLength;
  /* 0x0014 */ unsigned long TransactionIdInfoLength;
  /* 0x0018 */ unsigned long Unused1;
  /* 0x001c */ unsigned long Unused2;
} KCRM_PROTOCOL_BLOB, *PKCRM_PROTOCOL_BLOB; /* size: 0x0020 */

typedef struct _PROPSHEETPAGEA_V1
{
  /* 0x0000 */ unsigned long dwSize;
  /* 0x0004 */ unsigned long dwFlags;
  /* 0x0008 */ struct HINSTANCE__* hInstance;
  union
  {
    /* 0x000c */ const char* pszTemplate;
    /* 0x000c */ const struct DLGTEMPLATE* pResource;
  }; /* size: 0x0004 */
  union
  {
    /* 0x0010 */ struct HICON__* hIcon;
    /* 0x0010 */ const char* pszIcon;
  }; /* size: 0x0004 */
  /* 0x0014 */ const char* pszTitle;
  /* 0x0018 */ void* pfnDlgProc /* function */;
  /* 0x001c */ long lParam;
  /* 0x0020 */ void* pfnCallback /* function */;
  /* 0x0024 */ unsigned int* pcRefParent;
} PROPSHEETPAGEA_V1, *PPROPSHEETPAGEA_V1; /* size: 0x0028 */

struct tagPOINTER_DEVICE_CURSOR_INFO
{
  /* 0x0000 */ unsigned int cursorId;
  /* 0x0004 */ enum tagPOINTER_DEVICE_CURSOR_TYPE cursor;
}; /* size: 0x0008 */

typedef enum _LEARNING_MODE_LOG_LEVEL
{
  LearningModeLogLevelPassive = 0,
  LearningModeLogLevelNormalApc = 1,
  LearningModeLogLevelSpecialApc = 2,
  LearningModeLogLevelMax = 3,
} LEARNING_MODE_LOG_LEVEL, *PLEARNING_MODE_LOG_LEVEL;

typedef struct _FILE_NAME_INFORMATION
{
  /* 0x0000 */ unsigned long FileNameLength;
  /* 0x0004 */ wchar_t FileName[1];
  /* 0x0006 */ char __PADDING__[2];
} FILE_NAME_INFORMATION, *PFILE_NAME_INFORMATION; /* size: 0x0008 */

typedef enum _TAG_UNNAMED_7
{
  value = 1,
} TAG_UNNAMED_7, *PTAG_UNNAMED_7;

typedef struct _FIXED
{
  /* 0x0000 */ unsigned short fract;
  /* 0x0002 */ short value;
} FIXED, *PFIXED; /* size: 0x0004 */

struct tagPOINTFX
{
  /* 0x0000 */ struct _FIXED x;
  /* 0x0004 */ struct _FIXED y;
}; /* size: 0x0008 */

struct Microsoft::WRL::Details::VerifyInterfaceHelper<2,IUnknown,0,0>
{
}; /* size: 0x0001 */

typedef enum _CM_SERVICE_NODE_TYPE
{
  DriverType = 1,
  FileSystemType = 2,
  Win32ServiceOwnProcess = 16,
  Win32ServiceShareProcess = 32,
  AdapterType = 4,
  RecognizerType = 8,
} CM_SERVICE_NODE_TYPE, *PCM_SERVICE_NODE_TYPE;

typedef enum _APTTYPE
{
  APTTYPE_CURRENT = -1,
  APTTYPE_STA = 0,
  APTTYPE_MTA = 1,
  APTTYPE_NA = 2,
  APTTYPE_MAINSTA = 3,
} APTTYPE, *PAPTTYPE;

typedef struct _FSCTL_OFFLOAD_READ_OUTPUT
{
  /* 0x0000 */ unsigned long Size;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ unsigned __int64 TransferLength;
  /* 0x0010 */ unsigned char Token[512];
} FSCTL_OFFLOAD_READ_OUTPUT, *PFSCTL_OFFLOAD_READ_OUTPUT; /* size: 0x0210 */

typedef struct _UMS_SCHEDULER_STARTUP_INFO
{
  /* 0x0000 */ unsigned long UmsVersion;
  /* 0x0004 */ void* CompletionList;
  /* 0x0008 */ void* SchedulerProc /* function */;
  /* 0x000c */ void* SchedulerParam;
} UMS_SCHEDULER_STARTUP_INFO, *PUMS_SCHEDULER_STARTUP_INFO; /* size: 0x0010 */

typedef enum _TAG_UNNAMED_8
{
  Value = 1,
} TAG_UNNAMED_8, *PTAG_UNNAMED_8;

struct IPropertyPageSite
{
}; /* size: 0x0004 */

struct tagHELPINFO
{
  /* 0x0000 */ unsigned int cbSize;
  /* 0x0004 */ int iContextType;
  /* 0x0008 */ int iCtrlId;
  /* 0x000c */ void* hItemHandle;
  /* 0x0010 */ unsigned long dwContextId;
  /* 0x0014 */ struct tagPOINT MousePos;
}; /* size: 0x001c */

typedef struct _SYSTEM_POLICY_INFORMATION
{
  /* 0x0000 */ void* InputData;
  /* 0x0004 */ void* OutputData;
  /* 0x0008 */ unsigned long InputDataSize;
  /* 0x000c */ unsigned long OutputDataSize;
  /* 0x0010 */ unsigned long Version;
} SYSTEM_POLICY_INFORMATION, *PSYSTEM_POLICY_INFORMATION; /* size: 0x0014 */

struct tagOFNW
{
  /* 0x0000 */ unsigned long lStructSize;
  /* 0x0004 */ struct HWND__* hwndOwner;
  /* 0x0008 */ struct HINSTANCE__* hInstance;
  /* 0x000c */ const wchar_t* lpstrFilter;
  /* 0x0010 */ wchar_t* lpstrCustomFilter;
  /* 0x0014 */ unsigned long nMaxCustFilter;
  /* 0x0018 */ unsigned long nFilterIndex;
  /* 0x001c */ wchar_t* lpstrFile;
  /* 0x0020 */ unsigned long nMaxFile;
  /* 0x0024 */ wchar_t* lpstrFileTitle;
  /* 0x0028 */ unsigned long nMaxFileTitle;
  /* 0x002c */ const wchar_t* lpstrInitialDir;
  /* 0x0030 */ const wchar_t* lpstrTitle;
  /* 0x0034 */ unsigned long Flags;
  /* 0x0038 */ unsigned short nFileOffset;
  /* 0x003a */ unsigned short nFileExtension;
  /* 0x003c */ const wchar_t* lpstrDefExt;
  /* 0x0040 */ long lCustData;
  /* 0x0044 */ void* lpfnHook /* function */;
  /* 0x0048 */ const wchar_t* lpTemplateName;
  /* 0x004c */ void* pvReserved;
  /* 0x0050 */ unsigned long dwReserved;
  /* 0x0054 */ unsigned long FlagsEx;
}; /* size: 0x0058 */

typedef enum _CM_SERVICE_LOAD_TYPE
{
  BootLoad = 0,
  SystemLoad = 1,
  AutoLoad = 2,
  DemandLoad = 3,
  DisableLoad = 4,
} CM_SERVICE_LOAD_TYPE, *PCM_SERVICE_LOAD_TYPE;

typedef struct _SPC_SP_OPUS_INFO
{
  /* 0x0000 */ const wchar_t* pwszProgramName;
  /* 0x0004 */ struct SPC_LINK_* pMoreInfo;
  /* 0x0008 */ struct SPC_LINK_* pPublisherInfo;
} SPC_SP_OPUS_INFO, *PSPC_SP_OPUS_INFO; /* size: 0x000c */

struct IPropertyStorage
{
}; /* size: 0x0004 */

struct Windows::Foundation::IReferenceArray<int>
{
}; /* size: 0x0004 */

typedef enum _THREAD_INFORMATION_CLASS
{
  ThreadMemoryPriority = 0,
  ThreadAbsoluteCpuPriority = 1,
  ThreadInformationClassMax = 2,
} THREAD_INFORMATION_CLASS, *PTHREAD_INFORMATION_CLASS;

struct ISimpleFrameSite
{
}; /* size: 0x0004 */

typedef enum _TAG_UNNAMED_9
{
  Value = 0,
} TAG_UNNAMED_9, *PTAG_UNNAMED_9;

typedef union _userHMETAFILE::__MIDL_IWinTypes_0004
{
  union
  {
    /* 0x0000 */ long hInproc;
    /* 0x0000 */ struct _BYTE_BLOB* hRemote;
    /* 0x0000 */ __int64 hInproc64;
  }; /* size: 0x0008 */
} userHMETAFILE::__MIDL_IWinTypes_0004, *PuserHMETAFILE::__MIDL_IWinTypes_0004; /* size: 0x0008 */

typedef struct _userHMETAFILE
{
  /* 0x0000 */ long fContext;
  /* 0x0004 */ long Padding_18;
  /* 0x0008 */ union _userHMETAFILE::__MIDL_IWinTypes_0004 u;
} userHMETAFILE, *PuserHMETAFILE; /* size: 0x0010 */

struct IComThreadingInfo
{
}; /* size: 0x0004 */

typedef enum _SID_NAME_USE
{
  SidTypeUser = 1,
  SidTypeGroup = 2,
  SidTypeDomain = 3,
  SidTypeAlias = 4,
  SidTypeWellKnownGroup = 5,
  SidTypeDeletedAccount = 6,
  SidTypeInvalid = 7,
  SidTypeUnknown = 8,
  SidTypeComputer = 9,
  SidTypeLabel = 10,
} SID_NAME_USE, *PSID_NAME_USE;

enum DisconnectType
{
  NORMAL = 1,
  RELEASE = 2,
  APPLICATION = 4,
  UNINIT = 8,
  RUNDOWN = 16,
  SYSTEM = 32,
};

typedef struct _RPC_SECURITY_QOS_V5_W
{
  /* 0x0000 */ unsigned long Version;
  /* 0x0004 */ unsigned long Capabilities;
  /* 0x0008 */ unsigned long IdentityTracking;
  /* 0x000c */ unsigned long ImpersonationType;
  /* 0x0010 */ unsigned long AdditionalSecurityInfoType;
  union
  {
    /* 0x0014 */ struct _RPC_HTTP_TRANSPORT_CREDENTIALS_W* HttpCredentials;
  } /* size: 0x0004 */ u;
  /* 0x0018 */ void* Sid;
  /* 0x001c */ unsigned int EffectiveOnly;
  /* 0x0020 */ void* ServerSecurityDescriptor;
} RPC_SECURITY_QOS_V5_W, *PRPC_SECURITY_QOS_V5_W; /* size: 0x0024 */

struct DISPLAYCONFIG_VIDEO_SIGNAL_INFO
{
  /* 0x0000 */ unsigned __int64 pixelRate;
  /* 0x0008 */ struct DISPLAYCONFIG_RATIONAL hSyncFreq;
  /* 0x0010 */ struct DISPLAYCONFIG_RATIONAL vSyncFreq;
  /* 0x0018 */ struct DISPLAYCONFIG_2DREGION activeSize;
  /* 0x0020 */ struct DISPLAYCONFIG_2DREGION totalSize;
  union
  {
    struct
    {
      struct /* bitfield */
      {
        /* 0x0028 */ unsigned int videoStandard : 16; /* bit position: 0 */
        /* 0x0028 */ unsigned int vSyncFreqDivider : 6; /* bit position: 16 */
        /* 0x0028 */ unsigned int reserved : 10; /* bit position: 22 */
      }; /* bitfield */
    } /* size: 0x0004 */ AdditionalSignalInfo;
    /* 0x0028 */ unsigned int videoStandard;
  }; /* size: 0x0004 */
  /* 0x002c */ enum DISPLAYCONFIG_SCANLINE_ORDERING scanLineOrdering;
}; /* size: 0x0030 */

struct DISPLAYCONFIG_TARGET_MODE
{
  /* 0x0000 */ struct DISPLAYCONFIG_VIDEO_SIGNAL_INFO targetVideoSignalInfo;
}; /* size: 0x0030 */

struct DISPLAYCONFIG_TARGET_PREFERRED_MODE
{
  /* 0x0000 */ struct DISPLAYCONFIG_DEVICE_INFO_HEADER header;
  /* 0x0014 */ unsigned int width;
  /* 0x0018 */ unsigned int height;
  /* 0x001c */ long Padding_19;
  /* 0x0020 */ struct DISPLAYCONFIG_TARGET_MODE targetMode;
}; /* size: 0x0050 */

class CLimitedWritableStream::CopyTo::__l9::<lambda_698b4fc02dafd45f37536ae60dcd6711>
{
  /* 0x0000 */ class CLimitedWritableStream* __this;
  /* 0x0004 */ class Microsoft::WRL::ComPtr<IStream>& spOuter;
  /* 0x0008 */ union _ULARGE_INTEGER& cb;
  /* 0x000c */ union _ULARGE_INTEGER*& pcbRead;
  /* 0x0010 */ union _ULARGE_INTEGER*& pcbWritten;
}; /* size: 0x0014 */

typedef enum _TAG_UNNAMED_10
{
  Minimal = 0,
  Normal = 128,
  MaximallyVerbose = 255,
} TAG_UNNAMED_10, *PTAG_UNNAMED_10;

typedef struct _COAUTHINFO
{
  /* 0x0000 */ unsigned long dwAuthnSvc;
  /* 0x0004 */ unsigned long dwAuthzSvc;
  /* 0x0008 */ wchar_t* pwszServerPrincName;
  /* 0x000c */ unsigned long dwAuthnLevel;
  /* 0x0010 */ unsigned long dwImpersonationLevel;
  /* 0x0014 */ struct _COAUTHIDENTITY* pAuthIdentityData;
  /* 0x0018 */ unsigned long dwCapabilities;
} COAUTHINFO, *PCOAUTHINFO; /* size: 0x001c */

class CPointerHashTable
{
}; /* size: 0x0018 */

typedef struct _IO_STATUS_BLOCK
{
  union
  {
    /* 0x0000 */ long Status;
    /* 0x0000 */ void* Pointer;
  }; /* size: 0x0004 */
  /* 0x0004 */ unsigned long Information;
} IO_STATUS_BLOCK, *PIO_STATUS_BLOCK; /* size: 0x0008 */

typedef struct _FILE_IO_COMPLETION_INFORMATION
{
  /* 0x0000 */ void* KeyContext;
  /* 0x0004 */ void* ApcContext;
  /* 0x0008 */ struct _IO_STATUS_BLOCK IoStatusBlock;
} FILE_IO_COMPLETION_INFORMATION, *PFILE_IO_COMPLETION_INFORMATION; /* size: 0x0010 */

typedef struct _IMAGE_BOUND_IMPORT_DESCRIPTOR
{
  /* 0x0000 */ unsigned long TimeDateStamp;
  /* 0x0004 */ unsigned short OffsetModuleName;
  /* 0x0006 */ unsigned short NumberOfModuleForwarderRefs;
} IMAGE_BOUND_IMPORT_DESCRIPTOR, *PIMAGE_BOUND_IMPORT_DESCRIPTOR; /* size: 0x0008 */

enum tagFUNCFLAGS
{
  FUNCFLAG_FRESTRICTED = 1,
  FUNCFLAG_FSOURCE = 2,
  FUNCFLAG_FBINDABLE = 4,
  FUNCFLAG_FREQUESTEDIT = 8,
  FUNCFLAG_FDISPLAYBIND = 16,
  FUNCFLAG_FDEFAULTBIND = 32,
  FUNCFLAG_FHIDDEN = 64,
  FUNCFLAG_FUSESGETLASTERROR = 128,
  FUNCFLAG_FDEFAULTCOLLELEM = 256,
  FUNCFLAG_FUIDEFAULT = 512,
  FUNCFLAG_FNONBROWSABLE = 1024,
  FUNCFLAG_FREPLACEABLE = 2048,
  FUNCFLAG_FIMMEDIATEBIND = 4096,
};

struct tagENHMETARECORD
{
  /* 0x0000 */ unsigned long iType;
  /* 0x0004 */ unsigned long nSize;
  /* 0x0008 */ unsigned long dParm[1];
}; /* size: 0x000c */

enum tagOLEMISC
{
  OLEMISC_RECOMPOSEONRESIZE = 1,
  OLEMISC_ONLYICONIC = 2,
  OLEMISC_INSERTNOTREPLACE = 4,
  OLEMISC_STATIC = 8,
  OLEMISC_CANTLINKINSIDE = 16,
  OLEMISC_CANLINKBYOLE1 = 32,
  OLEMISC_ISLINKOBJECT = 64,
  OLEMISC_INSIDEOUT = 128,
  OLEMISC_ACTIVATEWHENVISIBLE = 256,
  OLEMISC_RENDERINGISDEVICEINDEPENDENT = 512,
  OLEMISC_INVISIBLEATRUNTIME = 1024,
  OLEMISC_ALWAYSRUN = 2048,
  OLEMISC_ACTSLIKEBUTTON = 4096,
  OLEMISC_ACTSLIKELABEL = 8192,
  OLEMISC_NOUIACTIVATE = 16384,
  OLEMISC_ALIGNABLE = 0xffff8000,
  OLEMISC_SIMPLEFRAME = 0x10000,
  OLEMISC_SETCLIENTSITEFIRST = 0x20000,
  OLEMISC_IMEMODE = 0x40000,
  OLEMISC_IGNOREACTIVATEWHENVISIBLE = 0x80000,
  OLEMISC_WANTSTOMENUMERGE = 0x100000,
  OLEMISC_SUPPORTSMULTILEVELUNDO = 0x200000,
};

typedef struct _PHYSICAL_CHANNEL_RUN
{
  /* 0x0000 */ unsigned long NodeNumber;
  /* 0x0004 */ unsigned long ChannelNumber;
  /* 0x0008 */ unsigned __int64 BasePage;
  /* 0x0010 */ unsigned __int64 PageCount;
  /* 0x0018 */ unsigned long Flags;
  /* 0x001c */ long __PADDING__[1];
} PHYSICAL_CHANNEL_RUN, *PPHYSICAL_CHANNEL_RUN; /* size: 0x0020 */

typedef struct _SYSTEM_MEMORY_TOPOLOGY_INFORMATION
{
  /* 0x0000 */ unsigned __int64 NumberOfRuns;
  /* 0x0008 */ unsigned long NumberOfNodes;
  /* 0x000c */ unsigned long NumberOfChannels;
  /* 0x0010 */ struct _PHYSICAL_CHANNEL_RUN Run[1];
} SYSTEM_MEMORY_TOPOLOGY_INFORMATION, *PSYSTEM_MEMORY_TOPOLOGY_INFORMATION; /* size: 0x0030 */

typedef enum _TAG_UNNAMED_11
{
  value = 0,
} TAG_UNNAMED_11, *PTAG_UNNAMED_11;

typedef struct _APPCATEGORYINFO
{
  /* 0x0000 */ unsigned long Locale;
  /* 0x0004 */ wchar_t* pszDescription;
  /* 0x0008 */ struct _GUID AppCategoryId;
} APPCATEGORYINFO, *PAPPCATEGORYINFO; /* size: 0x0018 */

typedef enum _THREAD_UMS_INFORMATION_COMMAND
{
  UmsInformationCommandInvalid = 0,
  UmsInformationCommandAttach = 1,
  UmsInformationCommandDetach = 2,
  UmsInformationCommandQuery = 3,
} THREAD_UMS_INFORMATION_COMMAND, *PTHREAD_UMS_INFORMATION_COMMAND;

struct IOleInPlaceUIWindow
{
}; /* size: 0x0004 */

enum tagCALLCATEGORY
{
  CALLCAT_NOCALL = 0,
  CALLCAT_SYNCHRONOUS = 1,
  CALLCAT_ASYNC = 2,
  CALLCAT_INPUTSYNC = 3,
  CALLCAT_INTERNALSYNC = 4,
  CALLCAT_INTERNALINPUTSYNC = 5,
  CALLCAT_SCMCALL = 6,
};

typedef struct _TEB_ACTIVE_FRAME
{
  /* 0x0000 */ unsigned long Flags;
  /* 0x0004 */ struct _TEB_ACTIVE_FRAME* Previous;
  /* 0x0008 */ const struct _TEB_ACTIVE_FRAME_CONTEXT* Context;
} TEB_ACTIVE_FRAME, *PTEB_ACTIVE_FRAME; /* size: 0x000c */

typedef enum _TAG_UNNAMED_12
{
  value = 0,
} TAG_UNNAMED_12, *PTAG_UNNAMED_12;

class CArrayFValue
{
  /* 0x0000 */ unsigned char* m_pData;
  /* 0x0004 */ unsigned int m_cbValue;
  /* 0x0008 */ int m_nSize;
  /* 0x000c */ int m_nMaxSize;
  /* 0x0010 */ int m_nGrowBy;
}; /* size: 0x0014 */

class CCliRotHintTable
{
  /* 0x0000 */ long Padding_20;
  /* 0x0004 */ void* _hSm;
}; /* size: 0x0008 */

class CRunningObjectTable
{
  /* 0x0000 */ long Padding_21[2];
  /* 0x0008 */ class CArrayFValue _afvRotList;
  /* 0x001c */ class CCliRotHintTable _crht;
  /* 0x0024 */ unsigned short _wSigRotItem;
}; /* size: 0x0028 */

struct PROCESSOR_IDLESTATE_INFO
{
  /* 0x0000 */ unsigned long TimeCheck;
  /* 0x0004 */ unsigned char DemotePercent;
  /* 0x0005 */ unsigned char PromotePercent;
  /* 0x0006 */ unsigned char Spare[2];
}; /* size: 0x0008 */

struct PROCESSOR_IDLESTATE_POLICY
{
  /* 0x0000 */ unsigned short Revision;
  union
  {
    union
    {
      /* 0x0002 */ unsigned short AsUSHORT;
      struct /* bitfield */
      {
        /* 0x0002 */ unsigned short AllowScaling : 1; /* bit position: 0 */
        /* 0x0002 */ unsigned short Disabled : 1; /* bit position: 1 */
        /* 0x0002 */ unsigned short Reserved : 14; /* bit position: 2 */
      }; /* bitfield */
    }; /* size: 0x0002 */
  } /* size: 0x0002 */ Flags;
  /* 0x0004 */ unsigned long PolicyCount;
  /* 0x0008 */ struct PROCESSOR_IDLESTATE_INFO Policy[3];
}; /* size: 0x0020 */

typedef struct _SID_IDENTIFIER_AUTHORITY
{
  /* 0x0000 */ unsigned char Value[6];
} SID_IDENTIFIER_AUTHORITY, *PSID_IDENTIFIER_AUTHORITY; /* size: 0x0006 */

typedef struct _ACTION_HEADER
{
  /* 0x0000 */ unsigned long transport_id;
  /* 0x0004 */ unsigned short action_code;
  /* 0x0006 */ unsigned short reserved;
} ACTION_HEADER, *PACTION_HEADER; /* size: 0x0008 */

enum tagGLOBALOPT_EH_VALUES
{
  COMGLB_EXCEPTION_HANDLE = 0,
  COMGLB_EXCEPTION_DONOT_HANDLE_FATAL = 1,
  COMGLB_EXCEPTION_DONOT_HANDLE = 1,
  COMGLB_EXCEPTION_DONOT_HANDLE_ANY = 2,
};

struct IAdviseSink2
{
}; /* size: 0x0004 */

class Windows::Rtl::StringTraits<_UNICODE_STRING>
{
}; /* size: 0x0001 */

enum tagXMLEMEM_TYPE
{
  XMLELEMTYPE_ELEMENT = 0,
  XMLELEMTYPE_TEXT = 1,
  XMLELEMTYPE_COMMENT = 2,
  XMLELEMTYPE_DOCUMENT = 3,
  XMLELEMTYPE_DTD = 4,
  XMLELEMTYPE_PI = 5,
  XMLELEMTYPE_OTHER = 6,
};

struct PPM_WMI_PERF_STATE
{
  /* 0x0000 */ unsigned long Frequency;
  /* 0x0004 */ unsigned long Power;
  /* 0x0008 */ unsigned char PercentFrequency;
  /* 0x0009 */ unsigned char IncreaseLevel;
  /* 0x000a */ unsigned char DecreaseLevel;
  /* 0x000b */ unsigned char Type;
  /* 0x000c */ unsigned long IncreaseTime;
  /* 0x0010 */ unsigned long DecreaseTime;
  /* 0x0014 */ long Padding_22;
  /* 0x0018 */ unsigned __int64 Control;
  /* 0x0020 */ unsigned __int64 Status;
  /* 0x0028 */ unsigned long HitCount;
  /* 0x002c */ unsigned long Reserved1;
  /* 0x0030 */ unsigned __int64 Reserved2;
  /* 0x0038 */ unsigned __int64 Reserved3;
}; /* size: 0x0040 */

typedef struct _JOB_INFO_4A
{
  /* 0x0000 */ unsigned long JobId;
  /* 0x0004 */ char* pPrinterName;
  /* 0x0008 */ char* pMachineName;
  /* 0x000c */ char* pUserName;
  /* 0x0010 */ char* pDocument;
  /* 0x0014 */ char* pNotifyName;
  /* 0x0018 */ char* pDatatype;
  /* 0x001c */ char* pPrintProcessor;
  /* 0x0020 */ char* pParameters;
  /* 0x0024 */ char* pDriverName;
  /* 0x0028 */ struct _devicemodeA* pDevMode;
  /* 0x002c */ char* pStatus;
  /* 0x0030 */ void* pSecurityDescriptor;
  /* 0x0034 */ unsigned long Status;
  /* 0x0038 */ unsigned long Priority;
  /* 0x003c */ unsigned long Position;
  /* 0x0040 */ unsigned long StartTime;
  /* 0x0044 */ unsigned long UntilTime;
  /* 0x0048 */ unsigned long TotalPages;
  /* 0x004c */ unsigned long Size;
  /* 0x0050 */ struct _SYSTEMTIME Submitted;
  /* 0x0060 */ unsigned long Time;
  /* 0x0064 */ unsigned long PagesPrinted;
  /* 0x0068 */ long SizeHigh;
} JOB_INFO_4A, *PJOB_INFO_4A; /* size: 0x006c */

typedef enum _TAG_UNNAMED_13
{
  value = 1,
} TAG_UNNAMED_13, *PTAG_UNNAMED_13;

struct tagMInterfacePointer
{
  /* 0x0000 */ unsigned long ulCntData;
  /* 0x0004 */ unsigned char abData[1];
  /* 0x0005 */ char __PADDING__[3];
}; /* size: 0x0008 */

typedef enum _MEMORY_INFORMATION_CLASS
{
  MemoryBasicInformation = 0,
  MemoryWorkingSetInformation = 1,
  MemoryMappedFilenameInformation = 2,
  MemoryRegionInformation = 3,
  MemoryWorkingSetExInformation = 4,
  MemorySharedCommitInformation = 5,
} MEMORY_INFORMATION_CLASS, *PMEMORY_INFORMATION_CLASS;

typedef struct _wfinddata32_t
{
  /* 0x0000 */ unsigned int attrib;
  /* 0x0004 */ long time_create;
  /* 0x0008 */ long time_access;
  /* 0x000c */ long time_write;
  /* 0x0010 */ unsigned long size;
  /* 0x0014 */ wchar_t name[260];
} wfinddata32_t, *Pwfinddata32_t; /* size: 0x021c */

typedef struct _COMMPROP
{
  /* 0x0000 */ unsigned short wPacketLength;
  /* 0x0002 */ unsigned short wPacketVersion;
  /* 0x0004 */ unsigned long dwServiceMask;
  /* 0x0008 */ unsigned long dwReserved1;
  /* 0x000c */ unsigned long dwMaxTxQueue;
  /* 0x0010 */ unsigned long dwMaxRxQueue;
  /* 0x0014 */ unsigned long dwMaxBaud;
  /* 0x0018 */ unsigned long dwProvSubType;
  /* 0x001c */ unsigned long dwProvCapabilities;
  /* 0x0020 */ unsigned long dwSettableParams;
  /* 0x0024 */ unsigned long dwSettableBaud;
  /* 0x0028 */ unsigned short wSettableData;
  /* 0x002a */ unsigned short wSettableStopParity;
  /* 0x002c */ unsigned long dwCurrentTxQueue;
  /* 0x0030 */ unsigned long dwCurrentRxQueue;
  /* 0x0034 */ unsigned long dwProvSpec1;
  /* 0x0038 */ unsigned long dwProvSpec2;
  /* 0x003c */ wchar_t wcProvChar[1];
  /* 0x003e */ char __PADDING__[2];
} COMMPROP, *PCOMMPROP; /* size: 0x0040 */

typedef struct _OLESTREAM
{
  /* 0x0000 */ struct _OLESTREAMVTBL* lpstbl;
} OLESTREAM, *POLESTREAM; /* size: 0x0004 */

typedef struct _BCRYPT_INTERFACE_VERSION
{
  /* 0x0000 */ unsigned short MajorVersion;
  /* 0x0002 */ unsigned short MinorVersion;
} BCRYPT_INTERFACE_VERSION, *PBCRYPT_INTERFACE_VERSION; /* size: 0x0004 */

struct linger
{
  /* 0x0000 */ unsigned short l_onoff;
  /* 0x0002 */ unsigned short l_linger;
}; /* size: 0x0004 */

typedef enum _tagPI_FLAGS
{
  PI_PARSE_URL = 1,
  PI_FILTER_MODE = 2,
  PI_FORCE_ASYNC = 4,
  PI_USE_WORKERTHREAD = 8,
  PI_MIMEVERIFICATION = 16,
  PI_CLSIDLOOKUP = 32,
  PI_DATAPROGRESS = 64,
  PI_SYNCHRONOUS = 128,
  PI_APARTMENTTHREADED = 256,
  PI_CLASSINSTALL = 512,
  PI_PASSONBINDCTX = 8192,
  PI_NOMIMEHANDLER = 0xffff8000,
  PI_LOADAPPDIRECT = 16384,
  PD_FORCE_SWITCH = 0x10000,
  PI_PREFERDEFAULTHANDLER = 0x20000,
} tagPI_FLAGS, *PtagPI_FLAGS;

typedef struct _KEY_NODE_INFORMATION
{
  /* 0x0000 */ union _LARGE_INTEGER LastWriteTime;
  /* 0x0008 */ unsigned long TitleIndex;
  /* 0x000c */ unsigned long ClassOffset;
  /* 0x0010 */ unsigned long ClassLength;
  /* 0x0014 */ unsigned long NameLength;
  /* 0x0018 */ wchar_t Name[1];
  /* 0x001a */ char __PADDING__[6];
} KEY_NODE_INFORMATION, *PKEY_NODE_INFORMATION; /* size: 0x0020 */

enum PO_WAKE_SOURCE_TYPE
{
  DeviceWakeSourceType = 0,
  FixedWakeSourceType = 1,
  TimerWakeSourceType = 2,
};

typedef struct _PO_WAKE_SOURCE_HEADER
{
  /* 0x0000 */ enum PO_WAKE_SOURCE_TYPE Type;
  /* 0x0004 */ unsigned long Size;
} PO_WAKE_SOURCE_HEADER, *PPO_WAKE_SOURCE_HEADER; /* size: 0x0008 */

typedef enum _REQUESTER_TYPE
{
  KernelRequester = 0,
  UserProcessRequester = 1,
  UserSharedServiceRequester = 2,
} REQUESTER_TYPE, *PREQUESTER_TYPE;

typedef struct _DIAGNOSTIC_BUFFER
{
  /* 0x0000 */ unsigned long Size;
  /* 0x0004 */ enum _REQUESTER_TYPE CallerType;
  union
  {
    struct
    {
      /* 0x0008 */ unsigned long ProcessImageNameOffset;
      /* 0x000c */ unsigned long ProcessId;
      /* 0x0010 */ unsigned long ServiceTag;
    }; /* size: 0x000c */
    struct
    {
      /* 0x0008 */ unsigned long DeviceDescriptionOffset;
      /* 0x000c */ unsigned long DevicePathOffset;
    }; /* size: 0x0008 */
  }; /* size: 0x000c */
  /* 0x0014 */ unsigned long ReasonOffset;
} DIAGNOSTIC_BUFFER, *PDIAGNOSTIC_BUFFER; /* size: 0x0018 */

typedef struct _PO_WAKE_SOURCE_TIMER
{
  /* 0x0000 */ struct _PO_WAKE_SOURCE_HEADER Header;
  /* 0x0008 */ struct _DIAGNOSTIC_BUFFER Reason;
} PO_WAKE_SOURCE_TIMER, *PPO_WAKE_SOURCE_TIMER; /* size: 0x0020 */

typedef enum _TAG_UNNAMED_14
{
  value = 1,
} TAG_UNNAMED_14, *PTAG_UNNAMED_14;

typedef struct _EXCEPTION_REGISTRATION_RECORD
{
  /* 0x0000 */ struct _EXCEPTION_REGISTRATION_RECORD* Next;
  /* 0x0004 */ void* Handler /* function */;
} EXCEPTION_REGISTRATION_RECORD, *PEXCEPTION_REGISTRATION_RECORD; /* size: 0x0008 */

typedef struct _CTL_ANY_SUBJECT_INFO
{
  /* 0x0000 */ struct _CRYPT_ALGORITHM_IDENTIFIER SubjectAlgorithm;
  /* 0x000c */ struct _CRYPTOAPI_BLOB SubjectIdentifier;
} CTL_ANY_SUBJECT_INFO, *PCTL_ANY_SUBJECT_INFO; /* size: 0x0014 */

typedef enum _SECTION_INFORMATION_CLASS
{
  SectionBasicInformation = 0,
  SectionImageInformation = 1,
  SectionRelocationInformation = 2,
  MaxSectionInfoClass = 3,
} SECTION_INFORMATION_CLASS, *PSECTION_INFORMATION_CLASS;

struct IAbandonmentNotification
{
}; /* size: 0x0004 */

enum IMPORT_OBJECT_NAME_TYPE
{
  IMPORT_OBJECT_ORDINAL = 0,
  IMPORT_OBJECT_NAME = 1,
  IMPORT_OBJECT_NAME_NO_PREFIX = 2,
  IMPORT_OBJECT_NAME_UNDECORATE = 3,
};

typedef struct _BIDI_DATA
{
  /* 0x0000 */ unsigned long dwBidiType;
  union
  {
    union
    {
      /* 0x0004 */ int bData;
      /* 0x0004 */ long iData;
      /* 0x0004 */ wchar_t* sData;
      /* 0x0004 */ float fData;
      /* 0x0004 */ struct _BINARY_CONTAINER biData;
    }; /* size: 0x0008 */
  } /* size: 0x0008 */ u;
} BIDI_DATA, *PBIDI_DATA; /* size: 0x000c */

typedef struct _BIDI_REQUEST_DATA
{
  /* 0x0000 */ unsigned long dwReqNumber;
  /* 0x0004 */ wchar_t* pSchema;
  /* 0x0008 */ struct _BIDI_DATA data;
} BIDI_REQUEST_DATA, *PBIDI_REQUEST_DATA; /* size: 0x0014 */

typedef enum _STORAGE_ID_NAA_FORMAT
{
  StorageIdNAAFormatIEEEExtended = 2,
  StorageIdNAAFormatIEEERegistered = 3,
  StorageIdNAAFormatIEEEERegisteredExtended = 5,
} STORAGE_ID_NAA_FORMAT, *PSTORAGE_ID_NAA_FORMAT;

typedef struct _OCSP_CERT_ID
{
  /* 0x0000 */ struct _CRYPT_ALGORITHM_IDENTIFIER HashAlgorithm;
  /* 0x000c */ struct _CRYPTOAPI_BLOB IssuerNameHash;
  /* 0x0014 */ struct _CRYPTOAPI_BLOB IssuerKeyHash;
  /* 0x001c */ struct _CRYPTOAPI_BLOB SerialNumber;
} OCSP_CERT_ID, *POCSP_CERT_ID; /* size: 0x0024 */

typedef struct _FILETIME
{
  /* 0x0000 */ unsigned long dwLowDateTime;
  /* 0x0004 */ unsigned long dwHighDateTime;
} FILETIME, *PFILETIME; /* size: 0x0008 */

typedef struct _OCSP_BASIC_RESPONSE_ENTRY
{
  /* 0x0000 */ struct _OCSP_CERT_ID CertId;
  /* 0x0024 */ unsigned long dwCertStatus;
  /* 0x0028 */ struct _OCSP_BASIC_REVOKED_INFO* pRevokedInfo;
  /* 0x002c */ struct _FILETIME ThisUpdate;
  /* 0x0034 */ struct _FILETIME NextUpdate;
  /* 0x003c */ unsigned long cExtension;
  /* 0x0040 */ struct _CERT_EXTENSION* rgExtension;
} OCSP_BASIC_RESPONSE_ENTRY, *POCSP_BASIC_RESPONSE_ENTRY; /* size: 0x0044 */

enum XLAT_SIDE
{
  XLAT_SERVER = 1,
  XLAT_CLIENT = 2,
};

typedef struct _RTL_HEAP_TAG_INFO
{
  /* 0x0000 */ unsigned long NumberOfAllocations;
  /* 0x0004 */ unsigned long NumberOfFrees;
  /* 0x0008 */ unsigned long BytesAllocated;
} RTL_HEAP_TAG_INFO, *PRTL_HEAP_TAG_INFO; /* size: 0x000c */

typedef struct _SID
{
  /* 0x0000 */ unsigned char Revision;
  /* 0x0001 */ unsigned char SubAuthorityCount;
  /* 0x0002 */ struct _SID_IDENTIFIER_AUTHORITY IdentifierAuthority;
  /* 0x0008 */ unsigned long SubAuthority[1];
} SID, *PSID; /* size: 0x000c */

typedef struct _FILE_QUOTA_INFORMATION
{
  /* 0x0000 */ unsigned long NextEntryOffset;
  /* 0x0004 */ unsigned long SidLength;
  /* 0x0008 */ union _LARGE_INTEGER ChangeTime;
  /* 0x0010 */ union _LARGE_INTEGER QuotaUsed;
  /* 0x0018 */ union _LARGE_INTEGER QuotaThreshold;
  /* 0x0020 */ union _LARGE_INTEGER QuotaLimit;
  /* 0x0028 */ struct _SID Sid;
  /* 0x0034 */ long __PADDING__[1];
} FILE_QUOTA_INFORMATION, *PFILE_QUOTA_INFORMATION; /* size: 0x0038 */

struct HTOUCHINPUT__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct IPrintDialogCallback
{
}; /* size: 0x0004 */

typedef enum _DEVICE_POWER_STATE
{
  PowerDeviceUnspecified = 0,
  PowerDeviceD0 = 1,
  PowerDeviceD1 = 2,
  PowerDeviceD2 = 3,
  PowerDeviceD3 = 4,
  PowerDeviceMaximum = 5,
} DEVICE_POWER_STATE, *PDEVICE_POWER_STATE;

typedef struct _tagDATAINFO
{
  /* 0x0000 */ unsigned long ulTotalSize;
  /* 0x0004 */ unsigned long ulavrPacketSize;
  /* 0x0008 */ unsigned long ulConnectSpeed;
  /* 0x000c */ unsigned long ulProcessorSpeed;
} tagDATAINFO, *PtagDATAINFO; /* size: 0x0010 */

typedef enum _TAG_UNNAMED_15
{
  value = 1,
} TAG_UNNAMED_15, *PTAG_UNNAMED_15;

typedef struct _IMAGE_ALPHA64_RUNTIME_FUNCTION_ENTRY
{
  /* 0x0000 */ unsigned __int64 BeginAddress;
  /* 0x0008 */ unsigned __int64 EndAddress;
  /* 0x0010 */ unsigned __int64 ExceptionHandler;
  /* 0x0018 */ unsigned __int64 HandlerData;
  /* 0x0020 */ unsigned __int64 PrologEndAddress;
} IMAGE_ALPHA64_RUNTIME_FUNCTION_ENTRY, *PIMAGE_ALPHA64_RUNTIME_FUNCTION_ENTRY; /* size: 0x0028 */

typedef struct _SYSTEM_PREFETCH_STATS
{
  /* 0x0000 */ unsigned long DemandFilePageCount;
  /* 0x0004 */ unsigned long DemandFileIOCount;
  /* 0x0008 */ unsigned long TrickleFilePageCount;
  /* 0x000c */ unsigned long TrickleFileIOCount;
  /* 0x0010 */ unsigned long DemandPrivatePageCount;
  /* 0x0014 */ unsigned long DemandPrivateIOCount;
  /* 0x0018 */ unsigned long TricklePrivatePageCount;
  /* 0x001c */ unsigned long TricklePrivateIOCount;
} SYSTEM_PREFETCH_STATS, *PSYSTEM_PREFETCH_STATS; /* size: 0x0020 */

typedef struct _CRT_DOUBLE
{
  /* 0x0000 */ double x;
} CRT_DOUBLE, *PCRT_DOUBLE; /* size: 0x0008 */

struct IInternetSecurityManagerEx2
{
}; /* size: 0x0004 */

struct IUriBuilderFactory
{
}; /* size: 0x0004 */

typedef enum _TRANSACTIONMANAGER_INFORMATION_CLASS
{
  TransactionManagerBasicInformation = 0,
  TransactionManagerLogInformation = 1,
  TransactionManagerLogPathInformation = 2,
  TransactionManagerRecoveryInformation = 4,
  TransactionManagerOnlineProbeInformation = 3,
  TransactionManagerOldestTransactionInformation = 5,
} TRANSACTIONMANAGER_INFORMATION_CLASS, *PTRANSACTIONMANAGER_INFORMATION_CLASS;

typedef enum _TAG_UNNAMED_16
{
  LdrpNoDevice = 0,
  LdrpWebDAV = 1,
  LdrpRemote = 2,
  LdrpAnyDevice = -1,
  LdrpAnyDevice2bit = 3,
} TAG_UNNAMED_16, *PTAG_UNNAMED_16;

typedef struct _DOCINFOA
{
  /* 0x0000 */ int cbSize;
  /* 0x0004 */ const char* lpszDocName;
  /* 0x0008 */ const char* lpszOutput;
  /* 0x000c */ const char* lpszDatatype;
  /* 0x0010 */ unsigned long fwType;
} DOCINFOA, *PDOCINFOA; /* size: 0x0014 */

struct PPM_IDLE_STATE_BUCKET_EX
{
  /* 0x0000 */ unsigned __int64 TotalTimeUs;
  /* 0x0008 */ unsigned long MinTimeUs;
  /* 0x000c */ unsigned long MaxTimeUs;
  /* 0x0010 */ unsigned long Count;
  /* 0x0014 */ long __PADDING__[1];
}; /* size: 0x0018 */

struct PPM_IDLE_STATE_ACCOUNTING_EX
{
  /* 0x0000 */ unsigned __int64 TotalTime;
  /* 0x0008 */ unsigned long IdleTransitions;
  /* 0x000c */ unsigned long FailedTransitions;
  /* 0x0010 */ unsigned long InvalidBucketIndex;
  /* 0x0014 */ unsigned long MinTimeUs;
  /* 0x0018 */ unsigned long MaxTimeUs;
  /* 0x001c */ unsigned long CancelledTransitions;
  /* 0x0020 */ struct PPM_IDLE_STATE_BUCKET_EX IdleTimeBuckets[16];
}; /* size: 0x01a0 */

struct PPM_IDLE_ACCOUNTING_EX
{
  /* 0x0000 */ unsigned long StateCount;
  /* 0x0004 */ unsigned long TotalTransitions;
  /* 0x0008 */ unsigned long ResetCount;
  /* 0x000c */ unsigned long AbortCount;
  /* 0x0010 */ unsigned __int64 StartTime;
  /* 0x0018 */ struct PPM_IDLE_STATE_ACCOUNTING_EX State[1];
}; /* size: 0x01b8 */

typedef enum _TAG_UNNAMED_17
{
  value = 1,
} TAG_UNNAMED_17, *PTAG_UNNAMED_17;

typedef struct _PLUGPLAY_CONTROL_PROPERTY_DATA
{
  /* 0x0000 */ struct _UNICODE_STRING DeviceInstance;
  /* 0x0008 */ unsigned long PropertyType;
  /* 0x000c */ void* Buffer;
  /* 0x0010 */ unsigned long BufferSize;
} PLUGPLAY_CONTROL_PROPERTY_DATA, *PPLUGPLAY_CONTROL_PROPERTY_DATA; /* size: 0x0014 */

typedef enum _NT_PRODUCT_TYPE
{
  NtProductWinNt = 1,
  NtProductLanManNt = 2,
  NtProductServer = 3,
} NT_PRODUCT_TYPE, *PNT_PRODUCT_TYPE;

typedef struct _userSTGMEDIUM
{
  /* 0x0000 */ struct IUnknown* pUnkForRelease;
} userSTGMEDIUM, *PuserSTGMEDIUM; /* size: 0x0004 */

typedef struct _userFLAG_STGMEDIUM
{
  /* 0x0000 */ long ContextFlags;
  /* 0x0004 */ long fPassOwnership;
  /* 0x0008 */ struct _userSTGMEDIUM Stgmed;
} userFLAG_STGMEDIUM, *PuserFLAG_STGMEDIUM; /* size: 0x000c */

struct Windows::Rtl::IRtlWOUCSStream
{
}; /* size: 0x0004 */

typedef enum _COPYFILE2_COPY_PHASE
{
  COPYFILE2_PHASE_NONE = 0,
  COPYFILE2_PHASE_PREPARE_SOURCE = 1,
  COPYFILE2_PHASE_PREPARE_DEST = 2,
  COPYFILE2_PHASE_READ_SOURCE = 3,
  COPYFILE2_PHASE_WRITE_DESTINATION = 4,
  COPYFILE2_PHASE_SERVER_COPY = 5,
  COPYFILE2_PHASE_NAMEGRAFT_COPY = 6,
  COPYFILE2_PHASE_MAX = 7,
} COPYFILE2_COPY_PHASE, *PCOPYFILE2_COPY_PHASE;

typedef enum _STORAGE_IDENTIFIER_CODE_SET
{
  StorageIdCodeSetReserved = 0,
  StorageIdCodeSetBinary = 1,
  StorageIdCodeSetAscii = 2,
  StorageIdCodeSetUtf8 = 3,
} STORAGE_IDENTIFIER_CODE_SET, *PSTORAGE_IDENTIFIER_CODE_SET;

struct Windows::Foundation::IReference_impl<unsigned char>
{
}; /* size: 0x0004 */

typedef struct _THREAD_TLS_INFORMATION
{
  /* 0x0000 */ unsigned long Flags;
  union
  {
    /* 0x0004 */ void* NewTlsData;
    /* 0x0004 */ void* OldTlsData;
  }; /* size: 0x0004 */
  /* 0x0008 */ void* ThreadId;
} THREAD_TLS_INFORMATION, *PTHREAD_TLS_INFORMATION; /* size: 0x000c */

typedef struct _PROCESS_TLS_INFORMATION
{
  /* 0x0000 */ unsigned long Flags;
  /* 0x0004 */ unsigned long OperationType;
  /* 0x0008 */ unsigned long ThreadDataCount;
  union
  {
    /* 0x000c */ unsigned long TlsIndex;
    /* 0x000c */ unsigned long PreviousCount;
  }; /* size: 0x0004 */
  /* 0x0010 */ struct _THREAD_TLS_INFORMATION ThreadData[1];
} PROCESS_TLS_INFORMATION, *PPROCESS_TLS_INFORMATION; /* size: 0x001c */

struct PPM_PERFSTATE_EVENT
{
  /* 0x0000 */ unsigned long State;
  /* 0x0004 */ unsigned long Status;
  /* 0x0008 */ unsigned long Latency;
  /* 0x000c */ unsigned long Speed;
  /* 0x0010 */ unsigned long Processor;
}; /* size: 0x0014 */

typedef enum __MIDL_IBindStatusCallback_0003
{
  BINDF_ASYNCHRONOUS = 1,
  BINDF_ASYNCSTORAGE = 2,
  BINDF_NOPROGRESSIVERENDERING = 4,
  BINDF_OFFLINEOPERATION = 8,
  BINDF_GETNEWESTVERSION = 16,
  BINDF_NOWRITECACHE = 32,
  BINDF_NEEDFILE = 64,
  BINDF_PULLDATA = 128,
  BINDF_IGNORESECURITYPROBLEM = 256,
  BINDF_RESYNCHRONIZE = 512,
  BINDF_HYPERLINK = 1024,
  BINDF_NO_UI = 2048,
  BINDF_SILENTOPERATION = 4096,
  BINDF_PRAGMA_NO_CACHE = 8192,
  BINDF_GETCLASSOBJECT = 16384,
  BINDF_RESERVED_1 = 0xffff8000,
  BINDF_FREE_THREADED = 0x10000,
  BINDF_DIRECT_READ = 0x20000,
  BINDF_FORMS_SUBMIT = 0x40000,
  BINDF_GETFROMCACHE_IF_NET_FAIL = 0x80000,
  BINDF_FROMURLMON = 0x100000,
  BINDF_FWD_BACK = 0x200000,
  BINDF_PREFERDEFAULTHANDLER = 0x400000,
  BINDF_ENFORCERESTRICTED = 0x800000,
  BINDF_RESERVED_2 = -2147483648,
  BINDF_RESERVED_3 = 0x1000000,
  BINDF_RESERVED_4 = 0x2000000,
  BINDF_RESERVED_5 = 0x4000000,
  BINDF_RESERVED_6 = 0x8000000,
  BINDF_RESERVED_7 = 0x40000000,
  BINDF_RESERVED_8 = 0x20000000,
} _MIDL_IBindStatusCallback_0003, *P_MIDL_IBindStatusCallback_0003;

typedef struct _RPC_BINDING_HANDLE_TEMPLATE_V1_W
{
  /* 0x0000 */ unsigned long Version;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ unsigned long ProtocolSequence;
  /* 0x000c */ unsigned short* NetworkAddress;
  /* 0x0010 */ unsigned short* StringEndpoint;
  union
  {
    /* 0x0014 */ unsigned short* Reserved;
  } /* size: 0x0004 */ u1;
  /* 0x0018 */ struct _GUID ObjectUuid;
} RPC_BINDING_HANDLE_TEMPLATE_V1_W, *PRPC_BINDING_HANDLE_TEMPLATE_V1_W; /* size: 0x0028 */

struct tagPDEXW
{
  /* 0x0000 */ unsigned long lStructSize;
  /* 0x0004 */ struct HWND__* hwndOwner;
  /* 0x0008 */ void* hDevMode;
  /* 0x000c */ void* hDevNames;
  /* 0x0010 */ struct HDC__* hDC;
  /* 0x0014 */ unsigned long Flags;
  /* 0x0018 */ unsigned long Flags2;
  /* 0x001c */ unsigned long ExclusionFlags;
  /* 0x0020 */ unsigned long nPageRanges;
  /* 0x0024 */ unsigned long nMaxPageRanges;
  /* 0x0028 */ struct tagPRINTPAGERANGE* lpPageRanges;
  /* 0x002c */ unsigned long nMinPage;
  /* 0x0030 */ unsigned long nMaxPage;
  /* 0x0034 */ unsigned long nCopies;
  /* 0x0038 */ struct HINSTANCE__* hInstance;
  /* 0x003c */ const wchar_t* lpPrintTemplateName;
  /* 0x0040 */ struct IUnknown* lpCallback;
  /* 0x0044 */ unsigned long nPropertyPages;
  /* 0x0048 */ struct _PSP** lphPropertyPages;
  /* 0x004c */ unsigned long nStartPage;
  /* 0x0050 */ unsigned long dwResultAction;
}; /* size: 0x0054 */

typedef enum _RTL_GENERIC_COMPARE_RESULTS
{
  GenericLessThan = 0,
  GenericGreaterThan = 1,
  GenericEqual = 2,
} RTL_GENERIC_COMPARE_RESULTS, *PRTL_GENERIC_COMPARE_RESULTS;

struct tagMOUSEHOOKSTRUCT
{
  /* 0x0000 */ struct tagPOINT pt;
  /* 0x0008 */ struct HWND__* hwnd;
  /* 0x000c */ unsigned int wHitTestCode;
  /* 0x0010 */ unsigned long dwExtraInfo;
}; /* size: 0x0014 */

struct IStackWalkerStack
{
}; /* size: 0x0004 */

typedef enum _DEVICEDUMP_COLLECTION_TYPE
{
  TCCollectionBugCheck = 1,
  TCCollectionApplicationRequested = 2,
  TCCollectionDeviceRequested = 3,
} DEVICEDUMP_COLLECTION_TYPE, *PDEVICEDUMP_COLLECTION_TYPE;

typedef struct _IMAGE_EXPORT_DIRECTORY
{
  /* 0x0000 */ unsigned long Characteristics;
  /* 0x0004 */ unsigned long TimeDateStamp;
  /* 0x0008 */ unsigned short MajorVersion;
  /* 0x000a */ unsigned short MinorVersion;
  /* 0x000c */ unsigned long Name;
  /* 0x0010 */ unsigned long Base;
  /* 0x0014 */ unsigned long NumberOfFunctions;
  /* 0x0018 */ unsigned long NumberOfNames;
  /* 0x001c */ unsigned long AddressOfFunctions;
  /* 0x0020 */ unsigned long AddressOfNames;
  /* 0x0024 */ unsigned long AddressOfNameOrdinals;
} IMAGE_EXPORT_DIRECTORY, *PIMAGE_EXPORT_DIRECTORY; /* size: 0x0028 */

class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<CBrokeredClipDataObject> >;

typedef enum _CSV_CONTROL_OP
{
  CsvControlStartRedirectFile = 2,
  CsvControlStopRedirectFile = 3,
  CsvControlQueryRedirectState = 4,
  CsvControlQueryFileRevision = 6,
  CsvControlQueryMdsPath = 8,
  CsvControlQueryFileRevisionFileId128 = 9,
  CsvControlQueryVolumeRedirectState = 10,
  CsvControlEnableUSNRangeModificationTracking = 13,
  CsvControlMarkHandleLocalVolumeMount = 14,
  CsvControlUnmarkHandleLocalVolumeMount = 15,
} CSV_CONTROL_OP, *PCSV_CONTROL_OP;

class Windows::AutoOperatorAmpersandHelper<Windows::Rtl::IRtlWOFOStream *,Windows::Auto<Windows::Rtl::IRtlWOFOStream *> >;

enum tagCOWAIT_FLAGS
{
  COWAIT_DEFAULT = 0,
  COWAIT_WAITALL = 1,
  COWAIT_ALERTABLE = 2,
  COWAIT_INPUTAVAILABLE = 4,
  COWAIT_DISPATCH_CALLS = 8,
  COWAIT_DISPATCH_WINDOW_MESSAGES = 16,
};

struct DLL_INSTANTIATION_PROPERTIES
{
  /* 0x0000 */ wchar_t _pzDllPath[261];
  /* 0x020a */ char Padding_23[2];
  /* 0x020c */ unsigned long _dwThreadingModel;
  /* 0x0210 */ unsigned long _dwFlags;
  /* 0x0214 */ unsigned long _dwHash;
  /* 0x0218 */ unsigned long _dwContext;
  /* 0x021c */ struct
  {
  } /* size: 0x0001 */* _dllClass;
}; /* size: 0x0220 */

typedef enum _MEDIA_TYPE
{
  Unknown = 0,
  F5_1Pt2_512 = 1,
  F3_1Pt44_512 = 2,
  F3_2Pt88_512 = 3,
  F3_20Pt8_512 = 4,
  F3_720_512 = 5,
  F5_360_512 = 6,
  F5_320_512 = 7,
  F5_320_1024 = 8,
  F5_180_512 = 9,
  F5_160_512 = 10,
  RemovableMedia = 11,
  FixedMedia = 12,
  F3_120M_512 = 13,
  F3_640_512 = 14,
  F5_640_512 = 15,
  F5_720_512 = 16,
  F3_1Pt2_512 = 17,
  F3_1Pt23_1024 = 18,
  F5_1Pt23_1024 = 19,
  F3_128Mb_512 = 20,
  F3_230Mb_512 = 21,
  F8_256_128 = 22,
  F3_200Mb_512 = 23,
  F3_240M_512 = 24,
  F3_32M_512 = 25,
} MEDIA_TYPE, *PMEDIA_TYPE;

typedef struct _SCOPE_TABLE_AMD64
{
  /* 0x0000 */ unsigned long Count;
  /* 0x0004 */ struct
  {
    /* 0x0004 */ unsigned long BeginAddress;
    /* 0x0008 */ unsigned long EndAddress;
    /* 0x000c */ unsigned long HandlerAddress;
    /* 0x0010 */ unsigned long JumpTarget;
  } /* size: 0x0010 */ ScopeRecord[1];
} SCOPE_TABLE_AMD64, *PSCOPE_TABLE_AMD64; /* size: 0x0014 */

typedef struct _PUBKEY
{
  /* 0x0000 */ unsigned long magic;
  /* 0x0004 */ unsigned long bitlen;
} PUBKEY, *PPUBKEY; /* size: 0x0008 */

struct Windows::Foundation::IReferenceArray<IInspectable *>
{
}; /* size: 0x0004 */

typedef struct _MINIDUMP_FUNCTION_TABLE_STREAM
{
  /* 0x0000 */ unsigned int SizeOfHeader;
  /* 0x0004 */ unsigned int SizeOfDescriptor;
  /* 0x0008 */ unsigned int SizeOfNativeDescriptor;
  /* 0x000c */ unsigned int SizeOfFunctionEntry;
  /* 0x0010 */ unsigned int NumberOfDescriptors;
  /* 0x0014 */ unsigned int SizeOfAlignPad;
} MINIDUMP_FUNCTION_TABLE_STREAM, *PMINIDUMP_FUNCTION_TABLE_STREAM; /* size: 0x0018 */

struct ISurrogate
{
}; /* size: 0x0004 */

struct Microsoft::WRL::Details::FactoryCache
{
  /* 0x0000 */ struct IUnknown* factory;
  union
  {
    union
    {
      /* 0x0004 */ struct
      {
      } /* size: 0x0001 */* winrt;
      /* 0x0004 */ unsigned long com;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ cookie;
}; /* size: 0x0008 */

typedef enum __MIDL_IBindStatusCallbackEx_0001
{
  BINDF2_DISABLEBASICOVERHTTP = 1,
  BINDF2_DISABLEAUTOCOOKIEHANDLING = 2,
  BINDF2_READ_DATA_GREATER_THAN_4GB = 4,
  BINDF2_DISABLE_HTTP_REDIRECT_XSECURITYID = 8,
  BINDF2_SETDOWNLOADMODE = 32,
  BINDF2_DISABLE_HTTP_REDIRECT_CACHING = 64,
  BINDF2_KEEP_CALLBACK_MODULE_LOADED = 128,
  BINDF2_ALLOW_PROXY_CRED_PROMPT = 256,
  BINDF2_RESERVED_14 = 4096,
  BINDF2_RESERVED_13 = 8192,
  BINDF2_RESERVED_12 = 16384,
  BINDF2_RESERVED_11 = 0xffff8000,
  BINDF2_RESERVED_10 = 0x10000,
  BINDF2_RESERVED_F = 0x20000,
  BINDF2_RESERVED_E = 0x40000,
  BINDF2_RESERVED_D = 0x80000,
  BINDF2_RESERVED_C = 0x100000,
  BINDF2_RESERVED_B = 0x200000,
  BINDF2_RESERVED_A = 0x400000,
  BINDF2_RESERVED_9 = 0x800000,
  BINDF2_RESERVED_8 = 0x1000000,
  BINDF2_RESERVED_7 = 0x2000000,
  BINDF2_RESERVED_6 = 0x4000000,
  BINDF2_RESERVED_5 = 0x8000000,
  BINDF2_RESERVED_4 = 0x10000000,
  BINDF2_RESERVED_3 = 0x20000000,
  BINDF2_RESERVED_2 = 0x40000000,
  BINDF2_RESERVED_1 = -2147483648,
} _MIDL_IBindStatusCallbackEx_0001, *P_MIDL_IBindStatusCallbackEx_0001;

typedef struct _SPC_IMAGE
{
  /* 0x0000 */ struct SPC_LINK_* pImageLink;
  /* 0x0004 */ struct _CRYPTOAPI_BLOB Bitmap;
  /* 0x000c */ struct _CRYPTOAPI_BLOB Metafile;
  /* 0x0014 */ struct _CRYPTOAPI_BLOB EnhancedMetafile;
  /* 0x001c */ struct _CRYPTOAPI_BLOB GifFile;
} SPC_IMAGE, *PSPC_IMAGE; /* size: 0x0024 */

typedef enum _DETECTION_TYPE
{
  DetectNone = 0,
  DetectInt13 = 1,
  DetectExInt13 = 2,
} DETECTION_TYPE, *PDETECTION_TYPE;

typedef struct _CRYPT_ASYNC_RETRIEVAL_COMPLETION
{
  /* 0x0000 */ void* pfnCompletion /* function */;
  /* 0x0004 */ void* pvCompletion;
} CRYPT_ASYNC_RETRIEVAL_COMPLETION, *PCRYPT_ASYNC_RETRIEVAL_COMPLETION; /* size: 0x0008 */

typedef struct _XSAVE_FEATURE
{
  /* 0x0000 */ unsigned long FeatureId;
  /* 0x0004 */ long Padding_24;
  union
  {
    /* 0x0008 */ struct _XSAVE_VENDORS* Vendors;
    /* 0x0008 */ unsigned __int64 Unused;
  }; /* size: 0x0008 */
} XSAVE_FEATURE, *PXSAVE_FEATURE; /* size: 0x0010 */

enum tagDOMNodeType
{
  NODE_INVALID = 0,
  NODE_ELEMENT = 1,
  NODE_ATTRIBUTE = 2,
  NODE_TEXT = 3,
  NODE_CDATA_SECTION = 4,
  NODE_ENTITY_REFERENCE = 5,
  NODE_ENTITY = 6,
  NODE_PROCESSING_INSTRUCTION = 7,
  NODE_COMMENT = 8,
  NODE_DOCUMENT = 9,
  NODE_DOCUMENT_TYPE = 10,
  NODE_DOCUMENT_FRAGMENT = 11,
  NODE_NOTATION = 12,
};

typedef enum _TRANSACTION_INFORMATION_CLASS
{
  TransactionBasicInformation = 0,
  TransactionPropertiesInformation = 1,
  TransactionEnlistmentInformation = 2,
  TransactionSuperiorEnlistmentInformation = 3,
  TransactionBindInformation = 4,
  TransactionDTCPrivateInformation = 5,
} TRANSACTION_INFORMATION_CLASS, *PTRANSACTION_INFORMATION_CLASS;

typedef struct _BLENDFUNCTION
{
  /* 0x0000 */ unsigned char BlendOp;
  /* 0x0001 */ unsigned char BlendFlags;
  /* 0x0002 */ unsigned char SourceConstantAlpha;
  /* 0x0003 */ unsigned char AlphaFormat;
} BLENDFUNCTION, *PBLENDFUNCTION; /* size: 0x0004 */

struct IDataAdviseHolder
{
}; /* size: 0x0004 */

struct PROCESSOR_PERFSTATE_POLICY
{
  /* 0x0000 */ unsigned long Revision;
  /* 0x0004 */ unsigned char MaxThrottle;
  /* 0x0005 */ unsigned char MinThrottle;
  /* 0x0006 */ unsigned char BusyAdjThreshold;
  union
  {
    /* 0x0007 */ unsigned char Spare;
    union
    {
      union
      {
        /* 0x0007 */ unsigned char AsUCHAR;
        struct /* bitfield */
        {
          /* 0x0007 */ unsigned char NoDomainAccounting : 1; /* bit position: 0 */
          /* 0x0007 */ unsigned char IncreasePolicy : 2; /* bit position: 1 */
          /* 0x0007 */ unsigned char DecreasePolicy : 2; /* bit position: 3 */
          /* 0x0007 */ unsigned char Reserved : 3; /* bit position: 5 */
        }; /* bitfield */
      }; /* size: 0x0001 */
    } /* size: 0x0001 */ Flags;
  }; /* size: 0x0001 */
  /* 0x0008 */ unsigned long TimeCheck;
  /* 0x000c */ unsigned long IncreaseTime;
  /* 0x0010 */ unsigned long DecreaseTime;
  /* 0x0014 */ unsigned long IncreasePercent;
  /* 0x0018 */ unsigned long DecreasePercent;
}; /* size: 0x001c */

struct IDropSourceNotify
{
}; /* size: 0x0004 */

enum BIDI_TYPE
{
  BIDI_NULL = 0,
  BIDI_INT = 1,
  BIDI_FLOAT = 2,
  BIDI_BOOL = 3,
  BIDI_STRING = 4,
  BIDI_TEXT = 5,
  BIDI_ENUM = 6,
  BIDI_BLOB = 7,
};

class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<CClipboardBroker> >;

typedef struct _SYSTEM_BIGPOOL_ENTRY
{
  union
  {
    /* 0x0000 */ void* VirtualAddress;
    /* 0x0000 */ unsigned long NonPaged : 1; /* bit position: 0 */
  }; /* size: 0x0004 */
  /* 0x0004 */ unsigned long SizeInBytes;
  union
  {
    /* 0x0008 */ unsigned char Tag[4];
    /* 0x0008 */ unsigned long TagUlong;
  }; /* size: 0x0004 */
} SYSTEM_BIGPOOL_ENTRY, *PSYSTEM_BIGPOOL_ENTRY; /* size: 0x000c */

class CSharedMemoryBlock
{
  /* 0x0000 */ void* _hMem;
  /* 0x0004 */ unsigned char* _pbBase;
  /* 0x0008 */ unsigned long _culCommitSize;
  /* 0x000c */ unsigned long _culInitCommitSize;
  /* 0x0010 */ int _fCreated;
  /* 0x0014 */ int _fReadWrite;
}; /* size: 0x0018 */

typedef struct _DISK_INT13_INFO
{
  /* 0x0000 */ unsigned short DriveSelect;
  /* 0x0002 */ char Padding_25[2];
  /* 0x0004 */ unsigned long MaxCylinders;
  /* 0x0008 */ unsigned short SectorsPerTrack;
  /* 0x000a */ unsigned short MaxHeads;
  /* 0x000c */ unsigned short NumberDrives;
  /* 0x000e */ char __PADDING__[2];
} DISK_INT13_INFO, *PDISK_INT13_INFO; /* size: 0x0010 */

typedef enum _PLUGPLAY_EVENT_CATEGORY
{
  HardwareProfileChangeEvent = 0,
  TargetDeviceChangeEvent = 1,
  DeviceClassChangeEvent = 2,
  CustomDeviceEvent = 3,
  DeviceInstallEvent = 4,
  DeviceArrivalEvent = 5,
  VetoEvent = 6,
  BlockedDriverEvent = 7,
  InvalidIDEvent = 8,
  DevicePropertyChangeEvent = 9,
  DeviceInstanceRemovalEvent = 10,
  DeviceInstanceStartedEvent = 11,
  MaxPlugEventCategory = 12,
} PLUGPLAY_EVENT_CATEGORY, *PPLUGPLAY_EVENT_CATEGORY;

enum tagCALLCONV
{
  CC_FASTCALL = 0,
  CC_CDECL = 1,
  CC_MSCPASCAL = 2,
  CC_PASCAL = 2,
  CC_MACPASCAL = 3,
  CC_STDCALL = 4,
  CC_FPFASTCALL = 5,
  CC_SYSCALL = 6,
  CC_MPWCDECL = 7,
  CC_MPWPASCAL = 8,
  CC_MAX = 9,
};

class CLimitedWritableStorage::SetElementTimes::__l3::<lambda_792e986abe19710efa357a5a0a92856c>
{
  /* 0x0000 */ class CLimitedWritableStorage* __this;
  /* 0x0004 */ const wchar_t*& pwcsName;
  /* 0x0008 */ const struct _FILETIME*& pctime;
  /* 0x000c */ const struct _FILETIME*& patime;
  /* 0x0010 */ const struct _FILETIME*& pmtime;
}; /* size: 0x0014 */

struct Windows::Foundation::Collections::IMapView_impl<HSTRING__ *,IInspectable *>
{
}; /* size: 0x0004 */

enum tagSTATFLAG
{
  STATFLAG_DEFAULT = 0,
  STATFLAG_NONAME = 1,
  STATFLAG_NOOPEN = 2,
};

struct IPicture
{
}; /* size: 0x0004 */

typedef enum _PROCESSOR_CACHE_TYPE
{
  CacheUnified = 0,
  CacheInstruction = 1,
  CacheData = 2,
  CacheTrace = 3,
} PROCESSOR_CACHE_TYPE, *PPROCESSOR_CACHE_TYPE;

typedef struct _CERT_TEMPLATE_EXT
{
  /* 0x0000 */ char* pszObjId;
  /* 0x0004 */ unsigned long dwMajorVersion;
  /* 0x0008 */ int fMinorVersion;
  /* 0x000c */ unsigned long dwMinorVersion;
} CERT_TEMPLATE_EXT, *PCERT_TEMPLATE_EXT; /* size: 0x0010 */

enum ComparisonMethod
{
  ComparisonMethod_Ok = 0,
  ComparisonMethod_CastInt = 1,
  ComparisonMethod_CastInt64 = 2,
  ComparisonMethod_UnsignedT = 3,
  ComparisonMethod_UnsignedU = 4,
};

struct IPSFactoryBuffer
{
}; /* size: 0x0004 */

struct Windows::Foundation::Rect
{
  /* 0x0000 */ float X;
  /* 0x0004 */ float Y;
  /* 0x0008 */ float Width;
  /* 0x000c */ float Height;
}; /* size: 0x0010 */

enum tagRpcCallType
{
  rctInvalid = 0,
  rctNormal = 1,
  rctTraining = 2,
  rctGuaranteed = 3,
};

typedef struct _WIN_TRUST_ACTDATA_CONTEXT_WITH_SUBJECT
{
  /* 0x0000 */ void* hClientToken;
  /* 0x0004 */ struct _GUID* SubjectType;
  /* 0x0008 */ void* Subject;
} WIN_TRUST_ACTDATA_CONTEXT_WITH_SUBJECT, *PWIN_TRUST_ACTDATA_CONTEXT_WITH_SUBJECT; /* size: 0x000c */

typedef struct _KSPIN_LOCK_QUEUE
{
  /* 0x0000 */ struct _KSPIN_LOCK_QUEUE* volatile Next;
  /* 0x0004 */ unsigned long* volatile Lock;
} KSPIN_LOCK_QUEUE, *PKSPIN_LOCK_QUEUE; /* size: 0x0008 */

typedef struct _ENCRYPTION_PROTECTOR_LIST
{
  /* 0x0000 */ unsigned long nProtectors;
  /* 0x0004 */ struct _ENCRYPTION_PROTECTOR** pProtectors;
} ENCRYPTION_PROTECTOR_LIST, *PENCRYPTION_PROTECTOR_LIST; /* size: 0x0008 */

typedef enum _IRQ_DEVICE_POLICY
{
  IrqPolicyMachineDefault = 0,
  IrqPolicyAllCloseProcessors = 1,
  IrqPolicyOneCloseProcessor = 2,
  IrqPolicyAllProcessorsInMachine = 3,
  IrqPolicySpecifiedProcessors = 4,
  IrqPolicySpreadMessagesAcrossAllProcessors = 5,
} IRQ_DEVICE_POLICY, *PIRQ_DEVICE_POLICY;

class CBrokeredClipDataObject::GetCanonicalFormatEtc::__l9::<lambda_127832d9aa71b1be4c4346c114774e0b>
{
  /* 0x0000 */ class CBrokeredClipDataObject* __this;
  /* 0x0004 */ struct tagFORMATETC*& pformatetc;
  /* 0x0008 */ struct tagFORMATETC*& pformatetcOut;
}; /* size: 0x000c */

enum tagOBJFLAGS
{
  OBJFLAGS_LINK = 1,
  OBJFLAGS_DOCUMENT = 2,
  OBJFLAGS_CONVERT = 4,
  OBJFLAGS_CACHEEMPTY = 8,
};

class CMSFHeaderData
{
  /* 0x0000 */ long Padding_26[19];
  /* 0x004c */ unsigned long _sectFat[109];
}; /* size: 0x0200 */

class CMSFHeader
{
  /* 0x0000 */ class CMSFHeaderData _hdr;
  /* 0x0200 */ int _fDirty;
}; /* size: 0x0204 */

typedef struct _ACE_HEADER
{
  /* 0x0000 */ unsigned char AceType;
  /* 0x0001 */ unsigned char AceFlags;
  /* 0x0002 */ unsigned short AceSize;
} ACE_HEADER, *PACE_HEADER; /* size: 0x0004 */

typedef struct _SYSTEM_ALARM_OBJECT_ACE
{
  /* 0x0000 */ struct _ACE_HEADER Header;
  /* 0x0004 */ unsigned long Mask;
  /* 0x0008 */ unsigned long Flags;
  /* 0x000c */ struct _GUID ObjectType;
  /* 0x001c */ struct _GUID InheritedObjectType;
  /* 0x002c */ unsigned long SidStart;
} SYSTEM_ALARM_OBJECT_ACE, *PSYSTEM_ALARM_OBJECT_ACE; /* size: 0x0030 */

typedef enum _KSPIN_LOCK_QUEUE_NUMBER
{
  LockQueueUnusedSpare0 = 0,
  LockQueueExpansionLock = 1,
  LockQueueUnusedSpare2 = 2,
  LockQueueSystemSpaceLock = 3,
  LockQueueVacbLock = 4,
  LockQueueMasterLock = 5,
  LockQueueNonPagedPoolLock = 6,
  LockQueueIoCancelLock = 7,
  LockQueueWorkQueueLock = 8,
  LockQueueIoVpbLock = 9,
  LockQueueIoDatabaseLock = 10,
  LockQueueIoCompletionLock = 11,
  LockQueueNtfsStructLock = 12,
  LockQueueAfdWorkQueueLock = 13,
  LockQueueBcbLock = 14,
  LockQueueMmNonPagedPoolLock = 15,
  LockQueueUnusedSpare16 = 16,
  LockQueueMaximumLock = 17,
} KSPIN_LOCK_QUEUE_NUMBER, *PKSPIN_LOCK_QUEUE_NUMBER;

struct IZoneIdentifier
{
}; /* size: 0x0004 */

enum tagACTIVATION_FLAGS
{
  ACTVFLAGS_NONE = 0,
  ACTVFLAGS_DISABLE_AAA = 2,
  ACTVFLAGS_ACTIVATE_32_BIT_SERVER = 4,
  ACTVFLAGS_ACTIVATE_64_BIT_SERVER = 8,
  ACTVFLAGS_SERVERSIDE_ACTIVATION = 16,
  ACTVFLAGS_NO_FAILURE_LOG = 32,
  ACTVFLAGS_ENABLE_CLOAKING = 64,
  ACTVFLAGS_REG_CATALOG_ONLY = 256,
  ACTVFLAGS_SXS_CATALOG_ONLY = 512,
  ACTVFLAGS_WINRT_LOCAL_SERVER = 1024,
  ACTVFLAGS_WINRT_PER_USER_OK = 2048,
  ACTVFLAGS_ACTIVATE_PSCLSID_FROM_PACKAGE = 4096,
  ACTVFLAGS_APPCONTAINER = 8192,
  ACTVFLAGS_IS_SXS_CLASS = 16384,
  ACTVFLAGS_BACKGROUND_MIXED_ACTIVATION = 0xffff8000,
  ACTVFLAGS_BACKGROUND_PURE_ACTIVATION = 0x10000,
  ACTVFLAGS_BACKGROUND_SYSTEM_ACTIVATION = 0x20000,
  ACTVFLAGS_DESIGNMODE_ACTIVATION = 0x40000,
  ACTVFLAGS_ACTIVATE_AS_IU = 0x80000,
  ACTVFLAGS_ACTIVATE_SHARED_AAP_SERVER = 0x100000,
};

enum CreateStackTraceFlags
{
  CREATESTACKTRACE_ONLYADDRESSES = 1,
};

typedef struct _CRYPT_ENCODE_PARA
{
  /* 0x0000 */ unsigned long cbSize;
  /* 0x0004 */ void* pfnAlloc /* function */;
  /* 0x0008 */ void* pfnFree /* function */;
} CRYPT_ENCODE_PARA, *PCRYPT_ENCODE_PARA; /* size: 0x000c */

typedef enum _TAG_UNNAMED_18
{
  isSigned = 1,
  is64Bit = 0,
  is32Bit = 1,
  is16Bit = 0,
  is8Bit = 0,
  isLT32Bit = 0,
  isLT64Bit = 1,
  isInt8 = 0,
  isUint8 = 0,
  isInt16 = 0,
  isUint16 = 0,
  isInt32 = 1,
  isUint32 = 0,
  isInt64 = 0,
  isUint64 = 0,
  bitCount = 32,
  isBool = 0,
} TAG_UNNAMED_18, *PTAG_UNNAMED_18;

typedef enum _LDR_DDAG_STATE
{
  LdrModulesMerged = -5,
  LdrModulesInitError = -4,
  LdrModulesSnapError = -3,
  LdrModulesUnloaded = -2,
  LdrModulesUnloading = -1,
  LdrModulesPlaceHolder = 0,
  LdrModulesMapping = 1,
  LdrModulesMapped = 2,
  LdrModulesWaitingForDependencies = 3,
  LdrModulesSnapping = 4,
  LdrModulesSnapped = 5,
  LdrModulesCondensed = 6,
  LdrModulesReadyToInit = 7,
  LdrModulesInitializing = 8,
  LdrModulesReadyToRun = 9,
} LDR_DDAG_STATE, *PLDR_DDAG_STATE;

typedef struct _DRAGINFOW
{
  /* 0x0000 */ unsigned int uSize;
  /* 0x0004 */ struct tagPOINT pt;
  /* 0x000c */ int fNC;
  /* 0x0010 */ wchar_t* lpFileList;
  /* 0x0014 */ unsigned long grfKeyState;
} DRAGINFOW, *PDRAGINFOW; /* size: 0x0018 */

class XIStorage
{
  /* 0x0000 */ struct IStorage* _p;
}; /* size: 0x0004 */

enum tagOLETLSFLAGS
{
  OLETLS_LOCALTID = 1,
  OLETLS_UUIDINITIALIZED = 2,
  OLETLS_INTHREADDETACH = 4,
  OLETLS_CHANNELTHREADINITIALZED = 8,
  OLETLS_WOWTHREAD = 16,
  OLETLS_THREADUNINITIALIZING = 32,
  OLETLS_DISABLE_OLE1DDE = 64,
  OLETLS_APARTMENTTHREADED = 128,
  OLETLS_MULTITHREADED = 256,
  OLETLS_IMPERSONATING = 512,
  OLETLS_DISABLE_EVENTLOGGER = 1024,
  OLETLS_INNEUTRALAPT = 2048,
  OLETLS_DISPATCHTHREAD = 4096,
  OLETLS_HOSTTHREAD = 8192,
  OLETLS_ALLOWCOINIT = 16384,
  OLETLS_PENDINGUNINIT = 0xffff8000,
  OLETLS_FIRSTMTAINIT = 0x10000,
  OLETLS_FIRSTNTAINIT = 0x20000,
  OLETLS_APTINITIALIZING = 0x40000,
  OLETLS_UIMSGSINMODALLOOP = 0x80000,
  OLETLS_MARSHALING_ERROR_OBJECT = 0x100000,
  OLETLS_WINRT_INITIALIZE = 0x200000,
  OLETLS_APPLICATION_STA = 0x400000,
  OLETLS_IN_SHUTDOWN_CALLBACKS = 0x800000,
  OLETLS_POINTER_INPUT_BLOCKED = 0x1000000,
  OLETLS_IN_ACTIVATION_FILTER = 0x2000000,
  OLETLS_ASTATOASTAEXEMPT_QUIRK = 0x4000000,
  OLETLS_ASTATOASTAEXEMPT_PROXY = 0x8000000,
  OLETLS_ASTATOASTAEXEMPT_INDOUBT = 0x10000000,
};

typedef struct _FILE_FS_ATTRIBUTE_INFORMATION
{
  /* 0x0000 */ unsigned long FileSystemAttributes;
  /* 0x0004 */ long MaximumComponentNameLength;
  /* 0x0008 */ unsigned long FileSystemNameLength;
  /* 0x000c */ wchar_t FileSystemName[1];
  /* 0x000e */ char __PADDING__[2];
} FILE_FS_ATTRIBUTE_INFORMATION, *PFILE_FS_ATTRIBUTE_INFORMATION; /* size: 0x0010 */

typedef enum __MIDL_IGetBindHandle_0001
{
  BINDHANDLETYPES_APPCACHE = 0,
  BINDHANDLETYPES_DEPENDENCY = 1,
  BINDHANDLETYPES_COUNT = 2,
} _MIDL_IGetBindHandle_0001, *P_MIDL_IGetBindHandle_0001;

typedef enum _ACTIVATION_CONTEXT_INFO_CLASS
{
  ActivationContextBasicInformation = 1,
  ActivationContextDetailedInformation = 2,
  AssemblyDetailedInformationInActivationContext = 3,
  FileInformationInAssemblyOfAssemblyInActivationContext = 4,
  RunlevelInformationInActivationContext = 5,
  CompatibilityInformationInActivationContext = 6,
  ActivationContextManifestResourceName = 7,
  MaxActivationContextInfoClass = 8,
  AssemblyDetailedInformationInActivationContxt = 3,
  FileInformationInAssemblyOfAssemblyInActivationContxt = 4,
} ACTIVATION_CONTEXT_INFO_CLASS, *PACTIVATION_CONTEXT_INFO_CLASS;

typedef enum __MIDL_IBindStatusCallback_0005
{
  BINDINFO_OPTIONS_WININETFLAG = 0x10000,
  BINDINFO_OPTIONS_ENABLE_UTF8 = 0x20000,
  BINDINFO_OPTIONS_DISABLE_UTF8 = 0x40000,
  BINDINFO_OPTIONS_USE_IE_ENCODING = 0x80000,
  BINDINFO_OPTIONS_BINDTOOBJECT = 0x100000,
  BINDINFO_OPTIONS_SECURITYOPTOUT = 0x200000,
  BINDINFO_OPTIONS_IGNOREMIMETEXTPLAIN = 0x400000,
  BINDINFO_OPTIONS_USEBINDSTRINGCREDS = 0x800000,
  BINDINFO_OPTIONS_IGNOREHTTPHTTPSREDIRECTS = 0x1000000,
  BINDINFO_OPTIONS_IGNORE_SSLERRORS_ONCE = 0x2000000,
  BINDINFO_WPC_DOWNLOADBLOCKED = 0x8000000,
  BINDINFO_WPC_LOGGING_ENABLED = 0x10000000,
  BINDINFO_OPTIONS_ALLOWCONNECTDATA = 0x20000000,
  BINDINFO_OPTIONS_DISABLEAUTOREDIRECTS = 0x40000000,
  BINDINFO_OPTIONS_SHDOCVW_NAVIGATE = -2147483648,
} _MIDL_IBindStatusCallback_0005, *P_MIDL_IBindStatusCallback_0005;

struct tagPROPBAG2
{
  /* 0x0000 */ unsigned long dwType;
  /* 0x0004 */ unsigned short vt;
  /* 0x0006 */ unsigned short cfType;
  /* 0x0008 */ unsigned long dwHint;
  /* 0x000c */ wchar_t* pstrName;
  /* 0x0010 */ struct _GUID clsid;
}; /* size: 0x0020 */

typedef struct _CMSG_STREAM_INFO
{
  /* 0x0000 */ unsigned long cbContent;
  /* 0x0004 */ void* pfnStreamOutput /* function */;
  /* 0x0008 */ void* pvArg;
} CMSG_STREAM_INFO, *PCMSG_STREAM_INFO; /* size: 0x000c */

typedef enum _USER_ACTIVITY_PRESENCE
{
  PowerUserPresent = 0,
  PowerUserNotPresent = 1,
  PowerUserInactive = 2,
  PowerUserMaximum = 3,
  PowerUserInvalid = 3,
} USER_ACTIVITY_PRESENCE, *PUSER_ACTIVITY_PRESENCE;

typedef struct _RTL_BALANCED_LINKS
{
  /* 0x0000 */ struct _RTL_BALANCED_LINKS* Parent;
  /* 0x0004 */ struct _RTL_BALANCED_LINKS* LeftChild;
  /* 0x0008 */ struct _RTL_BALANCED_LINKS* RightChild;
  /* 0x000c */ char Balance;
  /* 0x000d */ unsigned char Reserved[3];
} RTL_BALANCED_LINKS, *PRTL_BALANCED_LINKS; /* size: 0x0010 */

typedef struct _RTL_AVL_TABLE
{
  /* 0x0000 */ struct _RTL_BALANCED_LINKS BalancedRoot;
  /* 0x0010 */ void* OrderedPointer;
  /* 0x0014 */ unsigned long WhichOrderedElement;
  /* 0x0018 */ unsigned long NumberGenericTableElements;
  /* 0x001c */ unsigned long DepthOfTree;
  /* 0x0020 */ struct _RTL_BALANCED_LINKS* RestartKey;
  /* 0x0024 */ unsigned long DeleteCount;
  /* 0x0028 */ void* CompareRoutine /* function */;
  /* 0x002c */ void* AllocateRoutine /* function */;
  /* 0x0030 */ void* FreeRoutine /* function */;
  /* 0x0034 */ void* TableContext;
} RTL_AVL_TABLE, *PRTL_AVL_TABLE; /* size: 0x0038 */

struct IXMLDOMImplementation
{
}; /* size: 0x0004 */

typedef struct _FILE_END_OF_FILE_INFORMATION
{
  /* 0x0000 */ union _LARGE_INTEGER EndOfFile;
} FILE_END_OF_FILE_INFORMATION, *PFILE_END_OF_FILE_INFORMATION; /* size: 0x0008 */

typedef enum _MSI_ACTION
{
  MSI_ACTION_INSTALL = 0,
  MSI_ACTION_UNINSTALL = 1,
  MSI_ACTION_UPDATE = 2,
  MSI_ACTION_MAX = 3,
} MSI_ACTION, *PMSI_ACTION;

typedef enum _SYSTEM_MEMORY_LIST_COMMAND
{
  MemoryCaptureAccessedBits = 0,
  MemoryCaptureAndResetAccessedBits = 1,
  MemoryEmptyWorkingSets = 2,
  MemoryFlushModifiedList = 3,
  MemoryPurgeStandbyList = 4,
  MemoryPurgeLowPriorityStandbyList = 5,
  MemoryCommandMax = 6,
} SYSTEM_MEMORY_LIST_COMMAND, *PSYSTEM_MEMORY_LIST_COMMAND;

typedef struct _CRYPT_MASK_GEN_ALGORITHM
{
  /* 0x0000 */ char* pszObjId;
  /* 0x0004 */ struct _CRYPT_ALGORITHM_IDENTIFIER HashAlgorithm;
} CRYPT_MASK_GEN_ALGORITHM, *PCRYPT_MASK_GEN_ALGORITHM; /* size: 0x0010 */

typedef struct _CRYPT_PSOURCE_ALGORITHM
{
  /* 0x0000 */ char* pszObjId;
  /* 0x0004 */ struct _CRYPTOAPI_BLOB EncodingParameters;
} CRYPT_PSOURCE_ALGORITHM, *PCRYPT_PSOURCE_ALGORITHM; /* size: 0x000c */

typedef struct _CRYPT_RSAES_OAEP_PARAMETERS
{
  /* 0x0000 */ struct _CRYPT_ALGORITHM_IDENTIFIER HashAlgorithm;
  /* 0x000c */ struct _CRYPT_MASK_GEN_ALGORITHM MaskGenAlgorithm;
  /* 0x001c */ struct _CRYPT_PSOURCE_ALGORITHM PSourceAlgorithm;
} CRYPT_RSAES_OAEP_PARAMETERS, *PCRYPT_RSAES_OAEP_PARAMETERS; /* size: 0x0028 */

typedef struct _BCRYPT_OID_LIST
{
  /* 0x0000 */ unsigned long dwOIDCount;
  /* 0x0004 */ struct _BCRYPT_OID* pOIDs;
} BCRYPT_OID_LIST, *PBCRYPT_OID_LIST; /* size: 0x0008 */

typedef struct _PERF_INSTANCE_DEFINITION
{
  /* 0x0000 */ unsigned long ByteLength;
  /* 0x0004 */ unsigned long ParentObjectTitleIndex;
  /* 0x0008 */ unsigned long ParentObjectInstance;
  /* 0x000c */ long UniqueID;
  /* 0x0010 */ unsigned long NameOffset;
  /* 0x0014 */ unsigned long NameLength;
} PERF_INSTANCE_DEFINITION, *PPERF_INSTANCE_DEFINITION; /* size: 0x0018 */

typedef enum _FSINFOCLASS
{
  FileFsVolumeInformation = 1,
  FileFsLabelInformation = 2,
  FileFsSizeInformation = 3,
  FileFsDeviceInformation = 4,
  FileFsAttributeInformation = 5,
  FileFsControlInformation = 6,
  FileFsFullSizeInformation = 7,
  FileFsObjectIdInformation = 8,
  FileFsDriverPathInformation = 9,
  FileFsVolumeFlagsInformation = 10,
  FileFsSectorSizeInformation = 11,
  FileFsDataCopyInformation = 12,
  FileFsMaximumInformation = 13,
} FSINFOCLASS, *PFSINFOCLASS;

typedef enum _TIMER_TYPE
{
  NotificationTimer = 0,
  SynchronizationTimer = 1,
} TIMER_TYPE, *PTIMER_TYPE;

typedef struct _OBJECTID
{
  /* 0x0000 */ struct _GUID Lineage;
  /* 0x0010 */ unsigned long Uniquifier;
} OBJECTID, *POBJECTID; /* size: 0x0014 */

typedef struct _LDT_ENTRY
{
  /* 0x0000 */ unsigned short LimitLow;
  /* 0x0002 */ unsigned short BaseLow;
  union
  {
    union
    {
      struct
      {
        /* 0x0004 */ unsigned char BaseMid;
        /* 0x0005 */ unsigned char Flags1;
        /* 0x0006 */ unsigned char Flags2;
        /* 0x0007 */ unsigned char BaseHi;
      } /* size: 0x0004 */ Bytes;
      struct
      {
        struct /* bitfield */
        {
          /* 0x0004 */ unsigned long BaseMid : 8; /* bit position: 0 */
          /* 0x0004 */ unsigned long Type : 5; /* bit position: 8 */
          /* 0x0004 */ unsigned long Dpl : 2; /* bit position: 13 */
          /* 0x0004 */ unsigned long Pres : 1; /* bit position: 15 */
          /* 0x0004 */ unsigned long LimitHi : 4; /* bit position: 16 */
          /* 0x0004 */ unsigned long Sys : 1; /* bit position: 20 */
          /* 0x0004 */ unsigned long Reserved_0 : 1; /* bit position: 21 */
          /* 0x0004 */ unsigned long Default_Big : 1; /* bit position: 22 */
          /* 0x0004 */ unsigned long Granularity : 1; /* bit position: 23 */
          /* 0x0004 */ unsigned long BaseHi : 8; /* bit position: 24 */
        }; /* bitfield */
      } /* size: 0x0004 */ Bits;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ HighWord;
} LDT_ENTRY, *PLDT_ENTRY; /* size: 0x0008 */

typedef struct _DESCRIPTOR_TABLE_ENTRY
{
  /* 0x0000 */ unsigned long Selector;
  /* 0x0004 */ struct _LDT_ENTRY Descriptor;
} DESCRIPTOR_TABLE_ENTRY, *PDESCRIPTOR_TABLE_ENTRY; /* size: 0x000c */

typedef enum _WATCHDOG_HANDLER_ACTION
{
  WdActionSetTimeoutValue = 0,
  WdActionQueryTimeoutValue = 1,
  WdActionResetTimer = 2,
  WdActionStopTimer = 3,
  WdActionStartTimer = 4,
  WdActionSetTriggerAction = 5,
  WdActionQueryTriggerAction = 6,
  WdActionQueryState = 7,
  WdActionSleep = 8,
  WdActionWake = 9,
  WdActionMarkHiberPhase = 10,
} WATCHDOG_HANDLER_ACTION, *PWATCHDOG_HANDLER_ACTION;

typedef struct _M128A
{
  /* 0x0000 */ unsigned __int64 Low;
  /* 0x0008 */ __int64 High;
} M128A, *PM128A; /* size: 0x0010 */

typedef enum _WORKERFACTORYINFOCLASS
{
  WorkerFactoryTimeout = 0,
  WorkerFactoryRetryTimeout = 1,
  WorkerFactoryIdleTimeout = 2,
  WorkerFactoryBindingCount = 3,
  WorkerFactoryThreadMinimum = 4,
  WorkerFactoryThreadMaximum = 5,
  WorkerFactoryPaused = 6,
  WorkerFactoryBasicInformation = 7,
  WorkerFactoryAdjustThreadGoal = 8,
  WorkerFactoryCallbackType = 9,
  WorkerFactoryStackInformation = 10,
  WorkerFactoryThreadBasePriority = 11,
  MaxWorkerFactoryInfoClass = 12,
} WORKERFACTORYINFOCLASS, *PWORKERFACTORYINFOCLASS;

typedef struct _KEY_VALUE_ENTRY
{
  /* 0x0000 */ struct _UNICODE_STRING* ValueName;
  /* 0x0004 */ unsigned long DataLength;
  /* 0x0008 */ unsigned long DataOffset;
  /* 0x000c */ unsigned long Type;
} KEY_VALUE_ENTRY, *PKEY_VALUE_ENTRY; /* size: 0x0010 */

class CTrackingCompositeMoniker
{
  /* 0x0000 */ long Padding_27;
  /* 0x0004 */ class CCompositeMoniker* _pCCM;
}; /* size: 0x0008 */

class CCompositeMoniker
{
  /* 0x0000 */ long Padding_28[5];
  /* 0x0014 */ class CTrackingCompositeMoniker _tcm;
  /* 0x001c */ struct IMoniker* m_pmkLeft;
  /* 0x0020 */ struct IMoniker* m_pmkRight;
  /* 0x0024 */ int m_fReduced;
  /* 0x0028 */ int m_fReduceForced;
}; /* size: 0x002c */

enum tagSTDMSHLFLAGS
{
  SMEXF_SERVER = 1,
  SMEXF_HANDLER = 2,
};

struct IFastRundown
{
}; /* size: 0x0004 */

typedef struct _DOC_INFO_3A
{
  /* 0x0000 */ char* pDocName;
  /* 0x0004 */ char* pOutputFile;
  /* 0x0008 */ char* pDatatype;
  /* 0x000c */ unsigned long dwFlags;
} DOC_INFO_3A, *PDOC_INFO_3A; /* size: 0x0010 */

enum AsycImageDataMembers
{
  AFM_IMAGE_HDC = 0,
  AFM_IMAGE_HBITMAP = 1,
  AFM_IMAGE_HPALETTE = 2,
  AFM_MASK_HDC = 3,
  AFM_MASK_HBITMAP = 4,
  AFM_MAX = 5,
};

typedef struct _RTL_SRWLOCK
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long Locked : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned long Waiting : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned long Waking : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned long MultipleShared : 1; /* bit position: 3 */
      /* 0x0000 */ unsigned long Shared : 28; /* bit position: 4 */
    }; /* bitfield */
    /* 0x0000 */ unsigned long Value;
    /* 0x0000 */ void* Ptr;
  }; /* size: 0x0004 */
} RTL_SRWLOCK, *PRTL_SRWLOCK; /* size: 0x0004 */

enum BlockingReason
{
  NotBlocking = 0,
  OutgoingCall = 1,
  CoWait = 2,
  ProcessEvents = 3,
};

class IMessageParamList
{
  /* 0x0000 */ class IMessageParam* _pFirst;
  /* 0x0004 */ class IMessageParam* _pLast;
}; /* size: 0x0008 */

class ASTAIncomingCallList
{
}; /* size: 0x0008 */

struct ASTAState
{
  /* 0x0000 */ struct _RTL_SRWLOCK lock;
  struct /* bitfield */
  {
    /* 0x0004 */ BOOL bInWaitContext : 1; /* bit position: 0 */
    /* 0x0004 */ BOOL bInKernelWait : 1; /* bit position: 1 */
    /* 0x0004 */ BOOL bHandlingPriorityEvents : 1; /* bit position: 2 */
    /* 0x0004 */ BOOL bWaitContextDispatchesAllCalls : 1; /* bit position: 3 */
    /* 0x0004 */ BOOL bSavedLogicalThreadIdForInDoubtCallInfo : 1; /* bit position: 4 */
  }; /* bitfield */
  /* 0x0005 */ char Padding_29[3];
  /* 0x0008 */ enum BlockingReason blockingReason;
  /* 0x000c */ struct _GUID outgoingCallLogicalThreadId;
  /* 0x001c */ long Padding_30;
  /* 0x0020 */ unsigned __int64 uCallTakeANumber;
  /* 0x0028 */ class IMessageParamList priorityEvents;
  /* 0x0030 */ class IMessageParamList deferredOutgoingRemReleaseCalls;
  /* 0x0038 */ class ASTAIncomingCallList dispatchableCalls;
  /* 0x0040 */ class ASTAIncomingCallList queuedCalls;
  /* 0x0048 */ unsigned __int64 uQueuedCallsSequence;
  /* 0x0050 */ unsigned long dwCachedNextQueuedCallTimeout;
  /* 0x0054 */ long Padding_31;
  /* 0x0058 */ unsigned __int64 uCachedNextQueuedCallTimeoutSequence;
  /* 0x0060 */ unsigned long dwCurrentKernelWaitTimeout;
  /* 0x0064 */ long Padding_32;
  /* 0x0068 */ unsigned __int64 uCurrentKernelWaitInitialTickCount;
  /* 0x0070 */ struct _GUID guidSavedLogicalThreadIdForInDoubtCallInfo;
}; /* size: 0x0080 */

typedef struct _SCARD_IO_REQUEST
{
  /* 0x0000 */ unsigned long dwProtocol;
  /* 0x0004 */ unsigned long cbPciLength;
} SCARD_IO_REQUEST, *PSCARD_IO_REQUEST; /* size: 0x0008 */

struct SCARD_T1_REQUEST
{
  /* 0x0000 */ struct _SCARD_IO_REQUEST ioRequest;
}; /* size: 0x0008 */

typedef struct _stat32i64
{
  /* 0x0000 */ unsigned int st_dev;
  /* 0x0004 */ unsigned short st_ino;
  /* 0x0006 */ unsigned short st_mode;
  /* 0x0008 */ short st_nlink;
  /* 0x000a */ short st_uid;
  /* 0x000c */ short st_gid;
  /* 0x000e */ char Padding_33[2];
  /* 0x0010 */ unsigned int st_rdev;
  /* 0x0014 */ long Padding_34;
  /* 0x0018 */ __int64 st_size;
  /* 0x0020 */ long st_atime;
  /* 0x0024 */ long st_mtime;
  /* 0x0028 */ long st_ctime;
  /* 0x002c */ long __PADDING__[1];
} stat32i64, *Pstat32i64; /* size: 0x0030 */

typedef enum _RPC_NOTIFICATIONS
{
  RpcNotificationCallNone = 0,
  RpcNotificationClientDisconnect = 1,
  RpcNotificationCallCancel = 2,
} RPC_NOTIFICATIONS, *PRPC_NOTIFICATIONS;

struct tagEMRSETDIBITSTODEVICE
{
  /* 0x0000 */ struct tagEMR emr;
  /* 0x0008 */ struct _RECTL rclBounds;
  /* 0x0018 */ long xDest;
  /* 0x001c */ long yDest;
  /* 0x0020 */ long xSrc;
  /* 0x0024 */ long ySrc;
  /* 0x0028 */ long cxSrc;
  /* 0x002c */ long cySrc;
  /* 0x0030 */ unsigned long offBmiSrc;
  /* 0x0034 */ unsigned long cbBmiSrc;
  /* 0x0038 */ unsigned long offBitsSrc;
  /* 0x003c */ unsigned long cbBitsSrc;
  /* 0x0040 */ unsigned long iUsageSrc;
  /* 0x0044 */ unsigned long iStartScan;
  /* 0x0048 */ unsigned long cScans;
}; /* size: 0x004c */

typedef struct _RTL_BITMAP
{
  /* 0x0000 */ unsigned long SizeOfBitMap;
  /* 0x0004 */ unsigned long* Buffer;
} RTL_BITMAP, *PRTL_BITMAP; /* size: 0x0008 */

struct tagMSG
{
  /* 0x0000 */ struct HWND__* hwnd;
  /* 0x0004 */ unsigned int message;
  /* 0x0008 */ unsigned int wParam;
  /* 0x000c */ long lParam;
  /* 0x0010 */ unsigned long time;
  /* 0x0014 */ struct tagPOINT pt;
}; /* size: 0x001c */

struct IInternetProtocolEx
{
}; /* size: 0x0004 */

enum tagBINDSPEED
{
  BINDSPEED_INDEFINITE = 1,
  BINDSPEED_MODERATE = 2,
  BINDSPEED_IMMEDIATE = 3,
};

class Windows::AutoPointerBase<Windows::Rtl::IRtlWORAStream *,Windows::Auto<Windows::Rtl::IRtlWORAStream *> >
{
  /* 0x0000 */ struct Windows::Rtl::IRtlWORAStream* m_Data;
}; /* size: 0x0004 */

enum tagVARKIND
{
  VAR_PERINSTANCE = 0,
  VAR_STATIC = 1,
  VAR_CONST = 2,
  VAR_DISPATCH = 3,
};

typedef enum _DEP_SYSTEM_POLICY_TYPE
{
  DEPPolicyAlwaysOff = 0,
  DEPPolicyAlwaysOn = 1,
  DEPPolicyOptIn = 2,
  DEPPolicyOptOut = 3,
  DEPTotalPolicyCount = 4,
} DEP_SYSTEM_POLICY_TYPE, *PDEP_SYSTEM_POLICY_TYPE;

typedef struct _WIN32_FIND_DATAW
{
  /* 0x0000 */ unsigned long dwFileAttributes;
  /* 0x0004 */ struct _FILETIME ftCreationTime;
  /* 0x000c */ struct _FILETIME ftLastAccessTime;
  /* 0x0014 */ struct _FILETIME ftLastWriteTime;
  /* 0x001c */ unsigned long nFileSizeHigh;
  /* 0x0020 */ unsigned long nFileSizeLow;
  /* 0x0024 */ unsigned long dwReserved0;
  /* 0x0028 */ unsigned long dwReserved1;
  /* 0x002c */ wchar_t cFileName[260];
  /* 0x0234 */ wchar_t cAlternateFileName[14];
} WIN32_FIND_DATAW, *PWIN32_FIND_DATAW; /* size: 0x0250 */

typedef struct _RTL_STACK_CONTEXT_ENTRY
{
  /* 0x0000 */ unsigned long Address;
  /* 0x0004 */ unsigned long Data;
} RTL_STACK_CONTEXT_ENTRY, *PRTL_STACK_CONTEXT_ENTRY; /* size: 0x0008 */

typedef enum _EXCEPTION_DISPOSITION
{
  ExceptionContinueExecution = 0,
  ExceptionContinueSearch = 1,
  ExceptionNestedException = 2,
  ExceptionCollidedUnwind = 3,
} EXCEPTION_DISPOSITION, *PEXCEPTION_DISPOSITION;

struct IOplockStorage
{
}; /* size: 0x0004 */

enum GRID_PRESENTATION_MODE
{
  GPM_INVALID = 0,
  GPM_START = 1,
  GPM_ALLAPPS = 2,
  GPM_SEARCH = 3,
};

struct tagTOUCHINPUT
{
  /* 0x0000 */ long x;
  /* 0x0004 */ long y;
  /* 0x0008 */ void* hSource;
  /* 0x000c */ unsigned long dwID;
  /* 0x0010 */ unsigned long dwFlags;
  /* 0x0014 */ unsigned long dwMask;
  /* 0x0018 */ unsigned long dwTime;
  /* 0x001c */ unsigned long dwExtraInfo;
  /* 0x0020 */ unsigned long cxContact;
  /* 0x0024 */ unsigned long cyContact;
}; /* size: 0x0028 */

typedef struct _DISK_EXTENT
{
  /* 0x0000 */ unsigned long DiskNumber;
  /* 0x0004 */ long Padding_35;
  /* 0x0008 */ union _LARGE_INTEGER StartingOffset;
  /* 0x0010 */ union _LARGE_INTEGER ExtentLength;
} DISK_EXTENT, *PDISK_EXTENT; /* size: 0x0018 */

enum tagCPFLAGS
{
  CPFLAG_NONE = 0,
  CPFLAG_PROPAGATE = 1,
  CPFLAG_EXPOSE = 2,
  CPFLAG_ENVOY = 4,
  CPFLAG_MONITORSTUB = 8,
  CPFLAG_MONITORPROXY = 16,
  CPFLAG_DONTCOMPARE = 32,
};

enum tagEOLE_AUTHENTICATION_CAPABILITIES
{
  EOAC_NONE = 0,
  EOAC_MUTUAL_AUTH = 1,
  EOAC_STATIC_CLOAKING = 32,
  EOAC_DYNAMIC_CLOAKING = 64,
  EOAC_ANY_AUTHORITY = 128,
  EOAC_MAKE_FULLSIC = 256,
  EOAC_DEFAULT = 2048,
  EOAC_SECURE_REFS = 2,
  EOAC_ACCESS_CONTROL = 4,
  EOAC_APPID = 8,
  EOAC_DYNAMIC = 16,
  EOAC_REQUIRE_FULLSIC = 512,
  EOAC_AUTO_IMPERSONATE = 1024,
  EOAC_NO_CUSTOM_MARSHAL = 8192,
  EOAC_DISABLE_AAA = 4096,
};

typedef struct _LIST_ENTRY
{
  /* 0x0000 */ struct _LIST_ENTRY* Flink;
  /* 0x0004 */ struct _LIST_ENTRY* Blink;
} LIST_ENTRY, *PLIST_ENTRY; /* size: 0x0008 */

typedef struct _RTL_BALANCED_NODE
{
  union
  {
    /* 0x0000 */ struct _RTL_BALANCED_NODE* Children[2];
    struct
    {
      /* 0x0000 */ struct _RTL_BALANCED_NODE* Left;
      /* 0x0004 */ struct _RTL_BALANCED_NODE* Right;
    }; /* size: 0x0008 */
  }; /* size: 0x0008 */
  union
  {
    /* 0x0008 */ unsigned char Red : 1; /* bit position: 0 */
    /* 0x0008 */ unsigned char Balance : 2; /* bit position: 0 */
    /* 0x0008 */ unsigned long ParentValue;
  }; /* size: 0x0004 */
} RTL_BALANCED_NODE, *PRTL_BALANCED_NODE; /* size: 0x000c */

typedef struct _LDR_DATA_TABLE_ENTRY
{
  /* 0x0000 */ struct _LIST_ENTRY InLoadOrderLinks;
  /* 0x0008 */ struct _LIST_ENTRY InMemoryOrderLinks;
  union
  {
    /* 0x0010 */ struct _LIST_ENTRY InInitializationOrderLinks;
    /* 0x0010 */ struct _LIST_ENTRY InProgressLinks;
  }; /* size: 0x0008 */
  /* 0x0018 */ void* DllBase;
  /* 0x001c */ void* EntryPoint;
  /* 0x0020 */ unsigned long SizeOfImage;
  /* 0x0024 */ struct _UNICODE_STRING FullDllName;
  /* 0x002c */ struct _UNICODE_STRING BaseDllName;
  union
  {
    /* 0x0034 */ unsigned char FlagGroup[4];
    /* 0x0034 */ unsigned long Flags;
    struct /* bitfield */
    {
      /* 0x0034 */ unsigned long PackagedBinary : 1; /* bit position: 0 */
      /* 0x0034 */ unsigned long MarkedForRemoval : 1; /* bit position: 1 */
      /* 0x0034 */ unsigned long ImageDll : 1; /* bit position: 2 */
      /* 0x0034 */ unsigned long LoadNotificationsSent : 1; /* bit position: 3 */
      /* 0x0034 */ unsigned long TelemetryEntryProcessed : 1; /* bit position: 4 */
      /* 0x0034 */ unsigned long ProcessStaticImport : 1; /* bit position: 5 */
      /* 0x0034 */ unsigned long InLegacyLists : 1; /* bit position: 6 */
      /* 0x0034 */ unsigned long InIndexes : 1; /* bit position: 7 */
      /* 0x0034 */ unsigned long ShimDll : 1; /* bit position: 8 */
      /* 0x0034 */ unsigned long InExceptionTable : 1; /* bit position: 9 */
      /* 0x0034 */ unsigned long ReservedFlags1 : 2; /* bit position: 10 */
      /* 0x0034 */ unsigned long LoadInProgress : 1; /* bit position: 12 */
      /* 0x0034 */ unsigned long ReservedFlags2 : 1; /* bit position: 13 */
      /* 0x0034 */ unsigned long EntryProcessed : 1; /* bit position: 14 */
      /* 0x0034 */ unsigned long ReservedFlags3 : 3; /* bit position: 15 */
      /* 0x0034 */ unsigned long DontCallForThreads : 1; /* bit position: 18 */
      /* 0x0034 */ unsigned long ProcessAttachCalled : 1; /* bit position: 19 */
      /* 0x0034 */ unsigned long ProcessAttachFailed : 1; /* bit position: 20 */
      /* 0x0034 */ unsigned long CorDeferredValidate : 1; /* bit position: 21 */
      /* 0x0034 */ unsigned long CorImage : 1; /* bit position: 22 */
      /* 0x0034 */ unsigned long DontRelocate : 1; /* bit position: 23 */
      /* 0x0034 */ unsigned long CorILOnly : 1; /* bit position: 24 */
      /* 0x0034 */ unsigned long ReservedFlags5 : 3; /* bit position: 25 */
      /* 0x0034 */ unsigned long Redirected : 1; /* bit position: 28 */
      /* 0x0034 */ unsigned long ReservedFlags6 : 2; /* bit position: 29 */
      /* 0x0034 */ unsigned long CompatDatabaseProcessed : 1; /* bit position: 31 */
    }; /* bitfield */
  }; /* size: 0x0004 */
  /* 0x0038 */ unsigned short ObsoleteLoadCount;
  /* 0x003a */ unsigned short TlsIndex;
  /* 0x003c */ struct _LIST_ENTRY HashLinks;
  /* 0x0044 */ unsigned long TimeDateStamp;
  /* 0x0048 */ struct _ACTIVATION_CONTEXT* EntryPointActivationContext;
  /* 0x004c */ void* Spare;
  /* 0x0050 */ struct _LDR_DDAG_NODE* DdagNode;
  /* 0x0054 */ struct _LIST_ENTRY NodeModuleLink;
  /* 0x005c */ struct _LDRP_DLL_SNAP_CONTEXT* SnapContext;
  /* 0x0060 */ void* ParentDllBase;
  /* 0x0064 */ void* SwitchBackContext;
  /* 0x0068 */ struct _RTL_BALANCED_NODE BaseAddressIndexNode;
  /* 0x0074 */ struct _RTL_BALANCED_NODE MappingInfoIndexNode;
  /* 0x0080 */ unsigned long OriginalBase;
  /* 0x0084 */ long Padding_36;
  /* 0x0088 */ union _LARGE_INTEGER LoadTime;
  /* 0x0090 */ unsigned long BaseNameHashValue;
  /* 0x0094 */ enum _LDR_DLL_LOAD_REASON LoadReason;
  /* 0x0098 */ unsigned long ImplicitPathOptions;
  /* 0x009c */ long __PADDING__[1];
} LDR_DATA_TABLE_ENTRY, *PLDR_DATA_TABLE_ENTRY; /* size: 0x00a0 */

typedef enum _FILTER_BOOT_OPTION_OPERATION
{
  FilterBootOptionOperationOpenSystemStore = 0,
  FilterBootOptionOperationSetElement = 1,
  FilterBootOptionOperationDeleteElement = 2,
  FilterBootOptionOperationMax = 3,
} FILTER_BOOT_OPTION_OPERATION, *PFILTER_BOOT_OPTION_OPERATION;

typedef enum _KEY_SET_INFORMATION_CLASS
{
  KeyWriteTimeInformation = 0,
  KeyWow64FlagsInformation = 1,
  KeyControlFlagsInformation = 2,
  KeySetVirtualizationInformation = 3,
  KeySetDebugInformation = 4,
  KeySetHandleTagsInformation = 5,
  MaxKeySetInfoClass = 6,
} KEY_SET_INFORMATION_CLASS, *PKEY_SET_INFORMATION_CLASS;

typedef struct _CMSG_KEY_AGREE_RECIPIENT_ENCODE_INFO
{
  /* 0x0000 */ unsigned long cbSize;
  /* 0x0004 */ struct _CRYPT_ALGORITHM_IDENTIFIER KeyEncryptionAlgorithm;
