struct HAL_PRIVATE_DISPATCH
{
  /* 0x0000 */ unsigned long Version;
  /* 0x0004 */ void* HalHandlerForBus /* function */;
  /* 0x0008 */ void* HalHandlerForConfigSpace /* function */;
  /* 0x000c */ void* HalLocateHiberRanges /* function */;
  /* 0x0010 */ void* HalRegisterBusHandler /* function */;
  /* 0x0014 */ void* HalSetWakeEnable /* function */;
  /* 0x0018 */ void* HalSetWakeAlarm /* function */;
  /* 0x001c */ void* HalPciTranslateBusAddress /* function */;
  /* 0x0020 */ void* HalPciAssignSlotResources /* function */;
  /* 0x0024 */ void* HalHaltSystem /* function */;
  /* 0x0028 */ void* HalFindBusAddressTranslation /* function */;
  /* 0x002c */ void* HalResetDisplay /* function */;
  /* 0x0030 */ void* HalAllocateMapRegisters /* function */;
  /* 0x0034 */ void* KdSetupPciDeviceForDebugging /* function */;
  /* 0x0038 */ void* KdReleasePciDeviceForDebugging /* function */;
  /* 0x003c */ void* KdGetAcpiTablePhase0 /* function */;
  /* 0x0040 */ void* KdCheckPowerButton /* function */;
  /* 0x0044 */ void* HalVectorToIDTEntry /* function */;
  /* 0x0048 */ void* KdMapPhysicalMemory64 /* function */;
  /* 0x004c */ void* KdUnmapVirtualAddress /* function */;
  /* 0x0050 */ void* KdGetPciDataByOffset /* function */;
  /* 0x0054 */ void* KdSetPciDataByOffset /* function */;
  /* 0x0058 */ void* HalGetInterruptVectorOverride /* function */;
  /* 0x005c */ void* HalGetVectorInputOverride /* function */;
  /* 0x0060 */ void* HalLoadMicrocode /* function */;
  /* 0x0064 */ void* HalUnloadMicrocode /* function */;
  /* 0x0068 */ void* HalPostMicrocodeUpdate /* function */;
  /* 0x006c */ void* HalAllocateMessageTargetOverride /* function */;
  /* 0x0070 */ void* HalFreeMessageTargetOverride /* function */;
  /* 0x0074 */ void* HalDpReplaceBegin /* function */;
  /* 0x0078 */ void* HalDpReplaceTarget /* function */;
  /* 0x007c */ void* HalDpReplaceControl /* function */;
  /* 0x0080 */ void* HalDpReplaceEnd /* function */;
  /* 0x0084 */ void* HalPrepareForBugcheck /* function */;
  /* 0x0088 */ void* HalQueryWakeTime /* function */;
  /* 0x008c */ void* HalReportIdleStateUsage /* function */;
  /* 0x0090 */ void* HalTscSynchronization /* function */;
  /* 0x0094 */ void* HalWheaInitProcessorGenericSection /* function */;
  /* 0x0098 */ void* HalStopLegacyUsbInterrupts /* function */;
  /* 0x009c */ void* HalReadWheaPhysicalMemory /* function */;
  /* 0x00a0 */ void* HalWriteWheaPhysicalMemory /* function */;
  /* 0x00a4 */ void* HalDpMaskLevelTriggeredInterrupts /* function */;
  /* 0x00a8 */ void* HalDpUnmaskLevelTriggeredInterrupts /* function */;
  /* 0x00ac */ void* HalDpGetInterruptReplayState /* function */;
  /* 0x00b0 */ void* HalDpReplayInterrupts /* function */;
  /* 0x00b4 */ void* HalQueryIoPortAccessSupported /* function */;
  /* 0x00b8 */ void* KdSetupIntegratedDeviceForDebugging /* function */;
  /* 0x00bc */ void* KdReleaseIntegratedDeviceForDebugging /* function */;
  /* 0x00c0 */ void* HalGetEnlightenmentInformation /* function */;
  /* 0x00c4 */ void* HalAllocateEarlyPages /* function */;
  /* 0x00c8 */ void* HalMapEarlyPages /* function */;
  /* 0x00cc */ void* Dummy1;
  /* 0x00d0 */ void* Dummy2;
  /* 0x00d4 */ void* HalNotifyProcessorFreeze /* function */;
  /* 0x00d8 */ void* HalPrepareProcessorForIdle /* function */;
  /* 0x00dc */ void* HalRegisterLogRoutine /* function */;
  /* 0x00e0 */ void* HalResumeProcessorFromIdle /* function */;
  /* 0x00e4 */ void* Dummy;
  /* 0x00e8 */ void* HalVectorToIDTEntryEx /* function */;
  /* 0x00ec */ void* HalSecondaryInterruptQueryPrimaryInformation /* function */;
  /* 0x00f0 */ void* HalMaskInterrupt /* function */;
  /* 0x00f4 */ void* HalUnmaskInterrupt /* function */;
  /* 0x00f8 */ void* HalIsInterruptTypeSecondary /* function */;
  /* 0x00fc */ void* HalAllocateGsivForSecondaryInterrupt /* function */;
  /* 0x0100 */ void* HalAddInterruptRemapping /* function */;
  /* 0x0104 */ void* HalRemoveInterruptRemapping /* function */;
  /* 0x0108 */ void* HalSaveAndDisableHvEnlightenment /* function */;
  /* 0x010c */ void* HalRestoreHvEnlightenment /* function */;
  /* 0x0110 */ void* HalFlushIoBuffersExternalCache /* function */;
  /* 0x0114 */ void* HalFlushExternalCache /* function */;
  /* 0x0118 */ void* HalPciEarlyRestore /* function */;
  /* 0x011c */ void* HalGetProcessorId /* function */;
  /* 0x0120 */ void* HalAllocatePmcCounterSet /* function */;
  /* 0x0124 */ void* HalCollectPmcCounters /* function */;
  /* 0x0128 */ void* HalFreePmcCounterSet /* function */;
  /* 0x012c */ void* HalProcessorHalt /* function */;
  /* 0x0130 */ void* HalTimerQueryCycleCounter /* function */;
  /* 0x0134 */ void* Dummy3;
  /* 0x0138 */ void* HalPciMarkHiberPhase /* function */;
  /* 0x013c */ void* HalQueryProcessorRestartEntryPoint /* function */;
  /* 0x0140 */ void* HalRequestInterrupt /* function */;
  /* 0x0144 */ void* HalEnumerateUnmaskedInterrupts /* function */;
  /* 0x0148 */ void* HalFlushAndInvalidatePageExternalCache /* function */;
  /* 0x014c */ void* KdEnumerateDebuggingDevices /* function */;
  /* 0x0150 */ void* HalFlushIoRectangleExternalCache /* function */;
  /* 0x0154 */ void* HalPowerEarlyRestore /* function */;
  /* 0x0158 */ void* HalQueryCapsuleCapabilities /* function */;
  /* 0x015c */ void* HalUpdateCapsule /* function */;
  /* 0x0160 */ void* HalPciMultiStageResumeCapable /* function */;
  /* 0x0164 */ void* HalDmaFreeCrashDumpRegisters /* function */;
  /* 0x0168 */ void* HalAcpiAoacCapable /* function */;
  /* 0x016c */ void* HalInterruptSetDestination /* function */;
  /* 0x0170 */ void* HalGetClockConfiguration /* function */;
  /* 0x0174 */ void* HalClockTimerActivate /* function */;
  /* 0x0178 */ void* HalClockTimerInitialize /* function */;
  /* 0x017c */ void* HalClockTimerStop /* function */;
  /* 0x0180 */ void* HalClockTimerArm /* function */;
  /* 0x0184 */ void* HalTimerOnlyClockInterruptPending /* function */;
  /* 0x0188 */ void* HalAcpiGetMultiNode /* function */;
  /* 0x018c */ void* HalPowerSetRebootHandler /* function */;
  /* 0x0190 */ void* HalIommuRegisterDispatchTable /* function */;
  /* 0x0194 */ void* HalTimerWatchdogStart /* function */;
  /* 0x0198 */ void* HalTimerWatchdogResetCountdown /* function */;
  /* 0x019c */ void* HalTimerWatchdogStop /* function */;
  /* 0x01a0 */ void* HalTimerWatchdogGeneratedLastReset /* function */;
  /* 0x01a4 */ void* HalTimerWatchdogTriggerSystemReset /* function */;
  /* 0x01a8 */ void* HalInterruptVectorDataToGsiv /* function */;
  /* 0x01ac */ void* HalInterruptGetHighestPriorityInterrupt /* function */;
  /* 0x01b0 */ void* HalProcessorOn /* function */;
  /* 0x01b4 */ void* HalProcessorOff /* function */;
  /* 0x01b8 */ void* HalProcessorFreeze /* function */;
  /* 0x01bc */ void* HalDmaLinkDeviceObjectByToken /* function */;
  /* 0x01c0 */ void* HalDmaCheckAdapterToken /* function */;
  /* 0x01c4 */ void* Dummy4;
  /* 0x01c8 */ void* HalTimerConvertPerformanceCounterToAuxiliaryCounter /* function */;
  /* 0x01cc */ void* HalTimerConvertAuxiliaryCounterToPerformanceCounter /* function */;
  /* 0x01d0 */ void* HalTimerQueryAuxiliaryCounterFrequency /* function */;
  /* 0x01d4 */ void* HalConnectThermalInterrupt /* function */;
  /* 0x01d8 */ void* HalIsEFIRuntimeActive /* function */;
  /* 0x01dc */ void* HalTimerQueryAndResetRtcErrors /* function */;
  /* 0x01e0 */ void* HalAcpiLateRestore /* function */;
  /* 0x01e4 */ void* KdWatchdogDelayExpiration /* function */;
  /* 0x01e8 */ void* HalGetProcessorStats /* function */;
  /* 0x01ec */ void* HalTimerWatchdogQueryDueTime /* function */;
  /* 0x01f0 */ void* HalConnectSyntheticInterrupt /* function */;
  /* 0x01f4 */ void* HalPreprocessNmi /* function */;
  /* 0x01f8 */ void* HalEnumerateEnvironmentVariablesWithFilter /* function */;
  /* 0x01fc */ void* HalCaptureLastBranchRecordStack /* function */;
  /* 0x0200 */ void* HalClearLastBranchRecordStack /* function */;
  /* 0x0204 */ void* HalConfigureLastBranchRecord /* function */;
  /* 0x0208 */ void* HalGetLastBranchInformation /* function */;
  /* 0x020c */ void* HalResumeLastBranchRecord /* function */;
  /* 0x0210 */ void* HalStartLastBranchRecord /* function */;
  /* 0x0214 */ void* HalStopLastBranchRecord /* function */;
  /* 0x0218 */ void* HalIommuBlockDevice /* function */;
  /* 0x021c */ void* HalIommuUnblockDevice /* function */;
  /* 0x0220 */ void* HalGetIommuInterface /* function */;
  /* 0x0224 */ void* HalRequestGenericErrorRecovery /* function */;
  /* 0x0228 */ void* HalTimerQueryHostPerformanceCounter /* function */;
  /* 0x022c */ void* HalTopologyQueryProcessorRelationships /* function */;
  /* 0x0230 */ void* HalInitPlatformDebugTriggers /* function */;
  /* 0x0234 */ void* HalRunPlatformDebugTriggers /* function */;
  /* 0x0238 */ void* HalTimerGetReferencePage /* function */;
  /* 0x023c */ void* HalGetHiddenProcessorPowerInterface /* function */;
  /* 0x0240 */ void* HalGetHiddenProcessorPackageId /* function */;
  /* 0x0244 */ void* HalGetHiddenPackageProcessorCount /* function */;
  /* 0x0248 */ void* HalGetHiddenProcessorApicIdByIndex /* function */;
  /* 0x024c */ void* HalRegisterHiddenProcessorIdleState /* function */;
  /* 0x0250 */ void* HalIommuReportIommuFault /* function */;
}; /* size: 0x0254 */

