struct joyinfoex_tag
{
  /* 0x0000 */ unsigned long dwSize;
  /* 0x0004 */ unsigned long dwFlags;
  /* 0x0008 */ unsigned long dwXpos;
  /* 0x000c */ unsigned long dwYpos;
  /* 0x0010 */ unsigned long dwZpos;
  /* 0x0014 */ unsigned long dwRpos;
  /* 0x0018 */ unsigned long dwUpos;
  /* 0x001c */ unsigned long dwVpos;
  /* 0x0020 */ unsigned long dwButtons;
  /* 0x0024 */ unsigned long dwButtonNumber;
  /* 0x0028 */ unsigned long dwPOV;
  /* 0x002c */ unsigned long dwReserved1;
  /* 0x0030 */ unsigned long dwReserved2;
}; /* size: 0x0034 */

