typedef struct _KNONVOLATILE_CONTEXT_POINTERS_ARM64
{
  /* 0x0000 */ unsigned __int64* X19;
  /* 0x0008 */ unsigned __int64* X20;
  /* 0x0010 */ unsigned __int64* X21;
  /* 0x0018 */ unsigned __int64* X22;
  /* 0x0020 */ unsigned __int64* X23;
  /* 0x0028 */ unsigned __int64* X24;
  /* 0x0030 */ unsigned __int64* X25;
  /* 0x0038 */ unsigned __int64* X26;
  /* 0x0040 */ unsigned __int64* X27;
  /* 0x0048 */ unsigned __int64* X28;
  /* 0x0050 */ unsigned __int64* Fp;
  /* 0x0058 */ unsigned __int64* Lr;
  /* 0x0060 */ unsigned __int64* D8;
  /* 0x0068 */ unsigned __int64* D9;
  /* 0x0070 */ unsigned __int64* D10;
  /* 0x0078 */ unsigned __int64* D11;
  /* 0x0080 */ unsigned __int64* D12;
  /* 0x0088 */ unsigned __int64* D13;
  /* 0x0090 */ unsigned __int64* D14;
  /* 0x0098 */ unsigned __int64* D15;
} KNONVOLATILE_CONTEXT_POINTERS_ARM64, *PKNONVOLATILE_CONTEXT_POINTERS_ARM64; /* size: 0x00a0 */

