struct tagUSAGE_PROPERTIES
{
  /* 0x0000 */ unsigned short level;
  /* 0x0002 */ unsigned short page;
  /* 0x0004 */ unsigned short usage;
  /* 0x0008 */ int logicalMinimum;
  /* 0x000c */ int logicalMaximum;
  /* 0x0010 */ unsigned short unit;
  /* 0x0012 */ unsigned short exponent;
  /* 0x0014 */ unsigned char count;
  /* 0x0018 */ int physicalMinimum;
  /* 0x001c */ int physicalMaximum;
}; /* size: 0x0020 */

