struct tagMCI_SEQ_SET_PARMS
{
  /* 0x0000 */ unsigned __int64 dwCallback;
  /* 0x0008 */ unsigned long dwTimeFormat;
  /* 0x000c */ unsigned long dwAudio;
  /* 0x0010 */ unsigned long dwTempo;
  /* 0x0014 */ unsigned long dwPort;
  /* 0x0018 */ unsigned long dwSlave;
  /* 0x001c */ unsigned long dwMaster;
  /* 0x0020 */ unsigned long dwOffset;
}; /* size: 0x0024 */

