struct IOleInPlaceActiveObjectVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* GetWindow /* function */;
  /* 0x0010 */ void* ContextSensitiveHelp /* function */;
  /* 0x0014 */ void* TranslateAcceleratorW /* function */;
  /* 0x0018 */ void* OnFrameWindowActivate /* function */;
  /* 0x001c */ void* OnDocWindowActivate /* function */;
  /* 0x0020 */ void* ResizeBorder /* function */;
  /* 0x0024 */ void* EnableModeless /* function */;
}; /* size: 0x0028 */

