struct IOleInPlaceUIWindowVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* GetWindow /* function */;
  /* 0x0020 */ void* ContextSensitiveHelp /* function */;
  /* 0x0028 */ void* GetBorder /* function */;
  /* 0x0030 */ void* RequestBorderSpace /* function */;
  /* 0x0038 */ void* SetBorderSpace /* function */;
  /* 0x0040 */ void* SetActiveObject /* function */;
}; /* size: 0x0048 */

