typedef struct _MI_PFN_ULONG5
{
  union
  {
    /* 0x0000 */ unsigned long EntireField;
    struct
    {
      struct /* bitfield */
      {
        /* 0x0000 */ unsigned long NodeBlinkHigh : 21; /* bit position: 0 */
        /* 0x0000 */ unsigned long NodeFlinkMiddle : 11; /* bit position: 21 */
      }; /* bitfield */
    } /* size: 0x0004 */ StandbyList;
    struct
    {
      /* 0x0000 */ unsigned char ModifiedListBucketIndex : 4; /* bit position: 0 */
    } /* size: 0x0001 */ MappedPageList;
    struct
    {
      struct /* bitfield */
      {
        /* 0x0000 */ unsigned char AnchorLargePageSize : 2; /* bit position: 0 */
        /* 0x0000 */ unsigned char Spare1 : 6; /* bit position: 2 */
      }; /* bitfield */
      /* 0x0001 */ unsigned char ViewCount;
      /* 0x0002 */ unsigned short Spare2;
    } /* size: 0x0004 */ Active;
  }; /* size: 0x0004 */
} MI_PFN_ULONG5, *PMI_PFN_ULONG5; /* size: 0x0004 */

