struct DESCRIPTOR
{
  /* 0x0000 */ unsigned char bWidth;
  /* 0x0001 */ unsigned char bHeight;
  /* 0x0002 */ unsigned char colorCount;
  /* 0x0003 */ unsigned char bReserved;
  /* 0x0004 */ unsigned short xHotSpot;
  /* 0x0006 */ unsigned short yHotSpot;
  /* 0x0008 */ unsigned long BytesInRes;
  /* 0x000c */ unsigned long OffsetToBits;
}; /* size: 0x0010 */

