struct tagMDICREATESTRUCTW
{
  /* 0x0000 */ const wchar_t* szClass;
  /* 0x0004 */ const wchar_t* szTitle;
  /* 0x0008 */ void* hOwner;
  /* 0x000c */ int x;
  /* 0x0010 */ int y;
  /* 0x0014 */ int cx;
  /* 0x0018 */ int cy;
  /* 0x001c */ unsigned long style;
  /* 0x0020 */ long lParam;
}; /* size: 0x0024 */

