struct tagPOINTER_DEVICE_PROPERTY
{
  /* 0x0000 */ int logicalMin;
  /* 0x0004 */ int logicalMax;
  /* 0x0008 */ int physicalMin;
  /* 0x000c */ int physicalMax;
  /* 0x0010 */ unsigned int unit;
  /* 0x0014 */ unsigned int unitExponent;
  /* 0x0018 */ unsigned short usagePageId;
  /* 0x001a */ unsigned short usageId;
}; /* size: 0x001c */

