typedef union __n32
{
  union
  {
    /* 0x0000 */ unsigned int n32_u32[1];
    /* 0x0000 */ unsigned short n32_u16[2];
    /* 0x0000 */ unsigned char n32_u8[4];
    /* 0x0000 */ int n32_i32[1];
    /* 0x0000 */ short n32_i16[2];
    /* 0x0000 */ char n32_i8[4];
    /* 0x0000 */ unsigned int n32_p32[1];
    /* 0x0000 */ unsigned short n32_p16[2];
    /* 0x0000 */ unsigned char n32_p8[4];
    /* 0x0000 */ float n32_f32[1];
  }; /* size: 0x0004 */
} _n32, *P_n32; /* size: 0x0004 */

