struct DLGTEMPLATEEX
{
  /* 0x0000 */ unsigned short dlgVer;
  /* 0x0002 */ unsigned short signature;
  /* 0x0004 */ unsigned long helpID;
  /* 0x0008 */ unsigned long exStyle;
  /* 0x000c */ unsigned long style;
  /* 0x0010 */ unsigned short cDlgItems;
  /* 0x0012 */ short x;
  /* 0x0014 */ short y;
  /* 0x0016 */ short cx;
  /* 0x0018 */ short cy;
}; /* size: 0x001a */

