struct ImgDelayDescrV2
{
  /* 0x0000 */ unsigned long grAttrs;
  /* 0x0004 */ unsigned long rvaDLLName;
  /* 0x0008 */ unsigned long rvaHmod;
  /* 0x000c */ unsigned long rvaIAT;
  /* 0x0010 */ unsigned long rvaINT;
  /* 0x0014 */ unsigned long rvaBoundIAT;
  /* 0x0018 */ unsigned long rvaUnloadIAT;
  /* 0x001c */ unsigned long dwTimeStamp;
}; /* size: 0x0020 */

