enum _SECURITY_OPERATION_CODE;
struct _KGDTENTRY;
enum _KSPIN_LOCK_QUEUE_NUMBER;
enum _PP_NPAGED_LOOKASIDE_NUMBER;
enum _POOL_TYPE;
enum _PF_SCENARIO_TYPE;
enum _SECURITY_IMPERSONATION_LEVEL;
enum _KWAIT_REASON;
enum _OB_OPEN_REASON;
enum _MEMORY_CACHING_TYPE_ORIG;
enum _NT_PRODUCT_TYPE;
enum _ALTERNATIVE_ARCHITECTURE_TYPE;
enum _MODE;
enum _IO_ALLOCATION_ACTION;
enum ReplacesCorHdrNumericDefines;
enum _MEMORY_TYPE;
enum _PS_QUOTA_TYPE;
enum _EXCEPTION_DISPOSITION;
enum _FILE_INFORMATION_CLASS;
enum _FSINFOCLASS;
enum _DEVICE_RELATION_TYPE;
enum BUS_QUERY_ID_TYPE;
enum DEVICE_TEXT_TYPE;
struct _LIST_ENTRY;
struct _KDEVICE_QUEUE_ENTRY;
enum _DEVICE_USAGE_NOTIFICATION_TYPE;
enum _SYSTEM_POWER_STATE;
enum _POWER_STATE_TYPE;
enum POWER_ACTION;
enum _DEVICE_POWER_STATE;
enum _INTERFACE_TYPE;
struct _KAPC;
enum _FS_FILTER_SECTION_SYNC_TYPE;
struct LIST_ENTRY64;
struct LIST_ENTRY32;
struct _RTL_TRACE_BLOCK;
struct _IMAGE_FILE_HEADER;
struct _IMAGE_DATA_DIRECTORY;
struct _IMAGE_OPTIONAL_HEADER;
struct _IMAGE_NT_HEADERS;
struct _KSYSTEM_TIME;
union _LARGE_INTEGER;
union _ULARGE_INTEGER;
struct _LUID;
struct _DISPATCHER_HEADER;
struct _KAPC_STATE;
struct _SINGLE_LIST_ENTRY;
struct _KWAIT_BLOCK;
struct _KTIMER;
struct _KSEMAPHORE;
struct _KTHREAD;
struct _KIDTENTRY;
struct _KEXECUTE_OPTIONS;
struct _KPROCESS;
struct _COMPRESSED_DATA_INFO;
struct _KQUEUE;
struct _KDPC;
struct _KTRAP_FRAME;
struct _EXCEPTION_REGISTRATION_RECORD;
struct _EXCEPTION_RECORD;
struct _FLOATING_SAVE_AREA;

struct PROCESSOR_PERF_STATE;
struct _NPAGED_LOOKASIDE_LIST;
struct _PAGED_LOOKASIDE_LIST;
struct _CLIENT_ID;
struct _HANDLE_TRACE_DB_ENTRY;
struct _EX_PUSH_LOCK_WAIT_BLOCK;
struct _ERESOURCE;
struct _IO_COUNTERS;
struct _EJOB;
struct _EX_PUSH_LOCK_CACHE_AWARE;
struct _ETHREAD;
struct _SID_AND_ATTRIBUTES;
struct _IO_RESOURCE_DESCRIPTOR;
struct _IO_RESOURCE_LIST;
struct _PROCESS_WS_WATCH_INFORMATION;
struct _TERMINATION_PORT;
struct _PS_JOB_TOKEN_FILTER;
struct _PS_IMPERSONATION_INFORMATION;
struct _WAIT_CONTEXT_BLOCK;
struct _KDEVICE_QUEUE;
struct _DEVICE_OBJECT;
struct _UNICODE_STRING;
struct _CURDIR;
struct _STRING;
struct _RTL_DRIVE_LETTER_CURDIR;
struct _RTL_USER_PROCESS_PARAMETERS;
struct _DRIVER_OBJECT;
struct _DRIVER_EXTENSION;
struct _EPROCESS_QUOTA_ENTRY;
struct _IO_CLIENT_EXTENSION;
struct _FS_FILTER_CALLBACKS;
union _FS_FILTER_PARAMETERS;
struct _FS_FILTER_CALLBACK_DATA;
struct _FILE_OBJECT;
struct _VPB;
struct _SECTION_OBJECT_POINTERS;
struct _OBJECT_NAME_INFORMATION;
struct _IO_COMPLETION_CONTEXT;
struct _MMWSL;
struct _OBJECT_DUMP_CONTROL;
struct _IO_STATUS_BLOCK;
struct _FILE_BASIC_INFORMATION;
struct _HANDLE_TRACE_DEBUG_INFO;
struct _EPROCESS_QUOTA_BLOCK;
struct _PAGEFAULT_HISTORY;
struct _HEAP_UCR_SEGMENT;
struct _PEB;
struct _PEB_LDR_DATA;
struct _RTL_CRITICAL_SECTION;
struct _RTL_CRITICAL_SECTION_DEBUG;
struct _PEB_FREE_BLOCK;
struct _RTL_TRACE_SEGMENT;
struct _STACK_TRACE_DATABASE;
struct _SID_IDENTIFIER_AUTHORITY;
struct _IO_TIMER;
struct _HEAP_LOCK;
struct _FILE_NETWORK_OPEN_INFORMATION;
struct _CM_PARTIAL_RESOURCE_DESCRIPTOR;
struct _CM_PARTIAL_RESOURCE_LIST;
struct _CM_FULL_RESOURCE_DESCRIPTOR;
struct _MDL;
struct _IRP;
struct _GENERIC_MAPPING;
struct _OBJECT_TYPE_INITIALIZER;
struct _IO_STACK_LOCATION;
struct _IO_SECURITY_CONTEXT;
struct _SECURITY_QUALITY_OF_SERVICE;
struct _ACCESS_STATE;
struct _MAILSLOT_CREATE_PARAMETERS;
struct _SCSI_REQUEST_BLOCK;
struct _SID;
struct _FILE_GET_QUOTA_INFORMATION;
struct _GUID;
struct _INTERFACE;
struct _DEVICE_CAPABILITIES;
struct _IO_RESOURCE_REQUIREMENTS_LIST;
struct _POWER_SEQUENCE;
struct _CM_RESOURCE_LIST;
struct _DEVOBJ_EXTENSION;
struct _DEVICE_OBJECT_POWER_EXTENSION;
struct _OBJECT_ATTRIBUTES;
struct _OBJECT_TYPE;
struct _OBJECT_HANDLE_INFORMATION;
struct _RTL_STACK_TRACE_ENTRY;
struct _DPH_BLOCK_INFORMATION;
struct _HEAP_ENTRY;
struct _HEAP;
struct _HEAP_TAG_ENTRY;
struct _HEAP_UNCOMMMTTED_RANGE;
struct _HEAP_SEGMENT;
struct _HEAP_PSEUDO_TAG_ENTRY;
struct _IMAGE_SECTION_HEADER;
struct _KUSER_SHARED_DATA;
struct _RTL_TRACE_DATABASE;
struct _HEAP_FREE_ENTRY;
struct _DPH_HEAP_ROOT;
struct _DPH_HEAP_BLOCK;
struct _LDR_DATA_TABLE_ENTRY;
struct _NT_TIB;
struct _ACTIVATION_CONTEXT_STACK;
struct _GDI_TEB_BATCH;
struct _Wx86ThreadState;
struct _TEB;
struct _TEB_ACTIVE_FRAME;

typedef enum _SECURITY_OPERATION_CODE
{
  SetSecurityDescriptor = 0,
  QuerySecurityDescriptor = 1,
  DeleteSecurityDescriptor = 2,
  AssignSecurityDescriptor = 3,
} SECURITY_OPERATION_CODE, *PSECURITY_OPERATION_CODE;

typedef struct _KGDTENTRY
{
  /* 0x0000 */ unsigned short LimitLow;
  /* 0x0002 */ unsigned short BaseLow;
  union
  {
    union
    {
      struct
      {
        /* 0x0004 */ unsigned char BaseMid;
        /* 0x0005 */ unsigned char Flags1;
        /* 0x0006 */ unsigned char Flags2;
        /* 0x0007 */ unsigned char BaseHi;
      } /* size: 0x0004 */ Bytes;
      struct
      {
        struct /* bitfield */
        {
          /* 0x0004 */ unsigned long BaseMid : 8; /* bit position: 0 */
          /* 0x0004 */ unsigned long Type : 5; /* bit position: 8 */
          /* 0x0004 */ unsigned long Dpl : 2; /* bit position: 13 */
          /* 0x0004 */ unsigned long Pres : 1; /* bit position: 15 */
          /* 0x0004 */ unsigned long LimitHi : 4; /* bit position: 16 */
          /* 0x0004 */ unsigned long Sys : 1; /* bit position: 20 */
          /* 0x0004 */ unsigned long Reserved_0 : 1; /* bit position: 21 */
          /* 0x0004 */ unsigned long Default_Big : 1; /* bit position: 22 */
          /* 0x0004 */ unsigned long Granularity : 1; /* bit position: 23 */
          /* 0x0004 */ unsigned long BaseHi : 8; /* bit position: 24 */
        }; /* bitfield */
      } /* size: 0x0004 */ Bits;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ HighWord;
} KGDTENTRY, *PKGDTENTRY; /* size: 0x0008 */

typedef enum _KSPIN_LOCK_QUEUE_NUMBER
{
  LockQueueDispatcherLock = 0,
  LockQueueContextSwapLock = 1,
  LockQueuePfnLock = 2,
  LockQueueSystemSpaceLock = 3,
  LockQueueVacbLock = 4,
  LockQueueMasterLock = 5,
  LockQueueNonPagedPoolLock = 6,
  LockQueueIoCancelLock = 7,
  LockQueueWorkQueueLock = 8,
  LockQueueIoVpbLock = 9,
  LockQueueIoDatabaseLock = 10,
  LockQueueIoCompletionLock = 11,
  LockQueueNtfsStructLock = 12,
  LockQueueAfdWorkQueueLock = 13,
  LockQueueBcbLock = 14,
  LockQueueMaximumLock = 15,
} KSPIN_LOCK_QUEUE_NUMBER, *PKSPIN_LOCK_QUEUE_NUMBER;

typedef enum _PP_NPAGED_LOOKASIDE_NUMBER
{
  LookasideSmallIrpList = 0,
  LookasideLargeIrpList = 1,
  LookasideMdlList = 2,
  LookasideCreateInfoList = 3,
  LookasideNameBufferList = 4,
  LookasideTwilightList = 5,
  LookasideCompletionList = 6,
  LookasideMaximumList = 7,
} PP_NPAGED_LOOKASIDE_NUMBER, *PPP_NPAGED_LOOKASIDE_NUMBER;

typedef enum _POOL_TYPE
{
  NonPagedPool = 0,
  PagedPool = 1,
  NonPagedPoolMustSucceed = 2,
  DontUseThisType = 3,
  NonPagedPoolCacheAligned = 4,
  PagedPoolCacheAligned = 5,
  NonPagedPoolCacheAlignedMustS = 6,
  MaxPoolType = 7,
  NonPagedPoolSession = 32,
  PagedPoolSession = 33,
  NonPagedPoolMustSucceedSession = 34,
  DontUseThisTypeSession = 35,
  NonPagedPoolCacheAlignedSession = 36,
  PagedPoolCacheAlignedSession = 37,
  NonPagedPoolCacheAlignedMustSSession = 38,
} POOL_TYPE, *PPOOL_TYPE;

typedef enum _PF_SCENARIO_TYPE
{
  PfApplicationLaunchScenarioType = 0,
  PfSystemBootScenarioType = 1,
  PfMaxScenarioType = 2,
} PF_SCENARIO_TYPE, *PPF_SCENARIO_TYPE;

typedef enum _SECURITY_IMPERSONATION_LEVEL
{
  SecurityAnonymous = 0,
  SecurityIdentification = 1,
  SecurityImpersonation = 2,
  SecurityDelegation = 3,
} SECURITY_IMPERSONATION_LEVEL, *PSECURITY_IMPERSONATION_LEVEL;

typedef enum _KWAIT_REASON
{
  Executive = 0,
  FreePage = 1,
  PageIn = 2,
  PoolAllocation = 3,
  DelayExecution = 4,
  Suspended = 5,
  UserRequest = 6,
  WrExecutive = 7,
  WrFreePage = 8,
  WrPageIn = 9,
  WrPoolAllocation = 10,
  WrDelayExecution = 11,
  WrSuspended = 12,
  WrUserRequest = 13,
  WrEventPair = 14,
  WrQueue = 15,
  WrLpcReceive = 16,
  WrLpcReply = 17,
  WrVirtualMemory = 18,
  WrPageOut = 19,
  WrRendezvous = 20,
  Spare2 = 21,
  Spare3 = 22,
  Spare4 = 23,
  Spare5 = 24,
  Spare6 = 25,
  WrKernel = 26,
  MaximumWaitReason = 27,
} KWAIT_REASON, *PKWAIT_REASON;

typedef enum _OB_OPEN_REASON
{
  ObCreateHandle = 0,
  ObOpenHandle = 1,
  ObDuplicateHandle = 2,
  ObInheritHandle = 3,
  ObMaxOpenReason = 4,
} OB_OPEN_REASON, *POB_OPEN_REASON;

typedef enum _MEMORY_CACHING_TYPE_ORIG
{
  MmFrameBufferCached = 2,
} MEMORY_CACHING_TYPE_ORIG, *PMEMORY_CACHING_TYPE_ORIG;

typedef enum _NT_PRODUCT_TYPE
{
  NtProductWinNt = 1,
  NtProductLanManNt = 2,
  NtProductServer = 3,
} NT_PRODUCT_TYPE, *PNT_PRODUCT_TYPE;

typedef enum _ALTERNATIVE_ARCHITECTURE_TYPE
{
  StandardDesign = 0,
  NEC98x86 = 1,
  EndAlternatives = 2,
} ALTERNATIVE_ARCHITECTURE_TYPE, *PALTERNATIVE_ARCHITECTURE_TYPE;

typedef enum _MODE
{
  KernelMode = 0,
  UserMode = 1,
  MaximumMode = 2,
} MODE, *PMODE;

typedef enum _IO_ALLOCATION_ACTION
{
  KeepObject = 1,
  DeallocateObject = 2,
  DeallocateObjectKeepRegisters = 3,
} IO_ALLOCATION_ACTION, *PIO_ALLOCATION_ACTION;

enum ReplacesCorHdrNumericDefines
{
  COMIMAGE_FLAGS_ILONLY = 1,
  COMIMAGE_FLAGS_32BITREQUIRED = 2,
  COMIMAGE_FLAGS_IL_LIBRARY = 4,
  COMIMAGE_FLAGS_STRONGNAMESIGNED = 8,
  COMIMAGE_FLAGS_TRACKDEBUGDATA = 0x10000,
  COR_VERSION_MAJOR_V2 = 2,
  COR_VERSION_MAJOR = 2,
  COR_VERSION_MINOR = 0,
  COR_DELETED_NAME_LENGTH = 8,
  COR_VTABLEGAP_NAME_LENGTH = 8,
  NATIVE_TYPE_MAX_CB = 1,
  COR_ILMETHOD_SECT_SMALL_MAX_DATASIZE = 255,
  IMAGE_COR_MIH_METHODRVA = 1,
  IMAGE_COR_MIH_EHRVA = 2,
  IMAGE_COR_MIH_BASICBLOCK = 8,
  COR_VTABLE_32BIT = 1,
  COR_VTABLE_64BIT = 2,
  COR_VTABLE_FROM_UNMANAGED = 4,
  COR_VTABLE_CALL_MOST_DERIVED = 16,
  IMAGE_COR_EATJ_THUNK_SIZE = 32,
  MAX_CLASS_NAME = 1024,
  MAX_PACKAGE_NAME = 1024,
};

typedef enum _MEMORY_TYPE
{
  MemoryExceptionBlock = 0,
  MemorySystemBlock = 1,
  MemoryFree = 2,
  MemoryBad = 3,
  MemoryLoadedProgram = 4,
  MemoryFirmwareTemporary = 5,
  MemoryFirmwarePermanent = 6,
  MemoryFreeContiguous = 7,
  MemorySpecialMemory = 8,
  MemoryMaximum = 9,
} MEMORY_TYPE, *PMEMORY_TYPE;

typedef enum _PS_QUOTA_TYPE
{
  PsNonPagedPool = 0,
  PsPagedPool = 1,
  PsPageFile = 2,
  PsQuotaTypes = 3,
} PS_QUOTA_TYPE, *PPS_QUOTA_TYPE;

typedef enum _EXCEPTION_DISPOSITION
{
  ExceptionContinueExecution = 0,
  ExceptionContinueSearch = 1,
  ExceptionNestedException = 2,
  ExceptionCollidedUnwind = 3,
} EXCEPTION_DISPOSITION, *PEXCEPTION_DISPOSITION;

typedef enum _FILE_INFORMATION_CLASS
{
  FileDirectoryInformation = 1,
  FileFullDirectoryInformation = 2,
  FileBothDirectoryInformation = 3,
  FileBasicInformation = 4,
  FileStandardInformation = 5,
  FileInternalInformation = 6,
  FileEaInformation = 7,
  FileAccessInformation = 8,
  FileNameInformation = 9,
  FileRenameInformation = 10,
  FileLinkInformation = 11,
  FileNamesInformation = 12,
  FileDispositionInformation = 13,
  FilePositionInformation = 14,
  FileFullEaInformation = 15,
  FileModeInformation = 16,
  FileAlignmentInformation = 17,
  FileAllInformation = 18,
  FileAllocationInformation = 19,
  FileEndOfFileInformation = 20,
  FileAlternateNameInformation = 21,
  FileStreamInformation = 22,
  FilePipeInformation = 23,
  FilePipeLocalInformation = 24,
  FilePipeRemoteInformation = 25,
  FileMailslotQueryInformation = 26,
  FileMailslotSetInformation = 27,
  FileCompressionInformation = 28,
  FileObjectIdInformation = 29,
  FileCompletionInformation = 30,
  FileMoveClusterInformation = 31,
  FileQuotaInformation = 32,
  FileReparsePointInformation = 33,
  FileNetworkOpenInformation = 34,
  FileAttributeTagInformation = 35,
  FileTrackingInformation = 36,
  FileIdBothDirectoryInformation = 37,
  FileIdFullDirectoryInformation = 38,
  FileValidDataLengthInformation = 39,
  FileShortNameInformation = 40,
  FileMaximumInformation = 41,
} FILE_INFORMATION_CLASS, *PFILE_INFORMATION_CLASS;

typedef enum _FSINFOCLASS
{
  FileFsVolumeInformation = 1,
  FileFsLabelInformation = 2,
  FileFsSizeInformation = 3,
  FileFsDeviceInformation = 4,
  FileFsAttributeInformation = 5,
  FileFsControlInformation = 6,
  FileFsFullSizeInformation = 7,
  FileFsObjectIdInformation = 8,
  FileFsDriverPathInformation = 9,
  FileFsMaximumInformation = 10,
} FSINFOCLASS, *PFSINFOCLASS;

typedef enum _DEVICE_RELATION_TYPE
{
  BusRelations = 0,
  EjectionRelations = 1,
  PowerRelations = 2,
  RemovalRelations = 3,
  TargetDeviceRelation = 4,
  SingleBusRelations = 5,
} DEVICE_RELATION_TYPE, *PDEVICE_RELATION_TYPE;

enum BUS_QUERY_ID_TYPE
{
  BusQueryDeviceID = 0,
  BusQueryHardwareIDs = 1,
  BusQueryCompatibleIDs = 2,
  BusQueryInstanceID = 3,
  BusQueryDeviceSerialNumber = 4,
};

enum DEVICE_TEXT_TYPE
{
  DeviceTextDescription = 0,
  DeviceTextLocationInformation = 1,
};

typedef struct _LIST_ENTRY
{
  /* 0x0000 */ struct _LIST_ENTRY* Flink;
  /* 0x0004 */ struct _LIST_ENTRY* Blink;
} LIST_ENTRY, *PLIST_ENTRY; /* size: 0x0008 */

typedef struct _KDEVICE_QUEUE_ENTRY
{
  /* 0x0000 */ struct _LIST_ENTRY DeviceListEntry;
  /* 0x0008 */ unsigned long SortKey;
  /* 0x000c */ unsigned char Inserted;
  /* 0x000d */ char __PADDING__[3];
} KDEVICE_QUEUE_ENTRY, *PKDEVICE_QUEUE_ENTRY; /* size: 0x0010 */

typedef enum _DEVICE_USAGE_NOTIFICATION_TYPE
{
  DeviceUsageTypeUndefined = 0,
  DeviceUsageTypePaging = 1,
  DeviceUsageTypeHibernation = 2,
  DeviceUsageTypeDumpFile = 3,
} DEVICE_USAGE_NOTIFICATION_TYPE, *PDEVICE_USAGE_NOTIFICATION_TYPE;

typedef enum _SYSTEM_POWER_STATE
{
  PowerSystemUnspecified = 0,
  PowerSystemWorking = 1,
  PowerSystemSleeping1 = 2,
  PowerSystemSleeping2 = 3,
  PowerSystemSleeping3 = 4,
  PowerSystemHibernate = 5,
  PowerSystemShutdown = 6,
  PowerSystemMaximum = 7,
} SYSTEM_POWER_STATE, *PSYSTEM_POWER_STATE;

typedef enum _POWER_STATE_TYPE
{
  SystemPowerState = 0,
  DevicePowerState = 1,
} POWER_STATE_TYPE, *PPOWER_STATE_TYPE;

enum POWER_ACTION
{
  PowerActionNone = 0,
  PowerActionReserved = 1,
  PowerActionSleep = 2,
  PowerActionHibernate = 3,
  PowerActionShutdown = 4,
  PowerActionShutdownReset = 5,
  PowerActionShutdownOff = 6,
  PowerActionWarmEject = 7,
};

typedef enum _DEVICE_POWER_STATE
{
  PowerDeviceUnspecified = 0,
  PowerDeviceD0 = 1,
  PowerDeviceD1 = 2,
  PowerDeviceD2 = 3,
  PowerDeviceD3 = 4,
  PowerDeviceMaximum = 5,
} DEVICE_POWER_STATE, *PDEVICE_POWER_STATE;

typedef enum _INTERFACE_TYPE
{
  InterfaceTypeUndefined = -1,
  Internal = 0,
  Isa = 1,
  Eisa = 2,
  MicroChannel = 3,
  TurboChannel = 4,
  PCIBus = 5,
  VMEBus = 6,
  NuBus = 7,
  PCMCIABus = 8,
  CBus = 9,
  MPIBus = 10,
  MPSABus = 11,
  ProcessorInternal = 12,
  InternalPowerBus = 13,
  PNPISABus = 14,
  PNPBus = 15,
  MaximumInterfaceType = 16,
} INTERFACE_TYPE, *PINTERFACE_TYPE;

typedef struct _KAPC
{
  /* 0x0000 */ short Type;
  /* 0x0002 */ short Size;
  /* 0x0004 */ unsigned long Spare0;
  /* 0x0008 */ struct _KTHREAD* Thread;
  /* 0x000c */ struct _LIST_ENTRY ApcListEntry;
  /* 0x0014 */ void* KernelRoutine /* function */;
  /* 0x0018 */ void* RundownRoutine /* function */;
  /* 0x001c */ void* NormalRoutine /* function */;
  /* 0x0020 */ void* NormalContext;
  /* 0x0024 */ void* SystemArgument1;
  /* 0x0028 */ void* SystemArgument2;
  /* 0x002c */ char ApcStateIndex;
  /* 0x002d */ char ApcMode;
  /* 0x002e */ unsigned char Inserted;
  /* 0x002f */ char __PADDING__[1];
} KAPC, *PKAPC; /* size: 0x0030 */

typedef enum _FS_FILTER_SECTION_SYNC_TYPE
{
  SyncTypeOther = 0,
  SyncTypeCreateSection = 1,
} FS_FILTER_SECTION_SYNC_TYPE, *PFS_FILTER_SECTION_SYNC_TYPE;

struct LIST_ENTRY64
{
  /* 0x0000 */ unsigned __int64 Flink;
  /* 0x0008 */ unsigned __int64 Blink;
}; /* size: 0x0010 */

struct LIST_ENTRY32
{
  /* 0x0000 */ unsigned long Flink;
  /* 0x0004 */ unsigned long Blink;
}; /* size: 0x0008 */

typedef struct _RTL_TRACE_BLOCK
{
  /* 0x0000 */ unsigned long Magic;
  /* 0x0004 */ unsigned long Count;
  /* 0x0008 */ unsigned long Size;
  /* 0x000c */ unsigned long UserCount;
  /* 0x0010 */ unsigned long UserSize;
  /* 0x0014 */ void* UserContext;
  /* 0x0018 */ struct _RTL_TRACE_BLOCK* Next;
  /* 0x001c */ void** Trace;
} RTL_TRACE_BLOCK, *PRTL_TRACE_BLOCK; /* size: 0x0020 */

typedef struct _IMAGE_FILE_HEADER
{
  /* 0x0000 */ unsigned short Machine;
  /* 0x0002 */ unsigned short NumberOfSections;
  /* 0x0004 */ unsigned long TimeDateStamp;
  /* 0x0008 */ unsigned long PointerToSymbolTable;
  /* 0x000c */ unsigned long NumberOfSymbols;
  /* 0x0010 */ unsigned short SizeOfOptionalHeader;
  /* 0x0012 */ unsigned short Characteristics;
} IMAGE_FILE_HEADER, *PIMAGE_FILE_HEADER; /* size: 0x0014 */

typedef struct _IMAGE_DATA_DIRECTORY
{
  /* 0x0000 */ unsigned long VirtualAddress;
  /* 0x0004 */ unsigned long Size;
} IMAGE_DATA_DIRECTORY, *PIMAGE_DATA_DIRECTORY; /* size: 0x0008 */

typedef struct _IMAGE_OPTIONAL_HEADER
{
  /* 0x0000 */ unsigned short Magic;
  /* 0x0002 */ unsigned char MajorLinkerVersion;
  /* 0x0003 */ unsigned char MinorLinkerVersion;
  /* 0x0004 */ unsigned long SizeOfCode;
  /* 0x0008 */ unsigned long SizeOfInitializedData;
  /* 0x000c */ unsigned long SizeOfUninitializedData;
  /* 0x0010 */ unsigned long AddressOfEntryPoint;
  /* 0x0014 */ unsigned long BaseOfCode;
  /* 0x0018 */ unsigned long BaseOfData;
  /* 0x001c */ unsigned long ImageBase;
  /* 0x0020 */ unsigned long SectionAlignment;
  /* 0x0024 */ unsigned long FileAlignment;
  /* 0x0028 */ unsigned short MajorOperatingSystemVersion;
  /* 0x002a */ unsigned short MinorOperatingSystemVersion;
  /* 0x002c */ unsigned short MajorImageVersion;
  /* 0x002e */ unsigned short MinorImageVersion;
  /* 0x0030 */ unsigned short MajorSubsystemVersion;
  /* 0x0032 */ unsigned short MinorSubsystemVersion;
  /* 0x0034 */ unsigned long Win32VersionValue;
  /* 0x0038 */ unsigned long SizeOfImage;
  /* 0x003c */ unsigned long SizeOfHeaders;
  /* 0x0040 */ unsigned long CheckSum;
  /* 0x0044 */ unsigned short Subsystem;
  /* 0x0046 */ unsigned short DllCharacteristics;
  /* 0x0048 */ unsigned long SizeOfStackReserve;
  /* 0x004c */ unsigned long SizeOfStackCommit;
  /* 0x0050 */ unsigned long SizeOfHeapReserve;
  /* 0x0054 */ unsigned long SizeOfHeapCommit;
  /* 0x0058 */ unsigned long LoaderFlags;
  /* 0x005c */ unsigned long NumberOfRvaAndSizes;
  /* 0x0060 */ struct _IMAGE_DATA_DIRECTORY DataDirectory[16];
} IMAGE_OPTIONAL_HEADER, *PIMAGE_OPTIONAL_HEADER; /* size: 0x00e0 */

typedef struct _IMAGE_NT_HEADERS
{
  /* 0x0000 */ unsigned long Signature;
  /* 0x0004 */ struct _IMAGE_FILE_HEADER FileHeader;
  /* 0x0018 */ struct _IMAGE_OPTIONAL_HEADER OptionalHeader;
} IMAGE_NT_HEADERS, *PIMAGE_NT_HEADERS; /* size: 0x00f8 */

typedef struct _KSYSTEM_TIME
{
  /* 0x0000 */ unsigned long LowPart;
  /* 0x0004 */ long High1Time;
  /* 0x0008 */ long High2Time;
} KSYSTEM_TIME, *PKSYSTEM_TIME; /* size: 0x000c */

typedef union _LARGE_INTEGER
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned long LowPart;
      /* 0x0004 */ long HighPart;
    }; /* size: 0x0008 */
    struct
    {
      /* 0x0000 */ unsigned long LowPart;
      /* 0x0004 */ long HighPart;
    } /* size: 0x0008 */ u;
    /* 0x0000 */ __int64 QuadPart;
  }; /* size: 0x0008 */
} LARGE_INTEGER, *PLARGE_INTEGER; /* size: 0x0008 */

typedef union _ULARGE_INTEGER
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned long LowPart;
      /* 0x0004 */ unsigned long HighPart;
    }; /* size: 0x0008 */
    struct
    {
      /* 0x0000 */ unsigned long LowPart;
      /* 0x0004 */ unsigned long HighPart;
    } /* size: 0x0008 */ u;
    /* 0x0000 */ unsigned __int64 QuadPart;
  }; /* size: 0x0008 */
} ULARGE_INTEGER, *PULARGE_INTEGER; /* size: 0x0008 */

typedef struct _LUID
{
  /* 0x0000 */ unsigned long LowPart;
  /* 0x0004 */ long HighPart;
} LUID, *PLUID; /* size: 0x0008 */

typedef struct _DISPATCHER_HEADER
{
  /* 0x0000 */ unsigned char Type;
  /* 0x0001 */ unsigned char Absolute;
  /* 0x0002 */ unsigned char Size;
  /* 0x0003 */ unsigned char Inserted;
  /* 0x0004 */ long SignalState;
  /* 0x0008 */ struct _LIST_ENTRY WaitListHead;
} DISPATCHER_HEADER, *PDISPATCHER_HEADER; /* size: 0x0010 */

typedef struct _KAPC_STATE
{
  /* 0x0000 */ struct _LIST_ENTRY ApcListHead[2];
  /* 0x0010 */ struct _KPROCESS* Process;
  /* 0x0014 */ unsigned char KernelApcInProgress;
  /* 0x0015 */ unsigned char KernelApcPending;
  /* 0x0016 */ unsigned char UserApcPending;
  /* 0x0017 */ char __PADDING__[1];
} KAPC_STATE, *PKAPC_STATE; /* size: 0x0018 */

typedef struct _SINGLE_LIST_ENTRY
{
  /* 0x0000 */ struct _SINGLE_LIST_ENTRY* Next;
} SINGLE_LIST_ENTRY, *PSINGLE_LIST_ENTRY; /* size: 0x0004 */

typedef struct _KWAIT_BLOCK
{
  /* 0x0000 */ struct _LIST_ENTRY WaitListEntry;
  /* 0x0008 */ struct _KTHREAD* Thread;
  /* 0x000c */ void* Object;
  /* 0x0010 */ struct _KWAIT_BLOCK* NextWaitBlock;
  /* 0x0014 */ unsigned short WaitKey;
  /* 0x0016 */ unsigned short WaitType;
} KWAIT_BLOCK, *PKWAIT_BLOCK; /* size: 0x0018 */

typedef struct _KTIMER
{
  /* 0x0000 */ struct _DISPATCHER_HEADER Header;
  /* 0x0010 */ union _ULARGE_INTEGER DueTime;
  /* 0x0018 */ struct _LIST_ENTRY TimerListEntry;
  /* 0x0020 */ struct _KDPC* Dpc;
  /* 0x0024 */ long Period;
} KTIMER, *PKTIMER; /* size: 0x0028 */

typedef struct _KSEMAPHORE
{
  /* 0x0000 */ struct _DISPATCHER_HEADER Header;
  /* 0x0010 */ long Limit;
} KSEMAPHORE, *PKSEMAPHORE; /* size: 0x0014 */

typedef struct _KTHREAD
{
  /* 0x0000 */ struct _DISPATCHER_HEADER Header;
  /* 0x0010 */ struct _LIST_ENTRY MutantListHead;
  /* 0x0018 */ void* InitialStack;
  /* 0x001c */ void* StackLimit;
  /* 0x0020 */ void* Teb;
  /* 0x0024 */ void* TlsArray;
  /* 0x0028 */ void* KernelStack;
  /* 0x002c */ unsigned char DebugActive;
  /* 0x002d */ unsigned char State;
  /* 0x002e */ unsigned char Alerted[2];
  /* 0x0030 */ unsigned char Iopl;
  /* 0x0031 */ unsigned char NpxState;
  /* 0x0032 */ char Saturation;
  /* 0x0033 */ char Priority;
  /* 0x0034 */ struct _KAPC_STATE ApcState;
  /* 0x004c */ unsigned long ContextSwitches;
  /* 0x0050 */ unsigned char IdleSwapBlock;
  /* 0x0051 */ unsigned char Spare0[3];
  /* 0x0054 */ long WaitStatus;
  /* 0x0058 */ unsigned char WaitIrql;
  /* 0x0059 */ char WaitMode;
  /* 0x005a */ unsigned char WaitNext;
  /* 0x005b */ unsigned char WaitReason;
  /* 0x005c */ struct _KWAIT_BLOCK* WaitBlockList;
  union
  {
    /* 0x0060 */ struct _LIST_ENTRY WaitListEntry;
    /* 0x0060 */ struct _SINGLE_LIST_ENTRY SwapListEntry;
  }; /* size: 0x0008 */
  /* 0x0068 */ unsigned long WaitTime;
  /* 0x006c */ char BasePriority;
  /* 0x006d */ unsigned char DecrementCount;
  /* 0x006e */ char PriorityDecrement;
  /* 0x006f */ char Quantum;
  /* 0x0070 */ struct _KWAIT_BLOCK WaitBlock[4];
  /* 0x00d0 */ void* LegoData;
  /* 0x00d4 */ unsigned long KernelApcDisable;
  /* 0x00d8 */ unsigned long UserAffinity;
  /* 0x00dc */ unsigned char SystemAffinityActive;
  /* 0x00dd */ unsigned char PowerState;
  /* 0x00de */ unsigned char NpxIrql;
  /* 0x00df */ unsigned char InitialNode;
  /* 0x00e0 */ void* ServiceTable;
  /* 0x00e4 */ struct _KQUEUE* Queue;
  /* 0x00e8 */ unsigned long ApcQueueLock;
  /* 0x00ec */ long Padding_0;
  /* 0x00f0 */ struct _KTIMER Timer;
  /* 0x0118 */ struct _LIST_ENTRY QueueListEntry;
  /* 0x0120 */ unsigned long SoftAffinity;
  /* 0x0124 */ unsigned long Affinity;
  /* 0x0128 */ unsigned char Preempted;
  /* 0x0129 */ unsigned char ProcessReadyQueue;
  /* 0x012a */ unsigned char KernelStackResident;
  /* 0x012b */ unsigned char NextProcessor;
  /* 0x012c */ void* CallbackStack;
  /* 0x0130 */ void* Win32Thread;
  /* 0x0134 */ struct _KTRAP_FRAME* TrapFrame;
  /* 0x0138 */ struct _KAPC_STATE* ApcStatePointer[2];
  /* 0x0140 */ char PreviousMode;
  /* 0x0141 */ unsigned char EnableStackSwap;
  /* 0x0142 */ unsigned char LargeStack;
  /* 0x0143 */ unsigned char ResourceIndex;
  /* 0x0144 */ unsigned long KernelTime;
  /* 0x0148 */ unsigned long UserTime;
  /* 0x014c */ struct _KAPC_STATE SavedApcState;
  /* 0x0164 */ unsigned char Alertable;
  /* 0x0165 */ unsigned char ApcStateIndex;
  /* 0x0166 */ unsigned char ApcQueueable;
  /* 0x0167 */ unsigned char AutoAlignment;
  /* 0x0168 */ void* StackBase;
  /* 0x016c */ struct _KAPC SuspendApc;
  /* 0x019c */ struct _KSEMAPHORE SuspendSemaphore;
  /* 0x01b0 */ struct _LIST_ENTRY ThreadListEntry;
  /* 0x01b8 */ char FreezeCount;
  /* 0x01b9 */ char SuspendCount;
  /* 0x01ba */ unsigned char IdealProcessor;
  /* 0x01bb */ unsigned char DisableBoost;
  /* 0x01bc */ long __PADDING__[1];
} KTHREAD, *PKTHREAD; /* size: 0x01c0 */

typedef struct _KIDTENTRY
{
  /* 0x0000 */ unsigned short Offset;
  /* 0x0002 */ unsigned short Selector;
  /* 0x0004 */ unsigned short Access;
  /* 0x0006 */ unsigned short ExtendedOffset;
} KIDTENTRY, *PKIDTENTRY; /* size: 0x0008 */

typedef struct _KEXECUTE_OPTIONS
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned char ExecuteDisable : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned char ExecuteEnable : 1; /* bit position: 1 */
    /* 0x0000 */ unsigned char DisableThunkEmulation : 1; /* bit position: 2 */
    /* 0x0000 */ unsigned char Permanent : 1; /* bit position: 3 */
    /* 0x0000 */ unsigned char ExecuteDispatchEnable : 1; /* bit position: 4 */
    /* 0x0000 */ unsigned char ImageDispatchEnable : 1; /* bit position: 5 */
    /* 0x0000 */ unsigned char Spare : 2; /* bit position: 6 */
  }; /* bitfield */
} KEXECUTE_OPTIONS, *PKEXECUTE_OPTIONS; /* size: 0x0001 */

typedef struct _KPROCESS
{
  /* 0x0000 */ struct _DISPATCHER_HEADER Header;
  /* 0x0010 */ struct _LIST_ENTRY ProfileListHead;
  /* 0x0018 */ unsigned long DirectoryTableBase[2];
  /* 0x0020 */ struct _KGDTENTRY LdtDescriptor;
  /* 0x0028 */ struct _KIDTENTRY Int21Descriptor;
  /* 0x0030 */ unsigned short IopmOffset;
  /* 0x0032 */ unsigned char Iopl;
  /* 0x0033 */ unsigned char Unused;
  /* 0x0034 */ unsigned long ActiveProcessors;
  /* 0x0038 */ unsigned long KernelTime;
  /* 0x003c */ unsigned long UserTime;
  /* 0x0040 */ struct _LIST_ENTRY ReadyListHead;
  /* 0x0048 */ struct _SINGLE_LIST_ENTRY SwapListEntry;
  /* 0x004c */ void* VdmTrapcHandler;
  /* 0x0050 */ struct _LIST_ENTRY ThreadListHead;
  /* 0x0058 */ unsigned long ProcessLock;
  /* 0x005c */ unsigned long Affinity;
  /* 0x0060 */ unsigned short StackCount;
  /* 0x0062 */ char BasePriority;
  /* 0x0063 */ char ThreadQuantum;
  /* 0x0064 */ unsigned char AutoAlignment;
  /* 0x0065 */ unsigned char State;
  /* 0x0066 */ unsigned char ThreadSeed;
  /* 0x0067 */ unsigned char DisableBoost;
  /* 0x0068 */ unsigned char PowerState;
  /* 0x0069 */ unsigned char DisableQuantum;
  /* 0x006a */ unsigned char IdealNode;
  union
  {
    /* 0x006b */ struct _KEXECUTE_OPTIONS Flags;
    /* 0x006b */ unsigned char ExecuteOptions;
  }; /* size: 0x0001 */
} KPROCESS, *PKPROCESS; /* size: 0x006c */

typedef struct _COMPRESSED_DATA_INFO
{
  /* 0x0000 */ unsigned short CompressionFormatAndEngine;
  /* 0x0002 */ unsigned char CompressionUnitShift;
  /* 0x0003 */ unsigned char ChunkShift;
  /* 0x0004 */ unsigned char ClusterShift;
  /* 0x0005 */ unsigned char Reserved;
  /* 0x0006 */ unsigned short NumberOfChunks;
  /* 0x0008 */ unsigned long CompressedChunkSizes[1];
} COMPRESSED_DATA_INFO, *PCOMPRESSED_DATA_INFO; /* size: 0x000c */

typedef struct _KQUEUE
{
  /* 0x0000 */ struct _DISPATCHER_HEADER Header;
  /* 0x0010 */ struct _LIST_ENTRY EntryListHead;
  /* 0x0018 */ unsigned long CurrentCount;
  /* 0x001c */ unsigned long MaximumCount;
  /* 0x0020 */ struct _LIST_ENTRY ThreadListHead;
} KQUEUE, *PKQUEUE; /* size: 0x0028 */

typedef struct _KDPC
{
  /* 0x0000 */ short Type;
  /* 0x0002 */ unsigned char Number;
  /* 0x0003 */ unsigned char Importance;
  /* 0x0004 */ struct _LIST_ENTRY DpcListEntry;
  /* 0x000c */ void* DeferredRoutine /* function */;
  /* 0x0010 */ void* DeferredContext;
  /* 0x0014 */ void* SystemArgument1;
  /* 0x0018 */ void* SystemArgument2;
  /* 0x001c */ unsigned long* Lock;
} KDPC, *PKDPC; /* size: 0x0020 */

typedef struct _KTRAP_FRAME
{
  /* 0x0000 */ unsigned long DbgEbp;
  /* 0x0004 */ unsigned long DbgEip;
  /* 0x0008 */ unsigned long DbgArgMark;
  /* 0x000c */ unsigned long DbgArgPointer;
  /* 0x0010 */ unsigned long TempSegCs;
  /* 0x0014 */ unsigned long TempEsp;
  /* 0x0018 */ unsigned long Dr0;
  /* 0x001c */ unsigned long Dr1;
  /* 0x0020 */ unsigned long Dr2;
  /* 0x0024 */ unsigned long Dr3;
  /* 0x0028 */ unsigned long Dr6;
  /* 0x002c */ unsigned long Dr7;
  /* 0x0030 */ unsigned long SegGs;
  /* 0x0034 */ unsigned long SegEs;
  /* 0x0038 */ unsigned long SegDs;
  /* 0x003c */ unsigned long Edx;
  /* 0x0040 */ unsigned long Ecx;
  /* 0x0044 */ unsigned long Eax;
  /* 0x0048 */ unsigned long PreviousPreviousMode;
  /* 0x004c */ struct _EXCEPTION_REGISTRATION_RECORD* ExceptionList;
  /* 0x0050 */ unsigned long SegFs;
  /* 0x0054 */ unsigned long Edi;
  /* 0x0058 */ unsigned long Esi;
  /* 0x005c */ unsigned long Ebx;
  /* 0x0060 */ unsigned long Ebp;
  /* 0x0064 */ unsigned long ErrCode;
  /* 0x0068 */ unsigned long Eip;
  /* 0x006c */ unsigned long SegCs;
  /* 0x0070 */ unsigned long EFlags;
  /* 0x0074 */ unsigned long HardwareEsp;
  /* 0x0078 */ unsigned long HardwareSegSs;
  /* 0x007c */ unsigned long V86Es;
  /* 0x0080 */ unsigned long V86Ds;
  /* 0x0084 */ unsigned long V86Fs;
  /* 0x0088 */ unsigned long V86Gs;
} KTRAP_FRAME, *PKTRAP_FRAME; /* size: 0x008c */

typedef struct _EXCEPTION_REGISTRATION_RECORD
{
  /* 0x0000 */ struct _EXCEPTION_REGISTRATION_RECORD* Next;
  /* 0x0004 */ void* Handler /* function */;
} EXCEPTION_REGISTRATION_RECORD, *PEXCEPTION_REGISTRATION_RECORD; /* size: 0x0008 */

typedef struct _EXCEPTION_RECORD
{
  /* 0x0000 */ long ExceptionCode;
  /* 0x0004 */ unsigned long ExceptionFlags;
  /* 0x0008 */ struct _EXCEPTION_RECORD* ExceptionRecord;
  /* 0x000c */ void* ExceptionAddress;
  /* 0x0010 */ unsigned long NumberParameters;
  /* 0x0014 */ unsigned long ExceptionInformation[15];
} EXCEPTION_RECORD, *PEXCEPTION_RECORD; /* size: 0x0050 */

typedef struct _FLOATING_SAVE_AREA
{
  /* 0x0000 */ unsigned long ControlWord;
  /* 0x0004 */ unsigned long StatusWord;
  /* 0x0008 */ unsigned long TagWord;
  /* 0x000c */ unsigned long ErrorOffset;
  /* 0x0010 */ unsigned long ErrorSelector;
  /* 0x0014 */ unsigned long DataOffset;
  /* 0x0018 */ unsigned long DataSelector;
  /* 0x001c */ unsigned char RegisterArea[80];
  /* 0x006c */ unsigned long Cr0NpxState;
} FLOATING_SAVE_AREA, *PFLOATING_SAVE_AREA; /* size: 0x0070 */

typedef struct _CONTEXT
{
  /* 0x0000 */ unsigned long ContextFlags;
  /* 0x0004 */ unsigned long Dr0;
  /* 0x0008 */ unsigned long Dr1;
  /* 0x000c */ unsigned long Dr2;
  /* 0x0010 */ unsigned long Dr3;
  /* 0x0014 */ unsigned long Dr6;
  /* 0x0018 */ unsigned long Dr7;
  /* 0x001c */ struct _FLOATING_SAVE_AREA FloatSave;
  /* 0x008c */ unsigned long SegGs;
  /* 0x0090 */ unsigned long SegFs;
  /* 0x0094 */ unsigned long SegEs;
  /* 0x0098 */ unsigned long SegDs;
  /* 0x009c */ unsigned long Edi;
  /* 0x00a0 */ unsigned long Esi;
  /* 0x00a4 */ unsigned long Ebx;
  /* 0x00a8 */ unsigned long Edx;
  /* 0x00ac */ unsigned long Ecx;
  /* 0x00b0 */ unsigned long Eax;
  /* 0x00b4 */ unsigned long Ebp;
  /* 0x00b8 */ unsigned long Eip;
  /* 0x00bc */ unsigned long SegCs;
  /* 0x00c0 */ unsigned long EFlags;
  /* 0x00c4 */ unsigned long Esp;
  /* 0x00c8 */ unsigned long SegSs;
  /* 0x00cc */ unsigned char ExtendedRegisters[512];
} CONTEXT, *PCONTEXT; /* size: 0x02cc */

typedef struct _LUID_AND_ATTRIBUTES
{
  /* 0x0000 */ struct _LUID Luid;
  /* 0x0008 */ unsigned long Attributes;
} LUID_AND_ATTRIBUTES, *PLUID_AND_ATTRIBUTES; /* size: 0x000c */

typedef struct _PRIVILEGE_SET
{
  /* 0x0000 */ unsigned long PrivilegeCount;
  /* 0x0004 */ unsigned long Control;
  /* 0x0008 */ struct _LUID_AND_ATTRIBUTES Privilege[1];
} PRIVILEGE_SET, *PPRIVILEGE_SET; /* size: 0x0014 */

typedef union _POWER_STATE
{
  union
  {
    /* 0x0000 */ enum _SYSTEM_POWER_STATE SystemState;
    /* 0x0000 */ enum _DEVICE_POWER_STATE DeviceState;
  }; /* size: 0x0004 */
} POWER_STATE, *PPOWER_STATE; /* size: 0x0004 */

typedef struct _INITIAL_PRIVILEGE_SET
{
  /* 0x0000 */ unsigned long PrivilegeCount;
  /* 0x0004 */ unsigned long Control;
  /* 0x0008 */ struct _LUID_AND_ATTRIBUTES Privilege[3];
} INITIAL_PRIVILEGE_SET, *PINITIAL_PRIVILEGE_SET; /* size: 0x002c */

typedef struct _SECURITY_SUBJECT_CONTEXT
{
  /* 0x0000 */ void* ClientToken;
  /* 0x0004 */ enum _SECURITY_IMPERSONATION_LEVEL ImpersonationLevel;
  /* 0x0008 */ void* PrimaryToken;
  /* 0x000c */ void* ProcessAuditId;
} SECURITY_SUBJECT_CONTEXT, *PSECURITY_SUBJECT_CONTEXT; /* size: 0x0010 */

typedef struct _NAMED_PIPE_CREATE_PARAMETERS
{
  /* 0x0000 */ unsigned long NamedPipeType;
  /* 0x0004 */ unsigned long ReadMode;
  /* 0x0008 */ unsigned long CompletionMode;
  /* 0x000c */ unsigned long MaximumInstances;
  /* 0x0010 */ unsigned long InboundQuota;
  /* 0x0014 */ unsigned long OutboundQuota;
  /* 0x0018 */ union _LARGE_INTEGER DefaultTimeout;
  /* 0x0020 */ unsigned char TimeoutSpecified;
  /* 0x0021 */ char __PADDING__[7];
} NAMED_PIPE_CREATE_PARAMETERS, *PNAMED_PIPE_CREATE_PARAMETERS; /* size: 0x0028 */

typedef struct _TEB_ACTIVE_FRAME_CONTEXT
{
  /* 0x0000 */ unsigned long Flags;
  /* 0x0004 */ const char* FrameName;
} TEB_ACTIVE_FRAME_CONTEXT, *PTEB_ACTIVE_FRAME_CONTEXT; /* size: 0x0008 */

typedef struct _DESCRIPTOR
{
  /* 0x0000 */ unsigned short Pad;
  /* 0x0002 */ unsigned short Limit;
  /* 0x0004 */ unsigned long Base;
} DESCRIPTOR, *PDESCRIPTOR; /* size: 0x0008 */

typedef struct _KSPECIAL_REGISTERS
{
  /* 0x0000 */ unsigned long Cr0;
  /* 0x0004 */ unsigned long Cr2;
  /* 0x0008 */ unsigned long Cr3;
  /* 0x000c */ unsigned long Cr4;
  /* 0x0010 */ unsigned long KernelDr0;
  /* 0x0014 */ unsigned long KernelDr1;
  /* 0x0018 */ unsigned long KernelDr2;
  /* 0x001c */ unsigned long KernelDr3;
  /* 0x0020 */ unsigned long KernelDr6;
  /* 0x0024 */ unsigned long KernelDr7;
  /* 0x0028 */ struct _DESCRIPTOR Gdtr;
  /* 0x0030 */ struct _DESCRIPTOR Idtr;
  /* 0x0038 */ unsigned short Tr;
  /* 0x003a */ unsigned short Ldtr;
  /* 0x003c */ unsigned long Reserved[6];
} KSPECIAL_REGISTERS, *PKSPECIAL_REGISTERS; /* size: 0x0054 */

typedef struct _KPROCESSOR_STATE
{
  /* 0x0000 */ struct _CONTEXT ContextFrame;
  /* 0x02cc */ struct _KSPECIAL_REGISTERS SpecialRegisters;
} KPROCESSOR_STATE, *PKPROCESSOR_STATE; /* size: 0x0320 */

typedef struct _KSPIN_LOCK_QUEUE
{
  /* 0x0000 */ struct _KSPIN_LOCK_QUEUE* volatile Next;
  /* 0x0004 */ unsigned long* volatile Lock;
} KSPIN_LOCK_QUEUE, *PKSPIN_LOCK_QUEUE; /* size: 0x0008 */

typedef struct _PP_LOOKASIDE_LIST
{
  /* 0x0000 */ struct _GENERAL_LOOKASIDE* P;
  /* 0x0004 */ struct _GENERAL_LOOKASIDE* L;
} PP_LOOKASIDE_LIST, *PPP_LOOKASIDE_LIST; /* size: 0x0008 */

typedef struct _FNSAVE_FORMAT
{
  /* 0x0000 */ unsigned long ControlWord;
  /* 0x0004 */ unsigned long StatusWord;
  /* 0x0008 */ unsigned long TagWord;
  /* 0x000c */ unsigned long ErrorOffset;
  /* 0x0010 */ unsigned long ErrorSelector;
  /* 0x0014 */ unsigned long DataOffset;
  /* 0x0018 */ unsigned long DataSelector;
  /* 0x001c */ unsigned char RegisterArea[80];
} FNSAVE_FORMAT, *PFNSAVE_FORMAT; /* size: 0x006c */

typedef struct _FXSAVE_FORMAT
{
  /* 0x0000 */ unsigned short ControlWord;
  /* 0x0002 */ unsigned short StatusWord;
  /* 0x0004 */ unsigned short TagWord;
  /* 0x0006 */ unsigned short ErrorOpcode;
  /* 0x0008 */ unsigned long ErrorOffset;
  /* 0x000c */ unsigned long ErrorSelector;
  /* 0x0010 */ unsigned long DataOffset;
  /* 0x0014 */ unsigned long DataSelector;
  /* 0x0018 */ unsigned long MXCsr;
  /* 0x001c */ unsigned long MXCsrMask;
  /* 0x0020 */ unsigned char RegisterArea[128];
  /* 0x00a0 */ unsigned char Reserved3[128];
  /* 0x0120 */ unsigned char Reserved4[224];
  /* 0x0200 */ unsigned char Align16Byte[8];
} FXSAVE_FORMAT, *PFXSAVE_FORMAT; /* size: 0x0208 */

typedef struct _FX_SAVE_AREA
{
  union
  {
    union
    {
      /* 0x0000 */ struct _FNSAVE_FORMAT FnArea;
      /* 0x0000 */ struct _FXSAVE_FORMAT FxArea;
    }; /* size: 0x0208 */
  } /* size: 0x0208 */ U;
  /* 0x0208 */ unsigned long NpxSavedCpu;
  /* 0x020c */ unsigned long Cr0NpxState;
} FX_SAVE_AREA, *PFX_SAVE_AREA; /* size: 0x0210 */

struct PROCESSOR_IDLE_TIMES
{
  /* 0x0000 */ unsigned __int64 StartTime;
  /* 0x0008 */ unsigned __int64 EndTime;
  /* 0x0010 */ unsigned long IdleHandlerReserved[4];
}; /* size: 0x0020 */

typedef struct _PROCESSOR_POWER_STATE
{
  /* 0x0000 */ void* IdleFunction /* function */;
  /* 0x0004 */ unsigned long Idle0KernelTimeLimit;
  /* 0x0008 */ unsigned long Idle0LastTime;
  /* 0x000c */ void* IdleHandlers;
  /* 0x0010 */ void* IdleState;
  /* 0x0014 */ unsigned long IdleHandlersCount;
  /* 0x0018 */ unsigned __int64 LastCheck;
  /* 0x0020 */ struct PROCESSOR_IDLE_TIMES IdleTimes;
  /* 0x0040 */ unsigned long IdleTime1;
  /* 0x0044 */ unsigned long PromotionCheck;
  /* 0x0048 */ unsigned long IdleTime2;
  /* 0x004c */ unsigned char CurrentThrottle;
  /* 0x004d */ unsigned char ThermalThrottleLimit;
  /* 0x004e */ unsigned char CurrentThrottleIndex;
  /* 0x004f */ unsigned char ThermalThrottleIndex;
  /* 0x0050 */ unsigned long LastKernelUserTime;
  /* 0x0054 */ unsigned long LastIdleThreadKernelTime;
  /* 0x0058 */ unsigned long PackageIdleStartTime;
  /* 0x005c */ unsigned long PackageIdleTime;
  /* 0x0060 */ unsigned long DebugCount;
  /* 0x0064 */ unsigned long LastSysTime;
  /* 0x0068 */ unsigned __int64 TotalIdleStateTime[3];
  /* 0x0080 */ unsigned long TotalIdleTransitions[3];
  /* 0x008c */ long Padding_1;
  /* 0x0090 */ unsigned __int64 PreviousC3StateTime;
  /* 0x0098 */ unsigned char KneeThrottleIndex;
  /* 0x0099 */ unsigned char ThrottleLimitIndex;
  /* 0x009a */ unsigned char PerfStatesCount;
  /* 0x009b */ unsigned char ProcessorMinThrottle;
  /* 0x009c */ unsigned char ProcessorMaxThrottle;
  /* 0x009d */ unsigned char EnableIdleAccounting;
  /* 0x009e */ unsigned char LastC3Percentage;
  /* 0x009f */ unsigned char LastAdjustedBusyPercentage;
  /* 0x00a0 */ unsigned long PromotionCount;
  /* 0x00a4 */ unsigned long DemotionCount;
  /* 0x00a8 */ unsigned long ErrorCount;
  /* 0x00ac */ unsigned long RetryCount;
  /* 0x00b0 */ unsigned long Flags;
  /* 0x00b4 */ long Padding_2;
  /* 0x00b8 */ union _LARGE_INTEGER PerfCounterFrequency;
  /* 0x00c0 */ unsigned long PerfTickCount;
  /* 0x00c4 */ long Padding_3;
  /* 0x00c8 */ struct _KTIMER PerfTimer;
  /* 0x00f0 */ struct _KDPC PerfDpc;
  /* 0x0110 */ struct PROCESSOR_PERF_STATE* PerfStates;
  /* 0x0114 */ void* PerfSetThrottle /* function */;
  /* 0x0118 */ unsigned long LastC3KernelUserTime;
  /* 0x011c */ unsigned long LastPackageIdleTime;
} PROCESSOR_POWER_STATE, *PPROCESSOR_POWER_STATE; /* size: 0x0120 */

typedef struct _KPRCB
{
  /* 0x0000 */ unsigned short MinorVersion;
  /* 0x0002 */ unsigned short MajorVersion;
  /* 0x0004 */ struct _KTHREAD* CurrentThread;
  /* 0x0008 */ struct _KTHREAD* NextThread;
  /* 0x000c */ struct _KTHREAD* IdleThread;
  /* 0x0010 */ char Number;
  /* 0x0011 */ char Reserved;
  /* 0x0012 */ unsigned short BuildType;
  /* 0x0014 */ unsigned long SetMember;
  /* 0x0018 */ char CpuType;
  /* 0x0019 */ char CpuID;
  /* 0x001a */ unsigned short CpuStep;
  /* 0x001c */ struct _KPROCESSOR_STATE ProcessorState;
  /* 0x033c */ unsigned long KernelReserved[16];
  /* 0x037c */ unsigned long HalReserved[16];
  /* 0x03bc */ unsigned char PrcbPad0[92];
  /* 0x0418 */ struct _KSPIN_LOCK_QUEUE LockQueue[16];
  /* 0x0498 */ unsigned char PrcbPad1[8];
  /* 0x04a0 */ struct _KTHREAD* NpxThread;
  /* 0x04a4 */ unsigned long InterruptCount;
  /* 0x04a8 */ unsigned long KernelTime;
  /* 0x04ac */ unsigned long UserTime;
  /* 0x04b0 */ unsigned long DpcTime;
  /* 0x04b4 */ unsigned long DebugDpcTime;
  /* 0x04b8 */ unsigned long InterruptTime;
  /* 0x04bc */ unsigned long AdjustDpcThreshold;
  /* 0x04c0 */ unsigned long PageColor;
  /* 0x04c4 */ unsigned long SkipTick;
  /* 0x04c8 */ unsigned char MultiThreadSetBusy;
  /* 0x04c9 */ unsigned char Spare2[3];
  /* 0x04cc */ struct _KNODE* ParentNode;
  /* 0x04d0 */ unsigned long MultiThreadProcessorSet;
  /* 0x04d4 */ struct _KPRCB* MultiThreadSetMaster;
  /* 0x04d8 */ unsigned long ThreadStartCount[2];
  /* 0x04e0 */ unsigned long CcFastReadNoWait;
  /* 0x04e4 */ unsigned long CcFastReadWait;
  /* 0x04e8 */ unsigned long CcFastReadNotPossible;
  /* 0x04ec */ unsigned long CcCopyReadNoWait;
  /* 0x04f0 */ unsigned long CcCopyReadWait;
  /* 0x04f4 */ unsigned long CcCopyReadNoWaitMiss;
  /* 0x04f8 */ unsigned long KeAlignmentFixupCount;
  /* 0x04fc */ unsigned long KeContextSwitches;
  /* 0x0500 */ unsigned long KeDcacheFlushCount;
  /* 0x0504 */ unsigned long KeExceptionDispatchCount;
  /* 0x0508 */ unsigned long KeFirstLevelTbFills;
  /* 0x050c */ unsigned long KeFloatingEmulationCount;
  /* 0x0510 */ unsigned long KeIcacheFlushCount;
  /* 0x0514 */ unsigned long KeSecondLevelTbFills;
  /* 0x0518 */ unsigned long KeSystemCalls;
  /* 0x051c */ unsigned long SpareCounter0[1];
  /* 0x0520 */ struct _PP_LOOKASIDE_LIST PPLookasideList[16];
  /* 0x05a0 */ struct _PP_LOOKASIDE_LIST PPNPagedLookasideList[32];
  /* 0x06a0 */ struct _PP_LOOKASIDE_LIST PPPagedLookasideList[32];
  /* 0x07a0 */ volatile unsigned long PacketBarrier;
  /* 0x07a4 */ volatile unsigned long ReverseStall;
  /* 0x07a8 */ void* IpiFrame;
  /* 0x07ac */ unsigned char PrcbPad2[52];
  /* 0x07e0 */ void* volatile CurrentPacket[3];
  /* 0x07ec */ volatile unsigned long TargetSet;
  /* 0x07f0 */ void* volatile WorkerRoutine /* function */;
  /* 0x07f4 */ volatile unsigned long IpiFrozen;
  /* 0x07f8 */ unsigned char PrcbPad3[40];
  /* 0x0820 */ volatile unsigned long RequestSummary;
  /* 0x0824 */ volatile struct _KPRCB* SignalDone;
  /* 0x0828 */ unsigned char PrcbPad4[56];
  /* 0x0860 */ struct _LIST_ENTRY DpcListHead;
  /* 0x0868 */ void* DpcStack;
  /* 0x086c */ unsigned long DpcCount;
  /* 0x0870 */ volatile unsigned long DpcQueueDepth;
  /* 0x0874 */ volatile unsigned long DpcRoutineActive;
  /* 0x0878 */ volatile unsigned long DpcInterruptRequested;
  /* 0x087c */ unsigned long DpcLastCount;
  /* 0x0880 */ unsigned long DpcRequestRate;
  /* 0x0884 */ unsigned long MaximumDpcQueueDepth;
  /* 0x0888 */ unsigned long MinimumDpcRate;
  /* 0x088c */ unsigned long QuantumEnd;
  /* 0x0890 */ unsigned char PrcbPad5[16];
  /* 0x08a0 */ unsigned long DpcLock;
  /* 0x08a4 */ unsigned char PrcbPad6[28];
  /* 0x08c0 */ struct _KDPC CallDpc;
  /* 0x08e0 */ void* ChainedInterruptList;
  /* 0x08e4 */ long LookasideIrpFloat;
  /* 0x08e8 */ unsigned long SpareFields0[6];
  /* 0x0900 */ unsigned char VendorString[13];
  /* 0x090d */ unsigned char InitialApicId;
  /* 0x090e */ unsigned char LogicalProcessorsPerPhysicalProcessor;
  /* 0x090f */ char Padding_4;
  /* 0x0910 */ unsigned long MHz;
  /* 0x0914 */ unsigned long FeatureBits;
  /* 0x0918 */ union _LARGE_INTEGER UpdateSignature;
  /* 0x0920 */ struct _FX_SAVE_AREA NpxSaveArea;
  /* 0x0b30 */ struct _PROCESSOR_POWER_STATE PowerState;
} KPRCB, *PKPRCB; /* size: 0x0c50 */

typedef struct _EX_PUSH_LOCK
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long Waiting : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned long Exclusive : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned long Shared : 30; /* bit position: 2 */
    }; /* bitfield */
    /* 0x0000 */ unsigned long Value;
    /* 0x0000 */ void* Ptr;
  }; /* size: 0x0004 */
} EX_PUSH_LOCK, *PEX_PUSH_LOCK; /* size: 0x0004 */

typedef struct _HANDLE_TABLE
{
  /* 0x0000 */ unsigned long TableCode;
  /* 0x0004 */ struct _EPROCESS* QuotaProcess;
  /* 0x0008 */ void* UniqueProcessId;
  /* 0x000c */ struct _EX_PUSH_LOCK HandleTableLock[4];
  /* 0x001c */ struct _LIST_ENTRY HandleTableList;
  /* 0x0024 */ struct _EX_PUSH_LOCK HandleContentionEvent;
  /* 0x0028 */ struct _HANDLE_TRACE_DEBUG_INFO* DebugInfo;
  /* 0x002c */ long ExtraInfoPages;
  /* 0x0030 */ unsigned long FirstFree;
  /* 0x0034 */ unsigned long LastFree;
  /* 0x0038 */ unsigned long NextHandleNeedingPool;
  /* 0x003c */ long HandleCount;
  union
  {
    /* 0x0040 */ unsigned long Flags;
    struct
    {
      /* 0x0040 */ unsigned char StrictFIFO : 1; /* bit position: 0 */
      /* 0x0041 */ char __PADDING__[3];
    }; /* size: 0x0004 */
  }; /* size: 0x0004 */
} HANDLE_TABLE, *PHANDLE_TABLE; /* size: 0x0044 */

typedef struct _FAST_IO_DISPATCH
{
  /* 0x0000 */ unsigned long SizeOfFastIoDispatch;
  /* 0x0004 */ void* FastIoCheckIfPossible /* function */;
  /* 0x0008 */ void* FastIoRead /* function */;
  /* 0x000c */ void* FastIoWrite /* function */;
  /* 0x0010 */ void* FastIoQueryBasicInfo /* function */;
  /* 0x0014 */ void* FastIoQueryStandardInfo /* function */;
  /* 0x0018 */ void* FastIoLock /* function */;
  /* 0x001c */ void* FastIoUnlockSingle /* function */;
  /* 0x0020 */ void* FastIoUnlockAll /* function */;
  /* 0x0024 */ void* FastIoUnlockAllByKey /* function */;
  /* 0x0028 */ void* FastIoDeviceControl /* function */;
  /* 0x002c */ void* AcquireFileForNtCreateSection /* function */;
  /* 0x0030 */ void* ReleaseFileForNtCreateSection /* function */;
  /* 0x0034 */ void* FastIoDetachDevice /* function */;
  /* 0x0038 */ void* FastIoQueryNetworkOpenInfo /* function */;
  /* 0x003c */ void* AcquireForModWrite /* function */;
  /* 0x0040 */ void* MdlRead /* function */;
  /* 0x0044 */ void* MdlReadComplete /* function */;
  /* 0x0048 */ void* PrepareMdlWrite /* function */;
  /* 0x004c */ void* MdlWriteComplete /* function */;
  /* 0x0050 */ void* FastIoReadCompressed /* function */;
  /* 0x0054 */ void* FastIoWriteCompressed /* function */;
  /* 0x0058 */ void* MdlReadCompleteCompressed /* function */;
  /* 0x005c */ void* MdlWriteCompleteCompressed /* function */;
  /* 0x0060 */ void* FastIoQueryOpen /* function */;
  /* 0x0064 */ void* ReleaseForModWrite /* function */;
  /* 0x0068 */ void* AcquireForCcFlush /* function */;
  /* 0x006c */ void* ReleaseForCcFlush /* function */;
} FAST_IO_DISPATCH, *PFAST_IO_DISPATCH; /* size: 0x0070 */

typedef union _SLIST_HEADER
{
  union
  {
    /* 0x0000 */ unsigned __int64 Alignment;
    struct
    {
      /* 0x0000 */ struct _SINGLE_LIST_ENTRY Next;
      /* 0x0004 */ unsigned short Depth;
      /* 0x0006 */ unsigned short Sequence;
    }; /* size: 0x0008 */
  }; /* size: 0x0008 */
} SLIST_HEADER, *PSLIST_HEADER; /* size: 0x0008 */

typedef struct _flags
{
  /* 0x0000 */ unsigned char Removable;
} flags, *Pflags; /* size: 0x0001 */

typedef struct _KNODE
{
  /* 0x0000 */ unsigned long ProcessorMask;
  /* 0x0004 */ unsigned long Color;
  /* 0x0008 */ unsigned long MmShiftedColor;
  /* 0x000c */ unsigned long FreeCount[2];
  /* 0x0014 */ long Padding_5;
  /* 0x0018 */ union _SLIST_HEADER DeadStackList;
  /* 0x0020 */ union _SLIST_HEADER PfnDereferenceSListHead;
  /* 0x0028 */ struct _SINGLE_LIST_ENTRY* PfnDeferredList;
  /* 0x002c */ unsigned char Seed;
  /* 0x002d */ struct _flags Flags;
  /* 0x002e */ char __PADDING__[2];
} KNODE, *PKNODE; /* size: 0x0030 */

typedef struct _OWNER_ENTRY
{
  /* 0x0000 */ unsigned long OwnerThread;
  union
  {
    /* 0x0004 */ long OwnerCount;
    /* 0x0004 */ unsigned long TableSize;
  }; /* size: 0x0004 */
} OWNER_ENTRY, *POWNER_ENTRY; /* size: 0x0008 */

typedef struct _GENERAL_LOOKASIDE
{
  /* 0x0000 */ union _SLIST_HEADER ListHead;
  /* 0x0008 */ unsigned short Depth;
  /* 0x000a */ unsigned short MaximumDepth;
  /* 0x000c */ unsigned long TotalAllocates;
  union
  {
    /* 0x0010 */ unsigned long AllocateMisses;
    /* 0x0010 */ unsigned long AllocateHits;
  }; /* size: 0x0004 */
  /* 0x0014 */ unsigned long TotalFrees;
  union
  {
    /* 0x0018 */ unsigned long FreeMisses;
    /* 0x0018 */ unsigned long FreeHits;
  }; /* size: 0x0004 */
  /* 0x001c */ enum _POOL_TYPE Type;
  /* 0x0020 */ unsigned long Tag;
  /* 0x0024 */ unsigned long Size;
  /* 0x0028 */ void* Allocate /* function */;
  /* 0x002c */ void* Free /* function */;
  /* 0x0030 */ struct _LIST_ENTRY ListEntry;
  /* 0x0038 */ unsigned long LastTotalAllocates;
  union
  {
    /* 0x003c */ unsigned long LastAllocateMisses;
    /* 0x003c */ unsigned long LastAllocateHits;
  }; /* size: 0x0004 */
  /* 0x0040 */ unsigned long Future[2];
  /* 0x0048 */ long __PADDING__[14];
} GENERAL_LOOKASIDE, *PGENERAL_LOOKASIDE; /* size: 0x0080 */

typedef struct _FILE_STANDARD_INFORMATION
{
  /* 0x0000 */ union _LARGE_INTEGER AllocationSize;
  /* 0x0008 */ union _LARGE_INTEGER EndOfFile;
  /* 0x0010 */ unsigned long NumberOfLinks;
  /* 0x0014 */ unsigned char DeletePending;
  /* 0x0015 */ unsigned char Directory;
  /* 0x0016 */ char __PADDING__[2];
} FILE_STANDARD_INFORMATION, *PFILE_STANDARD_INFORMATION; /* size: 0x0018 */

typedef struct _EX_RUNDOWN_REF
{
  union
  {
    /* 0x0000 */ unsigned long Count;
    /* 0x0000 */ void* Ptr;
  }; /* size: 0x0004 */
} EX_RUNDOWN_REF, *PEX_RUNDOWN_REF; /* size: 0x0004 */

typedef struct _EX_FAST_REF
{
  union
  {
    /* 0x0000 */ void* Object;
    /* 0x0000 */ unsigned long RefCnt : 3; /* bit position: 0 */
    /* 0x0000 */ unsigned long Value;
  }; /* size: 0x0004 */
} EX_FAST_REF, *PEX_FAST_REF; /* size: 0x0004 */

typedef struct _KEVENT
{
  /* 0x0000 */ struct _DISPATCHER_HEADER Header;
} KEVENT, *PKEVENT; /* size: 0x0010 */

typedef struct _FAST_MUTEX
{
  /* 0x0000 */ long Count;
  /* 0x0004 */ struct _KTHREAD* Owner;
  /* 0x0008 */ unsigned long Contention;
  /* 0x000c */ struct _KEVENT Event;
  /* 0x001c */ unsigned long OldIrql;
} FAST_MUTEX, *PFAST_MUTEX; /* size: 0x0020 */

typedef struct _HARDWARE_PTE_X86
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned long Valid : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned long Write : 1; /* bit position: 1 */
    /* 0x0000 */ unsigned long Owner : 1; /* bit position: 2 */
    /* 0x0000 */ unsigned long WriteThrough : 1; /* bit position: 3 */
    /* 0x0000 */ unsigned long CacheDisable : 1; /* bit position: 4 */
    /* 0x0000 */ unsigned long Accessed : 1; /* bit position: 5 */
    /* 0x0000 */ unsigned long Dirty : 1; /* bit position: 6 */
    /* 0x0000 */ unsigned long LargePage : 1; /* bit position: 7 */
    /* 0x0000 */ unsigned long Global : 1; /* bit position: 8 */
    /* 0x0000 */ unsigned long CopyOnWrite : 1; /* bit position: 9 */
    /* 0x0000 */ unsigned long Prototype : 1; /* bit position: 10 */
    /* 0x0000 */ unsigned long reserved : 1; /* bit position: 11 */
    /* 0x0000 */ unsigned long PageFrameNumber : 20; /* bit position: 12 */
  }; /* bitfield */
} HARDWARE_PTE_X86, *PHARDWARE_PTE_X86; /* size: 0x0004 */

typedef struct _SE_AUDIT_PROCESS_CREATION_INFO
{
  /* 0x0000 */ struct _OBJECT_NAME_INFORMATION* ImageFileName;
} SE_AUDIT_PROCESS_CREATION_INFO, *PSE_AUDIT_PROCESS_CREATION_INFO; /* size: 0x0004 */

typedef struct _MMSUPPORT_FLAGS
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned int SessionSpace : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned int BeingTrimmed : 1; /* bit position: 1 */
    /* 0x0000 */ unsigned int SessionLeader : 1; /* bit position: 2 */
    /* 0x0000 */ unsigned int TrimHard : 1; /* bit position: 3 */
    /* 0x0000 */ unsigned int WorkingSetHard : 1; /* bit position: 4 */
    /* 0x0000 */ unsigned int AddressSpaceBeingDeleted : 1; /* bit position: 5 */
    /* 0x0000 */ unsigned int Available : 10; /* bit position: 6 */
    /* 0x0000 */ unsigned int AllowWorkingSetAdjustment : 8; /* bit position: 16 */
    /* 0x0000 */ unsigned int MemoryPriority : 8; /* bit position: 24 */
  }; /* bitfield */
} MMSUPPORT_FLAGS, *PMMSUPPORT_FLAGS; /* size: 0x0004 */

typedef struct _MMSUPPORT
{
  /* 0x0000 */ union _LARGE_INTEGER LastTrimTime;
  /* 0x0008 */ struct _MMSUPPORT_FLAGS Flags;
  /* 0x000c */ unsigned long PageFaultCount;
  /* 0x0010 */ unsigned long PeakWorkingSetSize;
  /* 0x0014 */ unsigned long WorkingSetSize;
  /* 0x0018 */ unsigned long MinimumWorkingSetSize;
  /* 0x001c */ unsigned long MaximumWorkingSetSize;
  /* 0x0020 */ struct _MMWSL* VmWorkingSetList;
  /* 0x0024 */ struct _LIST_ENTRY WorkingSetExpansionLinks;
  /* 0x002c */ unsigned long Claim;
  /* 0x0030 */ unsigned long NextEstimationSlot;
  /* 0x0034 */ unsigned long NextAgingSlot;
  /* 0x0038 */ unsigned long EstimatedAvailable;
  /* 0x003c */ unsigned long GrowthSinceLastEstimate;
} MMSUPPORT, *PMMSUPPORT; /* size: 0x0040 */

typedef struct _EPROCESS
{
  /* 0x0000 */ struct _KPROCESS Pcb;
  /* 0x006c */ struct _EX_PUSH_LOCK ProcessLock;
  /* 0x0070 */ union _LARGE_INTEGER CreateTime;
  /* 0x0078 */ union _LARGE_INTEGER ExitTime;
  /* 0x0080 */ struct _EX_RUNDOWN_REF RundownProtect;
  /* 0x0084 */ void* UniqueProcessId;
  /* 0x0088 */ struct _LIST_ENTRY ActiveProcessLinks;
  /* 0x0090 */ unsigned long QuotaUsage[3];
  /* 0x009c */ unsigned long QuotaPeak[3];
  /* 0x00a8 */ unsigned long CommitCharge;
  /* 0x00ac */ unsigned long PeakVirtualSize;
  /* 0x00b0 */ unsigned long VirtualSize;
  /* 0x00b4 */ struct _LIST_ENTRY SessionProcessLinks;
  /* 0x00bc */ void* DebugPort;
  /* 0x00c0 */ void* ExceptionPort;
  /* 0x00c4 */ struct _HANDLE_TABLE* ObjectTable;
  /* 0x00c8 */ struct _EX_FAST_REF Token;
  /* 0x00cc */ struct _FAST_MUTEX WorkingSetLock;
  /* 0x00ec */ unsigned long WorkingSetPage;
  /* 0x00f0 */ struct _FAST_MUTEX AddressCreationLock;
  /* 0x0110 */ unsigned long HyperSpaceLock;
  /* 0x0114 */ struct _ETHREAD* ForkInProgress;
  /* 0x0118 */ unsigned long HardwareTrigger;
  /* 0x011c */ void* VadRoot;
  /* 0x0120 */ void* VadHint;
  /* 0x0124 */ void* CloneRoot;
  /* 0x0128 */ unsigned long NumberOfPrivatePages;
  /* 0x012c */ unsigned long NumberOfLockedPages;
  /* 0x0130 */ void* Win32Process;
  /* 0x0134 */ struct _EJOB* Job;
  /* 0x0138 */ void* SectionObject;
  /* 0x013c */ void* SectionBaseAddress;
  /* 0x0140 */ struct _EPROCESS_QUOTA_BLOCK* QuotaBlock;
  /* 0x0144 */ struct _PAGEFAULT_HISTORY* WorkingSetWatch;
  /* 0x0148 */ void* Win32WindowStation;
  /* 0x014c */ void* InheritedFromUniqueProcessId;
  /* 0x0150 */ void* LdtInformation;
  /* 0x0154 */ void* VadFreeHint;
  /* 0x0158 */ void* VdmObjects;
  /* 0x015c */ void* DeviceMap;
  /* 0x0160 */ struct _LIST_ENTRY PhysicalVadList;
  union
  {
    /* 0x0168 */ struct _HARDWARE_PTE_X86 PageDirectoryPte;
    /* 0x0168 */ unsigned __int64 Filler;
  }; /* size: 0x0008 */
  /* 0x0170 */ void* Session;
  /* 0x0174 */ unsigned char ImageFileName[16];
  /* 0x0184 */ struct _LIST_ENTRY JobLinks;
  /* 0x018c */ void* LockedPagesList;
  /* 0x0190 */ struct _LIST_ENTRY ThreadListHead;
  /* 0x0198 */ void* SecurityPort;
  /* 0x019c */ void* PaeTop;
  /* 0x01a0 */ unsigned long ActiveThreads;
  /* 0x01a4 */ unsigned long GrantedAccess;
  /* 0x01a8 */ unsigned long DefaultHardErrorProcessing;
  /* 0x01ac */ long LastThreadExitStatus;
  /* 0x01b0 */ struct _PEB* Peb;
  /* 0x01b4 */ struct _EX_FAST_REF PrefetchTrace;
  /* 0x01b8 */ union _LARGE_INTEGER ReadOperationCount;
  /* 0x01c0 */ union _LARGE_INTEGER WriteOperationCount;
  /* 0x01c8 */ union _LARGE_INTEGER OtherOperationCount;
  /* 0x01d0 */ union _LARGE_INTEGER ReadTransferCount;
  /* 0x01d8 */ union _LARGE_INTEGER WriteTransferCount;
  /* 0x01e0 */ union _LARGE_INTEGER OtherTransferCount;
  /* 0x01e8 */ unsigned long CommitChargeLimit;
  /* 0x01ec */ unsigned long CommitChargePeak;
  /* 0x01f0 */ void* AweInfo;
  /* 0x01f4 */ struct _SE_AUDIT_PROCESS_CREATION_INFO SeAuditProcessCreationInfo;
  /* 0x01f8 */ struct _MMSUPPORT Vm;
  /* 0x0238 */ unsigned long LastFaultCount;
  /* 0x023c */ unsigned long ModifiedPageCount;
  /* 0x0240 */ unsigned long NumberOfVads;
  /* 0x0244 */ unsigned long JobStatus;
  union
  {
    /* 0x0248 */ unsigned long Flags;
    struct /* bitfield */
    {
      /* 0x0248 */ unsigned long CreateReported : 1; /* bit position: 0 */
      /* 0x0248 */ unsigned long NoDebugInherit : 1; /* bit position: 1 */
      /* 0x0248 */ unsigned long ProcessExiting : 1; /* bit position: 2 */
      /* 0x0248 */ unsigned long ProcessDelete : 1; /* bit position: 3 */
      /* 0x0248 */ unsigned long Wow64SplitPages : 1; /* bit position: 4 */
      /* 0x0248 */ unsigned long VmDeleted : 1; /* bit position: 5 */
      /* 0x0248 */ unsigned long OutswapEnabled : 1; /* bit position: 6 */
      /* 0x0248 */ unsigned long Outswapped : 1; /* bit position: 7 */
      /* 0x0248 */ unsigned long ForkFailed : 1; /* bit position: 8 */
      /* 0x0248 */ unsigned long HasPhysicalVad : 1; /* bit position: 9 */
      /* 0x0248 */ unsigned long AddressSpaceInitialized : 2; /* bit position: 10 */
      /* 0x0248 */ unsigned long SetTimerResolution : 1; /* bit position: 12 */
      /* 0x0248 */ unsigned long BreakOnTermination : 1; /* bit position: 13 */
      /* 0x0248 */ unsigned long SessionCreationUnderway : 1; /* bit position: 14 */
      /* 0x0248 */ unsigned long WriteWatch : 1; /* bit position: 15 */
      /* 0x0248 */ unsigned long ProcessInSession : 1; /* bit position: 16 */
      /* 0x0248 */ unsigned long OverrideAddressSpace : 1; /* bit position: 17 */
      /* 0x0248 */ unsigned long HasAddressSpace : 1; /* bit position: 18 */
      /* 0x0248 */ unsigned long LaunchPrefetched : 1; /* bit position: 19 */
      /* 0x0248 */ unsigned long InjectInpageErrors : 1; /* bit position: 20 */
      /* 0x0248 */ unsigned long VmTopDown : 1; /* bit position: 21 */
      /* 0x0248 */ unsigned long Unused3 : 1; /* bit position: 22 */
      /* 0x0248 */ unsigned long Unused4 : 1; /* bit position: 23 */
      /* 0x0248 */ unsigned long VdmAllowed : 1; /* bit position: 24 */
      /* 0x0248 */ unsigned long Unused : 5; /* bit position: 25 */
      /* 0x0248 */ unsigned long Unused1 : 1; /* bit position: 30 */
      /* 0x0248 */ unsigned long Unused2 : 1; /* bit position: 31 */
    }; /* bitfield */
  }; /* size: 0x0004 */
  /* 0x024c */ long ExitStatus;
  /* 0x0250 */ unsigned short NextPageColor;
  union
  {
    struct
    {
      /* 0x0252 */ unsigned char SubSystemMinorVersion;
      /* 0x0253 */ unsigned char SubSystemMajorVersion;
    }; /* size: 0x0002 */
    /* 0x0252 */ unsigned short SubSystemVersion;
  }; /* size: 0x0002 */
  /* 0x0254 */ unsigned char PriorityClass;
  /* 0x0255 */ unsigned char WorkingSetAcquiredUnsafe;
  /* 0x0256 */ char Padding_6[2];
  /* 0x0258 */ unsigned long Cookie;
  /* 0x025c */ long __PADDING__[1];
} EPROCESS, *PEPROCESS; /* size: 0x0260 */

struct PROCESSOR_PERF_STATE
{
  /* 0x0000 */ unsigned char PercentFrequency;
  /* 0x0001 */ unsigned char MinCapacity;
  /* 0x0002 */ unsigned short Power;
  /* 0x0004 */ unsigned char IncreaseLevel;
  /* 0x0005 */ unsigned char DecreaseLevel;
  /* 0x0006 */ unsigned short Flags;
  /* 0x0008 */ unsigned long IncreaseTime;
  /* 0x000c */ unsigned long DecreaseTime;
  /* 0x0010 */ unsigned long IncreaseCount;
  /* 0x0014 */ unsigned long DecreaseCount;
  /* 0x0018 */ unsigned __int64 PerformanceTime;
}; /* size: 0x0020 */

typedef struct _NPAGED_LOOKASIDE_LIST
{
  /* 0x0000 */ struct _GENERAL_LOOKASIDE L;
  /* 0x0080 */ unsigned long Lock__ObsoleteButDoNotDelete;
  /* 0x0084 */ long __PADDING__[31];
} NPAGED_LOOKASIDE_LIST, *PNPAGED_LOOKASIDE_LIST; /* size: 0x0100 */

typedef struct _PAGED_LOOKASIDE_LIST
{
  /* 0x0000 */ struct _GENERAL_LOOKASIDE L;
  /* 0x0080 */ struct _FAST_MUTEX Lock__ObsoleteButDoNotDelete;
  /* 0x00a0 */ long __PADDING__[24];
} PAGED_LOOKASIDE_LIST, *PPAGED_LOOKASIDE_LIST; /* size: 0x0100 */

typedef struct _CLIENT_ID
{
  /* 0x0000 */ void* UniqueProcess;
  /* 0x0004 */ void* UniqueThread;
} CLIENT_ID, *PCLIENT_ID; /* size: 0x0008 */

typedef struct _HANDLE_TRACE_DB_ENTRY
{
  /* 0x0000 */ struct _CLIENT_ID ClientId;
  /* 0x0008 */ void* Handle;
  /* 0x000c */ unsigned long Type;
  /* 0x0010 */ void* StackTrace[16];
} HANDLE_TRACE_DB_ENTRY, *PHANDLE_TRACE_DB_ENTRY; /* size: 0x0050 */

typedef struct _EX_PUSH_LOCK_WAIT_BLOCK
{
  /* 0x0000 */ struct _KEVENT WakeEvent;
  /* 0x0010 */ struct _EX_PUSH_LOCK_WAIT_BLOCK* Next;
  /* 0x0014 */ unsigned long ShareCount;
  /* 0x0018 */ unsigned char Exclusive;
  /* 0x0019 */ char __PADDING__[3];
} EX_PUSH_LOCK_WAIT_BLOCK, *PEX_PUSH_LOCK_WAIT_BLOCK; /* size: 0x001c */

typedef struct _ERESOURCE
{
  /* 0x0000 */ struct _LIST_ENTRY SystemResourcesList;
  /* 0x0008 */ struct _OWNER_ENTRY* OwnerTable;
  /* 0x000c */ short ActiveCount;
  /* 0x000e */ unsigned short Flag;
  /* 0x0010 */ struct _KSEMAPHORE* SharedWaiters;
  /* 0x0014 */ struct _KEVENT* ExclusiveWaiters;
  /* 0x0018 */ struct _OWNER_ENTRY OwnerThreads[2];
  /* 0x0028 */ unsigned long ContentionCount;
  /* 0x002c */ unsigned short NumberOfSharedWaiters;
  /* 0x002e */ unsigned short NumberOfExclusiveWaiters;
  union
  {
    /* 0x0030 */ void* Address;
    /* 0x0030 */ unsigned long CreatorBackTraceIndex;
  }; /* size: 0x0004 */
  /* 0x0034 */ unsigned long SpinLock;
} ERESOURCE, *PERESOURCE; /* size: 0x0038 */

typedef struct _IO_COUNTERS
{
  /* 0x0000 */ unsigned __int64 ReadOperationCount;
  /* 0x0008 */ unsigned __int64 WriteOperationCount;
  /* 0x0010 */ unsigned __int64 OtherOperationCount;
  /* 0x0018 */ unsigned __int64 ReadTransferCount;
  /* 0x0020 */ unsigned __int64 WriteTransferCount;
  /* 0x0028 */ unsigned __int64 OtherTransferCount;
} IO_COUNTERS, *PIO_COUNTERS; /* size: 0x0030 */

typedef struct _EJOB
{
  /* 0x0000 */ struct _KEVENT Event;
  /* 0x0010 */ struct _LIST_ENTRY JobLinks;
  /* 0x0018 */ struct _LIST_ENTRY ProcessListHead;
  /* 0x0020 */ struct _ERESOURCE JobLock;
  /* 0x0058 */ union _LARGE_INTEGER TotalUserTime;
  /* 0x0060 */ union _LARGE_INTEGER TotalKernelTime;
  /* 0x0068 */ union _LARGE_INTEGER ThisPeriodTotalUserTime;
  /* 0x0070 */ union _LARGE_INTEGER ThisPeriodTotalKernelTime;
  /* 0x0078 */ unsigned long TotalPageFaultCount;
  /* 0x007c */ unsigned long TotalProcesses;
  /* 0x0080 */ unsigned long ActiveProcesses;
  /* 0x0084 */ unsigned long TotalTerminatedProcesses;
  /* 0x0088 */ union _LARGE_INTEGER PerProcessUserTimeLimit;
  /* 0x0090 */ union _LARGE_INTEGER PerJobUserTimeLimit;
  /* 0x0098 */ unsigned long LimitFlags;
  /* 0x009c */ unsigned long MinimumWorkingSetSize;
  /* 0x00a0 */ unsigned long MaximumWorkingSetSize;
  /* 0x00a4 */ unsigned long ActiveProcessLimit;
  /* 0x00a8 */ unsigned long Affinity;
  /* 0x00ac */ unsigned char PriorityClass;
  /* 0x00ad */ char Padding_7[3];
  /* 0x00b0 */ unsigned long UIRestrictionsClass;
  /* 0x00b4 */ unsigned long SecurityLimitFlags;
  /* 0x00b8 */ void* Token;
  /* 0x00bc */ struct _PS_JOB_TOKEN_FILTER* Filter;
  /* 0x00c0 */ unsigned long EndOfJobTimeAction;
  /* 0x00c4 */ void* CompletionPort;
  /* 0x00c8 */ void* CompletionKey;
  /* 0x00cc */ unsigned long SessionId;
  /* 0x00d0 */ unsigned long SchedulingClass;
  /* 0x00d4 */ long Padding_8;
  /* 0x00d8 */ unsigned __int64 ReadOperationCount;
  /* 0x00e0 */ unsigned __int64 WriteOperationCount;
  /* 0x00e8 */ unsigned __int64 OtherOperationCount;
  /* 0x00f0 */ unsigned __int64 ReadTransferCount;
  /* 0x00f8 */ unsigned __int64 WriteTransferCount;
  /* 0x0100 */ unsigned __int64 OtherTransferCount;
  /* 0x0108 */ struct _IO_COUNTERS IoInfo;
  /* 0x0138 */ unsigned long ProcessMemoryLimit;
  /* 0x013c */ unsigned long JobMemoryLimit;
  /* 0x0140 */ unsigned long PeakProcessMemoryUsed;
  /* 0x0144 */ unsigned long PeakJobMemoryUsed;
  /* 0x0148 */ unsigned long CurrentJobMemoryUsed;
  /* 0x014c */ struct _FAST_MUTEX MemoryLimitsLock;
  /* 0x016c */ struct _LIST_ENTRY JobSetLinks;
  /* 0x0174 */ unsigned long MemberLevel;
  /* 0x0178 */ unsigned long JobFlags;
  /* 0x017c */ long __PADDING__[1];
} EJOB, *PEJOB; /* size: 0x0180 */

typedef struct _EX_PUSH_LOCK_CACHE_AWARE
{
  /* 0x0000 */ struct _EX_PUSH_LOCK* Locks[32];
} EX_PUSH_LOCK_CACHE_AWARE, *PEX_PUSH_LOCK_CACHE_AWARE; /* size: 0x0080 */

typedef struct _ETHREAD
{
  /* 0x0000 */ struct _KTHREAD Tcb;
  union
  {
    /* 0x01c0 */ union _LARGE_INTEGER CreateTime;
    struct /* bitfield */
    {
      /* 0x01c0 */ unsigned int NestedFaultCount : 2; /* bit position: 0 */
      /* 0x01c0 */ unsigned int ApcNeeded : 1; /* bit position: 2 */
    }; /* bitfield */
  }; /* size: 0x0008 */
  union
  {
    /* 0x01c8 */ union _LARGE_INTEGER ExitTime;
    /* 0x01c8 */ struct _LIST_ENTRY LpcReplyChain;
    /* 0x01c8 */ struct _LIST_ENTRY KeyedWaitChain;
  }; /* size: 0x0008 */
  union
  {
    /* 0x01d0 */ long ExitStatus;
    /* 0x01d0 */ void* OfsChain;
  }; /* size: 0x0004 */
  /* 0x01d4 */ struct _LIST_ENTRY PostBlockList;
  union
  {
    /* 0x01dc */ struct _TERMINATION_PORT* TerminationPort;
    /* 0x01dc */ struct _ETHREAD* ReaperLink;
    /* 0x01dc */ void* KeyedWaitValue;
  }; /* size: 0x0004 */
  /* 0x01e0 */ unsigned long ActiveTimerListLock;
  /* 0x01e4 */ struct _LIST_ENTRY ActiveTimerListHead;
  /* 0x01ec */ struct _CLIENT_ID Cid;
  union
  {
    /* 0x01f4 */ struct _KSEMAPHORE LpcReplySemaphore;
    /* 0x01f4 */ struct _KSEMAPHORE KeyedWaitSemaphore;
  }; /* size: 0x0014 */
  union
  {
    /* 0x0208 */ void* LpcReplyMessage;
    /* 0x0208 */ void* LpcWaitingOnPort;
  }; /* size: 0x0004 */
  /* 0x020c */ struct _PS_IMPERSONATION_INFORMATION* ImpersonationInfo;
  /* 0x0210 */ struct _LIST_ENTRY IrpList;
  /* 0x0218 */ unsigned long TopLevelIrp;
  /* 0x021c */ struct _DEVICE_OBJECT* DeviceToVerify;
  /* 0x0220 */ struct _EPROCESS* ThreadsProcess;
  /* 0x0224 */ void* StartAddress;
  union
  {
    /* 0x0228 */ void* Win32StartAddress;
    /* 0x0228 */ unsigned long LpcReceivedMessageId;
  }; /* size: 0x0004 */
  /* 0x022c */ struct _LIST_ENTRY ThreadListEntry;
  /* 0x0234 */ struct _EX_RUNDOWN_REF RundownProtect;
  /* 0x0238 */ struct _EX_PUSH_LOCK ThreadLock;
  /* 0x023c */ unsigned long LpcReplyMessageId;
  /* 0x0240 */ unsigned long ReadClusterSize;
  /* 0x0244 */ unsigned long GrantedAccess;
  union
  {
    /* 0x0248 */ unsigned long CrossThreadFlags;
    struct /* bitfield */
    {
      /* 0x0248 */ unsigned long Terminated : 1; /* bit position: 0 */
      /* 0x0248 */ unsigned long DeadThread : 1; /* bit position: 1 */
      /* 0x0248 */ unsigned long HideFromDebugger : 1; /* bit position: 2 */
      /* 0x0248 */ unsigned long ActiveImpersonationInfo : 1; /* bit position: 3 */
      /* 0x0248 */ unsigned long SystemThread : 1; /* bit position: 4 */
      /* 0x0248 */ unsigned long HardErrorsAreDisabled : 1; /* bit position: 5 */
      /* 0x0248 */ unsigned long BreakOnTermination : 1; /* bit position: 6 */
      /* 0x0248 */ unsigned long SkipCreationMsg : 1; /* bit position: 7 */
      /* 0x0248 */ unsigned long SkipTerminationMsg : 1; /* bit position: 8 */
    }; /* bitfield */
  }; /* size: 0x0004 */
  union
  {
    /* 0x024c */ unsigned long SameThreadPassiveFlags;
    struct /* bitfield */
    {
      /* 0x024c */ unsigned long ActiveExWorker : 1; /* bit position: 0 */
      /* 0x024c */ unsigned long ExWorkerCanWaitUser : 1; /* bit position: 1 */
      /* 0x024c */ unsigned long MemoryMaker : 1; /* bit position: 2 */
    }; /* bitfield */
  }; /* size: 0x0004 */
  union
  {
    /* 0x0250 */ unsigned long SameThreadApcFlags;
    struct /* bitfield */
    {
      /* 0x0250 */ unsigned char LpcReceivedMsgIdValid : 1; /* bit position: 0 */
      /* 0x0250 */ unsigned char LpcExitThreadCalled : 1; /* bit position: 1 */
      /* 0x0250 */ unsigned char AddressSpaceOwner : 1; /* bit position: 2 */
    }; /* bitfield */
  }; /* size: 0x0004 */
  /* 0x0254 */ unsigned char ForwardClusterOnly;
  /* 0x0255 */ unsigned char DisablePageFaultClustering;
  /* 0x0256 */ char __PADDING__[2];
} ETHREAD, *PETHREAD; /* size: 0x0258 */

typedef struct _SID_AND_ATTRIBUTES
{
  /* 0x0000 */ void* Sid;
  /* 0x0004 */ unsigned long Attributes;
} SID_AND_ATTRIBUTES, *PSID_AND_ATTRIBUTES; /* size: 0x0008 */

typedef struct _IO_RESOURCE_DESCRIPTOR
{
  /* 0x0000 */ unsigned char Option;
  /* 0x0001 */ unsigned char Type;
  /* 0x0002 */ unsigned char ShareDisposition;
  /* 0x0003 */ unsigned char Spare1;
  /* 0x0004 */ unsigned short Flags;
  /* 0x0006 */ unsigned short Spare2;
  union
  {
    union
    {
      struct
      {
        /* 0x0008 */ unsigned long Length;
        /* 0x000c */ unsigned long Alignment;
        /* 0x0010 */ union _LARGE_INTEGER MinimumAddress;
        /* 0x0018 */ union _LARGE_INTEGER MaximumAddress;
      } /* size: 0x0018 */ Port;
      struct
      {
        /* 0x0008 */ unsigned long Length;
        /* 0x000c */ unsigned long Alignment;
        /* 0x0010 */ union _LARGE_INTEGER MinimumAddress;
        /* 0x0018 */ union _LARGE_INTEGER MaximumAddress;
      } /* size: 0x0018 */ Memory;
      struct
      {
        /* 0x0008 */ unsigned long MinimumVector;
        /* 0x000c */ unsigned long MaximumVector;
      } /* size: 0x0008 */ Interrupt;
      struct
      {
        /* 0x0008 */ unsigned long MinimumChannel;
        /* 0x000c */ unsigned long MaximumChannel;
      } /* size: 0x0008 */ Dma;
      struct
      {
        /* 0x0008 */ unsigned long Length;
        /* 0x000c */ unsigned long Alignment;
        /* 0x0010 */ union _LARGE_INTEGER MinimumAddress;
        /* 0x0018 */ union _LARGE_INTEGER MaximumAddress;
      } /* size: 0x0018 */ Generic;
      struct
      {
        /* 0x0008 */ unsigned long Data[3];
      } /* size: 0x000c */ DevicePrivate;
      struct
      {
        /* 0x0008 */ unsigned long Length;
        /* 0x000c */ unsigned long MinBusNumber;
        /* 0x0010 */ unsigned long MaxBusNumber;
        /* 0x0014 */ unsigned long Reserved;
      } /* size: 0x0010 */ BusNumber;
      struct
      {
        /* 0x0008 */ unsigned long Priority;
        /* 0x000c */ unsigned long Reserved1;
        /* 0x0010 */ unsigned long Reserved2;
      } /* size: 0x000c */ ConfigData;
    }; /* size: 0x0018 */
  } /* size: 0x0018 */ u;
} IO_RESOURCE_DESCRIPTOR, *PIO_RESOURCE_DESCRIPTOR; /* size: 0x0020 */

typedef struct _IO_RESOURCE_LIST
{
  /* 0x0000 */ unsigned short Version;
  /* 0x0002 */ unsigned short Revision;
  /* 0x0004 */ unsigned long Count;
  /* 0x0008 */ struct _IO_RESOURCE_DESCRIPTOR Descriptors[1];
} IO_RESOURCE_LIST, *PIO_RESOURCE_LIST; /* size: 0x0028 */

typedef struct _PROCESS_WS_WATCH_INFORMATION
{
  /* 0x0000 */ void* FaultingPc;
  /* 0x0004 */ void* FaultingVa;
} PROCESS_WS_WATCH_INFORMATION, *PPROCESS_WS_WATCH_INFORMATION; /* size: 0x0008 */

typedef struct _TERMINATION_PORT
{
  /* 0x0000 */ struct _TERMINATION_PORT* Next;
  /* 0x0004 */ void* Port;
} TERMINATION_PORT, *PTERMINATION_PORT; /* size: 0x0008 */

typedef struct _PS_JOB_TOKEN_FILTER
{
  /* 0x0000 */ unsigned long CapturedSidCount;
  /* 0x0004 */ struct _SID_AND_ATTRIBUTES* CapturedSids;
  /* 0x0008 */ unsigned long CapturedSidsLength;
  /* 0x000c */ unsigned long CapturedGroupCount;
  /* 0x0010 */ struct _SID_AND_ATTRIBUTES* CapturedGroups;
  /* 0x0014 */ unsigned long CapturedGroupsLength;
  /* 0x0018 */ unsigned long CapturedPrivilegeCount;
  /* 0x001c */ struct _LUID_AND_ATTRIBUTES* CapturedPrivileges;
  /* 0x0020 */ unsigned long CapturedPrivilegesLength;
} PS_JOB_TOKEN_FILTER, *PPS_JOB_TOKEN_FILTER; /* size: 0x0024 */

typedef struct _PS_IMPERSONATION_INFORMATION
{
  /* 0x0000 */ void* Token;
  /* 0x0004 */ unsigned char CopyOnOpen;
  /* 0x0005 */ unsigned char EffectiveOnly;
  /* 0x0006 */ char Padding_9[2];
  /* 0x0008 */ enum _SECURITY_IMPERSONATION_LEVEL ImpersonationLevel;
} PS_IMPERSONATION_INFORMATION, *PPS_IMPERSONATION_INFORMATION; /* size: 0x000c */

typedef struct _WAIT_CONTEXT_BLOCK
{
  /* 0x0000 */ struct _KDEVICE_QUEUE_ENTRY WaitQueueEntry;
  /* 0x0010 */ void* DeviceRoutine /* function */;
  /* 0x0014 */ void* DeviceContext;
  /* 0x0018 */ unsigned long NumberOfMapRegisters;
  /* 0x001c */ void* DeviceObject;
  /* 0x0020 */ void* CurrentIrp;
  /* 0x0024 */ struct _KDPC* BufferChainingDpc;
} WAIT_CONTEXT_BLOCK, *PWAIT_CONTEXT_BLOCK; /* size: 0x0028 */

typedef struct _KDEVICE_QUEUE
{
  /* 0x0000 */ short Type;
  /* 0x0002 */ short Size;
  /* 0x0004 */ struct _LIST_ENTRY DeviceListHead;
  /* 0x000c */ unsigned long Lock;
  /* 0x0010 */ unsigned char Busy;
  /* 0x0011 */ char __PADDING__[3];
} KDEVICE_QUEUE, *PKDEVICE_QUEUE; /* size: 0x0014 */

typedef struct _DEVICE_OBJECT
{
  /* 0x0000 */ short Type;
  /* 0x0002 */ unsigned short Size;
  /* 0x0004 */ long ReferenceCount;
  /* 0x0008 */ struct _DRIVER_OBJECT* DriverObject;
  /* 0x000c */ struct _DEVICE_OBJECT* NextDevice;
  /* 0x0010 */ struct _DEVICE_OBJECT* AttachedDevice;
  /* 0x0014 */ struct _IRP* CurrentIrp;
  /* 0x0018 */ struct _IO_TIMER* Timer;
  /* 0x001c */ unsigned long Flags;
  /* 0x0020 */ unsigned long Characteristics;
  /* 0x0024 */ struct _VPB* Vpb;
  /* 0x0028 */ void* DeviceExtension;
  /* 0x002c */ unsigned long DeviceType;
  /* 0x0030 */ char StackSize;
  /* 0x0031 */ char Padding_10[3];
  union
  {
    union
    {
      /* 0x0034 */ struct _LIST_ENTRY ListEntry;
      /* 0x0034 */ struct _WAIT_CONTEXT_BLOCK Wcb;
    }; /* size: 0x0028 */
  } /* size: 0x0028 */ Queue;
  /* 0x005c */ unsigned long AlignmentRequirement;
  /* 0x0060 */ struct _KDEVICE_QUEUE DeviceQueue;
  /* 0x0074 */ struct _KDPC Dpc;
  /* 0x0094 */ unsigned long ActiveThreadCount;
  /* 0x0098 */ void* SecurityDescriptor;
  /* 0x009c */ struct _KEVENT DeviceLock;
  /* 0x00ac */ unsigned short SectorSize;
  /* 0x00ae */ unsigned short Spare1;
  /* 0x00b0 */ struct _DEVOBJ_EXTENSION* DeviceObjectExtension;
  /* 0x00b4 */ void* Reserved;
} DEVICE_OBJECT, *PDEVICE_OBJECT; /* size: 0x00b8 */

typedef struct _UNICODE_STRING
{
  /* 0x0000 */ unsigned short Length;
  /* 0x0002 */ unsigned short MaximumLength;
  /* 0x0004 */ unsigned short* Buffer;
} UNICODE_STRING, *PUNICODE_STRING; /* size: 0x0008 */

typedef struct _CURDIR
{
  /* 0x0000 */ struct _UNICODE_STRING DosPath;
  /* 0x0008 */ void* Handle;
} CURDIR, *PCURDIR; /* size: 0x000c */

typedef struct _STRING
{
  /* 0x0000 */ unsigned short Length;
  /* 0x0002 */ unsigned short MaximumLength;
  /* 0x0004 */ char* Buffer;
} STRING, *PSTRING; /* size: 0x0008 */

typedef struct _RTL_DRIVE_LETTER_CURDIR
{
  /* 0x0000 */ unsigned short Flags;
  /* 0x0002 */ unsigned short Length;
  /* 0x0004 */ unsigned long TimeStamp;
  /* 0x0008 */ struct _STRING DosPath;
} RTL_DRIVE_LETTER_CURDIR, *PRTL_DRIVE_LETTER_CURDIR; /* size: 0x0010 */

typedef struct _RTL_USER_PROCESS_PARAMETERS
{
  /* 0x0000 */ unsigned long MaximumLength;
  /* 0x0004 */ unsigned long Length;
  /* 0x0008 */ unsigned long Flags;
  /* 0x000c */ unsigned long DebugFlags;
  /* 0x0010 */ void* ConsoleHandle;
  /* 0x0014 */ unsigned long ConsoleFlags;
  /* 0x0018 */ void* StandardInput;
  /* 0x001c */ void* StandardOutput;
  /* 0x0020 */ void* StandardError;
  /* 0x0024 */ struct _CURDIR CurrentDirectory;
  /* 0x0030 */ struct _UNICODE_STRING DllPath;
  /* 0x0038 */ struct _UNICODE_STRING ImagePathName;
  /* 0x0040 */ struct _UNICODE_STRING CommandLine;
  /* 0x0048 */ void* Environment;
  /* 0x004c */ unsigned long StartingX;
  /* 0x0050 */ unsigned long StartingY;
  /* 0x0054 */ unsigned long CountX;
  /* 0x0058 */ unsigned long CountY;
  /* 0x005c */ unsigned long CountCharsX;
  /* 0x0060 */ unsigned long CountCharsY;
  /* 0x0064 */ unsigned long FillAttribute;
  /* 0x0068 */ unsigned long WindowFlags;
  /* 0x006c */ unsigned long ShowWindowFlags;
  /* 0x0070 */ struct _UNICODE_STRING WindowTitle;
  /* 0x0078 */ struct _UNICODE_STRING DesktopInfo;
  /* 0x0080 */ struct _UNICODE_STRING ShellInfo;
  /* 0x0088 */ struct _UNICODE_STRING RuntimeData;
  /* 0x0090 */ struct _RTL_DRIVE_LETTER_CURDIR CurrentDirectores[32];
} RTL_USER_PROCESS_PARAMETERS, *PRTL_USER_PROCESS_PARAMETERS; /* size: 0x0290 */

typedef struct _DRIVER_OBJECT
{
  /* 0x0000 */ short Type;
  /* 0x0002 */ short Size;
  /* 0x0004 */ struct _DEVICE_OBJECT* DeviceObject;
  /* 0x0008 */ unsigned long Flags;
  /* 0x000c */ void* DriverStart;
  /* 0x0010 */ unsigned long DriverSize;
  /* 0x0014 */ void* DriverSection;
  /* 0x0018 */ struct _DRIVER_EXTENSION* DriverExtension;
  /* 0x001c */ struct _UNICODE_STRING DriverName;
  /* 0x0024 */ struct _UNICODE_STRING* HardwareDatabase;
  /* 0x0028 */ struct _FAST_IO_DISPATCH* FastIoDispatch;
  /* 0x002c */ void* DriverInit /* function */;
  /* 0x0030 */ void* DriverStartIo /* function */;
  /* 0x0034 */ void* DriverUnload /* function */;
  /* 0x0038 */ void* MajorFunction[28] /* function */;
} DRIVER_OBJECT, *PDRIVER_OBJECT; /* size: 0x00a8 */

typedef struct _DRIVER_EXTENSION
{
  /* 0x0000 */ struct _DRIVER_OBJECT* DriverObject;
  /* 0x0004 */ void* AddDevice /* function */;
  /* 0x0008 */ unsigned long Count;
  /* 0x000c */ struct _UNICODE_STRING ServiceKeyName;
  /* 0x0014 */ struct _IO_CLIENT_EXTENSION* ClientDriverExtension;
  /* 0x0018 */ struct _FS_FILTER_CALLBACKS* FsFilterCallbacks;
} DRIVER_EXTENSION, *PDRIVER_EXTENSION; /* size: 0x001c */

typedef struct _EPROCESS_QUOTA_ENTRY
{
  /* 0x0000 */ unsigned long Usage;
  /* 0x0004 */ unsigned long Limit;
  /* 0x0008 */ unsigned long Peak;
  /* 0x000c */ unsigned long Return;
} EPROCESS_QUOTA_ENTRY, *PEPROCESS_QUOTA_ENTRY; /* size: 0x0010 */

typedef struct _IO_CLIENT_EXTENSION
{
  /* 0x0000 */ struct _IO_CLIENT_EXTENSION* NextExtension;
  /* 0x0004 */ void* ClientIdentificationAddress;
} IO_CLIENT_EXTENSION, *PIO_CLIENT_EXTENSION; /* size: 0x0008 */

typedef struct _FS_FILTER_CALLBACKS
{
  /* 0x0000 */ unsigned long SizeOfFsFilterCallbacks;
  /* 0x0004 */ unsigned long Reserved;
  /* 0x0008 */ void* PreAcquireForSectionSynchronization /* function */;
  /* 0x000c */ void* PostAcquireForSectionSynchronization /* function */;
  /* 0x0010 */ void* PreReleaseForSectionSynchronization /* function */;
  /* 0x0014 */ void* PostReleaseForSectionSynchronization /* function */;
  /* 0x0018 */ void* PreAcquireForCcFlush /* function */;
  /* 0x001c */ void* PostAcquireForCcFlush /* function */;
  /* 0x0020 */ void* PreReleaseForCcFlush /* function */;
  /* 0x0024 */ void* PostReleaseForCcFlush /* function */;
  /* 0x0028 */ void* PreAcquireForModifiedPageWriter /* function */;
  /* 0x002c */ void* PostAcquireForModifiedPageWriter /* function */;
  /* 0x0030 */ void* PreReleaseForModifiedPageWriter /* function */;
  /* 0x0034 */ void* PostReleaseForModifiedPageWriter /* function */;
} FS_FILTER_CALLBACKS, *PFS_FILTER_CALLBACKS; /* size: 0x0038 */

typedef union _FS_FILTER_PARAMETERS
{
  union
  {
    struct
    {
      /* 0x0000 */ union _LARGE_INTEGER* EndingOffset;
      /* 0x0004 */ struct _ERESOURCE** ResourceToRelease;
    } /* size: 0x0008 */ AcquireForModifiedPageWriter;
    struct
    {
      /* 0x0000 */ struct _ERESOURCE* ResourceToRelease;
    } /* size: 0x0004 */ ReleaseForModifiedPageWriter;
    struct
    {
      /* 0x0000 */ enum _FS_FILTER_SECTION_SYNC_TYPE SyncType;
      /* 0x0004 */ unsigned long PageProtection;
    } /* size: 0x0008 */ AcquireForSectionSynchronization;
    struct
    {
      /* 0x0000 */ void* Argument1;
      /* 0x0004 */ void* Argument2;
      /* 0x0008 */ void* Argument3;
      /* 0x000c */ void* Argument4;
      /* 0x0010 */ void* Argument5;
    } /* size: 0x0014 */ Others;
  }; /* size: 0x0014 */
} FS_FILTER_PARAMETERS, *PFS_FILTER_PARAMETERS; /* size: 0x0014 */

typedef struct _FS_FILTER_CALLBACK_DATA
{
  /* 0x0000 */ unsigned long SizeOfFsFilterCallbackData;
  /* 0x0004 */ unsigned char Operation;
  /* 0x0005 */ unsigned char Reserved;
  /* 0x0006 */ char Padding_11[2];
  /* 0x0008 */ struct _DEVICE_OBJECT* DeviceObject;
  /* 0x000c */ struct _FILE_OBJECT* FileObject;
  /* 0x0010 */ union _FS_FILTER_PARAMETERS Parameters;
} FS_FILTER_CALLBACK_DATA, *PFS_FILTER_CALLBACK_DATA; /* size: 0x0024 */

typedef struct _FILE_OBJECT
{
  /* 0x0000 */ short Type;
  /* 0x0002 */ short Size;
  /* 0x0004 */ struct _DEVICE_OBJECT* DeviceObject;
  /* 0x0008 */ struct _VPB* Vpb;
  /* 0x000c */ void* FsContext;
  /* 0x0010 */ void* FsContext2;
  /* 0x0014 */ struct _SECTION_OBJECT_POINTERS* SectionObjectPointer;
  /* 0x0018 */ void* PrivateCacheMap;
  /* 0x001c */ long FinalStatus;
  /* 0x0020 */ struct _FILE_OBJECT* RelatedFileObject;
  /* 0x0024 */ unsigned char LockOperation;
  /* 0x0025 */ unsigned char DeletePending;
  /* 0x0026 */ unsigned char ReadAccess;
  /* 0x0027 */ unsigned char WriteAccess;
  /* 0x0028 */ unsigned char DeleteAccess;
  /* 0x0029 */ unsigned char SharedRead;
  /* 0x002a */ unsigned char SharedWrite;
  /* 0x002b */ unsigned char SharedDelete;
  /* 0x002c */ unsigned long Flags;
  /* 0x0030 */ struct _UNICODE_STRING FileName;
  /* 0x0038 */ union _LARGE_INTEGER CurrentByteOffset;
  /* 0x0040 */ unsigned long Waiters;
  /* 0x0044 */ unsigned long Busy;
  /* 0x0048 */ void* LastLock;
  /* 0x004c */ struct _KEVENT Lock;
  /* 0x005c */ struct _KEVENT Event;
  /* 0x006c */ struct _IO_COMPLETION_CONTEXT* CompletionContext;
} FILE_OBJECT, *PFILE_OBJECT; /* size: 0x0070 */

typedef struct _VPB
{
  /* 0x0000 */ short Type;
  /* 0x0002 */ short Size;
  /* 0x0004 */ unsigned short Flags;
  /* 0x0006 */ unsigned short VolumeLabelLength;
  /* 0x0008 */ struct _DEVICE_OBJECT* DeviceObject;
  /* 0x000c */ struct _DEVICE_OBJECT* RealDevice;
  /* 0x0010 */ unsigned long SerialNumber;
  /* 0x0014 */ unsigned long ReferenceCount;
  /* 0x0018 */ unsigned short VolumeLabel[32];
} VPB, *PVPB; /* size: 0x0058 */

typedef struct _SECTION_OBJECT_POINTERS
{
  /* 0x0000 */ void* DataSectionObject;
  /* 0x0004 */ void* SharedCacheMap;
  /* 0x0008 */ void* ImageSectionObject;
} SECTION_OBJECT_POINTERS, *PSECTION_OBJECT_POINTERS; /* size: 0x000c */

typedef struct _OBJECT_NAME_INFORMATION
{
  /* 0x0000 */ struct _UNICODE_STRING Name;
} OBJECT_NAME_INFORMATION, *POBJECT_NAME_INFORMATION; /* size: 0x0008 */

typedef struct _IO_COMPLETION_CONTEXT
{
  /* 0x0000 */ void* Port;
  /* 0x0004 */ void* Key;
} IO_COMPLETION_CONTEXT, *PIO_COMPLETION_CONTEXT; /* size: 0x0008 */

struct _MMWSL;

typedef struct _OBJECT_DUMP_CONTROL
{
  /* 0x0000 */ void* Stream;
  /* 0x0004 */ unsigned long Detail;
} OBJECT_DUMP_CONTROL, *POBJECT_DUMP_CONTROL; /* size: 0x0008 */

typedef struct _IO_STATUS_BLOCK
{
  union
  {
    /* 0x0000 */ long Status;
    /* 0x0000 */ void* Pointer;
  }; /* size: 0x0004 */
  /* 0x0004 */ unsigned long Information;
} IO_STATUS_BLOCK, *PIO_STATUS_BLOCK; /* size: 0x0008 */

typedef struct _FILE_BASIC_INFORMATION
{
  /* 0x0000 */ union _LARGE_INTEGER CreationTime;
  /* 0x0008 */ union _LARGE_INTEGER LastAccessTime;
  /* 0x0010 */ union _LARGE_INTEGER LastWriteTime;
  /* 0x0018 */ union _LARGE_INTEGER ChangeTime;
  /* 0x0020 */ unsigned long FileAttributes;
  /* 0x0024 */ long __PADDING__[1];
} FILE_BASIC_INFORMATION, *PFILE_BASIC_INFORMATION; /* size: 0x0028 */

typedef struct _HANDLE_TRACE_DEBUG_INFO
{
  /* 0x0000 */ unsigned long CurrentStackIndex;
  /* 0x0004 */ struct _HANDLE_TRACE_DB_ENTRY TraceDb[4096];
} HANDLE_TRACE_DEBUG_INFO, *PHANDLE_TRACE_DEBUG_INFO; /* size: 0x50004 */

typedef struct _EPROCESS_QUOTA_BLOCK
{
  /* 0x0000 */ struct _EPROCESS_QUOTA_ENTRY QuotaEntry[3];
  /* 0x0030 */ struct _LIST_ENTRY QuotaList;
  /* 0x0038 */ unsigned long ReferenceCount;
  /* 0x003c */ unsigned long ProcessCount;
} EPROCESS_QUOTA_BLOCK, *PEPROCESS_QUOTA_BLOCK; /* size: 0x0040 */

typedef struct _PAGEFAULT_HISTORY
{
  /* 0x0000 */ unsigned long CurrentIndex;
  /* 0x0004 */ unsigned long MaxIndex;
  /* 0x0008 */ unsigned long SpinLock;
  /* 0x000c */ void* Reserved;
  /* 0x0010 */ struct _PROCESS_WS_WATCH_INFORMATION WatchInfo[1];
} PAGEFAULT_HISTORY, *PPAGEFAULT_HISTORY; /* size: 0x0018 */

typedef struct _HEAP_UCR_SEGMENT
{
  /* 0x0000 */ struct _HEAP_UCR_SEGMENT* Next;
  /* 0x0004 */ unsigned long ReservedSize;
  /* 0x0008 */ unsigned long CommittedSize;
  /* 0x000c */ unsigned long filler;
} HEAP_UCR_SEGMENT, *PHEAP_UCR_SEGMENT; /* size: 0x0010 */

typedef struct _PEB
{
  /* 0x0000 */ unsigned char InheritedAddressSpace;
  /* 0x0001 */ unsigned char ReadImageFileExecOptions;
  /* 0x0002 */ unsigned char BeingDebugged;
  /* 0x0003 */ unsigned char SpareBool;
  /* 0x0004 */ void* Mutant;
  /* 0x0008 */ void* ImageBaseAddress;
  /* 0x000c */ struct _PEB_LDR_DATA* Ldr;
  /* 0x0010 */ struct _RTL_USER_PROCESS_PARAMETERS* ProcessParameters;
  /* 0x0014 */ void* SubSystemData;
  /* 0x0018 */ void* ProcessHeap;
  /* 0x001c */ struct _RTL_CRITICAL_SECTION* FastPebLock;
  /* 0x0020 */ void* FastPebLockRoutine;
  /* 0x0024 */ void* FastPebUnlockRoutine;
  /* 0x0028 */ unsigned long EnvironmentUpdateCount;
  /* 0x002c */ void* KernelCallbackTable;
  /* 0x0030 */ unsigned long SystemReserved[1];
  /* 0x0034 */ unsigned long AtlThunkSListPtr32;
  /* 0x0038 */ struct _PEB_FREE_BLOCK* FreeList;
  /* 0x003c */ unsigned long TlsExpansionCounter;
  /* 0x0040 */ void* TlsBitmap;
  /* 0x0044 */ unsigned long TlsBitmapBits[2];
  /* 0x004c */ void* ReadOnlySharedMemoryBase;
  /* 0x0050 */ void* ReadOnlySharedMemoryHeap;
  /* 0x0054 */ void** ReadOnlyStaticServerData;
  /* 0x0058 */ void* AnsiCodePageData;
  /* 0x005c */ void* OemCodePageData;
  /* 0x0060 */ void* UnicodeCaseTableData;
  /* 0x0064 */ unsigned long NumberOfProcessors;
  /* 0x0068 */ unsigned long NtGlobalFlag;
  /* 0x006c */ long Padding_12;
  /* 0x0070 */ union _LARGE_INTEGER CriticalSectionTimeout;
  /* 0x0078 */ unsigned long HeapSegmentReserve;
  /* 0x007c */ unsigned long HeapSegmentCommit;
  /* 0x0080 */ unsigned long HeapDeCommitTotalFreeThreshold;
  /* 0x0084 */ unsigned long HeapDeCommitFreeBlockThreshold;
  /* 0x0088 */ unsigned long NumberOfHeaps;
  /* 0x008c */ unsigned long MaximumNumberOfHeaps;
  /* 0x0090 */ void** ProcessHeaps;
  /* 0x0094 */ void* GdiSharedHandleTable;
  /* 0x0098 */ void* ProcessStarterHelper;
  /* 0x009c */ unsigned long GdiDCAttributeList;
  /* 0x00a0 */ void* LoaderLock;
  /* 0x00a4 */ unsigned long OSMajorVersion;
  /* 0x00a8 */ unsigned long OSMinorVersion;
  /* 0x00ac */ unsigned short OSBuildNumber;
  /* 0x00ae */ unsigned short OSCSDVersion;
  /* 0x00b0 */ unsigned long OSPlatformId;
  /* 0x00b4 */ unsigned long ImageSubsystem;
  /* 0x00b8 */ unsigned long ImageSubsystemMajorVersion;
  /* 0x00bc */ unsigned long ImageSubsystemMinorVersion;
  /* 0x00c0 */ unsigned long ImageProcessAffinityMask;
  /* 0x00c4 */ unsigned long GdiHandleBuffer[34];
  /* 0x014c */ void* PostProcessInitRoutine /* function */;
  /* 0x0150 */ void* TlsExpansionBitmap;
  /* 0x0154 */ unsigned long TlsExpansionBitmapBits[32];
  /* 0x01d4 */ unsigned long SessionId;
  /* 0x01d8 */ union _ULARGE_INTEGER AppCompatFlags;
  /* 0x01e0 */ union _ULARGE_INTEGER AppCompatFlagsUser;
  /* 0x01e8 */ void* pShimData;
  /* 0x01ec */ void* AppCompatInfo;
  /* 0x01f0 */ struct _UNICODE_STRING CSDVersion;
  /* 0x01f8 */ void* ActivationContextData;
  /* 0x01fc */ void* ProcessAssemblyStorageMap;
  /* 0x0200 */ void* SystemDefaultActivationContextData;
  /* 0x0204 */ void* SystemAssemblyStorageMap;
  /* 0x0208 */ unsigned long MinimumStackCommit;
  /* 0x020c */ long __PADDING__[1];
} PEB, *PPEB; /* size: 0x0210 */

typedef struct _PEB_LDR_DATA
{
  /* 0x0000 */ unsigned long Length;
  /* 0x0004 */ unsigned char Initialized;
  /* 0x0005 */ char Padding_13[3];
  /* 0x0008 */ void* SsHandle;
  /* 0x000c */ struct _LIST_ENTRY InLoadOrderModuleList;
  /* 0x0014 */ struct _LIST_ENTRY InMemoryOrderModuleList;
  /* 0x001c */ struct _LIST_ENTRY InInitializationOrderModuleList;
  /* 0x0024 */ void* EntryInProgress;
} PEB_LDR_DATA, *PPEB_LDR_DATA; /* size: 0x0028 */

typedef struct _RTL_CRITICAL_SECTION
{
  /* 0x0000 */ struct _RTL_CRITICAL_SECTION_DEBUG* DebugInfo;
  /* 0x0004 */ long LockCount;
  /* 0x0008 */ long RecursionCount;
  /* 0x000c */ void* OwningThread;
  /* 0x0010 */ void* LockSemaphore;
  /* 0x0014 */ unsigned long SpinCount;
} RTL_CRITICAL_SECTION, *PRTL_CRITICAL_SECTION; /* size: 0x0018 */

typedef struct _RTL_CRITICAL_SECTION_DEBUG
{
  /* 0x0000 */ unsigned short Type;
  /* 0x0002 */ unsigned short CreatorBackTraceIndex;
  /* 0x0004 */ struct _RTL_CRITICAL_SECTION* CriticalSection;
  /* 0x0008 */ struct _LIST_ENTRY ProcessLocksList;
  /* 0x0010 */ unsigned long EntryCount;
  /* 0x0014 */ unsigned long ContentionCount;
  /* 0x0018 */ unsigned long Spare[2];
} RTL_CRITICAL_SECTION_DEBUG, *PRTL_CRITICAL_SECTION_DEBUG; /* size: 0x0020 */

typedef struct _PEB_FREE_BLOCK
{
  /* 0x0000 */ struct _PEB_FREE_BLOCK* Next;
  /* 0x0004 */ unsigned long Size;
} PEB_FREE_BLOCK, *PPEB_FREE_BLOCK; /* size: 0x0008 */

typedef struct _RTL_TRACE_SEGMENT
{
  /* 0x0000 */ unsigned long Magic;
  /* 0x0004 */ struct _RTL_TRACE_DATABASE* Database;
  /* 0x0008 */ struct _RTL_TRACE_SEGMENT* NextSegment;
  /* 0x000c */ unsigned long TotalSize;
  /* 0x0010 */ char* SegmentStart;
  /* 0x0014 */ char* SegmentEnd;
  /* 0x0018 */ char* SegmentFree;
} RTL_TRACE_SEGMENT, *PRTL_TRACE_SEGMENT; /* size: 0x001c */

typedef struct _STACK_TRACE_DATABASE
{
  union
  {
    union
    {
      /* 0x0000 */ struct _RTL_CRITICAL_SECTION CriticalSection;
      /* 0x0000 */ struct _ERESOURCE Resource;
    }; /* size: 0x0038 */
  } /* size: 0x0038 */ Lock;
  /* 0x0038 */ void* AcquireLockRoutine /* function */;
  /* 0x003c */ void* ReleaseLockRoutine /* function */;
  /* 0x0040 */ void* OkayToLockRoutine /* function */;
  /* 0x0044 */ unsigned char PreCommitted;
  /* 0x0045 */ unsigned char DumpInProgress;
  /* 0x0046 */ char Padding_14[2];
  /* 0x0048 */ void* CommitBase;
  /* 0x004c */ void* CurrentLowerCommitLimit;
  /* 0x0050 */ void* CurrentUpperCommitLimit;
  /* 0x0054 */ char* NextFreeLowerMemory;
  /* 0x0058 */ char* NextFreeUpperMemory;
  /* 0x005c */ unsigned long NumberOfEntriesLookedUp;
  /* 0x0060 */ unsigned long NumberOfEntriesAdded;
  /* 0x0064 */ struct _RTL_STACK_TRACE_ENTRY** EntryIndexArray;
  /* 0x0068 */ unsigned long NumberOfBuckets;
  /* 0x006c */ struct _RTL_STACK_TRACE_ENTRY* Buckets[1];
} STACK_TRACE_DATABASE, *PSTACK_TRACE_DATABASE; /* size: 0x0070 */

typedef struct _SID_IDENTIFIER_AUTHORITY
{
  /* 0x0000 */ unsigned char Value[6];
} SID_IDENTIFIER_AUTHORITY, *PSID_IDENTIFIER_AUTHORITY; /* size: 0x0006 */

typedef struct _IO_TIMER
{
  /* 0x0000 */ short Type;
  /* 0x0002 */ short TimerFlag;
  /* 0x0004 */ struct _LIST_ENTRY TimerList;
  /* 0x000c */ void* TimerRoutine /* function */;
  /* 0x0010 */ void* Context;
  /* 0x0014 */ struct _DEVICE_OBJECT* DeviceObject;
} IO_TIMER, *PIO_TIMER; /* size: 0x0018 */

typedef struct _HEAP_LOCK
{
  union
  {
    union
    {
      /* 0x0000 */ struct _RTL_CRITICAL_SECTION CriticalSection;
      /* 0x0000 */ struct _ERESOURCE Resource;
    }; /* size: 0x0038 */
  } /* size: 0x0038 */ Lock;
} HEAP_LOCK, *PHEAP_LOCK; /* size: 0x0038 */

typedef struct _FILE_NETWORK_OPEN_INFORMATION
{
  /* 0x0000 */ union _LARGE_INTEGER CreationTime;
  /* 0x0008 */ union _LARGE_INTEGER LastAccessTime;
  /* 0x0010 */ union _LARGE_INTEGER LastWriteTime;
  /* 0x0018 */ union _LARGE_INTEGER ChangeTime;
  /* 0x0020 */ union _LARGE_INTEGER AllocationSize;
  /* 0x0028 */ union _LARGE_INTEGER EndOfFile;
  /* 0x0030 */ unsigned long FileAttributes;
  /* 0x0034 */ long __PADDING__[1];
} FILE_NETWORK_OPEN_INFORMATION, *PFILE_NETWORK_OPEN_INFORMATION; /* size: 0x0038 */

typedef struct _CM_PARTIAL_RESOURCE_DESCRIPTOR
{
  /* 0x0000 */ unsigned char Type;
  /* 0x0001 */ unsigned char ShareDisposition;
  /* 0x0002 */ unsigned short Flags;
  union
  {
    union
    {
      struct
      {
        /* 0x0004 */ union _LARGE_INTEGER Start;
        /* 0x000c */ unsigned long Length;
      } /* size: 0x000c */ Generic;
      struct
      {
        /* 0x0004 */ union _LARGE_INTEGER Start;
        /* 0x000c */ unsigned long Length;
      } /* size: 0x000c */ Port;
      struct
      {
        /* 0x0004 */ unsigned long Level;
        /* 0x0008 */ unsigned long Vector;
        /* 0x000c */ unsigned long Affinity;
      } /* size: 0x000c */ Interrupt;
      struct
      {
        /* 0x0004 */ union _LARGE_INTEGER Start;
        /* 0x000c */ unsigned long Length;
      } /* size: 0x000c */ Memory;
      struct
      {
        /* 0x0004 */ unsigned long Channel;
        /* 0x0008 */ unsigned long Port;
        /* 0x000c */ unsigned long Reserved1;
      } /* size: 0x000c */ Dma;
      struct
      {
        /* 0x0004 */ unsigned long Data[3];
      } /* size: 0x000c */ DevicePrivate;
      struct
      {
        /* 0x0004 */ unsigned long Start;
        /* 0x0008 */ unsigned long Length;
        /* 0x000c */ unsigned long Reserved;
      } /* size: 0x000c */ BusNumber;
      struct
      {
        /* 0x0004 */ unsigned long DataSize;
        /* 0x0008 */ unsigned long Reserved1;
        /* 0x000c */ unsigned long Reserved2;
      } /* size: 0x000c */ DeviceSpecificData;
    }; /* size: 0x000c */
  } /* size: 0x000c */ u;
} CM_PARTIAL_RESOURCE_DESCRIPTOR, *PCM_PARTIAL_RESOURCE_DESCRIPTOR; /* size: 0x0010 */

typedef struct _CM_PARTIAL_RESOURCE_LIST
{
  /* 0x0000 */ unsigned short Version;
  /* 0x0002 */ unsigned short Revision;
  /* 0x0004 */ unsigned long Count;
  /* 0x0008 */ struct _CM_PARTIAL_RESOURCE_DESCRIPTOR PartialDescriptors[1];
} CM_PARTIAL_RESOURCE_LIST, *PCM_PARTIAL_RESOURCE_LIST; /* size: 0x0018 */

typedef struct _CM_FULL_RESOURCE_DESCRIPTOR
{
  /* 0x0000 */ enum _INTERFACE_TYPE InterfaceType;
  /* 0x0004 */ unsigned long BusNumber;
  /* 0x0008 */ struct _CM_PARTIAL_RESOURCE_LIST PartialResourceList;
} CM_FULL_RESOURCE_DESCRIPTOR, *PCM_FULL_RESOURCE_DESCRIPTOR; /* size: 0x0020 */

typedef struct _MDL
{
  /* 0x0000 */ struct _MDL* Next;
  /* 0x0004 */ short Size;
  /* 0x0006 */ short MdlFlags;
  /* 0x0008 */ struct _EPROCESS* Process;
  /* 0x000c */ void* MappedSystemVa;
  /* 0x0010 */ void* StartVa;
  /* 0x0014 */ unsigned long ByteCount;
  /* 0x0018 */ unsigned long ByteOffset;
} MDL, *PMDL; /* size: 0x001c */

typedef struct _IRP
{
  /* 0x0000 */ short Type;
  /* 0x0002 */ unsigned short Size;
  /* 0x0004 */ struct _MDL* MdlAddress;
  /* 0x0008 */ unsigned long Flags;
  union
  {
    union
    {
      /* 0x000c */ struct _IRP* MasterIrp;
      /* 0x000c */ long IrpCount;
      /* 0x000c */ void* SystemBuffer;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ AssociatedIrp;
  /* 0x0010 */ struct _LIST_ENTRY ThreadListEntry;
  /* 0x0018 */ struct _IO_STATUS_BLOCK IoStatus;
  /* 0x0020 */ char RequestorMode;
  /* 0x0021 */ unsigned char PendingReturned;
  /* 0x0022 */ char StackCount;
  /* 0x0023 */ char CurrentLocation;
  /* 0x0024 */ unsigned char Cancel;
  /* 0x0025 */ unsigned char CancelIrql;
  /* 0x0026 */ char ApcEnvironment;
  /* 0x0027 */ unsigned char AllocationFlags;
  /* 0x0028 */ struct _IO_STATUS_BLOCK* UserIosb;
  /* 0x002c */ struct _KEVENT* UserEvent;
  union
  {
    union
    {
      struct
      {
        /* 0x0030 */ void* UserApcRoutine /* function */;
        /* 0x0034 */ void* UserApcContext;
      } /* size: 0x0008 */ AsynchronousParameters;
      /* 0x0030 */ union _LARGE_INTEGER AllocationSize;
    }; /* size: 0x0008 */
  } /* size: 0x0008 */ Overlay;
  /* 0x0038 */ void* CancelRoutine /* function */;
  /* 0x003c */ void* UserBuffer;
  union
  {
    union
    {
      struct
      {
        union
        {
          /* 0x0040 */ struct _KDEVICE_QUEUE_ENTRY DeviceQueueEntry;
          /* 0x0040 */ void* DriverContext[4];
        }; /* size: 0x0010 */
        /* 0x0050 */ struct _ETHREAD* Thread;
        /* 0x0054 */ char* AuxiliaryBuffer;
        /* 0x0058 */ struct _LIST_ENTRY ListEntry;
        union
        {
          /* 0x0060 */ struct _IO_STACK_LOCATION* CurrentStackLocation;
          /* 0x0060 */ unsigned long PacketType;
        }; /* size: 0x0004 */
        /* 0x0064 */ struct _FILE_OBJECT* OriginalFileObject;
      } /* size: 0x0028 */ Overlay;
      /* 0x0040 */ struct _KAPC Apc;
      /* 0x0040 */ void* CompletionKey;
    }; /* size: 0x0030 */
  } /* size: 0x0030 */ Tail;
} IRP, *PIRP; /* size: 0x0070 */

typedef struct _GENERIC_MAPPING
{
  /* 0x0000 */ unsigned long GenericRead;
  /* 0x0004 */ unsigned long GenericWrite;
  /* 0x0008 */ unsigned long GenericExecute;
  /* 0x000c */ unsigned long GenericAll;
} GENERIC_MAPPING, *PGENERIC_MAPPING; /* size: 0x0010 */

typedef struct _OBJECT_TYPE_INITIALIZER
{
  /* 0x0000 */ unsigned short Length;
  /* 0x0002 */ unsigned char UseDefaultObject;
  /* 0x0003 */ unsigned char CaseInsensitive;
  /* 0x0004 */ unsigned long InvalidAttributes;
  /* 0x0008 */ struct _GENERIC_MAPPING GenericMapping;
  /* 0x0018 */ unsigned long ValidAccessMask;
  /* 0x001c */ unsigned char SecurityRequired;
  /* 0x001d */ unsigned char MaintainHandleCount;
  /* 0x001e */ unsigned char MaintainTypeList;
  /* 0x001f */ char Padding_15;
  /* 0x0020 */ enum _POOL_TYPE PoolType;
  /* 0x0024 */ unsigned long DefaultPagedPoolCharge;
  /* 0x0028 */ unsigned long DefaultNonPagedPoolCharge;
  /* 0x002c */ void* DumpProcedure /* function */;
  /* 0x0030 */ void* OpenProcedure /* function */;
  /* 0x0034 */ void* CloseProcedure /* function */;
  /* 0x0038 */ void* DeleteProcedure /* function */;
  /* 0x003c */ void* ParseProcedure /* function */;
  /* 0x0040 */ void* SecurityProcedure /* function */;
  /* 0x0044 */ void* QueryNameProcedure /* function */;
  /* 0x0048 */ void* OkayToCloseProcedure /* function */;
} OBJECT_TYPE_INITIALIZER, *POBJECT_TYPE_INITIALIZER; /* size: 0x004c */

typedef struct _IO_STACK_LOCATION
{
  /* 0x0000 */ unsigned char MajorFunction;
  /* 0x0001 */ unsigned char MinorFunction;
  /* 0x0002 */ unsigned char Flags;
  /* 0x0003 */ unsigned char Control;
  union
  {
    union
    {
      struct
      {
        /* 0x0004 */ struct _IO_SECURITY_CONTEXT* SecurityContext;
        /* 0x0008 */ unsigned long Options;
        /* 0x000c */ unsigned short FileAttributes;
        /* 0x000e */ unsigned short ShareAccess;
        /* 0x0010 */ unsigned long EaLength;
      } /* size: 0x0010 */ Create;
      struct
      {
        /* 0x0004 */ struct _IO_SECURITY_CONTEXT* SecurityContext;
        /* 0x0008 */ unsigned long Options;
        /* 0x000c */ unsigned short Reserved;
        /* 0x000e */ unsigned short ShareAccess;
        /* 0x0010 */ struct _NAMED_PIPE_CREATE_PARAMETERS* Parameters;
      } /* size: 0x0010 */ CreatePipe;
      struct
      {
        /* 0x0004 */ struct _IO_SECURITY_CONTEXT* SecurityContext;
        /* 0x0008 */ unsigned long Options;
        /* 0x000c */ unsigned short Reserved;
        /* 0x000e */ unsigned short ShareAccess;
        /* 0x0010 */ struct _MAILSLOT_CREATE_PARAMETERS* Parameters;
      } /* size: 0x0010 */ CreateMailslot;
      struct
      {
        /* 0x0004 */ unsigned long Length;
        /* 0x0008 */ unsigned long Key;
        /* 0x000c */ union _LARGE_INTEGER ByteOffset;
      } /* size: 0x0010 */ Read;
      struct
      {
        /* 0x0004 */ unsigned long Length;
        /* 0x0008 */ unsigned long Key;
        /* 0x000c */ union _LARGE_INTEGER ByteOffset;
      } /* size: 0x0010 */ Write;
      struct
      {
        /* 0x0004 */ unsigned long Length;
        /* 0x0008 */ struct _STRING* FileName;
        /* 0x000c */ enum _FILE_INFORMATION_CLASS FileInformationClass;
        /* 0x0010 */ unsigned long FileIndex;
      } /* size: 0x0010 */ QueryDirectory;
      struct
      {
        /* 0x0004 */ unsigned long Length;
        /* 0x0008 */ unsigned long CompletionFilter;
      } /* size: 0x0008 */ NotifyDirectory;
      struct
      {
        /* 0x0004 */ unsigned long Length;
        /* 0x0008 */ enum _FILE_INFORMATION_CLASS FileInformationClass;
      } /* size: 0x0008 */ QueryFile;
      struct
      {
        /* 0x0004 */ unsigned long Length;
        /* 0x0008 */ enum _FILE_INFORMATION_CLASS FileInformationClass;
        /* 0x000c */ struct _FILE_OBJECT* FileObject;
        union
        {
          struct
          {
            /* 0x0010 */ unsigned char ReplaceIfExists;
            /* 0x0011 */ unsigned char AdvanceOnly;
          }; /* size: 0x0002 */
          /* 0x0010 */ unsigned long ClusterCount;
          /* 0x0010 */ void* DeleteHandle;
        }; /* size: 0x0004 */
      } /* size: 0x0010 */ SetFile;
      struct
      {
        /* 0x0004 */ unsigned long Length;
        /* 0x0008 */ void* EaList;
        /* 0x000c */ unsigned long EaListLength;
        /* 0x0010 */ unsigned long EaIndex;
      } /* size: 0x0010 */ QueryEa;
      struct
      {
        /* 0x0004 */ unsigned long Length;
      } /* size: 0x0004 */ SetEa;
      struct
      {
        /* 0x0004 */ unsigned long Length;
        /* 0x0008 */ enum _FSINFOCLASS FsInformationClass;
      } /* size: 0x0008 */ QueryVolume;
      struct
      {
        /* 0x0004 */ unsigned long Length;
        /* 0x0008 */ enum _FSINFOCLASS FsInformationClass;
      } /* size: 0x0008 */ SetVolume;
      struct
      {
        /* 0x0004 */ unsigned long OutputBufferLength;
        /* 0x0008 */ unsigned long InputBufferLength;
        /* 0x000c */ unsigned long FsControlCode;
        /* 0x0010 */ void* Type3InputBuffer;
      } /* size: 0x0010 */ FileSystemControl;
      struct
      {
        /* 0x0004 */ union _LARGE_INTEGER* Length;
        /* 0x0008 */ unsigned long Key;
        /* 0x000c */ union _LARGE_INTEGER ByteOffset;
      } /* size: 0x0010 */ LockControl;
      struct
      {
        /* 0x0004 */ unsigned long OutputBufferLength;
        /* 0x0008 */ unsigned long InputBufferLength;
        /* 0x000c */ unsigned long IoControlCode;
        /* 0x0010 */ void* Type3InputBuffer;
      } /* size: 0x0010 */ DeviceIoControl;
      struct
      {
        /* 0x0004 */ unsigned long SecurityInformation;
        /* 0x0008 */ unsigned long Length;
      } /* size: 0x0008 */ QuerySecurity;
      struct
      {
        /* 0x0004 */ unsigned long SecurityInformation;
        /* 0x0008 */ void* SecurityDescriptor;
      } /* size: 0x0008 */ SetSecurity;
      struct
      {
        /* 0x0004 */ struct _VPB* Vpb;
        /* 0x0008 */ struct _DEVICE_OBJECT* DeviceObject;
      } /* size: 0x0008 */ MountVolume;
      struct
      {
        /* 0x0004 */ struct _VPB* Vpb;
        /* 0x0008 */ struct _DEVICE_OBJECT* DeviceObject;
      } /* size: 0x0008 */ VerifyVolume;
      struct
      {
        /* 0x0004 */ struct _SCSI_REQUEST_BLOCK* Srb;
      } /* size: 0x0004 */ Scsi;
      struct
      {
        /* 0x0004 */ unsigned long Length;
        /* 0x0008 */ void* StartSid;
        /* 0x000c */ struct _FILE_GET_QUOTA_INFORMATION* SidList;
        /* 0x0010 */ unsigned long SidListLength;
      } /* size: 0x0010 */ QueryQuota;
      struct
      {
        /* 0x0004 */ unsigned long Length;
      } /* size: 0x0004 */ SetQuota;
      struct
      {
        /* 0x0004 */ enum _DEVICE_RELATION_TYPE Type;
      } /* size: 0x0004 */ QueryDeviceRelations;
      struct
      {
        /* 0x0004 */ const struct _GUID* InterfaceType;
        /* 0x0008 */ unsigned short Size;
        /* 0x000a */ unsigned short Version;
        /* 0x000c */ struct _INTERFACE* Interface;
        /* 0x0010 */ void* InterfaceSpecificData;
      } /* size: 0x0010 */ QueryInterface;
      struct
      {
        /* 0x0004 */ struct _DEVICE_CAPABILITIES* Capabilities;
      } /* size: 0x0004 */ DeviceCapabilities;
      struct
      {
        /* 0x0004 */ struct _IO_RESOURCE_REQUIREMENTS_LIST* IoResourceRequirementList;
      } /* size: 0x0004 */ FilterResourceRequirements;
      struct
      {
        /* 0x0004 */ unsigned long WhichSpace;
        /* 0x0008 */ void* Buffer;
        /* 0x000c */ unsigned long Offset;
        /* 0x0010 */ unsigned long Length;
      } /* size: 0x0010 */ ReadWriteConfig;
      struct
      {
        /* 0x0004 */ unsigned char Lock;
      } /* size: 0x0001 */ SetLock;
      struct
      {
        /* 0x0004 */ enum BUS_QUERY_ID_TYPE IdType;
      } /* size: 0x0004 */ QueryId;
      struct
      {
        /* 0x0004 */ enum DEVICE_TEXT_TYPE DeviceTextType;
        /* 0x0008 */ unsigned long LocaleId;
      } /* size: 0x0008 */ QueryDeviceText;
      struct
      {
        /* 0x0004 */ unsigned char InPath;
        /* 0x0005 */ unsigned char Reserved[3];
        /* 0x0008 */ enum _DEVICE_USAGE_NOTIFICATION_TYPE Type;
      } /* size: 0x0008 */ UsageNotification;
      struct
      {
        /* 0x0004 */ enum _SYSTEM_POWER_STATE PowerState;
      } /* size: 0x0004 */ WaitWake;
      struct
      {
        /* 0x0004 */ struct _POWER_SEQUENCE* PowerSequence;
      } /* size: 0x0004 */ PowerSequence;
      struct
      {
        /* 0x0004 */ unsigned long SystemContext;
        /* 0x0008 */ enum _POWER_STATE_TYPE Type;
        /* 0x000c */ union _POWER_STATE State;
        /* 0x0010 */ enum POWER_ACTION ShutdownType;
      } /* size: 0x0010 */ Power;
      struct
      {
        /* 0x0004 */ struct _CM_RESOURCE_LIST* AllocatedResources;
        /* 0x0008 */ struct _CM_RESOURCE_LIST* AllocatedResourcesTranslated;
      } /* size: 0x0008 */ StartDevice;
      struct
      {
        /* 0x0004 */ unsigned long ProviderId;
        /* 0x0008 */ void* DataPath;
        /* 0x000c */ unsigned long BufferSize;
        /* 0x0010 */ void* Buffer;
      } /* size: 0x0010 */ WMI;
      struct
      {
        /* 0x0004 */ void* Argument1;
        /* 0x0008 */ void* Argument2;
        /* 0x000c */ void* Argument3;
        /* 0x0010 */ void* Argument4;
      } /* size: 0x0010 */ Others;
    }; /* size: 0x0010 */
  } /* size: 0x0010 */ Parameters;
  /* 0x0014 */ struct _DEVICE_OBJECT* DeviceObject;
  /* 0x0018 */ struct _FILE_OBJECT* FileObject;
  /* 0x001c */ void* CompletionRoutine /* function */;
  /* 0x0020 */ void* Context;
} IO_STACK_LOCATION, *PIO_STACK_LOCATION; /* size: 0x0024 */

typedef struct _IO_SECURITY_CONTEXT
{
  /* 0x0000 */ struct _SECURITY_QUALITY_OF_SERVICE* SecurityQos;
  /* 0x0004 */ struct _ACCESS_STATE* AccessState;
  /* 0x0008 */ unsigned long DesiredAccess;
  /* 0x000c */ unsigned long FullCreateOptions;
} IO_SECURITY_CONTEXT, *PIO_SECURITY_CONTEXT; /* size: 0x0010 */

typedef struct _SECURITY_QUALITY_OF_SERVICE
{
  /* 0x0000 */ unsigned long Length;
  /* 0x0004 */ enum _SECURITY_IMPERSONATION_LEVEL ImpersonationLevel;
  /* 0x0008 */ unsigned char ContextTrackingMode;
  /* 0x0009 */ unsigned char EffectiveOnly;
  /* 0x000a */ char __PADDING__[2];
} SECURITY_QUALITY_OF_SERVICE, *PSECURITY_QUALITY_OF_SERVICE; /* size: 0x000c */

typedef struct _ACCESS_STATE
{
  /* 0x0000 */ struct _LUID OperationID;
  /* 0x0008 */ unsigned char SecurityEvaluated;
  /* 0x0009 */ unsigned char GenerateAudit;
  /* 0x000a */ unsigned char GenerateOnClose;
  /* 0x000b */ unsigned char PrivilegesAllocated;
  /* 0x000c */ unsigned long Flags;
  /* 0x0010 */ unsigned long RemainingDesiredAccess;
  /* 0x0014 */ unsigned long PreviouslyGrantedAccess;
  /* 0x0018 */ unsigned long OriginalDesiredAccess;
  /* 0x001c */ struct _SECURITY_SUBJECT_CONTEXT SubjectSecurityContext;
  /* 0x002c */ void* SecurityDescriptor;
  /* 0x0030 */ void* AuxData;
  union
  {
    union
    {
      /* 0x0034 */ struct _INITIAL_PRIVILEGE_SET InitialPrivilegeSet;
      /* 0x0034 */ struct _PRIVILEGE_SET PrivilegeSet;
    }; /* size: 0x002c */
  } /* size: 0x002c */ Privileges;
  /* 0x0060 */ unsigned char AuditPrivileges;
  /* 0x0061 */ char Padding_16[3];
  /* 0x0064 */ struct _UNICODE_STRING ObjectName;
  /* 0x006c */ struct _UNICODE_STRING ObjectTypeName;
} ACCESS_STATE, *PACCESS_STATE; /* size: 0x0074 */

typedef struct _MAILSLOT_CREATE_PARAMETERS
{
  /* 0x0000 */ unsigned long MailslotQuota;
  /* 0x0004 */ unsigned long MaximumMessageSize;
  /* 0x0008 */ union _LARGE_INTEGER ReadTimeout;
  /* 0x0010 */ unsigned char TimeoutSpecified;
  /* 0x0011 */ char __PADDING__[7];
} MAILSLOT_CREATE_PARAMETERS, *PMAILSLOT_CREATE_PARAMETERS; /* size: 0x0018 */

struct _SCSI_REQUEST_BLOCK;

typedef struct _SID
{
  /* 0x0000 */ unsigned char Revision;
  /* 0x0001 */ unsigned char SubAuthorityCount;
  /* 0x0002 */ struct _SID_IDENTIFIER_AUTHORITY IdentifierAuthority;
  /* 0x0008 */ unsigned long SubAuthority[1];
} SID, *PSID; /* size: 0x000c */

typedef struct _FILE_GET_QUOTA_INFORMATION
{
  /* 0x0000 */ unsigned long NextEntryOffset;
  /* 0x0004 */ unsigned long SidLength;
  /* 0x0008 */ struct _SID Sid;
} FILE_GET_QUOTA_INFORMATION, *PFILE_GET_QUOTA_INFORMATION; /* size: 0x0014 */

typedef struct _GUID
{
  /* 0x0000 */ unsigned long Data1;
  /* 0x0004 */ unsigned short Data2;
  /* 0x0006 */ unsigned short Data3;
  /* 0x0008 */ unsigned char Data4[8];
} GUID, *PGUID; /* size: 0x0010 */

typedef struct _INTERFACE
{
  /* 0x0000 */ unsigned short Size;
  /* 0x0002 */ unsigned short Version;
  /* 0x0004 */ void* Context;
  /* 0x0008 */ void* InterfaceReference /* function */;
  /* 0x000c */ void* InterfaceDereference /* function */;
} INTERFACE, *PINTERFACE; /* size: 0x0010 */

typedef struct _DEVICE_CAPABILITIES
{
  /* 0x0000 */ unsigned short Size;
  /* 0x0002 */ unsigned short Version;
  struct /* bitfield */
  {
    /* 0x0004 */ unsigned long DeviceD1 : 1; /* bit position: 0 */
    /* 0x0004 */ unsigned long DeviceD2 : 1; /* bit position: 1 */
    /* 0x0004 */ unsigned long LockSupported : 1; /* bit position: 2 */
    /* 0x0004 */ unsigned long EjectSupported : 1; /* bit position: 3 */
    /* 0x0004 */ unsigned long Removable : 1; /* bit position: 4 */
    /* 0x0004 */ unsigned long DockDevice : 1; /* bit position: 5 */
    /* 0x0004 */ unsigned long UniqueID : 1; /* bit position: 6 */
    /* 0x0004 */ unsigned long SilentInstall : 1; /* bit position: 7 */
    /* 0x0004 */ unsigned long RawDeviceOK : 1; /* bit position: 8 */
    /* 0x0004 */ unsigned long SurpriseRemovalOK : 1; /* bit position: 9 */
    /* 0x0004 */ unsigned long WakeFromD0 : 1; /* bit position: 10 */
    /* 0x0004 */ unsigned long WakeFromD1 : 1; /* bit position: 11 */
    /* 0x0004 */ unsigned long WakeFromD2 : 1; /* bit position: 12 */
    /* 0x0004 */ unsigned long WakeFromD3 : 1; /* bit position: 13 */
    /* 0x0004 */ unsigned long HardwareDisabled : 1; /* bit position: 14 */
    /* 0x0004 */ unsigned long NonDynamic : 1; /* bit position: 15 */
    /* 0x0004 */ unsigned long WarmEjectSupported : 1; /* bit position: 16 */
    /* 0x0004 */ unsigned long NoDisplayInUI : 1; /* bit position: 17 */
    /* 0x0004 */ unsigned long Reserved : 14; /* bit position: 18 */
  }; /* bitfield */
  /* 0x0008 */ unsigned long Address;
  /* 0x000c */ unsigned long UINumber;
  /* 0x0010 */ enum _DEVICE_POWER_STATE DeviceState[7];
  /* 0x002c */ enum _SYSTEM_POWER_STATE SystemWake;
  /* 0x0030 */ enum _DEVICE_POWER_STATE DeviceWake;
  /* 0x0034 */ unsigned long D1Latency;
  /* 0x0038 */ unsigned long D2Latency;
  /* 0x003c */ unsigned long D3Latency;
} DEVICE_CAPABILITIES, *PDEVICE_CAPABILITIES; /* size: 0x0040 */

typedef struct _IO_RESOURCE_REQUIREMENTS_LIST
{
  /* 0x0000 */ unsigned long ListSize;
  /* 0x0004 */ enum _INTERFACE_TYPE InterfaceType;
  /* 0x0008 */ unsigned long BusNumber;
  /* 0x000c */ unsigned long SlotNumber;
  /* 0x0010 */ unsigned long Reserved[3];
  /* 0x001c */ unsigned long AlternativeLists;
  /* 0x0020 */ struct _IO_RESOURCE_LIST List[1];
} IO_RESOURCE_REQUIREMENTS_LIST, *PIO_RESOURCE_REQUIREMENTS_LIST; /* size: 0x0048 */

typedef struct _POWER_SEQUENCE
{
  /* 0x0000 */ unsigned long SequenceD1;
  /* 0x0004 */ unsigned long SequenceD2;
  /* 0x0008 */ unsigned long SequenceD3;
} POWER_SEQUENCE, *PPOWER_SEQUENCE; /* size: 0x000c */

typedef struct _CM_RESOURCE_LIST
{
  /* 0x0000 */ unsigned long Count;
  /* 0x0004 */ struct _CM_FULL_RESOURCE_DESCRIPTOR List[1];
} CM_RESOURCE_LIST, *PCM_RESOURCE_LIST; /* size: 0x0024 */

typedef struct _DEVOBJ_EXTENSION
{
  /* 0x0000 */ short Type;
  /* 0x0002 */ unsigned short Size;
  /* 0x0004 */ struct _DEVICE_OBJECT* DeviceObject;
  /* 0x0008 */ unsigned long PowerFlags;
  /* 0x000c */ struct _DEVICE_OBJECT_POWER_EXTENSION* Dope;
  /* 0x0010 */ unsigned long ExtensionFlags;
  /* 0x0014 */ void* DeviceNode;
  /* 0x0018 */ struct _DEVICE_OBJECT* AttachedTo;
  /* 0x001c */ long StartIoCount;
  /* 0x0020 */ long StartIoKey;
  /* 0x0024 */ unsigned long StartIoFlags;
  /* 0x0028 */ struct _VPB* Vpb;
} DEVOBJ_EXTENSION, *PDEVOBJ_EXTENSION; /* size: 0x002c */

struct _DEVICE_OBJECT_POWER_EXTENSION;

typedef struct _OBJECT_ATTRIBUTES
{
  /* 0x0000 */ unsigned long Length;
  /* 0x0004 */ void* RootDirectory;
  /* 0x0008 */ struct _UNICODE_STRING* ObjectName;
  /* 0x000c */ unsigned long Attributes;
  /* 0x0010 */ void* SecurityDescriptor;
  /* 0x0014 */ void* SecurityQualityOfService;
} OBJECT_ATTRIBUTES, *POBJECT_ATTRIBUTES; /* size: 0x0018 */

typedef struct _OBJECT_TYPE
{
  /* 0x0000 */ struct _ERESOURCE Mutex;
  /* 0x0038 */ struct _LIST_ENTRY TypeList;
  /* 0x0040 */ struct _UNICODE_STRING Name;
  /* 0x0048 */ void* DefaultObject;
  /* 0x004c */ unsigned long Index;
  /* 0x0050 */ unsigned long TotalNumberOfObjects;
  /* 0x0054 */ unsigned long TotalNumberOfHandles;
  /* 0x0058 */ unsigned long HighWaterNumberOfObjects;
  /* 0x005c */ unsigned long HighWaterNumberOfHandles;
  /* 0x0060 */ struct _OBJECT_TYPE_INITIALIZER TypeInfo;
  /* 0x00ac */ unsigned long Key;
  /* 0x00b0 */ struct _ERESOURCE ObjectLocks[4];
} OBJECT_TYPE, *POBJECT_TYPE; /* size: 0x0190 */

typedef struct _OBJECT_HANDLE_INFORMATION
{
  /* 0x0000 */ unsigned long HandleAttributes;
  /* 0x0004 */ unsigned long GrantedAccess;
} OBJECT_HANDLE_INFORMATION, *POBJECT_HANDLE_INFORMATION; /* size: 0x0008 */

typedef struct _RTL_STACK_TRACE_ENTRY
{
  /* 0x0000 */ struct _RTL_STACK_TRACE_ENTRY* HashChain;
  /* 0x0004 */ unsigned long TraceCount;
  /* 0x0008 */ unsigned short Index;
  /* 0x000a */ unsigned short Depth;
  /* 0x000c */ void* BackTrace[32];
} RTL_STACK_TRACE_ENTRY, *PRTL_STACK_TRACE_ENTRY; /* size: 0x008c */

typedef struct _DPH_BLOCK_INFORMATION
{
  /* 0x0000 */ unsigned long StartStamp;
  /* 0x0004 */ void* Heap;
  /* 0x0008 */ unsigned long RequestedSize;
  /* 0x000c */ unsigned long ActualSize;
  union
  {
    /* 0x0010 */ struct _LIST_ENTRY FreeQueue;
    /* 0x0010 */ unsigned short TraceIndex;
  }; /* size: 0x0008 */
  /* 0x0018 */ void* StackTrace;
  /* 0x001c */ unsigned long EndStamp;
} DPH_BLOCK_INFORMATION, *PDPH_BLOCK_INFORMATION; /* size: 0x0020 */

typedef struct _HEAP_ENTRY
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned short Size;
      /* 0x0002 */ unsigned short PreviousSize;
    }; /* size: 0x0004 */
    /* 0x0000 */ void* volatile SubSegmentCode;
  }; /* size: 0x0004 */
  /* 0x0004 */ unsigned char SmallTagIndex;
  /* 0x0005 */ unsigned char Flags;
  /* 0x0006 */ unsigned char UnusedBytes;
  /* 0x0007 */ volatile unsigned char SegmentIndex;
} HEAP_ENTRY, *PHEAP_ENTRY; /* size: 0x0008 */

typedef struct _HEAP
{
  /* 0x0000 */ struct _HEAP_ENTRY Entry;
  /* 0x0008 */ unsigned long Signature;
  /* 0x000c */ unsigned long Flags;
  /* 0x0010 */ unsigned long ForceFlags;
  /* 0x0014 */ unsigned long VirtualMemoryThreshold;
  /* 0x0018 */ unsigned long SegmentReserve;
  /* 0x001c */ unsigned long SegmentCommit;
  /* 0x0020 */ unsigned long DeCommitFreeBlockThreshold;
  /* 0x0024 */ unsigned long DeCommitTotalFreeThreshold;
  /* 0x0028 */ unsigned long TotalFreeSize;
  /* 0x002c */ unsigned long MaximumAllocationSize;
  /* 0x0030 */ unsigned short ProcessHeapsListIndex;
  /* 0x0032 */ unsigned short HeaderValidateLength;
  /* 0x0034 */ void* HeaderValidateCopy;
  /* 0x0038 */ unsigned short NextAvailableTagIndex;
  /* 0x003a */ unsigned short MaximumTagIndex;
  /* 0x003c */ struct _HEAP_TAG_ENTRY* TagEntries;
  /* 0x0040 */ struct _HEAP_UCR_SEGMENT* UCRSegments;
  /* 0x0044 */ struct _HEAP_UNCOMMMTTED_RANGE* UnusedUnCommittedRanges;
  /* 0x0048 */ unsigned long AlignRound;
  /* 0x004c */ unsigned long AlignMask;
  /* 0x0050 */ struct _LIST_ENTRY VirtualAllocdBlocks;
  /* 0x0058 */ struct _HEAP_SEGMENT* Segments[64];
  union
  {
    union
    {
      /* 0x0158 */ unsigned long FreeListsInUseUlong[4];
      /* 0x0158 */ unsigned char FreeListsInUseBytes[16];
    }; /* size: 0x0010 */
  } /* size: 0x0010 */ u;
  union
  {
    union
    {
      /* 0x0168 */ unsigned short FreeListsInUseTerminate;
      /* 0x0168 */ unsigned short DecommitCount;
    }; /* size: 0x0002 */
  } /* size: 0x0002 */ u2;
  /* 0x016a */ unsigned short AllocatorBackTraceIndex;
  /* 0x016c */ unsigned long NonDedicatedListLength;
  /* 0x0170 */ void* LargeBlocksIndex;
  /* 0x0174 */ struct _HEAP_PSEUDO_TAG_ENTRY* PseudoTagEntries;
  /* 0x0178 */ struct _LIST_ENTRY FreeLists[128];
  /* 0x0578 */ struct _HEAP_LOCK* LockVariable;
  /* 0x057c */ void* CommitRoutine /* function */;
  /* 0x0580 */ void* FrontEndHeap;
  /* 0x0584 */ unsigned short FrontHeapLockCount;
  /* 0x0586 */ unsigned char FrontEndHeapType;
  /* 0x0587 */ unsigned char LastSegmentIndex;
} HEAP, *PHEAP; /* size: 0x0588 */

typedef struct _HEAP_TAG_ENTRY
{
  /* 0x0000 */ unsigned long Allocs;
  /* 0x0004 */ unsigned long Frees;
  /* 0x0008 */ unsigned long Size;
  /* 0x000c */ unsigned short TagIndex;
  /* 0x000e */ unsigned short CreatorBackTraceIndex;
  /* 0x0010 */ unsigned short TagName[24];
} HEAP_TAG_ENTRY, *PHEAP_TAG_ENTRY; /* size: 0x0040 */

typedef struct _HEAP_UNCOMMMTTED_RANGE
{
  /* 0x0000 */ struct _HEAP_UNCOMMMTTED_RANGE* Next;
  /* 0x0004 */ unsigned long Address;
  /* 0x0008 */ unsigned long Size;
  /* 0x000c */ unsigned long filler;
} HEAP_UNCOMMMTTED_RANGE, *PHEAP_UNCOMMMTTED_RANGE; /* size: 0x0010 */

typedef struct _HEAP_SEGMENT
{
  /* 0x0000 */ struct _HEAP_ENTRY Entry;
  /* 0x0008 */ unsigned long Signature;
  /* 0x000c */ unsigned long Flags;
  /* 0x0010 */ struct _HEAP* Heap;
  /* 0x0014 */ unsigned long LargestUnCommittedRange;
  /* 0x0018 */ void* BaseAddress;
  /* 0x001c */ unsigned long NumberOfPages;
  /* 0x0020 */ struct _HEAP_ENTRY* FirstEntry;
  /* 0x0024 */ struct _HEAP_ENTRY* LastValidEntry;
  /* 0x0028 */ unsigned long NumberOfUnCommittedPages;
  /* 0x002c */ unsigned long NumberOfUnCommittedRanges;
  /* 0x0030 */ struct _HEAP_UNCOMMMTTED_RANGE* UnCommittedRanges;
  /* 0x0034 */ unsigned short AllocatorBackTraceIndex;
  /* 0x0036 */ unsigned short Reserved;
  /* 0x0038 */ struct _HEAP_ENTRY* LastEntryInSegment;
} HEAP_SEGMENT, *PHEAP_SEGMENT; /* size: 0x003c */

typedef struct _HEAP_PSEUDO_TAG_ENTRY
{
  /* 0x0000 */ unsigned long Allocs;
  /* 0x0004 */ unsigned long Frees;
  /* 0x0008 */ unsigned long Size;
} HEAP_PSEUDO_TAG_ENTRY, *PHEAP_PSEUDO_TAG_ENTRY; /* size: 0x000c */

typedef struct _IMAGE_SECTION_HEADER
{
  /* 0x0000 */ unsigned char Name[8];
  union
  {
    union
    {
      /* 0x0008 */ unsigned long PhysicalAddress;
      /* 0x0008 */ unsigned long VirtualSize;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ Misc;
  /* 0x000c */ unsigned long VirtualAddress;
  /* 0x0010 */ unsigned long SizeOfRawData;
  /* 0x0014 */ unsigned long PointerToRawData;
  /* 0x0018 */ unsigned long PointerToRelocations;
  /* 0x001c */ unsigned long PointerToLinenumbers;
  /* 0x0020 */ unsigned short NumberOfRelocations;
  /* 0x0022 */ unsigned short NumberOfLinenumbers;
  /* 0x0024 */ unsigned long Characteristics;
} IMAGE_SECTION_HEADER, *PIMAGE_SECTION_HEADER; /* size: 0x0028 */

typedef struct _KUSER_SHARED_DATA
{
  /* 0x0000 */ volatile unsigned long TickCountLow;
  /* 0x0004 */ unsigned long TickCountMultiplier;
  /* 0x0008 */ volatile struct _KSYSTEM_TIME InterruptTime;
  /* 0x0014 */ volatile struct _KSYSTEM_TIME SystemTime;
  /* 0x0020 */ volatile struct _KSYSTEM_TIME TimeZoneBias;
  /* 0x002c */ unsigned short ImageNumberLow;
  /* 0x002e */ unsigned short ImageNumberHigh;
  /* 0x0030 */ unsigned short NtSystemRoot[260];
  /* 0x0238 */ unsigned long MaxStackTraceDepth;
  /* 0x023c */ unsigned long CryptoExponent;
  /* 0x0240 */ unsigned long TimeZoneId;
  /* 0x0244 */ unsigned long Reserved2[8];
  /* 0x0264 */ enum _NT_PRODUCT_TYPE NtProductType;
  /* 0x0268 */ unsigned char ProductTypeIsValid;
  /* 0x0269 */ char Padding_17[3];
  /* 0x026c */ unsigned long NtMajorVersion;
  /* 0x0270 */ unsigned long NtMinorVersion;
  /* 0x0274 */ unsigned char ProcessorFeatures[64];
  /* 0x02b4 */ unsigned long Reserved1;
  /* 0x02b8 */ unsigned long Reserved3;
  /* 0x02bc */ volatile unsigned long TimeSlip;
  /* 0x02c0 */ enum _ALTERNATIVE_ARCHITECTURE_TYPE AlternativeArchitecture;
  /* 0x02c4 */ long Padding_18;
  /* 0x02c8 */ union _LARGE_INTEGER SystemExpirationDate;
  /* 0x02d0 */ unsigned long SuiteMask;
  /* 0x02d4 */ unsigned char KdDebuggerEnabled;
  /* 0x02d5 */ unsigned char NXSupportPolicy;
  /* 0x02d6 */ char Padding_19[2];
  /* 0x02d8 */ volatile unsigned long ActiveConsoleId;
  /* 0x02dc */ volatile unsigned long DismountCount;
  /* 0x02e0 */ unsigned long ComPlusPackage;
  /* 0x02e4 */ unsigned long LastSystemRITEventTickCount;
  /* 0x02e8 */ unsigned long NumberOfPhysicalPages;
  /* 0x02ec */ unsigned char SafeBootMode;
  /* 0x02ed */ char Padding_20[3];
  /* 0x02f0 */ unsigned long TraceLogging;
  /* 0x02f4 */ long Padding_21;
  /* 0x02f8 */ unsigned __int64 TestRetInstruction;
  /* 0x0300 */ unsigned long SystemCall;
  /* 0x0304 */ unsigned long SystemCallReturn;
  /* 0x0308 */ unsigned __int64 SystemCallPad[3];
  union
  {
    /* 0x0320 */ volatile struct _KSYSTEM_TIME TickCount;
    /* 0x0320 */ volatile unsigned __int64 TickCountQuad;
  }; /* size: 0x000c */
  /* 0x032c */ long Padding_22;
  /* 0x0330 */ unsigned long Cookie;
  /* 0x0334 */ long __PADDING__[1];
} KUSER_SHARED_DATA, *PKUSER_SHARED_DATA; /* size: 0x0338 */

typedef struct _RTL_TRACE_DATABASE
{
  /* 0x0000 */ unsigned long Magic;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ unsigned long Tag;
  /* 0x000c */ struct _RTL_TRACE_SEGMENT* SegmentList;
  /* 0x0010 */ unsigned long MaximumSize;
  /* 0x0014 */ unsigned long CurrentSize;
  /* 0x0018 */ void* Owner;
  /* 0x001c */ struct _RTL_CRITICAL_SECTION Lock;
  /* 0x0034 */ unsigned long NoOfBuckets;
  /* 0x0038 */ struct _RTL_TRACE_BLOCK** Buckets;
  /* 0x003c */ void* HashFunction /* function */;
  /* 0x0040 */ unsigned long NoOfTraces;
  /* 0x0044 */ unsigned long NoOfHits;
  /* 0x0048 */ unsigned long HashCounter[16];
} RTL_TRACE_DATABASE, *PRTL_TRACE_DATABASE; /* size: 0x0088 */

typedef struct _HEAP_FREE_ENTRY
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned short Size;
      /* 0x0002 */ unsigned short PreviousSize;
    }; /* size: 0x0004 */
    /* 0x0000 */ void* volatile SubSegmentCode;
  }; /* size: 0x0004 */
  /* 0x0004 */ unsigned char SmallTagIndex;
  /* 0x0005 */ unsigned char Flags;
  /* 0x0006 */ unsigned char UnusedBytes;
  /* 0x0007 */ volatile unsigned char SegmentIndex;
  /* 0x0008 */ struct _LIST_ENTRY FreeList;
} HEAP_FREE_ENTRY, *PHEAP_FREE_ENTRY; /* size: 0x0010 */

typedef struct _DPH_HEAP_ROOT
{
  /* 0x0000 */ unsigned long Signature;
  /* 0x0004 */ unsigned long HeapFlags;
  /* 0x0008 */ struct _RTL_CRITICAL_SECTION* HeapCritSect;
  /* 0x000c */ unsigned long nRemoteLockAcquired;
  /* 0x0010 */ struct _DPH_HEAP_BLOCK* pVirtualStorageListHead;
  /* 0x0014 */ struct _DPH_HEAP_BLOCK* pVirtualStorageListTail;
  /* 0x0018 */ unsigned long nVirtualStorageRanges;
  /* 0x001c */ unsigned long nVirtualStorageBytes;
  /* 0x0020 */ struct _DPH_HEAP_BLOCK* pBusyAllocationListHead;
  /* 0x0024 */ struct _DPH_HEAP_BLOCK* pBusyAllocationListTail;
  /* 0x0028 */ unsigned long nBusyAllocations;
  /* 0x002c */ unsigned long nBusyAllocationBytesCommitted;
  /* 0x0030 */ struct _DPH_HEAP_BLOCK* pFreeAllocationListHead;
  /* 0x0034 */ struct _DPH_HEAP_BLOCK* pFreeAllocationListTail;
  /* 0x0038 */ unsigned long nFreeAllocations;
  /* 0x003c */ unsigned long nFreeAllocationBytesCommitted;
  /* 0x0040 */ struct _DPH_HEAP_BLOCK* pAvailableAllocationListHead;
  /* 0x0044 */ struct _DPH_HEAP_BLOCK* pAvailableAllocationListTail;
  /* 0x0048 */ unsigned long nAvailableAllocations;
  /* 0x004c */ unsigned long nAvailableAllocationBytesCommitted;
  /* 0x0050 */ struct _DPH_HEAP_BLOCK* pUnusedNodeListHead;
  /* 0x0054 */ struct _DPH_HEAP_BLOCK* pUnusedNodeListTail;
  /* 0x0058 */ unsigned long nUnusedNodes;
  /* 0x005c */ unsigned long nBusyAllocationBytesAccessible;
  /* 0x0060 */ struct _DPH_HEAP_BLOCK* pNodePoolListHead;
  /* 0x0064 */ struct _DPH_HEAP_BLOCK* pNodePoolListTail;
  /* 0x0068 */ unsigned long nNodePools;
  /* 0x006c */ unsigned long nNodePoolBytes;
  /* 0x0070 */ struct _DPH_HEAP_ROOT* pNextHeapRoot;
  /* 0x0074 */ struct _DPH_HEAP_ROOT* pPrevHeapRoot;
  /* 0x0078 */ unsigned long nUnProtectionReferenceCount;
  /* 0x007c */ unsigned long InsideAllocateNode;
  /* 0x0080 */ unsigned long ExtraFlags;
  /* 0x0084 */ unsigned long Seed;
  /* 0x0088 */ void* NormalHeap;
  /* 0x008c */ struct _RTL_TRACE_BLOCK* CreateStackTrace;
  /* 0x0090 */ void* FirstThread;
} DPH_HEAP_ROOT, *PDPH_HEAP_ROOT; /* size: 0x0094 */

typedef struct _DPH_HEAP_BLOCK
{
  /* 0x0000 */ struct _DPH_HEAP_BLOCK* pNextAlloc;
  /* 0x0004 */ unsigned char* pVirtualBlock;
  /* 0x0008 */ unsigned long nVirtualBlockSize;
  /* 0x000c */ unsigned long nVirtualAccessSize;
  /* 0x0010 */ unsigned char* pUserAllocation;
  /* 0x0014 */ unsigned long nUserRequestedSize;
  /* 0x0018 */ unsigned long nUserActualSize;
  /* 0x001c */ void* UserValue;
  /* 0x0020 */ unsigned long UserFlags;
  /* 0x0024 */ struct _RTL_TRACE_BLOCK* StackTrace;
} DPH_HEAP_BLOCK, *PDPH_HEAP_BLOCK; /* size: 0x0028 */

typedef struct _LDR_DATA_TABLE_ENTRY
{
  /* 0x0000 */ struct _LIST_ENTRY InLoadOrderLinks;
  /* 0x0008 */ struct _LIST_ENTRY InMemoryOrderLinks;
  /* 0x0010 */ struct _LIST_ENTRY InInitializationOrderLinks;
  /* 0x0018 */ void* DllBase;
  /* 0x001c */ void* EntryPoint;
  /* 0x0020 */ unsigned long SizeOfImage;
  /* 0x0024 */ struct _UNICODE_STRING FullDllName;
  /* 0x002c */ struct _UNICODE_STRING BaseDllName;
  /* 0x0034 */ unsigned long Flags;
  /* 0x0038 */ unsigned short LoadCount;
  /* 0x003a */ unsigned short TlsIndex;
  union
  {
    /* 0x003c */ struct _LIST_ENTRY HashLinks;
    struct
    {
      /* 0x003c */ void* SectionPointer;
      /* 0x0040 */ unsigned long CheckSum;
    }; /* size: 0x0008 */
  }; /* size: 0x0008 */
  union
  {
    /* 0x0044 */ unsigned long TimeDateStamp;
    /* 0x0044 */ void* LoadedImports;
  }; /* size: 0x0004 */
  /* 0x0048 */ void* EntryPointActivationContext;
  /* 0x004c */ void* PatchInformation;
} LDR_DATA_TABLE_ENTRY, *PLDR_DATA_TABLE_ENTRY; /* size: 0x0050 */

typedef struct _NT_TIB
{
  /* 0x0000 */ struct _EXCEPTION_REGISTRATION_RECORD* ExceptionList;
  /* 0x0004 */ void* StackBase;
  /* 0x0008 */ void* StackLimit;
  /* 0x000c */ void* SubSystemTib;
  union
  {
    /* 0x0010 */ void* FiberData;
    /* 0x0010 */ unsigned long Version;
  }; /* size: 0x0004 */
  /* 0x0014 */ void* ArbitraryUserPointer;
  /* 0x0018 */ struct _NT_TIB* Self;
} NT_TIB, *PNT_TIB; /* size: 0x001c */

typedef struct _ACTIVATION_CONTEXT_STACK
{
  /* 0x0000 */ unsigned long Flags;
  /* 0x0004 */ unsigned long NextCookieSequenceNumber;
  /* 0x0008 */ void* ActiveFrame;
  /* 0x000c */ struct _LIST_ENTRY FrameListCache;
} ACTIVATION_CONTEXT_STACK, *PACTIVATION_CONTEXT_STACK; /* size: 0x0014 */

typedef struct _GDI_TEB_BATCH
{
  /* 0x0000 */ unsigned long Offset;
  /* 0x0004 */ unsigned long HDC;
  /* 0x0008 */ unsigned long Buffer[310];
} GDI_TEB_BATCH, *PGDI_TEB_BATCH; /* size: 0x04e0 */

typedef struct _Wx86ThreadState
{
  /* 0x0000 */ unsigned long* CallBx86Eip;
  /* 0x0004 */ void* DeallocationCpu;
  /* 0x0008 */ unsigned char UseKnownWx86Dll;
  /* 0x0009 */ char OleStubInvoked;
  /* 0x000a */ char __PADDING__[2];
} Wx86ThreadState, *PWx86ThreadState; /* size: 0x000c */

typedef struct _TEB
{
  /* 0x0000 */ struct _NT_TIB NtTib;
  /* 0x001c */ void* EnvironmentPointer;
  /* 0x0020 */ struct _CLIENT_ID ClientId;
  /* 0x0028 */ void* ActiveRpcHandle;
  /* 0x002c */ void* ThreadLocalStoragePointer;
  /* 0x0030 */ struct _PEB* ProcessEnvironmentBlock;
  /* 0x0034 */ unsigned long LastErrorValue;
  /* 0x0038 */ unsigned long CountOfOwnedCriticalSections;
  /* 0x003c */ void* CsrClientThread;
  /* 0x0040 */ void* Win32ThreadInfo;
  /* 0x0044 */ unsigned long User32Reserved[26];
  /* 0x00ac */ unsigned long UserReserved[5];
  /* 0x00c0 */ void* WOW32Reserved;
  /* 0x00c4 */ unsigned long CurrentLocale;
  /* 0x00c8 */ unsigned long FpSoftwareStatusRegister;
  /* 0x00cc */ void* SystemReserved1[54];
  /* 0x01a4 */ long ExceptionCode;
  /* 0x01a8 */ struct _ACTIVATION_CONTEXT_STACK ActivationContextStack;
  /* 0x01bc */ unsigned char SpareBytes1[24];
  /* 0x01d4 */ struct _GDI_TEB_BATCH GdiTebBatch;
  /* 0x06b4 */ struct _CLIENT_ID RealClientId;
  /* 0x06bc */ void* GdiCachedProcessHandle;
  /* 0x06c0 */ unsigned long GdiClientPID;
  /* 0x06c4 */ unsigned long GdiClientTID;
  /* 0x06c8 */ void* GdiThreadLocalInfo;
  /* 0x06cc */ unsigned long Win32ClientInfo[62];
  /* 0x07c4 */ void* glDispatchTable[233];
  /* 0x0b68 */ unsigned long glReserved1[29];
  /* 0x0bdc */ void* glReserved2;
  /* 0x0be0 */ void* glSectionInfo;
  /* 0x0be4 */ void* glSection;
  /* 0x0be8 */ void* glTable;
  /* 0x0bec */ void* glCurrentRC;
  /* 0x0bf0 */ void* glContext;
  /* 0x0bf4 */ unsigned long LastStatusValue;
  /* 0x0bf8 */ struct _UNICODE_STRING StaticUnicodeString;
  /* 0x0c00 */ unsigned short StaticUnicodeBuffer[261];
  /* 0x0e0a */ char Padding_23[2];
  /* 0x0e0c */ void* DeallocationStack;
  /* 0x0e10 */ void* TlsSlots[64];
  /* 0x0f10 */ struct _LIST_ENTRY TlsLinks;
  /* 0x0f18 */ void* Vdm;
  /* 0x0f1c */ void* ReservedForNtRpc;
  /* 0x0f20 */ void* DbgSsReserved[2];
  /* 0x0f28 */ unsigned long HardErrorsAreDisabled;
  /* 0x0f2c */ void* Instrumentation[16];
  /* 0x0f6c */ void* WinSockData;
  /* 0x0f70 */ unsigned long GdiBatchCount;
  /* 0x0f74 */ unsigned char InDbgPrint;
  /* 0x0f75 */ unsigned char FreeStackOnTermination;
  /* 0x0f76 */ unsigned char HasFiberData;
  /* 0x0f77 */ unsigned char IdealProcessor;
  /* 0x0f78 */ unsigned long Spare3;
  /* 0x0f7c */ void* ReservedForPerf;
  /* 0x0f80 */ void* ReservedForOle;
  /* 0x0f84 */ unsigned long WaitingOnLoaderLock;
  /* 0x0f88 */ struct _Wx86ThreadState Wx86Thread;
  /* 0x0f94 */ void** TlsExpansionSlots;
  /* 0x0f98 */ unsigned long ImpersonationLocale;
  /* 0x0f9c */ unsigned long IsImpersonating;
  /* 0x0fa0 */ void* NlsCache;
  /* 0x0fa4 */ void* pShimData;
  /* 0x0fa8 */ unsigned long HeapVirtualAffinity;
  /* 0x0fac */ void* CurrentTransactionHandle;
  /* 0x0fb0 */ struct _TEB_ACTIVE_FRAME* ActiveFrame;
  /* 0x0fb4 */ unsigned char SafeThunkCall;
  /* 0x0fb5 */ unsigned char BooleanSpare[3];
} TEB, *PTEB; /* size: 0x0fb8 */

typedef struct _TEB_ACTIVE_FRAME
{
  /* 0x0000 */ unsigned long Flags;
  /* 0x0004 */ struct _TEB_ACTIVE_FRAME* Previous;
  /* 0x0008 */ const struct _TEB_ACTIVE_FRAME_CONTEXT* Context;
} TEB_ACTIVE_FRAME, *PTEB_ACTIVE_FRAME; /* size: 0x000c */

/*
?LoadOle32Export@@YGPAXPAPAXQAD@Z
?PropertyLengthAsVariant@@YGKPBUtagSERIALIZEDPROPERTYVALUE@@KGE@Z
?RtlConvertPropertyToVariant@@YGEPBUtagSERIALIZEDPROPERTYVALUE@@GPAUtagPROPVARIANT@@PAVPMemoryAllocator@@@Z
?RtlConvertVariantToProperty@@YGPAUtagSERIALIZEDPROPERTYVALUE@@PBUtagPROPVARIANT@@GPAU1@PAKKE2@Z
@ExInterlockedFlushSList@4
@ExInterlockedPopEntrySList@8
@ExInterlockedPushEntrySList@12
@InterlockedPopEntrySList@4
@InterlockedPushEntrySList@8
@InterlockedPushListSList@16
@RtlInterlockedCompareExchange64@12
@RtlInterlockedSetClearBits@12
@RtlUlongByteSwap@4
@RtlUlonglongByteSwap@8
@RtlUshortByteSwap@4
@RtlpAllocateAffinityIndex@0
@RtlpAllocateUserBlock@8
@RtlpCreateLowFragHeap@4
@RtlpDestroyLowFragHeap@4
@RtlpFreeUserBlock@8
@RtlpInterlockedFlushSList@4
@RtlpInterlockedPopEntrySList@4
@RtlpInterlockedPushEntrySList@8
@RtlpLowFragHeapAlloc@8
