struct tagCOMPAREITEMSTRUCT
{
  /* 0x0000 */ unsigned int CtlType;
  /* 0x0004 */ unsigned int CtlID;
  /* 0x0008 */ struct HWND__* hwndItem;
  /* 0x000c */ unsigned int itemID1;
  /* 0x0010 */ unsigned long itemData1;
  /* 0x0014 */ unsigned int itemID2;
  /* 0x0018 */ unsigned long itemData2;
  /* 0x001c */ unsigned long dwLocaleId;
}; /* size: 0x0020 */

