enum _TAG_UNNAMED_1;
struct BATTERY_REPORTING_SCALE;
enum BUS_QUERY_ID_TYPE;
struct CMP_OFFSET_ARRAY;
enum DEVICE_TEXT_TYPE;
union EX_QUEUE_WORKER_INFO;
enum HSTORAGE_TYPE;
enum KTM_STATE;
struct LIST_ENTRY32;
struct LIST_ENTRY64;
enum LSA_FOREST_TRUST_RECORD_TYPE;
enum POP_POLICY_DEVICE_TYPE;
enum POWER_ACTION;
struct POWER_ACTION_POLICY;
struct PO_MEMORY_IMAGE;
struct PPM_IDLE_ACCOUNTING;
struct PPM_IDLE_STATE_ACCOUNTING;
struct PROCESSOR_IDLESTATE_INFO;
struct PROCESSOR_IDLESTATE_POLICY;
struct PROCESSOR_PERFSTATE_POLICY;
enum PROFILE_STATUS;
enum ReplacesCorHdrNumericDefines;
struct SYSTEM_POWER_CAPABILITIES;
enum SYSTEM_POWER_CONDITION;
struct SYSTEM_POWER_LEVEL;
enum UoWActionType;
enum WHEA_PCIEXPRESS_DEVICE_TYPE;
struct WHEA_PCIXDEVICE_REGISTER_PAIR;
struct _ACCESS_STATE;
struct _ACL;
struct _ACTIVATION_CONTEXT;
struct _ACTIVATION_CONTEXT_DATA;
struct _ACTIVATION_CONTEXT_STACK;
struct _ADAPTER_OBJECT;
struct _ALPC_COMMUNICATION_INFO;
struct _ALPC_COMPLETION_LIST;
struct _ALPC_COMPLETION_LIST_HEADER;
struct _ALPC_COMPLETION_LIST_STATE;
struct _ALPC_COMPLETION_PACKET_LOOKASIDE;
struct _ALPC_COMPLETION_PACKET_LOOKASIDE_ENTRY;
struct _ALPC_DISPATCH_CONTEXT;
struct _ALPC_HANDLE_ENTRY;
struct _ALPC_HANDLE_TABLE;
struct _ALPC_MESSAGE_ATTRIBUTES;
struct _ALPC_MESSAGE_ZONE;
struct _ALPC_PORT;
struct _ALPC_PORT_ATTRIBUTES;
struct _ALPC_PROCESS_CONTEXT;
struct _ALPHA_LOADER_BLOCK;
enum _ALTERNATIVE_ARCHITECTURE_TYPE;
struct _AMD64_DBGKD_CONTROL_SET;
enum _ARBITER_ACTION;

struct _SYSTEM_POWER_STATE_CONTEXT;
struct _SYSTEM_TRACE_HEADER;
struct _TEB;
struct _TEB_ACTIVE_FRAME;
struct _TEB_ACTIVE_FRAME_CONTEXT;
struct _TERMINATION_PORT;
struct _THERMAL_INFORMATION;
struct _THERMAL_INFORMATION_EX;
struct _TIME_FIELDS;
struct _TOKEN;
struct _TOKEN_AUDIT_POLICY;
struct _TOKEN_CONTROL;
struct _TOKEN_SOURCE;
enum _TOKEN_TYPE;
struct _TP_CALLBACK_ENVIRON;
struct _TP_CALLBACK_INSTANCE;
struct _TP_CLEANUP_GROUP;
struct _TP_DIRECT;
struct _TP_POOL;
struct _TP_TASK;
struct _TP_TASK_CALLBACKS;
struct _TRACE_ENABLE_CONTEXT;
struct _TRACE_ENABLE_CONTEXT_EX;
struct _TRACE_ENABLE_INFO;
struct _TXN_PARAMETER_BLOCK;
enum _TYPE_OF_MEMORY;
union _ULARGE_INTEGER;
struct _UNICODE_STRING;
struct _VACB;
struct _VACB_ARRAY_HEADER;
struct _VACB_LEVEL_REFERENCE;
struct _VF_BTS_DATA_MANAGEMENT_AREA;
struct _VF_BTS_RECORD;
struct _VF_POOL_TRACE;
struct _VF_TRACKER;
struct _VF_TRACKER_STAMP;
struct _VIRTUAL_EFI_RUNTIME_SERVICES;
struct _VI_CANCEL_GLOBALS;
enum _VI_CNT_INDEX_TYPE;
struct _VI_DEADLOCK_ADDRESS_RANGE;
struct _VI_DEADLOCK_GLOBALS;
struct _VI_DEADLOCK_NODE;
struct _VI_DEADLOCK_RESOURCE;
enum _VI_DEADLOCK_RESOURCE_TYPE;
struct _VI_DEADLOCK_THREAD;
struct _VI_FAULT_TRACE;
struct _VI_POOL_ENTRY;
struct _VI_POOL_ENTRY_INUSE;
struct _VI_POOL_PAGE_HEADER;
struct _VI_TRACK_IRQL;
struct _VI_VERIFIER_ISSUE;
struct _VOLUME_CACHE_MAP;
struct _VPB;
struct _WAIT_CONTEXT_BLOCK;
enum _WAIT_TYPE;
struct _WHEA_ERROR_PACKET;
union _WHEA_ERROR_PACKET_FLAGS;
struct _WHEA_ERROR_RECORD;
struct _WHEA_ERROR_RECORD_HEADER;
union _WHEA_ERROR_RECORD_HEADER_FLAGS;
union _WHEA_ERROR_RECORD_HEADER_VALIDBITS;
struct _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR;
union _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_FLAGS;
union _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_VALIDBITS;
enum _WHEA_ERROR_SEVERITY;
enum _WHEA_ERROR_SOURCE_TYPE;
union _WHEA_ERROR_STATUS;
enum _WHEA_ERROR_TYPE;
struct _WHEA_GENERIC_PROCESSOR_ERROR;
union _WHEA_GENERIC_PROCESSOR_ERROR_VALIDBITS;
struct _WHEA_MEMORY_ERROR;
union _WHEA_MEMORY_ERROR_VALIDBITS;
struct _WHEA_NMI_ERROR;
union _WHEA_NMI_ERROR_FLAGS;
union _WHEA_PCIEXPRESS_BRIDGE_CONTROL_STATUS;
union _WHEA_PCIEXPRESS_COMMAND_STATUS;
struct _WHEA_PCIEXPRESS_DEVICE_ID;
struct _WHEA_PCIEXPRESS_ERROR;
union _WHEA_PCIEXPRESS_ERROR_VALIDBITS;
union _WHEA_PCIEXPRESS_VERSION;
union _WHEA_PCIXBUS_COMMAND;
struct _WHEA_PCIXBUS_ERROR;
union _WHEA_PCIXBUS_ERROR_VALIDBITS;
union _WHEA_PCIXBUS_ID;
struct _WHEA_PCIXDEVICE_ERROR;
union _WHEA_PCIXDEVICE_ERROR_VALIDBITS;
struct _WHEA_PCIXDEVICE_ID;
union _WHEA_PERSISTENCE_INFO;
enum _WHEA_RAW_DATA_FORMAT;
union _WHEA_REVISION;
union _WHEA_TIMESTAMP;
struct _WMI_BUFFER_HEADER;
struct _WMI_LOGGER_CONTEXT;
struct _WMI_TRACE_PACKET;
struct _WNODE_HEADER;
struct _WORK_QUEUE_ENTRY;
struct _WORK_QUEUE_ITEM;
enum _WOW64_SHARED_INFORMATION;
struct _X86_DBGKD_CONTROL_SET;
struct _flags;
struct _iobuf;
union _u;

typedef enum
{
  KTMOH_CommitTransaction_Result = 1,
  KTMOH_RollbackTransaction_Result = 2,
} TAG_UNNAMED_1, *PTAG_UNNAMED_1;

struct BATTERY_REPORTING_SCALE
{
  /* 0x0000 */ unsigned long Granularity;
  /* 0x0004 */ unsigned long Capacity;
}; /* size: 0x0008 */

enum BUS_QUERY_ID_TYPE
{
  BusQueryDeviceID = 0,
  BusQueryHardwareIDs = 1,
  BusQueryCompatibleIDs = 2,
  BusQueryInstanceID = 3,
  BusQueryDeviceSerialNumber = 4,
};

struct CMP_OFFSET_ARRAY
{
  /* 0x0000 */ unsigned long FileOffset;
  /* 0x0004 */ void* DataBuffer;
  /* 0x0008 */ unsigned long DataLength;
}; /* size: 0x000c */

enum DEVICE_TEXT_TYPE
{
  DeviceTextDescription = 0,
  DeviceTextLocationInformation = 1,
};

union EX_QUEUE_WORKER_INFO
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long QueueDisabled : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned long MakeThreadsAsNecessary : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned long WaitMode : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned long WorkerCount : 29; /* bit position: 3 */
    }; /* bitfield */
    /* 0x0000 */ long QueueWorkerInfo;
  }; /* size: 0x0004 */
}; /* size: 0x0004 */

enum HSTORAGE_TYPE
{
  Stable = 0,
  Volatile = 1,
  InvalidStorage = 2,
};

enum KTM_STATE
{
  KKtmUninitialized = 0,
  KKtmInitialized = 1,
  KKtmRecovering = 2,
  KKtmOnline = 3,
  KKtmRecoveryFailed = 4,
  KKtmOffline = 5,
};

struct LIST_ENTRY32
{
  /* 0x0000 */ unsigned long Flink;
  /* 0x0004 */ unsigned long Blink;
}; /* size: 0x0008 */

struct LIST_ENTRY64
{
  /* 0x0000 */ unsigned __int64 Flink;
  /* 0x0008 */ unsigned __int64 Blink;
}; /* size: 0x0010 */

enum LSA_FOREST_TRUST_RECORD_TYPE
{
  ForestTrustTopLevelName = 0,
  ForestTrustTopLevelNameEx = 1,
  ForestTrustDomainInfo = 2,
  ForestTrustRecordTypeLast = 2,
};

enum POP_POLICY_DEVICE_TYPE
{
  PolicyDeviceSystemButton = 0,
  PolicyDeviceThermalZone = 1,
  PolicyDeviceBattery = 2,
  PolicyDeviceMemory = 3,
  PolicyInitiatePowerActionAPI = 4,
  PolicySetPowerStateAPI = 5,
  PolicyImmediateDozeS4 = 6,
  PolicySystemIdle = 7,
  PolicyDeviceMax = 8,
};

enum POWER_ACTION
{
  PowerActionNone = 0,
  PowerActionReserved = 1,
  PowerActionSleep = 2,
  PowerActionHibernate = 3,
  PowerActionShutdown = 4,
  PowerActionShutdownReset = 5,
  PowerActionShutdownOff = 6,
  PowerActionWarmEject = 7,
};

struct POWER_ACTION_POLICY
{
  /* 0x0000 */ enum POWER_ACTION Action;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ unsigned long EventCode;
}; /* size: 0x000c */

struct PO_MEMORY_IMAGE
{
  /* 0x0000 */ unsigned long Signature;
  /* 0x0004 */ unsigned long ImageType;
  /* 0x0008 */ unsigned long CheckSum;
  /* 0x000c */ unsigned long LengthSelf;
  /* 0x0010 */ unsigned long PageSelf;
  /* 0x0014 */ unsigned long PageSize;
  /* 0x0018 */ union _LARGE_INTEGER SystemTime;
  /* 0x0020 */ unsigned __int64 InterruptTime;
  /* 0x0028 */ unsigned long FeatureFlags;
  /* 0x002c */ unsigned char HiberFlags;
  /* 0x002d */ unsigned char spare[3];
  /* 0x0030 */ unsigned long NoHiberPtes;
  /* 0x0034 */ unsigned long HiberVa;
  /* 0x0038 */ union _LARGE_INTEGER HiberPte;
  /* 0x0040 */ unsigned long NoFreePages;
  /* 0x0044 */ unsigned long FreeMapCheck;
  /* 0x0048 */ unsigned long WakeCheck;
  /* 0x004c */ unsigned long TotalPages;
  /* 0x0050 */ unsigned long FirstTablePage;
  /* 0x0054 */ unsigned long LastFilePage;
  /* 0x0058 */ struct _PO_HIBER_PERF PerfInfo;
  /* 0x00b8 */ unsigned long FirmwareRuntimeInformationPages;
  /* 0x00bc */ unsigned long FirmwareRuntimeInformation[1];
  /* 0x00c0 */ unsigned long NoBootLoaderLogPages;
  /* 0x00c4 */ unsigned long BootLoaderLogPages[8];
  /* 0x00e4 */ unsigned long NotUsed;
  /* 0x00e8 */ unsigned long ResumeContextCheck;
  /* 0x00ec */ unsigned long ResumeContextPages;
}; /* size: 0x00f0 */

struct PPM_IDLE_ACCOUNTING
{
  /* 0x0000 */ unsigned long StateCount;
  /* 0x0004 */ unsigned long TotalTransitions;
  /* 0x0008 */ unsigned long ResetCount;
  /* 0x0010 */ unsigned __int64 StartTime;
  /* 0x0018 */ struct PPM_IDLE_STATE_ACCOUNTING State[1];
}; /* size: 0x0048 */

struct PPM_IDLE_STATE_ACCOUNTING
{
  /* 0x0000 */ unsigned long IdleTransitions;
  /* 0x0004 */ unsigned long FailedTransitions;
  /* 0x0008 */ unsigned long InvalidBucketIndex;
  /* 0x0010 */ unsigned __int64 TotalTime;
  /* 0x0018 */ unsigned long IdleTimeBuckets[6];
}; /* size: 0x0030 */

struct PROCESSOR_IDLESTATE_INFO
{
  /* 0x0000 */ unsigned long TimeCheck;
  /* 0x0004 */ unsigned char DemotePercent;
  /* 0x0005 */ unsigned char PromotePercent;
  /* 0x0006 */ unsigned char Spare[2];
}; /* size: 0x0008 */

struct PROCESSOR_IDLESTATE_POLICY
{
  /* 0x0000 */ unsigned short Revision;
  union
  {
    union
    {
      /* 0x0002 */ unsigned short AsUSHORT;
      struct /* bitfield */
      {
        /* 0x0002 */ unsigned short AllowScaling : 1; /* bit position: 0 */
        /* 0x0002 */ unsigned short Disabled : 1; /* bit position: 1 */
        /* 0x0002 */ unsigned short Reserved : 14; /* bit position: 2 */
      }; /* bitfield */
    }; /* size: 0x0002 */
  } /* size: 0x0002 */ Flags;
  /* 0x0004 */ unsigned long PolicyCount;
  /* 0x0008 */ struct PROCESSOR_IDLESTATE_INFO Policy[3];
}; /* size: 0x0020 */

struct PROCESSOR_PERFSTATE_POLICY
{
  /* 0x0000 */ unsigned long Revision;
  /* 0x0004 */ unsigned char MaxThrottle;
  /* 0x0005 */ unsigned char MinThrottle;
  /* 0x0006 */ unsigned char BusyAdjThreshold;
  union
  {
    /* 0x0007 */ unsigned char Spare;
    union
    {
      union
      {
        /* 0x0007 */ unsigned char AsUCHAR;
        struct /* bitfield */
        {
          /* 0x0007 */ unsigned char NoDomainAccounting : 1; /* bit position: 0 */
          /* 0x0007 */ unsigned char IncreasePolicy : 2; /* bit position: 1 */
          /* 0x0007 */ unsigned char DecreasePolicy : 2; /* bit position: 3 */
          /* 0x0007 */ unsigned char Reserved : 3; /* bit position: 5 */
        }; /* bitfield */
      }; /* size: 0x0001 */
    } /* size: 0x0001 */ Flags;
  }; /* size: 0x0001 */
  /* 0x0008 */ unsigned long TimeCheck;
  /* 0x000c */ unsigned long IncreaseTime;
  /* 0x0010 */ unsigned long DecreaseTime;
  /* 0x0014 */ unsigned long IncreasePercent;
  /* 0x0018 */ unsigned long DecreasePercent;
}; /* size: 0x001c */

enum PROFILE_STATUS
{
  DOCK_NOTDOCKDEVICE = 0,
  DOCK_QUIESCENT = 1,
  DOCK_ARRIVING = 2,
  DOCK_DEPARTING = 3,
  DOCK_EJECTIRP_COMPLETED = 4,
};

enum ReplacesCorHdrNumericDefines
{
  COMIMAGE_FLAGS_ILONLY = 1,
  COMIMAGE_FLAGS_32BITREQUIRED = 2,
  COMIMAGE_FLAGS_IL_LIBRARY = 4,
  COMIMAGE_FLAGS_STRONGNAMESIGNED = 8,
  COMIMAGE_FLAGS_NATIVE_ENTRYPOINT = 16,
  COMIMAGE_FLAGS_TRACKDEBUGDATA = 0x10000,
  COR_VERSION_MAJOR_V2 = 2,
  COR_VERSION_MAJOR = 2,
  COR_VERSION_MINOR = 0,
  COR_DELETED_NAME_LENGTH = 8,
  COR_VTABLEGAP_NAME_LENGTH = 8,
  NATIVE_TYPE_MAX_CB = 1,
  COR_ILMETHOD_SECT_SMALL_MAX_DATASIZE = 255,
  IMAGE_COR_MIH_METHODRVA = 1,
  IMAGE_COR_MIH_EHRVA = 2,
  IMAGE_COR_MIH_BASICBLOCK = 8,
  COR_VTABLE_32BIT = 1,
  COR_VTABLE_64BIT = 2,
  COR_VTABLE_FROM_UNMANAGED = 4,
  COR_VTABLE_FROM_UNMANAGED_RETAIN_APPDOMAIN = 8,
  COR_VTABLE_CALL_MOST_DERIVED = 16,
  IMAGE_COR_EATJ_THUNK_SIZE = 32,
  MAX_CLASS_NAME = 1024,
  MAX_PACKAGE_NAME = 1024,
};

struct SYSTEM_POWER_CAPABILITIES
{
  /* 0x0000 */ unsigned char PowerButtonPresent;
  /* 0x0001 */ unsigned char SleepButtonPresent;
  /* 0x0002 */ unsigned char LidPresent;
  /* 0x0003 */ unsigned char SystemS1;
  /* 0x0004 */ unsigned char SystemS2;
  /* 0x0005 */ unsigned char SystemS3;
  /* 0x0006 */ unsigned char SystemS4;
  /* 0x0007 */ unsigned char SystemS5;
  /* 0x0008 */ unsigned char HiberFilePresent;
  /* 0x0009 */ unsigned char FullWake;
  /* 0x000a */ unsigned char VideoDimPresent;
  /* 0x000b */ unsigned char ApmPresent;
  /* 0x000c */ unsigned char UpsPresent;
  /* 0x000d */ unsigned char ThermalControl;
  /* 0x000e */ unsigned char ProcessorThrottle;
  /* 0x000f */ unsigned char ProcessorMinThrottle;
  /* 0x0010 */ unsigned char ProcessorMaxThrottle;
  /* 0x0011 */ unsigned char FastSystemS4;
  /* 0x0012 */ unsigned char spare2[3];
  /* 0x0015 */ unsigned char DiskSpinDown;
  /* 0x0016 */ unsigned char spare3[8];
  /* 0x001e */ unsigned char SystemBatteriesPresent;
  /* 0x001f */ unsigned char BatteriesAreShortTerm;
  /* 0x0020 */ struct BATTERY_REPORTING_SCALE BatteryScale[3];
  /* 0x0038 */ enum _SYSTEM_POWER_STATE AcOnLineWake;
  /* 0x003c */ enum _SYSTEM_POWER_STATE SoftLidWake;
  /* 0x0040 */ enum _SYSTEM_POWER_STATE RtcWake;
  /* 0x0044 */ enum _SYSTEM_POWER_STATE MinDeviceWakeState;
  /* 0x0048 */ enum _SYSTEM_POWER_STATE DefaultLowLatencyWake;
}; /* size: 0x004c */

enum SYSTEM_POWER_CONDITION
{
  PoAc = 0,
  PoDc = 1,
  PoHot = 2,
  PoConditionMaximum = 3,
};

struct SYSTEM_POWER_LEVEL
{
  /* 0x0000 */ unsigned char Enable;
  /* 0x0001 */ unsigned char Spare[3];
  /* 0x0004 */ unsigned long BatteryLevel;
  /* 0x0008 */ struct POWER_ACTION_POLICY PowerPolicy;
  /* 0x0014 */ enum _SYSTEM_POWER_STATE MinSystemState;
}; /* size: 0x0018 */

enum UoWActionType
{
  UoWAddThisKey = 0,
  UoWAddChildKey = 1,
  UoWDeleteThisKey = 2,
  UoWDeleteChildKey = 3,
  UoWSetValueNew = 4,
  UoWSetValueExisting = 5,
  UoWDeleteValue = 6,
  UoWSetKeyUserFlags = 7,
  UoWSetLastWriteTime = 8,
  UoWSetSecurityDescriptor = 9,
  UoWRenameSubKey = 10,
  UoWRenameOldSubKey = 11,
  UoWRenameNewSubKey = 12,
  UoWIsolation = 13,
  UoWInvalid = 14,
};

enum WHEA_PCIEXPRESS_DEVICE_TYPE
{
  WheaPciExpressEndpoint = 0,
  WheaPciExpressLegacyEndpoint = 1,
  WheaPciExpressRootPort = 4,
  WheaPciExpressUpstreamSwitchPort = 5,
  WheaPciExpressDownstreamSwitchPort = 6,
  WheaPciExpressToPciXBridge = 7,
  WheaPciXToExpressBridge = 8,
  WheaPciExpressRootComplexIntegratedEndpoint = 9,
  WheaPciExpressRootComplexEventCollector = 10,
};

struct WHEA_PCIXDEVICE_REGISTER_PAIR
{
  /* 0x0000 */ unsigned __int64 Register;
  /* 0x0008 */ unsigned __int64 Data;
}; /* size: 0x0010 */

typedef struct _ACCESS_STATE
{
  /* 0x0000 */ struct _LUID OperationID;
  /* 0x0008 */ unsigned char SecurityEvaluated;
  /* 0x0009 */ unsigned char GenerateAudit;
  /* 0x000a */ unsigned char GenerateOnClose;
  /* 0x000b */ unsigned char PrivilegesAllocated;
  /* 0x000c */ unsigned long Flags;
  /* 0x0010 */ unsigned long RemainingDesiredAccess;
  /* 0x0014 */ unsigned long PreviouslyGrantedAccess;
  /* 0x0018 */ unsigned long OriginalDesiredAccess;
  /* 0x001c */ struct _SECURITY_SUBJECT_CONTEXT SubjectSecurityContext;
  /* 0x002c */ void* SecurityDescriptor;
  /* 0x0030 */ void* AuxData;
  union
  {
    union
    {
      /* 0x0034 */ struct _INITIAL_PRIVILEGE_SET InitialPrivilegeSet;
      /* 0x0034 */ struct _PRIVILEGE_SET PrivilegeSet;
    }; /* size: 0x002c */
  } /* size: 0x002c */ Privileges;
  /* 0x0060 */ unsigned char AuditPrivileges;
  /* 0x0064 */ struct _UNICODE_STRING ObjectName;
  /* 0x006c */ struct _UNICODE_STRING ObjectTypeName;
} ACCESS_STATE, *PACCESS_STATE; /* size: 0x0074 */

typedef struct _ACL
{
  /* 0x0000 */ unsigned char AclRevision;
  /* 0x0001 */ unsigned char Sbz1;
  /* 0x0002 */ unsigned short AclSize;
  /* 0x0004 */ unsigned short AceCount;
  /* 0x0006 */ unsigned short Sbz2;
} ACL, *PACL; /* size: 0x0008 */

struct _ACTIVATION_CONTEXT;

struct _ACTIVATION_CONTEXT_DATA;

typedef struct _ACTIVATION_CONTEXT_STACK
{
  /* 0x0000 */ struct _RTL_ACTIVATION_CONTEXT_STACK_FRAME* ActiveFrame;
  /* 0x0004 */ struct _LIST_ENTRY FrameListCache;
  /* 0x000c */ unsigned long Flags;
  /* 0x0010 */ unsigned long NextCookieSequenceNumber;
  /* 0x0014 */ unsigned long StackId;
} ACTIVATION_CONTEXT_STACK, *PACTIVATION_CONTEXT_STACK; /* size: 0x0018 */

struct _ADAPTER_OBJECT;

typedef struct _ALPC_COMMUNICATION_INFO
{
  /* 0x0000 */ struct _ALPC_PORT* ConnectionPort;
  /* 0x0004 */ struct _ALPC_PORT* ServerCommunicationPort;
  /* 0x0008 */ struct _ALPC_PORT* ClientCommunicationPort;
  /* 0x000c */ struct _LIST_ENTRY CommunicationList;
  /* 0x0014 */ struct _ALPC_HANDLE_TABLE HandleTable;
} ALPC_COMMUNICATION_INFO, *PALPC_COMMUNICATION_INFO; /* size: 0x0024 */

typedef struct _ALPC_COMPLETION_LIST
{
  /* 0x0000 */ struct _LIST_ENTRY Entry;
  /* 0x0008 */ struct _EPROCESS* OwnerProcess;
  /* 0x000c */ struct _MDL* Mdl;
  /* 0x0010 */ void* UserVa;
  /* 0x0014 */ void* UserLimit;
  /* 0x0018 */ void* DataUserVa;
  /* 0x001c */ void* SystemVa;
  /* 0x0020 */ unsigned long TotalSize;
  /* 0x0024 */ struct _ALPC_COMPLETION_LIST_HEADER* Header;
  /* 0x0028 */ void* List;
  /* 0x002c */ unsigned long ListSize;
  /* 0x0030 */ void* Bitmap;
  /* 0x0034 */ unsigned long BitmapSize;
  /* 0x0038 */ void* Data;
  /* 0x003c */ unsigned long DataSize;
  /* 0x0040 */ unsigned long BitmapLimit;
  /* 0x0044 */ unsigned long BitmapNextHint;
  /* 0x0048 */ unsigned long ConcurrencyCount;
  /* 0x004c */ unsigned long AttributeFlags;
  /* 0x0050 */ unsigned long AttributeSize;
} ALPC_COMPLETION_LIST, *PALPC_COMPLETION_LIST; /* size: 0x0054 */

typedef struct _ALPC_COMPLETION_LIST_HEADER
{
  /* 0x0000 */ unsigned __int64 StartMagic;
  /* 0x0008 */ unsigned long TotalSize;
  /* 0x000c */ unsigned long ListOffset;
  /* 0x0010 */ unsigned long ListSize;
  /* 0x0014 */ unsigned long BitmapOffset;
  /* 0x0018 */ unsigned long BitmapSize;
  /* 0x001c */ unsigned long DataOffset;
  /* 0x0020 */ unsigned long DataSize;
  /* 0x0024 */ unsigned long AttributeFlags;
  /* 0x0028 */ unsigned long AttributeSize;
  /* 0x0080 */ struct _ALPC_COMPLETION_LIST_STATE State;
  /* 0x0088 */ volatile unsigned long LastMessageId;
  /* 0x008c */ volatile unsigned long LastCallbackId;
  /* 0x0100 */ volatile unsigned long PostCount;
  /* 0x0180 */ volatile unsigned long ReturnCount;
  /* 0x0200 */ volatile unsigned long LogSequenceNumber;
  /* 0x0280 */ struct _RTL_SRWLOCK UserLock;
  /* 0x0288 */ unsigned __int64 EndMagic;
  /* 0x0290 */ long __PADDING__[28];
} ALPC_COMPLETION_LIST_HEADER, *PALPC_COMPLETION_LIST_HEADER; /* size: 0x0300 */

typedef struct _ALPC_COMPLETION_LIST_STATE
{
  union
  {
    union
    {
      struct
      {
        struct /* bitfield */
        {
          /* 0x0000 */ volatile unsigned __int64 Head : 24; /* bit position: 0 */
          /* 0x0000 */ volatile unsigned __int64 Tail : 24; /* bit position: 24 */
          /* 0x0000 */ volatile unsigned __int64 ActiveThreadCount : 16; /* bit position: 48 */
        }; /* bitfield */
      } /* size: 0x0008 */ s1;
      /* 0x0000 */ volatile unsigned __int64 Value;
    }; /* size: 0x0008 */
  } /* size: 0x0008 */ u1;
} ALPC_COMPLETION_LIST_STATE, *PALPC_COMPLETION_LIST_STATE; /* size: 0x0008 */

typedef struct _ALPC_COMPLETION_PACKET_LOOKASIDE
{
  /* 0x0000 */ unsigned long Lock;
  /* 0x0004 */ unsigned long Size;
  /* 0x0008 */ unsigned long ActiveCount;
  /* 0x000c */ unsigned long PendingNullCount;
  /* 0x0010 */ unsigned long PendingCheckCompletionListCount;
  /* 0x0014 */ unsigned long PendingDelete;
  /* 0x0018 */ struct _SINGLE_LIST_ENTRY FreeListHead;
  /* 0x001c */ void* CompletionPort;
  /* 0x0020 */ void* CompletionKey;
  /* 0x0024 */ struct _ALPC_COMPLETION_PACKET_LOOKASIDE_ENTRY* Entry /* zero-length array */;
} ALPC_COMPLETION_PACKET_LOOKASIDE, *PALPC_COMPLETION_PACKET_LOOKASIDE; /* size: 0x0024 */

typedef struct _ALPC_COMPLETION_PACKET_LOOKASIDE_ENTRY
{
  /* 0x0000 */ struct _SINGLE_LIST_ENTRY ListEntry;
  /* 0x0004 */ void* Packet;
  /* 0x0008 */ struct _ALPC_COMPLETION_PACKET_LOOKASIDE* Lookaside;
} ALPC_COMPLETION_PACKET_LOOKASIDE_ENTRY, *PALPC_COMPLETION_PACKET_LOOKASIDE_ENTRY; /* size: 0x000c */

typedef struct _ALPC_DISPATCH_CONTEXT
{
  /* 0x0000 */ struct _ALPC_PORT* PortObject;
  /* 0x0004 */ struct _KALPC_MESSAGE* Message;
  /* 0x0008 */ struct _ALPC_COMMUNICATION_INFO* CommunicationInfo;
  /* 0x000c */ unsigned long Flags;
  /* 0x0010 */ struct _ETHREAD* TargetThread;
  /* 0x0014 */ struct _ALPC_PORT* TargetPort;
  /* 0x0018 */ unsigned short TotalLength;
  /* 0x001a */ unsigned short Type;
  /* 0x001c */ unsigned short DataInfoOffset;
  /* 0x001e */ char __PADDING__[2];
} ALPC_DISPATCH_CONTEXT, *PALPC_DISPATCH_CONTEXT; /* size: 0x0020 */

typedef struct _ALPC_HANDLE_ENTRY
{
  /* 0x0000 */ void* Object;
} ALPC_HANDLE_ENTRY, *PALPC_HANDLE_ENTRY; /* size: 0x0004 */

typedef struct _ALPC_HANDLE_TABLE
{
  /* 0x0000 */ unsigned long Flags;
  /* 0x0004 */ struct _ALPC_HANDLE_ENTRY* Handles;
  /* 0x0008 */ unsigned long TotalHandles;
  /* 0x000c */ struct _EX_PUSH_LOCK Lock;
} ALPC_HANDLE_TABLE, *PALPC_HANDLE_TABLE; /* size: 0x0010 */

typedef struct _ALPC_MESSAGE_ATTRIBUTES
{
  /* 0x0000 */ unsigned long AllocatedAttributes;
  /* 0x0004 */ unsigned long ValidAttributes;
} ALPC_MESSAGE_ATTRIBUTES, *PALPC_MESSAGE_ATTRIBUTES; /* size: 0x0008 */

typedef struct _ALPC_MESSAGE_ZONE
{
  /* 0x0000 */ struct _MDL* Mdl;
  /* 0x0004 */ void* UserVa;
  /* 0x0008 */ void* UserLimit;
  /* 0x000c */ void* SystemVa;
  /* 0x0010 */ void* SystemLimit;
  /* 0x0014 */ unsigned long Size;
} ALPC_MESSAGE_ZONE, *PALPC_MESSAGE_ZONE; /* size: 0x0018 */

typedef struct _ALPC_PORT
{
  /* 0x0000 */ struct _LIST_ENTRY PortListEntry;
  /* 0x0008 */ struct _ALPC_COMMUNICATION_INFO* CommunicationInfo;
  /* 0x000c */ struct _EPROCESS* OwnerProcess;
  /* 0x0010 */ unsigned long SequenceNo;
  /* 0x0014 */ void* CompletionPort;
  /* 0x0018 */ void* CompletionKey;
  /* 0x001c */ struct _ALPC_COMPLETION_PACKET_LOOKASIDE* CompletionPacketLookaside;
  /* 0x0020 */ void* PortContext;
  /* 0x0024 */ struct _SECURITY_CLIENT_CONTEXT StaticSecurity;
  /* 0x0060 */ struct _LIST_ENTRY MainQueue;
  /* 0x0068 */ struct _LIST_ENTRY PendingQueue;
  /* 0x0070 */ struct _LIST_ENTRY LargeMessageQueue;
  /* 0x0078 */ struct _LIST_ENTRY WaitQueue;
  union
  {
    /* 0x0080 */ struct _KSEMAPHORE* Semaphore;
    /* 0x0080 */ struct _KEVENT* DummyEvent;
  }; /* size: 0x0004 */
  /* 0x0084 */ struct _EX_PUSH_LOCK Lock;
  /* 0x0088 */ struct _ALPC_PORT_ATTRIBUTES PortAttributes;
  /* 0x00b4 */ struct _EX_PUSH_LOCK ResourceListLock;
  /* 0x00b8 */ struct _LIST_ENTRY ResourceListHead;
  /* 0x00c0 */ struct _ALPC_COMPLETION_LIST* CompletionList;
  /* 0x00c4 */ struct _ALPC_MESSAGE_ZONE* MessageZone;
  /* 0x00c8 */ struct _LIST_ENTRY CanceledQueue;
  union
  {
    union
    {
      struct
      {
        struct /* bitfield */
        {
          /* 0x00d0 */ unsigned long Initialized : 1; /* bit position: 0 */
          /* 0x00d0 */ unsigned long Type : 2; /* bit position: 1 */
          /* 0x00d0 */ unsigned long ConnectionPending : 1; /* bit position: 3 */
          /* 0x00d0 */ unsigned long ConnectionRefused : 1; /* bit position: 4 */
          /* 0x00d0 */ unsigned long Disconnected : 1; /* bit position: 5 */
          /* 0x00d0 */ unsigned long Closed : 1; /* bit position: 6 */
          /* 0x00d0 */ unsigned long NoFlushOnClose : 1; /* bit position: 7 */
          /* 0x00d0 */ unsigned long ReturnExtendedInfo : 1; /* bit position: 8 */
          /* 0x00d0 */ unsigned long Waitable : 1; /* bit position: 9 */
          /* 0x00d0 */ unsigned long DynamicSecurity : 1; /* bit position: 10 */
          /* 0x00d0 */ unsigned long Wow64CompletionList : 1; /* bit position: 11 */
          /* 0x00d0 */ unsigned long Lpc : 1; /* bit position: 12 */
          /* 0x00d0 */ unsigned long LpcToLpc : 1; /* bit position: 13 */
          /* 0x00d0 */ unsigned long HasCompletionList : 1; /* bit position: 14 */
          /* 0x00d0 */ unsigned long HadCompletionList : 1; /* bit position: 15 */
        }; /* bitfield */
      } /* size: 0x0004 */ s1;
      /* 0x00d0 */ unsigned long State;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ u1;
  /* 0x00d4 */ struct _ALPC_PORT* TargetQueuePort;
  /* 0x00d8 */ struct _ALPC_PORT* TargetSequencePort;
  /* 0x00dc */ struct _KALPC_MESSAGE* Message;
  /* 0x00e0 */ unsigned long MainQueueLength;
  /* 0x00e4 */ unsigned long PendingQueueLength;
  /* 0x00e8 */ unsigned long LargeMessageQueueLength;
  /* 0x00ec */ unsigned long CanceledQueueLength;
  /* 0x00f0 */ unsigned long WaitQueueLength;
} ALPC_PORT, *PALPC_PORT; /* size: 0x00f4 */

typedef struct _ALPC_PORT_ATTRIBUTES
{
  /* 0x0000 */ unsigned long Flags;
  /* 0x0004 */ struct _SECURITY_QUALITY_OF_SERVICE SecurityQos;
  /* 0x0010 */ unsigned long MaxMessageLength;
  /* 0x0014 */ unsigned long MemoryBandwidth;
  /* 0x0018 */ unsigned long MaxPoolUsage;
  /* 0x001c */ unsigned long MaxSectionSize;
  /* 0x0020 */ unsigned long MaxViewSize;
  /* 0x0024 */ unsigned long MaxTotalSectionSize;
  /* 0x0028 */ unsigned long DupObjectTypes;
} ALPC_PORT_ATTRIBUTES, *PALPC_PORT_ATTRIBUTES; /* size: 0x002c */

typedef struct _ALPC_PROCESS_CONTEXT
{
  /* 0x0000 */ struct _EX_PUSH_LOCK Lock;
  /* 0x0004 */ struct _LIST_ENTRY ViewListHead;
  /* 0x000c */ volatile unsigned long PagedPoolQuotaCache;
} ALPC_PROCESS_CONTEXT, *PALPC_PROCESS_CONTEXT; /* size: 0x0010 */

typedef struct _ALPHA_LOADER_BLOCK
{
  /* 0x0000 */ unsigned long PlaceHolder;
} ALPHA_LOADER_BLOCK, *PALPHA_LOADER_BLOCK; /* size: 0x0004 */

typedef enum _ALTERNATIVE_ARCHITECTURE_TYPE
{
  StandardDesign = 0,
  NEC98x86 = 1,
  EndAlternatives = 2,
} ALTERNATIVE_ARCHITECTURE_TYPE, *PALTERNATIVE_ARCHITECTURE_TYPE;

typedef struct _AMD64_DBGKD_CONTROL_SET
{
  /* 0x0000 */ unsigned long TraceFlag;
  /* 0x0004 */ unsigned __int64 Dr7;
  /* 0x000c */ unsigned __int64 CurrentSymbolStart;
  /* 0x0014 */ unsigned __int64 CurrentSymbolEnd;
} AMD64_DBGKD_CONTROL_SET, *PAMD64_DBGKD_CONTROL_SET; /* size: 0x001c */

typedef enum _ARBITER_ACTION
{
  ArbiterActionTestAllocation = 0,
  ArbiterActionRetestAllocation = 1,
  ArbiterActionCommitAllocation = 2,
  ArbiterActionRollbackAllocation = 3,
  ArbiterActionQueryAllocatedResources = 4,
  ArbiterActionWriteReservedResources = 5,
  ArbiterActionQueryConflict = 6,
  ArbiterActionQueryArbitrate = 7,
  ArbiterActionAddReserved = 8,
  ArbiterActionBootAllocation = 9,
} ARBITER_ACTION, *PARBITER_ACTION;

typedef struct _ARBITER_ADD_RESERVED_PARAMETERS
{
  /* 0x0000 */ struct _DEVICE_OBJECT* ReserveDevice;
} ARBITER_ADD_RESERVED_PARAMETERS, *PARBITER_ADD_RESERVED_PARAMETERS; /* size: 0x0004 */

typedef struct _ARBITER_ALLOCATION_STATE
{
  /* 0x0000 */ unsigned __int64 Start;
  /* 0x0008 */ unsigned __int64 End;
  /* 0x0010 */ unsigned __int64 CurrentMinimum;
  /* 0x0018 */ unsigned __int64 CurrentMaximum;
  /* 0x0020 */ struct _ARBITER_LIST_ENTRY* Entry;
  /* 0x0024 */ struct _ARBITER_ALTERNATIVE* CurrentAlternative;
  /* 0x0028 */ unsigned long AlternativeCount;
  /* 0x002c */ struct _ARBITER_ALTERNATIVE* Alternatives;
  /* 0x0030 */ unsigned short Flags;
  /* 0x0032 */ unsigned char RangeAttributes;
  /* 0x0033 */ unsigned char RangeAvailableAttributes;
  /* 0x0034 */ unsigned long WorkSpace;
} ARBITER_ALLOCATION_STATE, *PARBITER_ALLOCATION_STATE; /* size: 0x0038 */

typedef struct _ARBITER_ALTERNATIVE
{
  /* 0x0000 */ unsigned __int64 Minimum;
  /* 0x0008 */ unsigned __int64 Maximum;
  /* 0x0010 */ unsigned __int64 Length;
  /* 0x0018 */ unsigned __int64 Alignment;
  /* 0x0020 */ long Priority;
  /* 0x0024 */ unsigned long Flags;
  /* 0x0028 */ struct _IO_RESOURCE_DESCRIPTOR* Descriptor;
  /* 0x002c */ unsigned long Reserved[3];
} ARBITER_ALTERNATIVE, *PARBITER_ALTERNATIVE; /* size: 0x0038 */

typedef struct _ARBITER_BOOT_ALLOCATION_PARAMETERS
{
  /* 0x0000 */ struct _LIST_ENTRY* ArbitrationList;
} ARBITER_BOOT_ALLOCATION_PARAMETERS, *PARBITER_BOOT_ALLOCATION_PARAMETERS; /* size: 0x0004 */

typedef struct _ARBITER_CONFLICT_INFO
{
  /* 0x0000 */ struct _DEVICE_OBJECT* OwningObject;
  /* 0x0008 */ unsigned __int64 Start;
  /* 0x0010 */ unsigned __int64 End;
} ARBITER_CONFLICT_INFO, *PARBITER_CONFLICT_INFO; /* size: 0x0018 */

typedef struct _ARBITER_INSTANCE
{
  /* 0x0000 */ unsigned long Signature;
  /* 0x0004 */ struct _KEVENT* MutexEvent;
  /* 0x0008 */ unsigned short* Name;
  /* 0x000c */ unsigned short* OrderingName;
  /* 0x0010 */ int ResourceType;
  /* 0x0014 */ struct _RTL_RANGE_LIST* Allocation;
  /* 0x0018 */ struct _RTL_RANGE_LIST* PossibleAllocation;
  /* 0x001c */ struct _ARBITER_ORDERING_LIST OrderingList;
  /* 0x0024 */ struct _ARBITER_ORDERING_LIST ReservedList;
  /* 0x002c */ long ReferenceCount;
  /* 0x0030 */ struct _ARBITER_INTERFACE* Interface;
  /* 0x0034 */ unsigned long AllocationStackMaxSize;
  /* 0x0038 */ struct _ARBITER_ALLOCATION_STATE* AllocationStack;
  /* 0x003c */ void* UnpackRequirement /* function */;
  /* 0x0040 */ void* PackResource /* function */;
  /* 0x0044 */ void* UnpackResource /* function */;
  /* 0x0048 */ void* ScoreRequirement /* function */;
  /* 0x004c */ void* TestAllocation /* function */;
  /* 0x0050 */ void* RetestAllocation /* function */;
  /* 0x0054 */ void* CommitAllocation /* function */;
  /* 0x0058 */ void* RollbackAllocation /* function */;
  /* 0x005c */ void* BootAllocation /* function */;
  /* 0x0060 */ void* QueryArbitrate /* function */;
  /* 0x0064 */ void* QueryConflict /* function */;
  /* 0x0068 */ void* AddReserved /* function */;
  /* 0x006c */ void* StartArbiter /* function */;
  /* 0x0070 */ void* PreprocessEntry /* function */;
  /* 0x0074 */ void* AllocateEntry /* function */;
  /* 0x0078 */ void* GetNextAllocationRange /* function */;
  /* 0x007c */ void* FindSuitableRange /* function */;
  /* 0x0080 */ void* AddAllocation /* function */;
  /* 0x0084 */ void* BacktrackAllocation /* function */;
  /* 0x0088 */ void* OverrideConflict /* function */;
  /* 0x008c */ void* InitializeRangeList /* function */;
  /* 0x0090 */ unsigned char TransactionInProgress;
  /* 0x0094 */ struct _KEVENT* TransactionEvent;
  /* 0x0098 */ void* Extension;
  /* 0x009c */ struct _DEVICE_OBJECT* BusDeviceObject;
  /* 0x00a0 */ void* ConflictCallbackContext;
  /* 0x00a4 */ void* ConflictCallback /* function */;
  /* 0x00a8 */ wchar_t PdoDescriptionString[336];
  /* 0x0348 */ char PdoSymbolicNameString[672];
  /* 0x05e8 */ wchar_t PdoAddressString[1];
  /* 0x05ea */ char __PADDING__[2];
} ARBITER_INSTANCE, *PARBITER_INSTANCE; /* size: 0x05ec */

typedef struct _ARBITER_INTERFACE
{
  /* 0x0000 */ unsigned short Size;
  /* 0x0002 */ unsigned short Version;
  /* 0x0004 */ void* Context;
  /* 0x0008 */ void* InterfaceReference /* function */;
  /* 0x000c */ void* InterfaceDereference /* function */;
  /* 0x0010 */ void* ArbiterHandler /* function */;
  /* 0x0014 */ unsigned long Flags;
} ARBITER_INTERFACE, *PARBITER_INTERFACE; /* size: 0x0018 */

typedef struct _ARBITER_LIST_ENTRY
{
  /* 0x0000 */ struct _LIST_ENTRY ListEntry;
  /* 0x0008 */ unsigned long AlternativeCount;
  /* 0x000c */ struct _IO_RESOURCE_DESCRIPTOR* Alternatives;
  /* 0x0010 */ struct _DEVICE_OBJECT* PhysicalDeviceObject;
  /* 0x0014 */ enum _ARBITER_REQUEST_SOURCE RequestSource;
  /* 0x0018 */ unsigned long Flags;
  /* 0x001c */ long WorkSpace;
  /* 0x0020 */ enum _INTERFACE_TYPE InterfaceType;
  /* 0x0024 */ unsigned long SlotNumber;
  /* 0x0028 */ unsigned long BusNumber;
  /* 0x002c */ struct _CM_PARTIAL_RESOURCE_DESCRIPTOR* Assignment;
  /* 0x0030 */ struct _IO_RESOURCE_DESCRIPTOR* SelectedAlternative;
  /* 0x0034 */ enum _ARBITER_RESULT Result;
} ARBITER_LIST_ENTRY, *PARBITER_LIST_ENTRY; /* size: 0x0038 */

typedef struct _ARBITER_ORDERING
{
  /* 0x0000 */ unsigned __int64 Start;
  /* 0x0008 */ unsigned __int64 End;
} ARBITER_ORDERING, *PARBITER_ORDERING; /* size: 0x0010 */

typedef struct _ARBITER_ORDERING_LIST
{
  /* 0x0000 */ unsigned short Count;
  /* 0x0002 */ unsigned short Maximum;
  /* 0x0004 */ struct _ARBITER_ORDERING* Orderings;
} ARBITER_ORDERING_LIST, *PARBITER_ORDERING_LIST; /* size: 0x0008 */

typedef struct _ARBITER_PARAMETERS
{
  union
  {
    union
    {
      /* 0x0000 */ struct _ARBITER_TEST_ALLOCATION_PARAMETERS TestAllocation;
      /* 0x0000 */ struct _ARBITER_RETEST_ALLOCATION_PARAMETERS RetestAllocation;
      /* 0x0000 */ struct _ARBITER_BOOT_ALLOCATION_PARAMETERS BootAllocation;
      /* 0x0000 */ struct _ARBITER_QUERY_ALLOCATED_RESOURCES_PARAMETERS QueryAllocatedResources;
      /* 0x0000 */ struct _ARBITER_QUERY_CONFLICT_PARAMETERS QueryConflict;
      /* 0x0000 */ struct _ARBITER_QUERY_ARBITRATE_PARAMETERS QueryArbitrate;
      /* 0x0000 */ struct _ARBITER_ADD_RESERVED_PARAMETERS AddReserved;
    }; /* size: 0x0010 */
  } /* size: 0x0010 */ Parameters;
} ARBITER_PARAMETERS, *PARBITER_PARAMETERS; /* size: 0x0010 */

typedef struct _ARBITER_QUERY_ALLOCATED_RESOURCES_PARAMETERS
{
  /* 0x0000 */ struct _CM_PARTIAL_RESOURCE_LIST** AllocatedResources;
} ARBITER_QUERY_ALLOCATED_RESOURCES_PARAMETERS, *PARBITER_QUERY_ALLOCATED_RESOURCES_PARAMETERS; /* size: 0x0004 */

typedef struct _ARBITER_QUERY_ARBITRATE_PARAMETERS
{
  /* 0x0000 */ struct _LIST_ENTRY* ArbitrationList;
} ARBITER_QUERY_ARBITRATE_PARAMETERS, *PARBITER_QUERY_ARBITRATE_PARAMETERS; /* size: 0x0004 */

typedef struct _ARBITER_QUERY_CONFLICT_PARAMETERS
{
  /* 0x0000 */ struct _DEVICE_OBJECT* PhysicalDeviceObject;
  /* 0x0004 */ struct _IO_RESOURCE_DESCRIPTOR* ConflictingResource;
  /* 0x0008 */ unsigned long* ConflictCount;
  /* 0x000c */ struct _ARBITER_CONFLICT_INFO** Conflicts;
} ARBITER_QUERY_CONFLICT_PARAMETERS, *PARBITER_QUERY_CONFLICT_PARAMETERS; /* size: 0x0010 */

typedef enum _ARBITER_REQUEST_SOURCE
{
  ArbiterRequestUndefined = -1,
  ArbiterRequestLegacyReported = 0,
  ArbiterRequestHalReported = 1,
  ArbiterRequestLegacyAssigned = 2,
  ArbiterRequestPnpDetected = 3,
  ArbiterRequestPnpEnumerated = 4,
} ARBITER_REQUEST_SOURCE, *PARBITER_REQUEST_SOURCE;

typedef enum _ARBITER_RESULT
{
  ArbiterResultUndefined = -1,
  ArbiterResultSuccess = 0,
  ArbiterResultExternalConflict = 1,
  ArbiterResultNullRequest = 2,
} ARBITER_RESULT, *PARBITER_RESULT;

typedef struct _ARBITER_RETEST_ALLOCATION_PARAMETERS
{
  /* 0x0000 */ struct _LIST_ENTRY* ArbitrationList;
  /* 0x0004 */ unsigned long AllocateFromCount;
  /* 0x0008 */ struct _CM_PARTIAL_RESOURCE_DESCRIPTOR* AllocateFrom;
} ARBITER_RETEST_ALLOCATION_PARAMETERS, *PARBITER_RETEST_ALLOCATION_PARAMETERS; /* size: 0x000c */

typedef struct _ARBITER_TEST_ALLOCATION_PARAMETERS
{
  /* 0x0000 */ struct _LIST_ENTRY* ArbitrationList;
  /* 0x0004 */ unsigned long AllocateFromCount;
  /* 0x0008 */ struct _CM_PARTIAL_RESOURCE_DESCRIPTOR* AllocateFrom;
} ARBITER_TEST_ALLOCATION_PARAMETERS, *PARBITER_TEST_ALLOCATION_PARAMETERS; /* size: 0x000c */

typedef struct _ARC_DISK_INFORMATION
{
  /* 0x0000 */ struct _LIST_ENTRY DiskSignatures;
} ARC_DISK_INFORMATION, *PARC_DISK_INFORMATION; /* size: 0x0008 */

typedef struct _ARM_DBGKD_CONTROL_SET
{
  /* 0x0000 */ unsigned long Continue;
  /* 0x0004 */ unsigned long CurrentSymbolStart;
  /* 0x0008 */ unsigned long CurrentSymbolEnd;
} ARM_DBGKD_CONTROL_SET, *PARM_DBGKD_CONTROL_SET; /* size: 0x000c */

struct _ASSEMBLY_STORAGE_MAP;

typedef struct _BITMAP_RANGE
{
  /* 0x0000 */ struct _LIST_ENTRY Links;
  /* 0x0008 */ __int64 BasePage;
  /* 0x0010 */ unsigned long FirstDirtyPage;
  /* 0x0014 */ unsigned long LastDirtyPage;
  /* 0x0018 */ unsigned long DirtyPages;
  /* 0x001c */ unsigned long* Bitmap;
} BITMAP_RANGE, *PBITMAP_RANGE; /* size: 0x0020 */

typedef struct _BLOB
{
  union
  {
    /* 0x0000 */ struct _LIST_ENTRY ResourceList;
    /* 0x0000 */ struct _SINGLE_LIST_ENTRY FreeListEntry;
  }; /* size: 0x0008 */
  union
  {
    union
    {
      struct
      {
        struct /* bitfield */
        {
          /* 0x0008 */ unsigned char ReferenceCache : 1; /* bit position: 0 */
          /* 0x0008 */ unsigned char Lookaside : 1; /* bit position: 1 */
          /* 0x0008 */ unsigned char Initializing : 1; /* bit position: 2 */
          /* 0x0008 */ unsigned char Deleted : 1; /* bit position: 3 */
        }; /* bitfield */
      } /* size: 0x0001 */ s1;
      /* 0x0008 */ unsigned char Flags;
    }; /* size: 0x0001 */
  } /* size: 0x0001 */ u1;
  /* 0x0009 */ unsigned char ResourceId;
  /* 0x000a */ short CachedReferences;
  /* 0x000c */ volatile long ReferenceCount;
  /* 0x0010 */ struct _EX_PUSH_LOCK Lock;
  /* 0x0014 */ unsigned long Pad;
} BLOB, *PBLOB; /* size: 0x0018 */

typedef enum _BLOB_ID
{
  BLOB_TYPE_UNKNOWN = 0,
  BLOB_TYPE_CONNECTION_INFO = 1,
  BLOB_TYPE_MESSAGE = 2,
  BLOB_TYPE_SECURITY_CONTEXT = 3,
  BLOB_TYPE_SECTION = 4,
  BLOB_TYPE_REGION = 5,
  BLOB_TYPE_VIEW = 6,
  BLOB_TYPE_RESERVE = 7,
  BLOB_TYPE_DIRECT_TRANSFER = 8,
  BLOB_TYPE_HANDLE_DATA = 9,
  BLOB_TYPE_MAX_ID = 10,
} BLOB_ID, *PBLOB_ID;

typedef struct _BLOB_TYPE
{
  /* 0x0000 */ enum _BLOB_ID ResourceId;
  /* 0x0004 */ unsigned long PoolTag;
  /* 0x0008 */ unsigned long Flags;
  /* 0x000c */ unsigned long CreatedObjects;
  /* 0x0010 */ unsigned long DeletedObjects;
  /* 0x0014 */ void* DeleteProcedure /* function */;
  /* 0x0018 */ void* DestroyProcedure /* function */;
  /* 0x001c */ unsigned long UsualSize;
  /* 0x0020 */ unsigned long LookasideIndex;
} BLOB_TYPE, *PBLOB_TYPE; /* size: 0x0024 */

typedef struct _BUS_EXTENSION_LIST
{
  /* 0x0000 */ void* Next;
  /* 0x0004 */ struct _PI_BUS_EXTENSION* BusExtension;
} BUS_EXTENSION_LIST, *PBUS_EXTENSION_LIST; /* size: 0x0008 */

typedef struct _CACHED_CHILD_LIST
{
  /* 0x0000 */ unsigned long Count;
  union
  {
    /* 0x0004 */ unsigned long ValueList;
    /* 0x0004 */ struct _CM_KEY_CONTROL_BLOCK* RealKcb;
  }; /* size: 0x0004 */
} CACHED_CHILD_LIST, *PCACHED_CHILD_LIST; /* size: 0x0008 */

typedef struct _CACHED_KSTACK_LIST
{
  /* 0x0000 */ union _SLIST_HEADER SListHead;
  /* 0x0008 */ long MinimumFree;
  /* 0x000c */ unsigned long Misses;
  /* 0x0010 */ unsigned long MissesLast;
  /* 0x0014 */ long __PADDING__[1];
} CACHED_KSTACK_LIST, *PCACHED_KSTACK_LIST; /* size: 0x0018 */

typedef struct _CACHE_DESCRIPTOR
{
  /* 0x0000 */ unsigned char Level;
  /* 0x0001 */ unsigned char Associativity;
  /* 0x0002 */ unsigned short LineSize;
  /* 0x0004 */ unsigned long Size;
  /* 0x0008 */ enum _PROCESSOR_CACHE_TYPE Type;
} CACHE_DESCRIPTOR, *PCACHE_DESCRIPTOR; /* size: 0x000c */

typedef struct _CACHE_MANAGER_CALLBACKS
{
  /* 0x0000 */ void* AcquireForLazyWrite /* function */;
  /* 0x0004 */ void* ReleaseFromLazyWrite /* function */;
  /* 0x0008 */ void* AcquireForReadAhead /* function */;
  /* 0x000c */ void* ReleaseFromReadAhead /* function */;
} CACHE_MANAGER_CALLBACKS, *PCACHE_MANAGER_CALLBACKS; /* size: 0x0010 */

typedef struct _CACHE_UNINITIALIZE_EVENT
{
  /* 0x0000 */ struct _CACHE_UNINITIALIZE_EVENT* Next;
  /* 0x0004 */ struct _KEVENT Event;
} CACHE_UNINITIALIZE_EVENT, *PCACHE_UNINITIALIZE_EVENT; /* size: 0x0014 */

typedef struct _CALL_HASH_ENTRY
{
  /* 0x0000 */ struct _LIST_ENTRY ListEntry;
  /* 0x0008 */ void* CallersAddress;
  /* 0x000c */ void* CallersCaller;
  /* 0x0010 */ unsigned long CallCount;
} CALL_HASH_ENTRY, *PCALL_HASH_ENTRY; /* size: 0x0014 */

typedef struct _CALL_PERFORMANCE_DATA
{
  /* 0x0000 */ unsigned long SpinLock;
  /* 0x0004 */ struct _LIST_ENTRY HashTable[64];
} CALL_PERFORMANCE_DATA, *PCALL_PERFORMANCE_DATA; /* size: 0x0204 */

typedef struct _CELL_DATA
{
  /* 0x0000 */ union _u u;
} CELL_DATA, *PCELL_DATA; /* size: 0x0050 */

typedef struct _CHILD_LIST
{
  /* 0x0000 */ unsigned long Count;
  /* 0x0004 */ unsigned long List;
} CHILD_LIST, *PCHILD_LIST; /* size: 0x0008 */

typedef struct _CLIENT_ID
{
  /* 0x0000 */ void* UniqueProcess;
  /* 0x0004 */ void* UniqueThread;
} CLIENT_ID, *PCLIENT_ID; /* size: 0x0008 */

typedef union _CLS_LSN
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned int idxRecord;
      /* 0x0004 */ unsigned long cidContainer;
    } /* size: 0x0008 */ offset;
    /* 0x0000 */ unsigned __int64 ullOffset;
  }; /* size: 0x0008 */
} CLS_LSN, *PCLS_LSN; /* size: 0x0008 */

typedef struct _CMHIVE
{
  /* 0x0000 */ struct _HHIVE Hive;
  /* 0x02e8 */ void* FileHandles[6];
  /* 0x0300 */ struct _LIST_ENTRY NotifyList;
  /* 0x0308 */ struct _LIST_ENTRY HiveList;
  /* 0x0310 */ struct _FAST_MUTEX* HiveLock;
  /* 0x0314 */ struct _EX_PUSH_LOCK ViewLock;
  /* 0x0318 */ struct _KTHREAD* ViewLockOwner;
  /* 0x031c */ unsigned long ViewLockLast;
  /* 0x0320 */ unsigned long ViewUnLockLast;
  /* 0x0324 */ struct _FAST_MUTEX* WriterLock;
  /* 0x0328 */ struct _EX_PUSH_LOCK FlusherLock;
  /* 0x032c */ struct _EX_PUSH_LOCK SecurityLock;
  /* 0x0330 */ struct _LIST_ENTRY MappedViewList;
  /* 0x0338 */ struct _LIST_ENTRY PinnedViewList;
  /* 0x0340 */ struct _LIST_ENTRY FlushedViewList;
  /* 0x0348 */ unsigned short MappedViewCount;
  /* 0x034a */ unsigned short PinnedViewCount;
  /* 0x034c */ unsigned long UseCount;
  /* 0x0350 */ unsigned long ViewsPerHive;
  /* 0x0354 */ struct _FILE_OBJECT* FileObject;
  /* 0x0358 */ unsigned long LastShrinkHiveSize;
  /* 0x0360 */ union _LARGE_INTEGER ActualFileSize;
  /* 0x0368 */ struct _UNICODE_STRING FileFullPath;
  /* 0x0370 */ struct _UNICODE_STRING FileUserName;
  /* 0x0378 */ struct _UNICODE_STRING HiveRootPath;
  /* 0x0380 */ unsigned long SecurityCount;
  /* 0x0384 */ unsigned long SecurityCacheSize;
  /* 0x0388 */ long SecurityHitHint;
  /* 0x038c */ struct _CM_KEY_SECURITY_CACHE_ENTRY* SecurityCache;
  /* 0x0390 */ struct _LIST_ENTRY SecurityHash[64];
  /* 0x0590 */ unsigned long UnloadEventCount;
  /* 0x0594 */ struct _KEVENT** UnloadEventArray;
  /* 0x0598 */ struct _CM_KEY_CONTROL_BLOCK* RootKcb;
  /* 0x059c */ unsigned char Frozen;
  /* 0x05a0 */ struct _CM_WORKITEM* UnloadWorkItem;
  /* 0x05a4 */ unsigned char GrowOnlyMode;
  /* 0x05a8 */ unsigned long GrowOffset;
  /* 0x05ac */ struct _LIST_ENTRY KcbConvertListHead;
  /* 0x05b4 */ struct _LIST_ENTRY KnodeConvertListHead;
  /* 0x05bc */ struct _CM_CELL_REMAP_BLOCK* CellRemapArray;
  /* 0x05c0 */ unsigned long Flags;
  /* 0x05c4 */ struct _LIST_ENTRY TrustClassEntry;
  /* 0x05cc */ unsigned long FlushCount;
  /* 0x05d0 */ struct _CM_RM* CmRm;
  /* 0x05d4 */ unsigned long CmRmInitFailPoint;
  /* 0x05d8 */ long CmRmInitFailStatus;
  /* 0x05dc */ struct _KTHREAD* CreatorOwner;
} CMHIVE, *PCMHIVE; /* size: 0x05e0 */

typedef struct _CM_BIG_DATA
{
  /* 0x0000 */ unsigned short Signature;
  /* 0x0002 */ unsigned short Count;
  /* 0x0004 */ unsigned long List;
} CM_BIG_DATA, *PCM_BIG_DATA; /* size: 0x0008 */

typedef struct _CM_CACHED_VALUE_INDEX
{
  /* 0x0000 */ unsigned long CellIndex;
  union
  {
    union
    {
      /* 0x0004 */ struct _CELL_DATA CellData;
      /* 0x0004 */ unsigned long List[1];
    }; /* size: 0x0050 */
  } /* size: 0x0050 */ Data;
} CM_CACHED_VALUE_INDEX, *PCM_CACHED_VALUE_INDEX; /* size: 0x0054 */

typedef struct _CM_CELL_REMAP_BLOCK
{
  /* 0x0000 */ unsigned long OldCell;
  /* 0x0004 */ unsigned long NewCell;
} CM_CELL_REMAP_BLOCK, *PCM_CELL_REMAP_BLOCK; /* size: 0x0008 */

typedef struct _CM_FULL_RESOURCE_DESCRIPTOR
{
  /* 0x0000 */ enum _INTERFACE_TYPE InterfaceType;
  /* 0x0004 */ unsigned long BusNumber;
  /* 0x0008 */ struct _CM_PARTIAL_RESOURCE_LIST PartialResourceList;
} CM_FULL_RESOURCE_DESCRIPTOR, *PCM_FULL_RESOURCE_DESCRIPTOR; /* size: 0x0020 */

typedef struct _CM_INDEX_HINT_BLOCK
{
  /* 0x0000 */ unsigned long Count;
  /* 0x0004 */ unsigned long HashKey[1];
} CM_INDEX_HINT_BLOCK, *PCM_INDEX_HINT_BLOCK; /* size: 0x0008 */

typedef struct _CM_INTENT_LOCK
{
  /* 0x0000 */ unsigned long OwnerCount;
  /* 0x0004 */ struct _CM_KCB_UOW** OwnerTable;
} CM_INTENT_LOCK, *PCM_INTENT_LOCK; /* size: 0x0008 */

typedef struct _CM_KCB_UOW
{
  /* 0x0000 */ struct _LIST_ENTRY TransactionListEntry;
  /* 0x0008 */ struct _CM_INTENT_LOCK* KCBLock;
  /* 0x000c */ struct _CM_INTENT_LOCK* KeyLock;
  /* 0x0010 */ struct _LIST_ENTRY KCBListEntry;
  /* 0x0018 */ struct _CM_KEY_CONTROL_BLOCK* KeyControlBlock;
  /* 0x001c */ struct _CM_TRANS* Transaction;
  /* 0x0020 */ unsigned long UoWState;
  /* 0x0024 */ enum UoWActionType ActionType;
  /* 0x0028 */ enum HSTORAGE_TYPE StorageType;
  union
  {
    /* 0x0030 */ struct _CM_KEY_CONTROL_BLOCK* ChildKCB;
    /* 0x0030 */ unsigned long VolatileKeyCell;
    struct
    {
      /* 0x0030 */ unsigned long OldValueCell;
      /* 0x0034 */ unsigned long NewValueCell;
    }; /* size: 0x0008 */
    /* 0x0030 */ unsigned long UserFlags;
    /* 0x0030 */ union _LARGE_INTEGER LastWriteTime;
    /* 0x0030 */ unsigned long TxSecurityCell;
    struct
    {
      /* 0x0030 */ struct _CM_KEY_CONTROL_BLOCK* OldChildKCB;
      /* 0x0034 */ struct _CM_KEY_CONTROL_BLOCK* NewChildKCB;
    }; /* size: 0x0008 */
    struct
    {
      /* 0x0030 */ struct _CM_KEY_CONTROL_BLOCK* OtherChildKCB;
      /* 0x0034 */ unsigned long ThisVolatileKeyCell;
    }; /* size: 0x0008 */
  }; /* size: 0x0008 */
} CM_KCB_UOW, *PCM_KCB_UOW; /* size: 0x0038 */

typedef struct _CM_KEY_BODY
{
  /* 0x0000 */ unsigned long Type;
  /* 0x0004 */ struct _CM_KEY_CONTROL_BLOCK* KeyControlBlock;
  /* 0x0008 */ struct _CM_NOTIFY_BLOCK* NotifyBlock;
  /* 0x000c */ void* ProcessID;
  /* 0x0010 */ struct _LIST_ENTRY KeyBodyList;
  /* 0x0018 */ unsigned long Flags;
  /* 0x001c */ void* KtmTrans;
  /* 0x0020 */ struct _GUID* KtmUow;
  /* 0x0024 */ struct _LIST_ENTRY ContextListHead;
} CM_KEY_BODY, *PCM_KEY_BODY; /* size: 0x002c */

typedef struct _CM_KEY_CONTROL_BLOCK
{
  /* 0x0000 */ unsigned long RefCount;
  struct /* bitfield */
  {
    /* 0x0004 */ unsigned long ExtFlags : 9; /* bit position: 0 */
    /* 0x0004 */ unsigned long PrivateAlloc : 1; /* bit position: 9 */
    /* 0x0004 */ unsigned long Delete : 1; /* bit position: 10 */
    /* 0x0004 */ unsigned long DelayedCloseIndex : 11; /* bit position: 11 */
    /* 0x0004 */ unsigned long TotalLevels : 10; /* bit position: 22 */
  }; /* bitfield */
  union
  {
    /* 0x0008 */ struct _CM_KEY_HASH KeyHash;
    struct
    {
      /* 0x0008 */ unsigned long ConvKey;
      /* 0x000c */ struct _CM_KEY_HASH* NextHash;
      /* 0x0010 */ struct _HHIVE* KeyHive;
      /* 0x0014 */ unsigned long KeyCell;
    }; /* size: 0x0010 */
  }; /* size: 0x0010 */
  /* 0x0018 */ struct _CM_KEY_CONTROL_BLOCK* ParentKcb;
  /* 0x001c */ struct _CM_NAME_CONTROL_BLOCK* NameBlock;
  /* 0x0020 */ struct _CM_KEY_SECURITY_CACHE* CachedSecurity;
  /* 0x0024 */ struct _CACHED_CHILD_LIST ValueCache;
  union
  {
    /* 0x002c */ struct _CM_INDEX_HINT_BLOCK* IndexHint;
    /* 0x002c */ unsigned long HashKey;
    /* 0x002c */ unsigned long SubKeyCount;
  }; /* size: 0x0004 */
  union
  {
    /* 0x0030 */ struct _LIST_ENTRY KeyBodyListHead;
    /* 0x0030 */ struct _LIST_ENTRY FreeListEntry;
  }; /* size: 0x0008 */
  /* 0x0038 */ struct _CM_KEY_BODY* KeyBodyArray[4];
  /* 0x0048 */ void* DelayCloseEntry;
  /* 0x0050 */ union _LARGE_INTEGER KcbLastWriteTime;
  /* 0x0058 */ unsigned short KcbMaxNameLen;
  /* 0x005a */ unsigned short KcbMaxValueNameLen;
  /* 0x005c */ unsigned long KcbMaxValueDataLen;
  struct /* bitfield */
  {
    /* 0x0060 */ unsigned long KcbUserFlags : 4; /* bit position: 0 */
    /* 0x0060 */ unsigned long KcbVirtControlFlags : 4; /* bit position: 4 */
    /* 0x0060 */ unsigned long KcbDebug : 8; /* bit position: 8 */
    /* 0x0060 */ unsigned long Flags : 16; /* bit position: 16 */
  }; /* bitfield */
  /* 0x0064 */ struct _LIST_ENTRY KCBUoWListHead;
  /* 0x006c */ struct _CM_TRANS* TransKCBOwner;
  /* 0x0070 */ struct _CM_INTENT_LOCK KCBLock;
  /* 0x0078 */ struct _CM_INTENT_LOCK KeyLock;
  /* 0x0080 */ struct _CHILD_LIST TransValueCache;
  /* 0x0088 */ struct _CM_TRANS* TransValueListOwner;
  /* 0x008c */ struct _UNICODE_STRING* FullKCBName;
} CM_KEY_CONTROL_BLOCK, *PCM_KEY_CONTROL_BLOCK; /* size: 0x0090 */

typedef struct _CM_KEY_HASH
{
  /* 0x0000 */ unsigned long ConvKey;
  /* 0x0004 */ struct _CM_KEY_HASH* NextHash;
  /* 0x0008 */ struct _HHIVE* KeyHive;
  /* 0x000c */ unsigned long KeyCell;
} CM_KEY_HASH, *PCM_KEY_HASH; /* size: 0x0010 */

typedef struct _CM_KEY_INDEX
{
  /* 0x0000 */ unsigned short Signature;
  /* 0x0002 */ unsigned short Count;
  /* 0x0004 */ unsigned long List[1];
} CM_KEY_INDEX, *PCM_KEY_INDEX; /* size: 0x0008 */

typedef struct _CM_KEY_NODE
{
  /* 0x0000 */ unsigned short Signature;
  /* 0x0002 */ unsigned short Flags;
  /* 0x0004 */ union _LARGE_INTEGER LastWriteTime;
  /* 0x000c */ unsigned long Spare;
  /* 0x0010 */ unsigned long Parent;
  /* 0x0014 */ unsigned long SubKeyCounts[2];
  union
  {
    struct
    {
      /* 0x001c */ unsigned long SubKeyLists[2];
      /* 0x0024 */ struct _CHILD_LIST ValueList;
    }; /* size: 0x0010 */
    /* 0x001c */ struct _CM_KEY_REFERENCE ChildHiveReference;
  }; /* size: 0x0010 */
  /* 0x002c */ unsigned long Security;
  /* 0x0030 */ unsigned long Class;
  struct /* bitfield */
  {
    /* 0x0034 */ unsigned long MaxNameLen : 16; /* bit position: 0 */
    /* 0x0034 */ unsigned long UserFlags : 4; /* bit position: 16 */
    /* 0x0034 */ unsigned long VirtControlFlags : 4; /* bit position: 20 */
    /* 0x0034 */ unsigned long Debug : 8; /* bit position: 24 */
  }; /* bitfield */
  /* 0x0038 */ unsigned long MaxClassLen;
  /* 0x003c */ unsigned long MaxValueNameLen;
  /* 0x0040 */ unsigned long MaxValueDataLen;
  /* 0x0044 */ unsigned long WorkVar;
  /* 0x0048 */ unsigned short NameLength;
  /* 0x004a */ unsigned short ClassLength;
  /* 0x004c */ wchar_t Name[1];
  /* 0x004e */ char __PADDING__[2];
} CM_KEY_NODE, *PCM_KEY_NODE; /* size: 0x0050 */

typedef struct _CM_KEY_REFERENCE
{
  /* 0x0000 */ unsigned long KeyCell;
  /* 0x0004 */ struct _HHIVE* KeyHive;
} CM_KEY_REFERENCE, *PCM_KEY_REFERENCE; /* size: 0x0008 */

typedef struct _CM_KEY_SECURITY
{
  /* 0x0000 */ unsigned short Signature;
  /* 0x0002 */ unsigned short Reserved;
  /* 0x0004 */ unsigned long Flink;
  /* 0x0008 */ unsigned long Blink;
  /* 0x000c */ unsigned long ReferenceCount;
  /* 0x0010 */ unsigned long DescriptorLength;
  /* 0x0014 */ struct _SECURITY_DESCRIPTOR_RELATIVE Descriptor;
} CM_KEY_SECURITY, *PCM_KEY_SECURITY; /* size: 0x0028 */

typedef struct _CM_KEY_SECURITY_CACHE
{
  /* 0x0000 */ unsigned long Cell;
  /* 0x0004 */ unsigned long ConvKey;
  /* 0x0008 */ struct _LIST_ENTRY List;
  /* 0x0010 */ unsigned long DescriptorLength;
  /* 0x0014 */ unsigned long RealRefCount;
  /* 0x0018 */ struct _SECURITY_DESCRIPTOR_RELATIVE Descriptor;
} CM_KEY_SECURITY_CACHE, *PCM_KEY_SECURITY_CACHE; /* size: 0x002c */

typedef struct _CM_KEY_SECURITY_CACHE_ENTRY
{
  /* 0x0000 */ unsigned long Cell;
  /* 0x0004 */ struct _CM_KEY_SECURITY_CACHE* CachedSecurity;
} CM_KEY_SECURITY_CACHE_ENTRY, *PCM_KEY_SECURITY_CACHE_ENTRY; /* size: 0x0008 */

typedef struct _CM_KEY_VALUE
{
  /* 0x0000 */ unsigned short Signature;
  /* 0x0002 */ unsigned short NameLength;
  /* 0x0004 */ unsigned long DataLength;
  /* 0x0008 */ unsigned long Data;
  /* 0x000c */ unsigned long Type;
  /* 0x0010 */ unsigned short Flags;
  /* 0x0012 */ unsigned short Spare;
  /* 0x0014 */ wchar_t Name[1];
  /* 0x0016 */ char __PADDING__[2];
} CM_KEY_VALUE, *PCM_KEY_VALUE; /* size: 0x0018 */

typedef struct _CM_NAME_CONTROL_BLOCK
{
  /* 0x0000 */ unsigned char Compressed;
  /* 0x0002 */ unsigned short RefCount;
  union
  {
    /* 0x0004 */ struct _CM_NAME_HASH NameHash;
    struct
    {
      /* 0x0004 */ unsigned long ConvKey;
      /* 0x0008 */ struct _CM_KEY_HASH* NextHash;
      /* 0x000c */ unsigned short NameLength;
      /* 0x000e */ wchar_t Name[1];
    }; /* size: 0x000c */
  }; /* size: 0x000c */
} CM_NAME_CONTROL_BLOCK, *PCM_NAME_CONTROL_BLOCK; /* size: 0x0010 */

typedef struct _CM_NAME_HASH
{
  /* 0x0000 */ unsigned long ConvKey;
  /* 0x0004 */ struct _CM_NAME_HASH* NextHash;
  /* 0x0008 */ unsigned short NameLength;
  /* 0x000a */ wchar_t Name[1];
} CM_NAME_HASH, *PCM_NAME_HASH; /* size: 0x000c */

typedef struct _CM_NOTIFY_BLOCK
{
  /* 0x0000 */ struct _LIST_ENTRY HiveList;
  /* 0x0008 */ struct _LIST_ENTRY PostList;
  /* 0x0010 */ struct _CM_KEY_CONTROL_BLOCK* KeyControlBlock;
  /* 0x0014 */ struct _CM_KEY_BODY* KeyBody;
  struct /* bitfield */
  {
    /* 0x0018 */ unsigned long Filter : 30; /* bit position: 0 */
    /* 0x0018 */ unsigned long WatchTree : 1; /* bit position: 30 */
    /* 0x0018 */ unsigned long NotifyPending : 1; /* bit position: 31 */
  }; /* bitfield */
  /* 0x001c */ struct _SECURITY_SUBJECT_CONTEXT SubjectContext;
} CM_NOTIFY_BLOCK, *PCM_NOTIFY_BLOCK; /* size: 0x002c */

typedef struct _CM_PARTIAL_RESOURCE_DESCRIPTOR
{
  /* 0x0000 */ unsigned char Type;
  /* 0x0001 */ unsigned char ShareDisposition;
  /* 0x0002 */ unsigned short Flags;
  union
  {
    union
    {
      struct
      {
        /* 0x0004 */ union _LARGE_INTEGER Start;
        /* 0x000c */ unsigned long Length;
      } /* size: 0x000c */ Generic;
      struct
      {
        /* 0x0004 */ union _LARGE_INTEGER Start;
        /* 0x000c */ unsigned long Length;
      } /* size: 0x000c */ Port;
      struct
      {
        /* 0x0004 */ unsigned long Level;
        /* 0x0008 */ unsigned long Vector;
        /* 0x000c */ unsigned long Affinity;
      } /* size: 0x000c */ Interrupt;
      struct
      {
        union
        {
          struct
          {
            /* 0x0004 */ unsigned short Reserved;
            /* 0x0006 */ unsigned short MessageCount;
            /* 0x0008 */ unsigned long Vector;
            /* 0x000c */ unsigned long Affinity;
          } /* size: 0x000c */ Raw;
          struct
          {
            /* 0x0004 */ unsigned long Level;
            /* 0x0008 */ unsigned long Vector;
            /* 0x000c */ unsigned long Affinity;
          } /* size: 0x000c */ Translated;
        }; /* size: 0x000c */
      } /* size: 0x000c */ MessageInterrupt;
      struct
      {
        /* 0x0004 */ union _LARGE_INTEGER Start;
        /* 0x000c */ unsigned long Length;
      } /* size: 0x000c */ Memory;
      struct
      {
        /* 0x0004 */ unsigned long Channel;
        /* 0x0008 */ unsigned long Port;
        /* 0x000c */ unsigned long Reserved1;
      } /* size: 0x000c */ Dma;
      struct
      {
        /* 0x0004 */ unsigned long Data[3];
      } /* size: 0x000c */ DevicePrivate;
      struct
      {
        /* 0x0004 */ unsigned long Start;
        /* 0x0008 */ unsigned long Length;
        /* 0x000c */ unsigned long Reserved;
      } /* size: 0x000c */ BusNumber;
      struct
      {
        /* 0x0004 */ unsigned long DataSize;
        /* 0x0008 */ unsigned long Reserved1;
        /* 0x000c */ unsigned long Reserved2;
      } /* size: 0x000c */ DeviceSpecificData;
      struct
      {
        /* 0x0004 */ union _LARGE_INTEGER Start;
        /* 0x000c */ unsigned long Length40;
      } /* size: 0x000c */ Memory40;
      struct
      {
        /* 0x0004 */ union _LARGE_INTEGER Start;
        /* 0x000c */ unsigned long Length48;
      } /* size: 0x000c */ Memory48;
      struct
      {
        /* 0x0004 */ union _LARGE_INTEGER Start;
        /* 0x000c */ unsigned long Length64;
      } /* size: 0x000c */ Memory64;
    }; /* size: 0x000c */
  } /* size: 0x000c */ u;
} CM_PARTIAL_RESOURCE_DESCRIPTOR, *PCM_PARTIAL_RESOURCE_DESCRIPTOR; /* size: 0x0010 */

typedef struct _CM_PARTIAL_RESOURCE_LIST
{
  /* 0x0000 */ unsigned short Version;
  /* 0x0002 */ unsigned short Revision;
  /* 0x0004 */ unsigned long Count;
  /* 0x0008 */ struct _CM_PARTIAL_RESOURCE_DESCRIPTOR PartialDescriptors[1];
} CM_PARTIAL_RESOURCE_LIST, *PCM_PARTIAL_RESOURCE_LIST; /* size: 0x0018 */

typedef struct _CM_RESOURCE_LIST
{
  /* 0x0000 */ unsigned long Count;
  /* 0x0004 */ struct _CM_FULL_RESOURCE_DESCRIPTOR List[1];
} CM_RESOURCE_LIST, *PCM_RESOURCE_LIST; /* size: 0x0024 */

typedef struct _CM_RM
{
  /* 0x0000 */ struct _LIST_ENTRY RmListEntry;
  /* 0x0008 */ struct _LIST_ENTRY TransactionListHead;
  /* 0x0010 */ void* TmHandle;
  /* 0x0014 */ void* Tm;
  /* 0x0018 */ void* RmHandle;
  /* 0x001c */ void* KtmRm;
  /* 0x0020 */ unsigned long RefCount;
  /* 0x0024 */ unsigned long ContainerNum;
  /* 0x0028 */ unsigned __int64 ContainerSize;
  /* 0x0030 */ struct _CMHIVE* CmHive;
  /* 0x0034 */ void* LogFileObject;
  /* 0x0038 */ void* MarshallingContext;
  /* 0x003c */ unsigned long RmFlags;
  /* 0x0040 */ long LogStartStatus1;
  /* 0x0044 */ long LogStartStatus2;
  /* 0x0048 */ unsigned __int64 BaseLsn;
  /* 0x0050 */ struct _ERESOURCE* RmLock;
  /* 0x0054 */ long __PADDING__[1];
} CM_RM, *PCM_RM; /* size: 0x0058 */

typedef struct _CM_TRANS
{
  /* 0x0000 */ struct _LIST_ENTRY TransactionListEntry;
  /* 0x0008 */ struct _LIST_ENTRY KCBUoWListHead;
  /* 0x0010 */ struct _LIST_ENTRY LazyCommitListEntry;
  /* 0x0018 */ void* KtmTrans;
  /* 0x001c */ struct _CM_RM* CmRm;
  /* 0x0020 */ struct _KENLISTMENT* KtmEnlistmentObject;
  /* 0x0024 */ void* KtmEnlistmentHandle;
  /* 0x0028 */ struct _GUID KtmUow;
  /* 0x0038 */ unsigned __int64 StartLsn;
  /* 0x0040 */ unsigned long TransState;
  /* 0x0044 */ unsigned long HiveCount;
  /* 0x0048 */ struct _CMHIVE* HiveArray[8];
} CM_TRANS, *PCM_TRANS; /* size: 0x0068 */

typedef struct _CM_VIEW_OF_FILE
{
  /* 0x0000 */ struct _LIST_ENTRY MappedViewLinks;
  /* 0x0008 */ struct _LIST_ENTRY PinnedViewLinks;
  /* 0x0010 */ struct _LIST_ENTRY FlushedViewLinks;
  /* 0x0018 */ struct _CMHIVE* CmHive;
  /* 0x001c */ void* Bcb;
  /* 0x0020 */ void* ViewAddress;
  /* 0x0024 */ unsigned long FileOffset;
  /* 0x0028 */ unsigned long Size;
  /* 0x002c */ unsigned long UseCount;
} CM_VIEW_OF_FILE, *PCM_VIEW_OF_FILE; /* size: 0x0030 */

typedef struct _CM_WORKITEM
{
  /* 0x0000 */ struct _LIST_ENTRY ListEntry;
  /* 0x0008 */ void* WorkerRoutine /* function */;
  /* 0x000c */ void* Parameter;
} CM_WORKITEM, *PCM_WORKITEM; /* size: 0x0010 */

typedef struct _COMPRESSED_DATA_INFO
{
  /* 0x0000 */ unsigned short CompressionFormatAndEngine;
  /* 0x0002 */ unsigned char CompressionUnitShift;
  /* 0x0003 */ unsigned char ChunkShift;
  /* 0x0004 */ unsigned char ClusterShift;
  /* 0x0005 */ unsigned char Reserved;
  /* 0x0006 */ unsigned short NumberOfChunks;
  /* 0x0008 */ unsigned long CompressedChunkSizes[1];
} COMPRESSED_DATA_INFO, *PCOMPRESSED_DATA_INFO; /* size: 0x000c */

typedef enum _CONFIGURATION_CLASS
{
  SystemClass = 0,
  ProcessorClass = 1,
  CacheClass = 2,
  AdapterClass = 3,
  ControllerClass = 4,
  PeripheralClass = 5,
  MemoryClass = 6,
  MaximumClass = 7,
} CONFIGURATION_CLASS, *PCONFIGURATION_CLASS;

typedef struct _CONFIGURATION_COMPONENT
{
  /* 0x0000 */ enum _CONFIGURATION_CLASS Class;
  /* 0x0004 */ enum _CONFIGURATION_TYPE Type;
  /* 0x0008 */ struct _DEVICE_FLAGS Flags;
  /* 0x000c */ unsigned short Version;
  /* 0x000e */ unsigned short Revision;
  /* 0x0010 */ unsigned long Key;
  /* 0x0014 */ unsigned long AffinityMask;
  /* 0x0018 */ unsigned long ConfigurationDataLength;
  /* 0x001c */ unsigned long IdentifierLength;
  /* 0x0020 */ char* Identifier;
} CONFIGURATION_COMPONENT, *PCONFIGURATION_COMPONENT; /* size: 0x0024 */

typedef struct _CONFIGURATION_COMPONENT_DATA
{
  /* 0x0000 */ struct _CONFIGURATION_COMPONENT_DATA* Parent;
  /* 0x0004 */ struct _CONFIGURATION_COMPONENT_DATA* Child;
  /* 0x0008 */ struct _CONFIGURATION_COMPONENT_DATA* Sibling;
  /* 0x000c */ struct _CONFIGURATION_COMPONENT ComponentEntry;
  /* 0x0030 */ void* ConfigurationData;
} CONFIGURATION_COMPONENT_DATA, *PCONFIGURATION_COMPONENT_DATA; /* size: 0x0034 */

typedef enum _CONFIGURATION_TYPE
{
  ArcSystem = 0,
  CentralProcessor = 1,
  FloatingPointProcessor = 2,
  PrimaryIcache = 3,
  PrimaryDcache = 4,
  SecondaryIcache = 5,
  SecondaryDcache = 6,
  SecondaryCache = 7,
  EisaAdapter = 8,
  TcAdapter = 9,
  ScsiAdapter = 10,
  DtiAdapter = 11,
  MultiFunctionAdapter = 12,
  DiskController = 13,
  TapeController = 14,
  CdromController = 15,
  WormController = 16,
  SerialController = 17,
  NetworkController = 18,
  DisplayController = 19,
  ParallelController = 20,
  PointerController = 21,
  KeyboardController = 22,
  AudioController = 23,
  OtherController = 24,
  DiskPeripheral = 25,
  FloppyDiskPeripheral = 26,
  TapePeripheral = 27,
  ModemPeripheral = 28,
  MonitorPeripheral = 29,
  PrinterPeripheral = 30,
  PointerPeripheral = 31,
  KeyboardPeripheral = 32,
  TerminalPeripheral = 33,
  OtherPeripheral = 34,
  LinePeripheral = 35,
  NetworkPeripheral = 36,
  SystemMemory = 37,
  DockingInformation = 38,
  RealModeIrqRoutingTable = 39,
  RealModePCIEnumeration = 40,
  MaximumType = 41,
} CONFIGURATION_TYPE, *PCONFIGURATION_TYPE;

typedef struct _CONTEXT
{
  /* 0x0000 */ unsigned long ContextFlags;
  /* 0x0004 */ unsigned long Dr0;
  /* 0x0008 */ unsigned long Dr1;
  /* 0x000c */ unsigned long Dr2;
  /* 0x0010 */ unsigned long Dr3;
  /* 0x0014 */ unsigned long Dr6;
  /* 0x0018 */ unsigned long Dr7;
  /* 0x001c */ struct _FLOATING_SAVE_AREA FloatSave;
  /* 0x008c */ unsigned long SegGs;
  /* 0x0090 */ unsigned long SegFs;
  /* 0x0094 */ unsigned long SegEs;
  /* 0x0098 */ unsigned long SegDs;
  /* 0x009c */ unsigned long Edi;
  /* 0x00a0 */ unsigned long Esi;
  /* 0x00a4 */ unsigned long Ebx;
  /* 0x00a8 */ unsigned long Edx;
  /* 0x00ac */ unsigned long Ecx;
  /* 0x00b0 */ unsigned long Eax;
  /* 0x00b4 */ unsigned long Ebp;
  /* 0x00b8 */ unsigned long Eip;
  /* 0x00bc */ unsigned long SegCs;
  /* 0x00c0 */ unsigned long EFlags;
  /* 0x00c4 */ unsigned long Esp;
  /* 0x00c8 */ unsigned long SegSs;
  /* 0x00cc */ unsigned char ExtendedRegisters[512];
} CONTEXT, *PCONTEXT; /* size: 0x02cc */

typedef struct _CONTROL_AREA
{
  /* 0x0000 */ struct _SEGMENT* Segment;
  /* 0x0004 */ struct _LIST_ENTRY DereferenceList;
  /* 0x000c */ unsigned long NumberOfSectionReferences;
  /* 0x0010 */ unsigned long NumberOfPfnReferences;
  /* 0x0014 */ unsigned long NumberOfMappedViews;
  /* 0x0018 */ unsigned long NumberOfUserReferences;
  union
  {
    union
    {
      /* 0x001c */ unsigned long LongFlags;
      /* 0x001c */ struct _MMSECTION_FLAGS Flags;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ u;
  union
  {
    struct
    {
      /* 0x0020 */ unsigned short ModifiedWriteCount;
      /* 0x0022 */ unsigned short FlushInProgressCount;
    } /* size: 0x0004 */ e2;
  } /* size: 0x0004 */ u1;
  /* 0x0024 */ struct _EX_FAST_REF FilePointer;
  /* 0x0028 */ volatile long ControlAreaLock;
  /* 0x002c */ unsigned long StartingFrame;
  /* 0x0030 */ struct _MI_SECTION_CREATION_GATE* WaitingForDeletion;
  union
  {
    struct
    {
      union
      {
        /* 0x0034 */ unsigned long NumberOfSystemCacheViews;
        /* 0x0034 */ unsigned long ImageRelocationStartBit;
      }; /* size: 0x0004 */
      union
      {
        /* 0x0038 */ volatile long WritableUserReferences;
        struct /* bitfield */
        {
          /* 0x0038 */ unsigned long ImageRelocationSizeIn64k : 16; /* bit position: 0 */
          /* 0x0038 */ unsigned long Unused : 14; /* bit position: 16 */
          /* 0x0038 */ unsigned long BitMap64 : 1; /* bit position: 30 */
          /* 0x0038 */ unsigned long ImageActive : 1; /* bit position: 31 */
        }; /* bitfield */
      }; /* size: 0x0004 */
      union
      {
        /* 0x003c */ struct _MM_SUBSECTION_AVL_TABLE* SubsectionRoot;
        /* 0x003c */ struct _MI_IMAGE_SECURITY_REFERENCE* SeImageStub;
      }; /* size: 0x0004 */
    } /* size: 0x000c */ e2;
  } /* size: 0x000c */ u2;
  /* 0x0040 */ volatile __int64 LockedPages;
} CONTROL_AREA, *PCONTROL_AREA; /* size: 0x0048 */

typedef struct _CURDIR
{
  /* 0x0000 */ struct _UNICODE_STRING DosPath;
  /* 0x0008 */ void* Handle;
} CURDIR, *PCURDIR; /* size: 0x000c */

typedef struct _DBGKD_ANY_CONTROL_SET
{
  union
  {
    /* 0x0000 */ struct _X86_DBGKD_CONTROL_SET X86ControlSet;
    /* 0x0000 */ unsigned long AlphaControlSet;
    /* 0x0000 */ struct _IA64_DBGKD_CONTROL_SET IA64ControlSet;
    /* 0x0000 */ struct _AMD64_DBGKD_CONTROL_SET Amd64ControlSet;
    struct
    {
      /* 0x0000 */ struct _ARM_DBGKD_CONTROL_SET ArmControlSet;
      /* 0x000c */ long __PADDING__[4];
    }; /* size: 0x001c */
  }; /* size: 0x001c */
} DBGKD_ANY_CONTROL_SET, *PDBGKD_ANY_CONTROL_SET; /* size: 0x001c */

typedef struct _DBGKD_BREAKPOINTEX
{
  /* 0x0000 */ unsigned long BreakPointCount;
  /* 0x0004 */ long ContinueStatus;
} DBGKD_BREAKPOINTEX, *PDBGKD_BREAKPOINTEX; /* size: 0x0008 */

typedef struct _DBGKD_CONTINUE
{
  /* 0x0000 */ long ContinueStatus;
} DBGKD_CONTINUE, *PDBGKD_CONTINUE; /* size: 0x0004 */

typedef struct _DBGKD_CONTINUE2
{
  /* 0x0000 */ long ContinueStatus;
  union
  {
    /* 0x0004 */ struct _X86_DBGKD_CONTROL_SET ControlSet;
    /* 0x0004 */ struct _DBGKD_ANY_CONTROL_SET AnyControlSet;
  }; /* size: 0x001c */
} DBGKD_CONTINUE2, *PDBGKD_CONTINUE2; /* size: 0x0020 */

typedef struct _DBGKD_FILL_MEMORY
{
  /* 0x0000 */ unsigned __int64 Address;
  /* 0x0008 */ unsigned long Length;
  /* 0x000c */ unsigned short Flags;
  /* 0x000e */ unsigned short PatternLength;
} DBGKD_FILL_MEMORY, *PDBGKD_FILL_MEMORY; /* size: 0x0010 */

typedef struct _DBGKD_GET_CONTEXT
{
  /* 0x0000 */ unsigned long Unused;
} DBGKD_GET_CONTEXT, *PDBGKD_GET_CONTEXT; /* size: 0x0004 */

typedef struct _DBGKD_GET_INTERNAL_BREAKPOINT32
{
  /* 0x0000 */ unsigned long BreakpointAddress;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ unsigned long Calls;
  /* 0x000c */ unsigned long MaxCallsPerPeriod;
  /* 0x0010 */ unsigned long MinInstructions;
  /* 0x0014 */ unsigned long MaxInstructions;
  /* 0x0018 */ unsigned long TotalInstructions;
} DBGKD_GET_INTERNAL_BREAKPOINT32, *PDBGKD_GET_INTERNAL_BREAKPOINT32; /* size: 0x001c */

typedef struct _DBGKD_GET_INTERNAL_BREAKPOINT64
{
  /* 0x0000 */ unsigned __int64 BreakpointAddress;
  /* 0x0008 */ unsigned long Flags;
  /* 0x000c */ unsigned long Calls;
  /* 0x0010 */ unsigned long MaxCallsPerPeriod;
  /* 0x0014 */ unsigned long MinInstructions;
  /* 0x0018 */ unsigned long MaxInstructions;
  /* 0x001c */ unsigned long TotalInstructions;
} DBGKD_GET_INTERNAL_BREAKPOINT64, *PDBGKD_GET_INTERNAL_BREAKPOINT64; /* size: 0x0020 */

typedef struct _DBGKD_GET_SET_BUS_DATA
{
  /* 0x0000 */ unsigned long BusDataType;
  /* 0x0004 */ unsigned long BusNumber;
  /* 0x0008 */ unsigned long SlotNumber;
  /* 0x000c */ unsigned long Offset;
  /* 0x0010 */ unsigned long Length;
} DBGKD_GET_SET_BUS_DATA, *PDBGKD_GET_SET_BUS_DATA; /* size: 0x0014 */

typedef struct _DBGKD_GET_VERSION32
{
  /* 0x0000 */ unsigned short MajorVersion;
  /* 0x0002 */ unsigned short MinorVersion;
  /* 0x0004 */ unsigned short ProtocolVersion;
  /* 0x0006 */ unsigned short Flags;
  /* 0x0008 */ unsigned long KernBase;
  /* 0x000c */ unsigned long PsLoadedModuleList;
  /* 0x0010 */ unsigned short MachineType;
  /* 0x0012 */ unsigned short ThCallbackStack;
  /* 0x0014 */ unsigned short NextCallback;
  /* 0x0016 */ unsigned short FramePointer;
  /* 0x0018 */ unsigned long KiCallUserMode;
  /* 0x001c */ unsigned long KeUserCallbackDispatcher;
  /* 0x0020 */ unsigned long BreakpointWithStatus;
  /* 0x0024 */ unsigned long DebuggerDataList;
} DBGKD_GET_VERSION32, *PDBGKD_GET_VERSION32; /* size: 0x0028 */

typedef struct _DBGKD_GET_VERSION64
{
  /* 0x0000 */ unsigned short MajorVersion;
  /* 0x0002 */ unsigned short MinorVersion;
  /* 0x0004 */ unsigned char ProtocolVersion;
  /* 0x0005 */ unsigned char KdSecondaryVersion;
  /* 0x0006 */ unsigned short Flags;
  /* 0x0008 */ unsigned short MachineType;
  /* 0x000a */ unsigned char MaxPacketType;
  /* 0x000b */ unsigned char MaxStateChange;
  /* 0x000c */ unsigned char MaxManipulate;
  /* 0x000d */ unsigned char Simulation;
  /* 0x000e */ unsigned short Unused[1];
  /* 0x0010 */ unsigned __int64 KernBase;
  /* 0x0018 */ unsigned __int64 PsLoadedModuleList;
  /* 0x0020 */ unsigned __int64 DebuggerDataList;
} DBGKD_GET_VERSION64, *PDBGKD_GET_VERSION64; /* size: 0x0028 */

typedef struct _DBGKD_LOAD_SYMBOLS32
{
  /* 0x0000 */ unsigned long PathNameLength;
  /* 0x0004 */ unsigned long BaseOfDll;
  /* 0x0008 */ unsigned long ProcessId;
  /* 0x000c */ unsigned long CheckSum;
  /* 0x0010 */ unsigned long SizeOfImage;
  /* 0x0014 */ unsigned char UnloadSymbols;
  /* 0x0015 */ char __PADDING__[3];
} DBGKD_LOAD_SYMBOLS32, *PDBGKD_LOAD_SYMBOLS32; /* size: 0x0018 */

typedef struct _DBGKD_LOAD_SYMBOLS64
{
  /* 0x0000 */ unsigned long PathNameLength;
  /* 0x0008 */ unsigned __int64 BaseOfDll;
  /* 0x0010 */ unsigned __int64 ProcessId;
  /* 0x0018 */ unsigned long CheckSum;
  /* 0x001c */ unsigned long SizeOfImage;
  /* 0x0020 */ unsigned char UnloadSymbols;
  /* 0x0021 */ char __PADDING__[7];
} DBGKD_LOAD_SYMBOLS64, *PDBGKD_LOAD_SYMBOLS64; /* size: 0x0028 */

typedef struct _DBGKD_MANIPULATE_STATE32
{
  /* 0x0000 */ unsigned long ApiNumber;
  /* 0x0004 */ unsigned short ProcessorLevel;
  /* 0x0006 */ unsigned short Processor;
  /* 0x0008 */ long ReturnStatus;
  union
  {
    union
    {
      /* 0x000c */ struct _DBGKD_READ_MEMORY32 ReadMemory;
      /* 0x000c */ struct _DBGKD_WRITE_MEMORY32 WriteMemory;
      /* 0x000c */ struct _DBGKD_READ_MEMORY64 ReadMemory64;
      /* 0x000c */ struct _DBGKD_WRITE_MEMORY64 WriteMemory64;
      /* 0x000c */ struct _DBGKD_GET_CONTEXT GetContext;
      /* 0x000c */ struct _DBGKD_SET_CONTEXT SetContext;
      /* 0x000c */ struct _DBGKD_WRITE_BREAKPOINT32 WriteBreakPoint;
      /* 0x000c */ struct _DBGKD_RESTORE_BREAKPOINT RestoreBreakPoint;
      /* 0x000c */ struct _DBGKD_CONTINUE Continue;
      /* 0x000c */ struct _DBGKD_CONTINUE2 Continue2;
      /* 0x000c */ struct _DBGKD_READ_WRITE_IO32 ReadWriteIo;
      /* 0x000c */ struct _DBGKD_READ_WRITE_IO_EXTENDED32 ReadWriteIoExtended;
      /* 0x000c */ struct _DBGKD_QUERY_SPECIAL_CALLS QuerySpecialCalls;
      /* 0x000c */ struct _DBGKD_SET_SPECIAL_CALL32 SetSpecialCall;
      /* 0x000c */ struct _DBGKD_SET_INTERNAL_BREAKPOINT32 SetInternalBreakpoint;
      /* 0x000c */ struct _DBGKD_GET_INTERNAL_BREAKPOINT32 GetInternalBreakpoint;
      /* 0x000c */ struct _DBGKD_GET_VERSION32 GetVersion32;
      /* 0x000c */ struct _DBGKD_BREAKPOINTEX BreakPointEx;
      /* 0x000c */ struct _DBGKD_READ_WRITE_MSR ReadWriteMsr;
      /* 0x000c */ struct _DBGKD_SEARCH_MEMORY SearchMemory;
    }; /* size: 0x0028 */
  } /* size: 0x0028 */ u;
} DBGKD_MANIPULATE_STATE32, *PDBGKD_MANIPULATE_STATE32; /* size: 0x0034 */

typedef struct _DBGKD_MANIPULATE_STATE64
{
  /* 0x0000 */ unsigned long ApiNumber;
  /* 0x0004 */ unsigned short ProcessorLevel;
  /* 0x0006 */ unsigned short Processor;
  /* 0x0008 */ long ReturnStatus;
  union
  {
    union
    {
      /* 0x0010 */ struct _DBGKD_READ_MEMORY64 ReadMemory;
      /* 0x0010 */ struct _DBGKD_WRITE_MEMORY64 WriteMemory;
      /* 0x0010 */ struct _DBGKD_GET_CONTEXT GetContext;
      /* 0x0010 */ struct _DBGKD_SET_CONTEXT SetContext;
      /* 0x0010 */ struct _DBGKD_WRITE_BREAKPOINT64 WriteBreakPoint;
      /* 0x0010 */ struct _DBGKD_RESTORE_BREAKPOINT RestoreBreakPoint;
      /* 0x0010 */ struct _DBGKD_CONTINUE Continue;
      /* 0x0010 */ struct _DBGKD_CONTINUE2 Continue2;
      /* 0x0010 */ struct _DBGKD_READ_WRITE_IO64 ReadWriteIo;
      /* 0x0010 */ struct _DBGKD_READ_WRITE_IO_EXTENDED64 ReadWriteIoExtended;
      /* 0x0010 */ struct _DBGKD_QUERY_SPECIAL_CALLS QuerySpecialCalls;
      /* 0x0010 */ struct _DBGKD_SET_SPECIAL_CALL64 SetSpecialCall;
      /* 0x0010 */ struct _DBGKD_SET_INTERNAL_BREAKPOINT64 SetInternalBreakpoint;
      /* 0x0010 */ struct _DBGKD_GET_INTERNAL_BREAKPOINT64 GetInternalBreakpoint;
      /* 0x0010 */ struct _DBGKD_GET_VERSION64 GetVersion64;
      /* 0x0010 */ struct _DBGKD_BREAKPOINTEX BreakPointEx;
      /* 0x0010 */ struct _DBGKD_READ_WRITE_MSR ReadWriteMsr;
      /* 0x0010 */ struct _DBGKD_SEARCH_MEMORY SearchMemory;
      /* 0x0010 */ struct _DBGKD_GET_SET_BUS_DATA GetSetBusData;
      /* 0x0010 */ struct _DBGKD_FILL_MEMORY FillMemory;
      /* 0x0010 */ struct _DBGKD_QUERY_MEMORY QueryMemory;
      /* 0x0010 */ struct _DBGKD_SWITCH_PARTITION SwitchPartition;
    }; /* size: 0x0028 */
  } /* size: 0x0028 */ u;
} DBGKD_MANIPULATE_STATE64, *PDBGKD_MANIPULATE_STATE64; /* size: 0x0038 */

typedef struct _DBGKD_QUERY_MEMORY
{
  /* 0x0000 */ unsigned __int64 Address;
  /* 0x0008 */ unsigned __int64 Reserved;
  /* 0x0010 */ unsigned long AddressSpace;
  /* 0x0014 */ unsigned long Flags;
} DBGKD_QUERY_MEMORY, *PDBGKD_QUERY_MEMORY; /* size: 0x0018 */

typedef struct _DBGKD_QUERY_SPECIAL_CALLS
{
  /* 0x0000 */ unsigned long NumberOfSpecialCalls;
} DBGKD_QUERY_SPECIAL_CALLS, *PDBGKD_QUERY_SPECIAL_CALLS; /* size: 0x0004 */

typedef struct _DBGKD_READ_MEMORY32
{
  /* 0x0000 */ unsigned long TargetBaseAddress;
  /* 0x0004 */ unsigned long TransferCount;
  /* 0x0008 */ unsigned long ActualBytesRead;
} DBGKD_READ_MEMORY32, *PDBGKD_READ_MEMORY32; /* size: 0x000c */

typedef struct _DBGKD_READ_MEMORY64
{
  /* 0x0000 */ unsigned __int64 TargetBaseAddress;
  /* 0x0008 */ unsigned long TransferCount;
  /* 0x000c */ unsigned long ActualBytesRead;
} DBGKD_READ_MEMORY64, *PDBGKD_READ_MEMORY64; /* size: 0x0010 */

typedef struct _DBGKD_READ_WRITE_IO32
{
  /* 0x0000 */ unsigned long DataSize;
  /* 0x0004 */ unsigned long IoAddress;
  /* 0x0008 */ unsigned long DataValue;
} DBGKD_READ_WRITE_IO32, *PDBGKD_READ_WRITE_IO32; /* size: 0x000c */

typedef struct _DBGKD_READ_WRITE_IO64
{
  /* 0x0000 */ unsigned __int64 IoAddress;
  /* 0x0008 */ unsigned long DataSize;
  /* 0x000c */ unsigned long DataValue;
} DBGKD_READ_WRITE_IO64, *PDBGKD_READ_WRITE_IO64; /* size: 0x0010 */

typedef struct _DBGKD_READ_WRITE_IO_EXTENDED32
{
  /* 0x0000 */ unsigned long DataSize;
  /* 0x0004 */ unsigned long InterfaceType;
  /* 0x0008 */ unsigned long BusNumber;
  /* 0x000c */ unsigned long AddressSpace;
  /* 0x0010 */ unsigned long IoAddress;
  /* 0x0014 */ unsigned long DataValue;
} DBGKD_READ_WRITE_IO_EXTENDED32, *PDBGKD_READ_WRITE_IO_EXTENDED32; /* size: 0x0018 */

typedef struct _DBGKD_READ_WRITE_IO_EXTENDED64
{
  /* 0x0000 */ unsigned long DataSize;
  /* 0x0004 */ unsigned long InterfaceType;
  /* 0x0008 */ unsigned long BusNumber;
  /* 0x000c */ unsigned long AddressSpace;
  /* 0x0010 */ unsigned __int64 IoAddress;
  /* 0x0018 */ unsigned long DataValue;
  /* 0x001c */ long __PADDING__[1];
} DBGKD_READ_WRITE_IO_EXTENDED64, *PDBGKD_READ_WRITE_IO_EXTENDED64; /* size: 0x0020 */

typedef struct _DBGKD_READ_WRITE_MSR
{
  /* 0x0000 */ unsigned long Msr;
  /* 0x0004 */ unsigned long DataValueLow;
  /* 0x0008 */ unsigned long DataValueHigh;
} DBGKD_READ_WRITE_MSR, *PDBGKD_READ_WRITE_MSR; /* size: 0x000c */

typedef struct _DBGKD_RESTORE_BREAKPOINT
{
  /* 0x0000 */ unsigned long BreakPointHandle;
} DBGKD_RESTORE_BREAKPOINT, *PDBGKD_RESTORE_BREAKPOINT; /* size: 0x0004 */

typedef struct _DBGKD_SEARCH_MEMORY
{
  union
  {
    /* 0x0000 */ unsigned __int64 SearchAddress;
    /* 0x0000 */ unsigned __int64 FoundAddress;
  }; /* size: 0x0008 */
  /* 0x0008 */ unsigned __int64 SearchLength;
  /* 0x0010 */ unsigned long PatternLength;
  /* 0x0014 */ long __PADDING__[1];
} DBGKD_SEARCH_MEMORY, *PDBGKD_SEARCH_MEMORY; /* size: 0x0018 */

typedef struct _DBGKD_SET_CONTEXT
{
  /* 0x0000 */ unsigned long ContextFlags;
} DBGKD_SET_CONTEXT, *PDBGKD_SET_CONTEXT; /* size: 0x0004 */

typedef struct _DBGKD_SET_INTERNAL_BREAKPOINT32
{
  /* 0x0000 */ unsigned long BreakpointAddress;
  /* 0x0004 */ unsigned long Flags;
} DBGKD_SET_INTERNAL_BREAKPOINT32, *PDBGKD_SET_INTERNAL_BREAKPOINT32; /* size: 0x0008 */

typedef struct _DBGKD_SET_INTERNAL_BREAKPOINT64
{
  /* 0x0000 */ unsigned __int64 BreakpointAddress;
  /* 0x0008 */ unsigned long Flags;
  /* 0x000c */ long __PADDING__[1];
} DBGKD_SET_INTERNAL_BREAKPOINT64, *PDBGKD_SET_INTERNAL_BREAKPOINT64; /* size: 0x0010 */

typedef struct _DBGKD_SET_SPECIAL_CALL32
{
  /* 0x0000 */ unsigned long SpecialCall;
} DBGKD_SET_SPECIAL_CALL32, *PDBGKD_SET_SPECIAL_CALL32; /* size: 0x0004 */

typedef struct _DBGKD_SET_SPECIAL_CALL64
{
  /* 0x0000 */ unsigned __int64 SpecialCall;
} DBGKD_SET_SPECIAL_CALL64, *PDBGKD_SET_SPECIAL_CALL64; /* size: 0x0008 */

typedef struct _DBGKD_SWITCH_PARTITION
{
  /* 0x0000 */ unsigned long Partition;
} DBGKD_SWITCH_PARTITION, *PDBGKD_SWITCH_PARTITION; /* size: 0x0004 */

typedef struct _DBGKD_WRITE_BREAKPOINT32
{
  /* 0x0000 */ unsigned long BreakPointAddress;
  /* 0x0004 */ unsigned long BreakPointHandle;
} DBGKD_WRITE_BREAKPOINT32, *PDBGKD_WRITE_BREAKPOINT32; /* size: 0x0008 */

typedef struct _DBGKD_WRITE_BREAKPOINT64
{
  /* 0x0000 */ unsigned __int64 BreakPointAddress;
  /* 0x0008 */ unsigned long BreakPointHandle;
  /* 0x000c */ long __PADDING__[1];
} DBGKD_WRITE_BREAKPOINT64, *PDBGKD_WRITE_BREAKPOINT64; /* size: 0x0010 */

typedef struct _DBGKD_WRITE_MEMORY32
{
  /* 0x0000 */ unsigned long TargetBaseAddress;
  /* 0x0004 */ unsigned long TransferCount;
  /* 0x0008 */ unsigned long ActualBytesWritten;
} DBGKD_WRITE_MEMORY32, *PDBGKD_WRITE_MEMORY32; /* size: 0x000c */

typedef struct _DBGKD_WRITE_MEMORY64
{
  /* 0x0000 */ unsigned __int64 TargetBaseAddress;
  /* 0x0008 */ unsigned long TransferCount;
  /* 0x000c */ unsigned long ActualBytesWritten;
} DBGKD_WRITE_MEMORY64, *PDBGKD_WRITE_MEMORY64; /* size: 0x0010 */

typedef struct _DBGKM_EXCEPTION32
{
  /* 0x0000 */ struct _EXCEPTION_RECORD32 ExceptionRecord;
  /* 0x0050 */ unsigned long FirstChance;
} DBGKM_EXCEPTION32, *PDBGKM_EXCEPTION32; /* size: 0x0054 */

typedef struct _DBGKM_EXCEPTION64
{
  /* 0x0000 */ struct _EXCEPTION_RECORD64 ExceptionRecord;
  /* 0x0098 */ unsigned long FirstChance;
  /* 0x009c */ long __PADDING__[1];
} DBGKM_EXCEPTION64, *PDBGKM_EXCEPTION64; /* size: 0x00a0 */

typedef struct _DEFERRED_WRITE
{
  /* 0x0000 */ short NodeTypeCode;
  /* 0x0002 */ short NodeByteSize;
  /* 0x0004 */ struct _FILE_OBJECT* FileObject;
  /* 0x0008 */ unsigned long BytesToWrite;
  /* 0x000c */ struct _LIST_ENTRY DeferredWriteLinks;
  /* 0x0014 */ struct _KEVENT* Event;
  /* 0x0018 */ void* PostRoutine /* function */;
  /* 0x001c */ void* Context1;
  /* 0x0020 */ void* Context2;
  /* 0x0024 */ unsigned char LimitModifiedPages;
  /* 0x0025 */ char __PADDING__[3];
} DEFERRED_WRITE, *PDEFERRED_WRITE; /* size: 0x0028 */

typedef struct _DESCRIPTOR
{
  /* 0x0000 */ unsigned short Pad;
  /* 0x0002 */ unsigned short Limit;
  /* 0x0004 */ unsigned long Base;
} DESCRIPTOR, *PDESCRIPTOR; /* size: 0x0008 */

typedef struct _DEVICE_CAPABILITIES
{
  /* 0x0000 */ unsigned short Size;
  /* 0x0002 */ unsigned short Version;
  struct /* bitfield */
  {
    /* 0x0004 */ unsigned long DeviceD1 : 1; /* bit position: 0 */
    /* 0x0004 */ unsigned long DeviceD2 : 1; /* bit position: 1 */
    /* 0x0004 */ unsigned long LockSupported : 1; /* bit position: 2 */
    /* 0x0004 */ unsigned long EjectSupported : 1; /* bit position: 3 */
    /* 0x0004 */ unsigned long Removable : 1; /* bit position: 4 */
    /* 0x0004 */ unsigned long DockDevice : 1; /* bit position: 5 */
    /* 0x0004 */ unsigned long UniqueID : 1; /* bit position: 6 */
    /* 0x0004 */ unsigned long SilentInstall : 1; /* bit position: 7 */
    /* 0x0004 */ unsigned long RawDeviceOK : 1; /* bit position: 8 */
    /* 0x0004 */ unsigned long SurpriseRemovalOK : 1; /* bit position: 9 */
    /* 0x0004 */ unsigned long WakeFromD0 : 1; /* bit position: 10 */
    /* 0x0004 */ unsigned long WakeFromD1 : 1; /* bit position: 11 */
    /* 0x0004 */ unsigned long WakeFromD2 : 1; /* bit position: 12 */
    /* 0x0004 */ unsigned long WakeFromD3 : 1; /* bit position: 13 */
    /* 0x0004 */ unsigned long HardwareDisabled : 1; /* bit position: 14 */
    /* 0x0004 */ unsigned long NonDynamic : 1; /* bit position: 15 */
    /* 0x0004 */ unsigned long WarmEjectSupported : 1; /* bit position: 16 */
    /* 0x0004 */ unsigned long NoDisplayInUI : 1; /* bit position: 17 */
    /* 0x0004 */ unsigned long Reserved : 14; /* bit position: 18 */
  }; /* bitfield */
  /* 0x0008 */ unsigned long Address;
  /* 0x000c */ unsigned long UINumber;
  /* 0x0010 */ enum _DEVICE_POWER_STATE DeviceState[7];
  /* 0x002c */ enum _SYSTEM_POWER_STATE SystemWake;
  /* 0x0030 */ enum _DEVICE_POWER_STATE DeviceWake;
  /* 0x0034 */ unsigned long D1Latency;
  /* 0x0038 */ unsigned long D2Latency;
  /* 0x003c */ unsigned long D3Latency;
} DEVICE_CAPABILITIES, *PDEVICE_CAPABILITIES; /* size: 0x0040 */

typedef struct _DEVICE_FLAGS
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned long Failed : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned long ReadOnly : 1; /* bit position: 1 */
    /* 0x0000 */ unsigned long Removable : 1; /* bit position: 2 */
    /* 0x0000 */ unsigned long ConsoleIn : 1; /* bit position: 3 */
    /* 0x0000 */ unsigned long ConsoleOut : 1; /* bit position: 4 */
    /* 0x0000 */ unsigned long Input : 1; /* bit position: 5 */
    /* 0x0000 */ unsigned long Output : 1; /* bit position: 6 */
  }; /* bitfield */
} DEVICE_FLAGS, *PDEVICE_FLAGS; /* size: 0x0004 */

typedef struct _DEVICE_MAP
{
  /* 0x0000 */ struct _OBJECT_DIRECTORY* DosDevicesDirectory;
  /* 0x0004 */ struct _OBJECT_DIRECTORY* GlobalDosDevicesDirectory;
  /* 0x0008 */ unsigned long ReferenceCount;
  /* 0x000c */ unsigned long DriveMap;
  /* 0x0010 */ unsigned char DriveType[32];
} DEVICE_MAP, *PDEVICE_MAP; /* size: 0x0030 */

typedef struct _DEVICE_NODE
{
  /* 0x0000 */ struct _DEVICE_NODE* Sibling;
  /* 0x0004 */ struct _DEVICE_NODE* Child;
  /* 0x0008 */ struct _DEVICE_NODE* Parent;
  /* 0x000c */ struct _DEVICE_NODE* LastChild;
  /* 0x0010 */ unsigned long Level;
  /* 0x0014 */ struct _PO_DEVICE_NOTIFY Notify;
  /* 0x0038 */ struct _PO_IRP_MANAGER PoIrpManager;
  /* 0x0048 */ enum _PNP_DEVNODE_STATE State;
  /* 0x004c */ enum _PNP_DEVNODE_STATE PreviousState;
  /* 0x0050 */ enum _PNP_DEVNODE_STATE StateHistory[20];
  /* 0x00a0 */ unsigned long StateHistoryEntry;
  /* 0x00a4 */ long CompletionStatus;
  /* 0x00a8 */ struct _IRP* PendingIrp;
  /* 0x00ac */ unsigned long Flags;
  /* 0x00b0 */ unsigned long UserFlags;
  /* 0x00b4 */ unsigned long Problem;
  /* 0x00b8 */ struct _DEVICE_OBJECT* PhysicalDeviceObject;
  /* 0x00bc */ struct _CM_RESOURCE_LIST* ResourceList;
  /* 0x00c0 */ struct _CM_RESOURCE_LIST* ResourceListTranslated;
  /* 0x00c4 */ struct _UNICODE_STRING InstancePath;
  /* 0x00cc */ struct _UNICODE_STRING ServiceName;
  /* 0x00d4 */ struct _DEVICE_OBJECT* DuplicatePDO;
  /* 0x00d8 */ struct _IO_RESOURCE_REQUIREMENTS_LIST* ResourceRequirements;
  /* 0x00dc */ enum _INTERFACE_TYPE InterfaceType;
  /* 0x00e0 */ unsigned long BusNumber;
  /* 0x00e4 */ enum _INTERFACE_TYPE ChildInterfaceType;
  /* 0x00e8 */ unsigned long ChildBusNumber;
  /* 0x00ec */ unsigned short ChildBusTypeIndex;
  /* 0x00ee */ unsigned char RemovalPolicy;
  /* 0x00ef */ unsigned char HardwareRemovalPolicy;
  /* 0x00f0 */ struct _LIST_ENTRY TargetDeviceNotify;
  /* 0x00f8 */ struct _LIST_ENTRY DeviceArbiterList;
  /* 0x0100 */ struct _LIST_ENTRY DeviceTranslatorList;
  /* 0x0108 */ unsigned short NoTranslatorMask;
  /* 0x010a */ unsigned short QueryTranslatorMask;
  /* 0x010c */ unsigned short NoArbiterMask;
  /* 0x010e */ unsigned short QueryArbiterMask;
  union
  {
    union
    {
      /* 0x0110 */ struct _DEVICE_NODE* LegacyDeviceNode;
      /* 0x0110 */ struct _DEVICE_RELATIONS* PendingDeviceRelations;
      /* 0x0110 */ void* Information;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ OverUsed1;
  union
  {
    /* 0x0114 */ struct _DEVICE_NODE* NextResourceDeviceNode;
  } /* size: 0x0004 */ OverUsed2;
  /* 0x0118 */ struct _CM_RESOURCE_LIST* BootResources;
  /* 0x011c */ struct _CM_RESOURCE_LIST* BootResourcesTranslated;
  /* 0x0120 */ unsigned long CapabilityFlags;
  struct
  {
    /* 0x0124 */ enum PROFILE_STATUS DockStatus;
    /* 0x0128 */ struct _LIST_ENTRY ListEntry;
    /* 0x0130 */ unsigned short* SerialNumber;
  } /* size: 0x0010 */ DockInfo;
  /* 0x0134 */ unsigned long DisableableDepends;
  /* 0x0138 */ struct _LIST_ENTRY PendedSetInterfaceState;
  /* 0x0140 */ struct _LIST_ENTRY LegacyBusListEntry;
  /* 0x0148 */ unsigned long DriverUnloadRetryCount;
  /* 0x014c */ struct _DEVICE_NODE* PreviousParent;
  /* 0x0150 */ unsigned long DeletedChildren;
  /* 0x0154 */ unsigned long NumaNodeIndex;
} DEVICE_NODE, *PDEVICE_NODE; /* size: 0x0158 */

typedef struct _DEVICE_OBJECT
{
  /* 0x0000 */ short Type;
  /* 0x0002 */ unsigned short Size;
  /* 0x0004 */ long ReferenceCount;
  /* 0x0008 */ struct _DRIVER_OBJECT* DriverObject;
  /* 0x000c */ struct _DEVICE_OBJECT* NextDevice;
  /* 0x0010 */ struct _DEVICE_OBJECT* AttachedDevice;
  /* 0x0014 */ struct _IRP* CurrentIrp;
  /* 0x0018 */ struct _IO_TIMER* Timer;
  /* 0x001c */ unsigned long Flags;
  /* 0x0020 */ unsigned long Characteristics;
  /* 0x0024 */ struct _VPB* Vpb;
  /* 0x0028 */ void* DeviceExtension;
  /* 0x002c */ unsigned long DeviceType;
  /* 0x0030 */ char StackSize;
  union
  {
    union
    {
      /* 0x0034 */ struct _LIST_ENTRY ListEntry;
      /* 0x0034 */ struct _WAIT_CONTEXT_BLOCK Wcb;
    }; /* size: 0x0028 */
  } /* size: 0x0028 */ Queue;
  /* 0x005c */ unsigned long AlignmentRequirement;
  /* 0x0060 */ struct _KDEVICE_QUEUE DeviceQueue;
  /* 0x0074 */ struct _KDPC Dpc;
  /* 0x0094 */ unsigned long ActiveThreadCount;
  /* 0x0098 */ void* SecurityDescriptor;
  /* 0x009c */ struct _KEVENT DeviceLock;
  /* 0x00ac */ unsigned short SectorSize;
  /* 0x00ae */ unsigned short Spare1;
  /* 0x00b0 */ struct _DEVOBJ_EXTENSION* DeviceObjectExtension;
  /* 0x00b4 */ void* Reserved;
} DEVICE_OBJECT, *PDEVICE_OBJECT; /* size: 0x00b8 */

typedef struct _DEVICE_OBJECT_POWER_EXTENSION
{
  /* 0x0000 */ volatile unsigned long IdleCount;
  /* 0x0004 */ volatile unsigned long BusyCount;
  /* 0x0008 */ unsigned long TotalBusyCount;
  /* 0x000c */ unsigned long ConservationIdleTime;
  /* 0x0010 */ unsigned long PerformanceIdleTime;
  /* 0x0014 */ struct _DEVICE_OBJECT* DeviceObject;
  /* 0x0018 */ struct _LIST_ENTRY IdleList;
  /* 0x0020 */ unsigned char DeviceType;
  /* 0x0024 */ enum _DEVICE_POWER_STATE IdleState;
  /* 0x0028 */ enum _DEVICE_POWER_STATE CurrentState;
  /* 0x002c */ struct _LIST_ENTRY NotifySourceList;
  /* 0x0034 */ struct _LIST_ENTRY NotifyTargetList;
  /* 0x003c */ struct _POWER_CHANNEL_SUMMARY PowerChannelSummary;
  /* 0x0050 */ struct _LIST_ENTRY Volume;
  union
  {
    struct
    {
      /* 0x0058 */ unsigned long IdleTime;
      /* 0x005c */ unsigned long NonIdleTime;
    } /* size: 0x0008 */ Disk;
  } /* size: 0x0008 */ Specific;
} DEVICE_OBJECT_POWER_EXTENSION, *PDEVICE_OBJECT_POWER_EXTENSION; /* size: 0x0060 */

typedef enum _DEVICE_POWER_STATE
{
  PowerDeviceUnspecified = 0,
  PowerDeviceD0 = 1,
  PowerDeviceD1 = 2,
  PowerDeviceD2 = 3,
  PowerDeviceD3 = 4,
  PowerDeviceMaximum = 5,
} DEVICE_POWER_STATE, *PDEVICE_POWER_STATE;

typedef struct _DEVICE_RELATIONS
{
  /* 0x0000 */ unsigned long Count;
  /* 0x0004 */ struct _DEVICE_OBJECT* Objects[1];
} DEVICE_RELATIONS, *PDEVICE_RELATIONS; /* size: 0x0008 */

typedef enum _DEVICE_RELATION_TYPE
{
  BusRelations = 0,
  EjectionRelations = 1,
  PowerRelations = 2,
  RemovalRelations = 3,
  TargetDeviceRelation = 4,
  SingleBusRelations = 5,
} DEVICE_RELATION_TYPE, *PDEVICE_RELATION_TYPE;

typedef enum _DEVICE_USAGE_NOTIFICATION_TYPE
{
  DeviceUsageTypeUndefined = 0,
  DeviceUsageTypePaging = 1,
  DeviceUsageTypeHibernation = 2,
  DeviceUsageTypeDumpFile = 3,
} DEVICE_USAGE_NOTIFICATION_TYPE, *PDEVICE_USAGE_NOTIFICATION_TYPE;

typedef struct _DEVOBJ_EXTENSION
{
  /* 0x0000 */ short Type;
  /* 0x0002 */ unsigned short Size;
  /* 0x0004 */ struct _DEVICE_OBJECT* DeviceObject;
  /* 0x0008 */ unsigned long PowerFlags;
  /* 0x000c */ struct _DEVICE_OBJECT_POWER_EXTENSION* Dope;
  /* 0x0010 */ unsigned long ExtensionFlags;
  /* 0x0014 */ void* DeviceNode;
  /* 0x0018 */ struct _DEVICE_OBJECT* AttachedTo;
  /* 0x001c */ long StartIoCount;
  /* 0x0020 */ long StartIoKey;
  /* 0x0024 */ unsigned long StartIoFlags;
  /* 0x0028 */ struct _VPB* Vpb;
  /* 0x002c */ struct _LIST_ENTRY DependentList;
  /* 0x0034 */ struct _LIST_ENTRY ProviderList;
} DEVOBJ_EXTENSION, *PDEVOBJ_EXTENSION; /* size: 0x003c */

typedef struct _DEVPROPKEY
{
  /* 0x0000 */ struct _GUID fmtid;
  /* 0x0010 */ unsigned long pid;
} DEVPROPKEY, *PDEVPROPKEY; /* size: 0x0014 */

typedef struct _DISPATCHER_HEADER
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned char Type;
      union
      {
        /* 0x0001 */ unsigned char Abandoned;
        /* 0x0001 */ unsigned char Absolute;
        /* 0x0001 */ unsigned char NpxIrql;
        struct
        {
          /* 0x0001 */ unsigned char Signalling;
          union
          {
            /* 0x0002 */ unsigned char Size;
            struct
            {
              /* 0x0002 */ unsigned char Hand;
              union
              {
                /* 0x0003 */ unsigned char Inserted;
                /* 0x0003 */ unsigned char DebugActive;
                /* 0x0003 */ unsigned char DpcActive;
              }; /* size: 0x0001 */
            }; /* size: 0x0002 */
          }; /* size: 0x0002 */
        }; /* size: 0x0003 */
      }; /* size: 0x0003 */
    }; /* size: 0x0004 */
    /* 0x0000 */ volatile long Lock;
  }; /* size: 0x0004 */
  /* 0x0004 */ long SignalState;
  /* 0x0008 */ struct _LIST_ENTRY WaitListHead;
} DISPATCHER_HEADER, *PDISPATCHER_HEADER; /* size: 0x0010 */

typedef enum _DPFLTR_TYPE
{
  DPFLTR_SYSTEM_ID = 0,
  DPFLTR_SMSS_ID = 1,
  DPFLTR_SETUP_ID = 2,
  DPFLTR_NTFS_ID = 3,
  DPFLTR_FSTUB_ID = 4,
  DPFLTR_CRASHDUMP_ID = 5,
  DPFLTR_CDAUDIO_ID = 6,
  DPFLTR_CDROM_ID = 7,
  DPFLTR_CLASSPNP_ID = 8,
  DPFLTR_DISK_ID = 9,
  DPFLTR_REDBOOK_ID = 10,
  DPFLTR_STORPROP_ID = 11,
  DPFLTR_SCSIPORT_ID = 12,
  DPFLTR_SCSIMINIPORT_ID = 13,
  DPFLTR_CONFIG_ID = 14,
  DPFLTR_I8042PRT_ID = 15,
  DPFLTR_SERMOUSE_ID = 16,
  DPFLTR_LSERMOUS_ID = 17,
  DPFLTR_KBDHID_ID = 18,
  DPFLTR_MOUHID_ID = 19,
  DPFLTR_KBDCLASS_ID = 20,
  DPFLTR_MOUCLASS_ID = 21,
  DPFLTR_TWOTRACK_ID = 22,
  DPFLTR_WMILIB_ID = 23,
  DPFLTR_ACPI_ID = 24,
  DPFLTR_AMLI_ID = 25,
  DPFLTR_HALIA64_ID = 26,
  DPFLTR_VIDEO_ID = 27,
  DPFLTR_SVCHOST_ID = 28,
  DPFLTR_VIDEOPRT_ID = 29,
  DPFLTR_TCPIP_ID = 30,
  DPFLTR_DMSYNTH_ID = 31,
  DPFLTR_NTOSPNP_ID = 32,
  DPFLTR_FASTFAT_ID = 33,
  DPFLTR_SAMSS_ID = 34,
  DPFLTR_PNPMGR_ID = 35,
  DPFLTR_NETAPI_ID = 36,
  DPFLTR_SCSERVER_ID = 37,
  DPFLTR_SCCLIENT_ID = 38,
  DPFLTR_SERIAL_ID = 39,
  DPFLTR_SERENUM_ID = 40,
  DPFLTR_UHCD_ID = 41,
  DPFLTR_RPCPROXY_ID = 42,
  DPFLTR_AUTOCHK_ID = 43,
  DPFLTR_DCOMSS_ID = 44,
  DPFLTR_UNIMODEM_ID = 45,
  DPFLTR_SIS_ID = 46,
  DPFLTR_FLTMGR_ID = 47,
  DPFLTR_WMICORE_ID = 48,
  DPFLTR_BURNENG_ID = 49,
  DPFLTR_IMAPI_ID = 50,
  DPFLTR_SXS_ID = 51,
  DPFLTR_FUSION_ID = 52,
  DPFLTR_IDLETASK_ID = 53,
  DPFLTR_SOFTPCI_ID = 54,
  DPFLTR_TAPE_ID = 55,
  DPFLTR_MCHGR_ID = 56,
  DPFLTR_IDEP_ID = 57,
  DPFLTR_PCIIDE_ID = 58,
  DPFLTR_FLOPPY_ID = 59,
  DPFLTR_FDC_ID = 60,
  DPFLTR_TERMSRV_ID = 61,
  DPFLTR_W32TIME_ID = 62,
  DPFLTR_PREFETCHER_ID = 63,
  DPFLTR_RSFILTER_ID = 64,
  DPFLTR_FCPORT_ID = 65,
  DPFLTR_PCI_ID = 66,
  DPFLTR_DMIO_ID = 67,
  DPFLTR_DMCONFIG_ID = 68,
  DPFLTR_DMADMIN_ID = 69,
  DPFLTR_WSOCKTRANSPORT_ID = 70,
  DPFLTR_VSS_ID = 71,
  DPFLTR_PNPMEM_ID = 72,
  DPFLTR_PROCESSOR_ID = 73,
  DPFLTR_DMSERVER_ID = 74,
  DPFLTR_SR_ID = 75,
  DPFLTR_INFINIBAND_ID = 76,
  DPFLTR_IHVDRIVER_ID = 77,
  DPFLTR_IHVVIDEO_ID = 78,
  DPFLTR_IHVAUDIO_ID = 79,
  DPFLTR_IHVNETWORK_ID = 80,
  DPFLTR_IHVSTREAMING_ID = 81,
  DPFLTR_IHVBUS_ID = 82,
  DPFLTR_HPS_ID = 83,
  DPFLTR_RTLTHREADPOOL_ID = 84,
  DPFLTR_LDR_ID = 85,
  DPFLTR_TCPIP6_ID = 86,
  DPFLTR_ISAPNP_ID = 87,
  DPFLTR_SHPC_ID = 88,
  DPFLTR_STORPORT_ID = 89,
  DPFLTR_STORMINIPORT_ID = 90,
  DPFLTR_PRINTSPOOLER_ID = 91,
  DPFLTR_VSSDYNDISK_ID = 92,
  DPFLTR_VERIFIER_ID = 93,
  DPFLTR_VDS_ID = 94,
  DPFLTR_VDSBAS_ID = 95,
  DPFLTR_VDSDYN_ID = 96,
  DPFLTR_VDSDYNDR_ID = 97,
  DPFLTR_VDSLDR_ID = 98,
  DPFLTR_VDSUTIL_ID = 99,
  DPFLTR_DFRGIFC_ID = 100,
  DPFLTR_DEFAULT_ID = 101,
  DPFLTR_MM_ID = 102,
  DPFLTR_DFSC_ID = 103,
  DPFLTR_WOW64_ID = 104,
  DPFLTR_ALPC_ID = 105,
  DPFLTR_WDI_ID = 106,
  DPFLTR_PERFLIB_ID = 107,
  DPFLTR_KTM_ID = 108,
  DPFLTR_IOSTRESS_ID = 109,
  DPFLTR_HEAP_ID = 110,
  DPFLTR_WHEA_ID = 111,
  DPFLTR_USERGDI_ID = 112,
  DPFLTR_MMCSS_ID = 113,
  DPFLTR_TPM_ID = 114,
  DPFLTR_THREADORDER_ID = 115,
  DPFLTR_ENVIRON_ID = 116,
  DPFLTR_EMS_ID = 117,
  DPFLTR_WDT_ID = 118,
  DPFLTR_FVEVOL_ID = 119,
  DPFLTR_NDIS_ID = 120,
  DPFLTR_NVCTRACE_ID = 121,
  DPFLTR_LUAFV_ID = 122,
  DPFLTR_APPCOMPAT_ID = 123,
  DPFLTR_USBSTOR_ID = 124,
  DPFLTR_SBP2PORT_ID = 125,
  DPFLTR_COVERAGE_ID = 126,
  DPFLTR_CACHEMGR_ID = 127,
  DPFLTR_MOUNTMGR_ID = 128,
  DPFLTR_CFR_ID = 129,
  DPFLTR_TXF_ID = 130,
  DPFLTR_KSECDD_ID = 131,
  DPFLTR_FLTREGRESS_ID = 132,
  DPFLTR_MPIO_ID = 133,
  DPFLTR_MSDSM_ID = 134,
  DPFLTR_UDFS_ID = 135,
  DPFLTR_PSHED_ID = 136,
  DPFLTR_STORVSP_ID = 137,
  DPFLTR_EXFAT_ID = 138,
  DPFLTR_ENDOFTABLE_ID = 139,
} DPFLTR_TYPE, *PDPFLTR_TYPE;

typedef struct _DRIVER_EXTENSION
{
  /* 0x0000 */ struct _DRIVER_OBJECT* DriverObject;
  /* 0x0004 */ void* AddDevice /* function */;
  /* 0x0008 */ unsigned long Count;
  /* 0x000c */ struct _UNICODE_STRING ServiceKeyName;
  /* 0x0014 */ struct _IO_CLIENT_EXTENSION* ClientDriverExtension;
  /* 0x0018 */ struct _FS_FILTER_CALLBACKS* FsFilterCallbacks;
} DRIVER_EXTENSION, *PDRIVER_EXTENSION; /* size: 0x001c */

typedef struct _DRIVER_OBJECT
{
  /* 0x0000 */ short Type;
  /* 0x0002 */ short Size;
  /* 0x0004 */ struct _DEVICE_OBJECT* DeviceObject;
  /* 0x0008 */ unsigned long Flags;
  /* 0x000c */ void* DriverStart;
  /* 0x0010 */ unsigned long DriverSize;
  /* 0x0014 */ void* DriverSection;
  /* 0x0018 */ struct _DRIVER_EXTENSION* DriverExtension;
  /* 0x001c */ struct _UNICODE_STRING DriverName;
  /* 0x0024 */ struct _UNICODE_STRING* HardwareDatabase;
  /* 0x0028 */ struct _FAST_IO_DISPATCH* FastIoDispatch;
  /* 0x002c */ void* DriverInit /* function */;
  /* 0x0030 */ void* DriverStartIo /* function */;
  /* 0x0034 */ void* DriverUnload /* function */;
  /* 0x0038 */ void* MajorFunction[28] /* function */;
} DRIVER_OBJECT, *PDRIVER_OBJECT; /* size: 0x00a8 */

typedef struct _DUAL
{
  /* 0x0000 */ unsigned long Length;
  /* 0x0004 */ struct _HMAP_DIRECTORY* Map;
  /* 0x0008 */ struct _HMAP_TABLE* SmallDir;
  /* 0x000c */ unsigned long Guard;
  /* 0x0010 */ struct _FREE_DISPLAY FreeDisplay[24];
  /* 0x0130 */ unsigned long FreeSummary;
  /* 0x0134 */ struct _LIST_ENTRY FreeBins;
} DUAL, *PDUAL; /* size: 0x013c */

typedef struct _DUMP_INITIALIZATION_CONTEXT
{
  /* 0x0000 */ unsigned long Length;
  /* 0x0004 */ unsigned long Reserved;
  /* 0x0008 */ void* MemoryBlock;
  /* 0x000c */ void* CommonBuffer[2];
  /* 0x0018 */ union _LARGE_INTEGER PhysicalAddress[2];
  /* 0x0028 */ void* StallRoutine /* function */;
  /* 0x002c */ void* OpenRoutine /* function */;
  /* 0x0030 */ void* WriteRoutine /* function */;
  /* 0x0034 */ void* FinishRoutine /* function */;
  /* 0x0038 */ struct _ADAPTER_OBJECT* AdapterObject;
  /* 0x003c */ void* MappedRegisterBase;
  /* 0x0040 */ void* PortConfiguration;
  /* 0x0044 */ unsigned char CrashDump;
  /* 0x0048 */ unsigned long MaximumTransferSize;
  /* 0x004c */ unsigned long CommonBufferSize;
  /* 0x0050 */ void* TargetAddress;
  /* 0x0054 */ void* WritePendingRoutine /* function */;
  /* 0x0058 */ unsigned long PartitionStyle;
  union
  {
    union
    {
      struct
      {
        /* 0x005c */ unsigned long Signature;
        /* 0x0060 */ unsigned long CheckSum;
      } /* size: 0x0008 */ Mbr;
      struct
      {
        /* 0x005c */ struct _GUID DiskId;
      } /* size: 0x0010 */ Gpt;
    }; /* size: 0x0010 */
  } /* size: 0x0010 */ DiskInfo;
  /* 0x006c */ long __PADDING__[1];
} DUMP_INITIALIZATION_CONTEXT, *PDUMP_INITIALIZATION_CONTEXT; /* size: 0x0070 */

typedef struct _DUMP_STACK_CONTEXT
{
  /* 0x0000 */ struct _DUMP_INITIALIZATION_CONTEXT Init;
  /* 0x0070 */ union _LARGE_INTEGER PartitionOffset;
  /* 0x0078 */ void* DumpPointers;
  /* 0x007c */ unsigned long PointersLength;
  /* 0x0080 */ unsigned short* ModulePrefix;
  /* 0x0084 */ struct _LIST_ENTRY DriverList;
  /* 0x008c */ struct _STRING InitMsg;
  /* 0x0094 */ struct _STRING ProgMsg;
  /* 0x009c */ struct _STRING DoneMsg;
  /* 0x00a4 */ void* FileObject;
  /* 0x00a8 */ enum _DEVICE_USAGE_NOTIFICATION_TYPE UsageType;
  /* 0x00ac */ long __PADDING__[1];
} DUMP_STACK_CONTEXT, *PDUMP_STACK_CONTEXT; /* size: 0x00b0 */

struct _ECP_LIST;

typedef struct _EFI_FIRMWARE_INFORMATION
{
  /* 0x0000 */ unsigned long FirmwareVersion;
  /* 0x0004 */ struct _VIRTUAL_EFI_RUNTIME_SERVICES* VirtualEfiRuntimeServices;
  /* 0x0008 */ long SetVirtualAddressMapStatus;
  /* 0x000c */ unsigned long MissedMappingsCount;
} EFI_FIRMWARE_INFORMATION, *PEFI_FIRMWARE_INFORMATION; /* size: 0x0010 */

typedef struct _EJOB
{
  /* 0x0000 */ struct _KEVENT Event;
  /* 0x0010 */ struct _LIST_ENTRY JobLinks;
  /* 0x0018 */ struct _LIST_ENTRY ProcessListHead;
  /* 0x0020 */ struct _ERESOURCE JobLock;
  /* 0x0058 */ union _LARGE_INTEGER TotalUserTime;
  /* 0x0060 */ union _LARGE_INTEGER TotalKernelTime;
  /* 0x0068 */ union _LARGE_INTEGER ThisPeriodTotalUserTime;
  /* 0x0070 */ union _LARGE_INTEGER ThisPeriodTotalKernelTime;
  /* 0x0078 */ unsigned long TotalPageFaultCount;
  /* 0x007c */ unsigned long TotalProcesses;
  /* 0x0080 */ unsigned long ActiveProcesses;
  /* 0x0084 */ unsigned long TotalTerminatedProcesses;
  /* 0x0088 */ union _LARGE_INTEGER PerProcessUserTimeLimit;
  /* 0x0090 */ union _LARGE_INTEGER PerJobUserTimeLimit;
  /* 0x0098 */ unsigned long LimitFlags;
  /* 0x009c */ unsigned long MinimumWorkingSetSize;
  /* 0x00a0 */ unsigned long MaximumWorkingSetSize;
  /* 0x00a4 */ unsigned long ActiveProcessLimit;
  /* 0x00a8 */ unsigned long Affinity;
  /* 0x00ac */ unsigned char PriorityClass;
  /* 0x00b0 */ struct _JOB_ACCESS_STATE* AccessState;
  /* 0x00b4 */ unsigned long UIRestrictionsClass;
  /* 0x00b8 */ unsigned long EndOfJobTimeAction;
  /* 0x00bc */ void* CompletionPort;
  /* 0x00c0 */ void* CompletionKey;
  /* 0x00c4 */ unsigned long SessionId;
  /* 0x00c8 */ unsigned long SchedulingClass;
  /* 0x00d0 */ unsigned __int64 ReadOperationCount;
  /* 0x00d8 */ unsigned __int64 WriteOperationCount;
  /* 0x00e0 */ unsigned __int64 OtherOperationCount;
  /* 0x00e8 */ unsigned __int64 ReadTransferCount;
  /* 0x00f0 */ unsigned __int64 WriteTransferCount;
  /* 0x00f8 */ unsigned __int64 OtherTransferCount;
  /* 0x0100 */ unsigned long ProcessMemoryLimit;
  /* 0x0104 */ unsigned long JobMemoryLimit;
  /* 0x0108 */ unsigned long PeakProcessMemoryUsed;
  /* 0x010c */ unsigned long PeakJobMemoryUsed;
  /* 0x0110 */ unsigned long CurrentJobMemoryUsed;
  /* 0x0114 */ struct _EX_PUSH_LOCK MemoryLimitsLock;
  /* 0x0118 */ struct _LIST_ENTRY JobSetLinks;
  /* 0x0120 */ unsigned long MemberLevel;
  /* 0x0124 */ unsigned long JobFlags;
} EJOB, *PEJOB; /* size: 0x0128 */

typedef struct _EPROCESS
{
  /* 0x0000 */ struct _KPROCESS Pcb;
  /* 0x0080 */ struct _EX_PUSH_LOCK ProcessLock;
  /* 0x0088 */ union _LARGE_INTEGER CreateTime;
  /* 0x0090 */ union _LARGE_INTEGER ExitTime;
  /* 0x0098 */ struct _EX_RUNDOWN_REF RundownProtect;
  /* 0x009c */ void* UniqueProcessId;
  /* 0x00a0 */ struct _LIST_ENTRY ActiveProcessLinks;
  /* 0x00a8 */ unsigned long QuotaUsage[3];
  /* 0x00b4 */ unsigned long QuotaPeak[3];
  /* 0x00c0 */ volatile unsigned long CommitCharge;
  /* 0x00c4 */ unsigned long PeakVirtualSize;
  /* 0x00c8 */ unsigned long VirtualSize;
  /* 0x00cc */ struct _LIST_ENTRY SessionProcessLinks;
  /* 0x00d4 */ void* DebugPort;
  union
  {
    /* 0x00d8 */ void* ExceptionPortData;
    /* 0x00d8 */ unsigned long ExceptionPortValue;
    /* 0x00d8 */ unsigned long ExceptionPortState : 3; /* bit position: 0 */
  }; /* size: 0x0004 */
  /* 0x00dc */ struct _HANDLE_TABLE* ObjectTable;
  /* 0x00e0 */ struct _EX_FAST_REF Token;
  /* 0x00e4 */ unsigned long WorkingSetPage;
  /* 0x00e8 */ struct _EX_PUSH_LOCK AddressCreationLock;
  /* 0x00ec */ struct _ETHREAD* RotateInProgress;
  /* 0x00f0 */ struct _ETHREAD* ForkInProgress;
  /* 0x00f4 */ unsigned long HardwareTrigger;
  /* 0x00f8 */ struct _MM_AVL_TABLE* PhysicalVadRoot;
  /* 0x00fc */ void* CloneRoot;
  /* 0x0100 */ volatile unsigned long NumberOfPrivatePages;
  /* 0x0104 */ volatile unsigned long NumberOfLockedPages;
  /* 0x0108 */ void* Win32Process;
  /* 0x010c */ struct _EJOB* Job;
  /* 0x0110 */ void* SectionObject;
  /* 0x0114 */ void* SectionBaseAddress;
  /* 0x0118 */ struct _EPROCESS_QUOTA_BLOCK* QuotaBlock;
  /* 0x011c */ struct _PAGEFAULT_HISTORY* WorkingSetWatch;
  /* 0x0120 */ void* Win32WindowStation;
  /* 0x0124 */ void* InheritedFromUniqueProcessId;
  /* 0x0128 */ void* LdtInformation;
  /* 0x012c */ void* Spare;
  /* 0x0130 */ void* VdmObjects;
  /* 0x0134 */ void* DeviceMap;
  /* 0x0138 */ void* EtwDataSource;
  /* 0x013c */ void* FreeTebHint;
  union
  {
    /* 0x0140 */ struct _HARDWARE_PTE PageDirectoryPte;
    /* 0x0140 */ unsigned __int64 Filler;
  }; /* size: 0x0008 */
  /* 0x0148 */ void* Session;
  /* 0x014c */ unsigned char ImageFileName[16];
  /* 0x015c */ struct _LIST_ENTRY JobLinks;
  /* 0x0164 */ void* LockedPagesList;
  /* 0x0168 */ struct _LIST_ENTRY ThreadListHead;
  /* 0x0170 */ void* SecurityPort;
  /* 0x0174 */ void* PaeTop;
  /* 0x0178 */ volatile unsigned long ActiveThreads;
  /* 0x017c */ unsigned long ImagePathHash;
  /* 0x0180 */ unsigned long DefaultHardErrorProcessing;
  /* 0x0184 */ long LastThreadExitStatus;
  /* 0x0188 */ struct _PEB* Peb;
  /* 0x018c */ struct _EX_FAST_REF PrefetchTrace;
  /* 0x0190 */ union _LARGE_INTEGER ReadOperationCount;
  /* 0x0198 */ union _LARGE_INTEGER WriteOperationCount;
  /* 0x01a0 */ union _LARGE_INTEGER OtherOperationCount;
  /* 0x01a8 */ union _LARGE_INTEGER ReadTransferCount;
  /* 0x01b0 */ union _LARGE_INTEGER WriteTransferCount;
  /* 0x01b8 */ union _LARGE_INTEGER OtherTransferCount;
  /* 0x01c0 */ unsigned long CommitChargeLimit;
  /* 0x01c4 */ volatile unsigned long CommitChargePeak;
  /* 0x01c8 */ void* AweInfo;
  /* 0x01cc */ struct _SE_AUDIT_PROCESS_CREATION_INFO SeAuditProcessCreationInfo;
  /* 0x01d0 */ struct _MMSUPPORT Vm;
  /* 0x0218 */ struct _LIST_ENTRY MmProcessLinks;
  /* 0x0220 */ unsigned long ModifiedPageCount;
  union
  {
    /* 0x0224 */ unsigned long Flags2;
    struct /* bitfield */
    {
      /* 0x0224 */ unsigned long JobNotReallyActive : 1; /* bit position: 0 */
      /* 0x0224 */ unsigned long AccountingFolded : 1; /* bit position: 1 */
      /* 0x0224 */ unsigned long NewProcessReported : 1; /* bit position: 2 */
      /* 0x0224 */ unsigned long ExitProcessReported : 1; /* bit position: 3 */
      /* 0x0224 */ unsigned long ReportCommitChanges : 1; /* bit position: 4 */
      /* 0x0224 */ unsigned long LastReportMemory : 1; /* bit position: 5 */
      /* 0x0224 */ unsigned long ReportPhysicalPageChanges : 1; /* bit position: 6 */
      /* 0x0224 */ unsigned long HandleTableRundown : 1; /* bit position: 7 */
      /* 0x0224 */ unsigned long NeedsHandleRundown : 1; /* bit position: 8 */
      /* 0x0224 */ unsigned long RefTraceEnabled : 1; /* bit position: 9 */
      /* 0x0224 */ unsigned long NumaAware : 1; /* bit position: 10 */
      /* 0x0224 */ unsigned long ProtectedProcess : 1; /* bit position: 11 */
      /* 0x0224 */ unsigned long DefaultPagePriority : 3; /* bit position: 12 */
      /* 0x0224 */ unsigned long PrimaryTokenFrozen : 1; /* bit position: 15 */
      /* 0x0224 */ unsigned long ProcessVerifierTarget : 1; /* bit position: 16 */
      /* 0x0224 */ unsigned long StackRandomizationDisabled : 1; /* bit position: 17 */
      /* 0x0224 */ unsigned long AffinityPermanent : 1; /* bit position: 18 */
      /* 0x0224 */ unsigned long AffinityUpdateEnable : 1; /* bit position: 19 */
      /* 0x0224 */ unsigned long CrossSessionCreate : 1; /* bit position: 20 */
    }; /* bitfield */
  }; /* size: 0x0004 */
  union
  {
    /* 0x0228 */ unsigned long Flags;
    struct /* bitfield */
    {
      /* 0x0228 */ unsigned long CreateReported : 1; /* bit position: 0 */
      /* 0x0228 */ unsigned long NoDebugInherit : 1; /* bit position: 1 */
      /* 0x0228 */ unsigned long ProcessExiting : 1; /* bit position: 2 */
      /* 0x0228 */ unsigned long ProcessDelete : 1; /* bit position: 3 */
      /* 0x0228 */ unsigned long Wow64SplitPages : 1; /* bit position: 4 */
      /* 0x0228 */ unsigned long VmDeleted : 1; /* bit position: 5 */
      /* 0x0228 */ unsigned long OutswapEnabled : 1; /* bit position: 6 */
      /* 0x0228 */ unsigned long Outswapped : 1; /* bit position: 7 */
      /* 0x0228 */ unsigned long ForkFailed : 1; /* bit position: 8 */
      /* 0x0228 */ unsigned long Wow64VaSpace4Gb : 1; /* bit position: 9 */
      /* 0x0228 */ unsigned long AddressSpaceInitialized : 2; /* bit position: 10 */
      /* 0x0228 */ unsigned long SetTimerResolution : 1; /* bit position: 12 */
      /* 0x0228 */ unsigned long BreakOnTermination : 1; /* bit position: 13 */
      /* 0x0228 */ unsigned long DeprioritizeViews : 1; /* bit position: 14 */
      /* 0x0228 */ unsigned long WriteWatch : 1; /* bit position: 15 */
      /* 0x0228 */ unsigned long ProcessInSession : 1; /* bit position: 16 */
      /* 0x0228 */ unsigned long OverrideAddressSpace : 1; /* bit position: 17 */
      /* 0x0228 */ unsigned long HasAddressSpace : 1; /* bit position: 18 */
      /* 0x0228 */ unsigned long LaunchPrefetched : 1; /* bit position: 19 */
      /* 0x0228 */ unsigned long InjectInpageErrors : 1; /* bit position: 20 */
      /* 0x0228 */ unsigned long VmTopDown : 1; /* bit position: 21 */
      /* 0x0228 */ unsigned long ImageNotifyDone : 1; /* bit position: 22 */
      /* 0x0228 */ unsigned long PdeUpdateNeeded : 1; /* bit position: 23 */
      /* 0x0228 */ unsigned long VdmAllowed : 1; /* bit position: 24 */
      /* 0x0228 */ unsigned long SmapAllowed : 1; /* bit position: 25 */
      /* 0x0228 */ unsigned long ProcessInserted : 1; /* bit position: 26 */
      /* 0x0228 */ unsigned long DefaultIoPriority : 3; /* bit position: 27 */
      /* 0x0228 */ unsigned long ProcessSelfDelete : 1; /* bit position: 30 */
      /* 0x0228 */ unsigned long SpareProcessFlags : 1; /* bit position: 31 */
    }; /* bitfield */
  }; /* size: 0x0004 */
  /* 0x022c */ long ExitStatus;
  /* 0x0230 */ unsigned short Spare7;
  union
  {
    struct
    {
      /* 0x0232 */ unsigned char SubSystemMinorVersion;
      /* 0x0233 */ unsigned char SubSystemMajorVersion;
    }; /* size: 0x0002 */
    /* 0x0232 */ unsigned short SubSystemVersion;
  }; /* size: 0x0002 */
  /* 0x0234 */ unsigned char PriorityClass;
  /* 0x0238 */ struct _MM_AVL_TABLE VadRoot;
  /* 0x0258 */ unsigned long Cookie;
  /* 0x025c */ struct _ALPC_PROCESS_CONTEXT AlpcContext;
  /* 0x026c */ long __PADDING__[1];
} EPROCESS, *PEPROCESS; /* size: 0x0270 */

struct _EPROCESS_QUOTA_BLOCK;

typedef struct _ERESOURCE
{
  /* 0x0000 */ struct _LIST_ENTRY SystemResourcesList;
  /* 0x0008 */ struct _OWNER_ENTRY* OwnerTable;
  /* 0x000c */ short ActiveCount;
  /* 0x000e */ unsigned short Flag;
  /* 0x0010 */ struct _KSEMAPHORE* SharedWaiters;
  /* 0x0014 */ struct _KEVENT* ExclusiveWaiters;
  /* 0x0018 */ struct _OWNER_ENTRY OwnerEntry;
  /* 0x0020 */ unsigned long ActiveEntries;
  /* 0x0024 */ unsigned long ContentionCount;
  /* 0x0028 */ unsigned long NumberOfSharedWaiters;
  /* 0x002c */ unsigned long NumberOfExclusiveWaiters;
  union
  {
    /* 0x0030 */ void* Address;
    /* 0x0030 */ unsigned long CreatorBackTraceIndex;
  }; /* size: 0x0004 */
  /* 0x0034 */ unsigned long SpinLock;
} ERESOURCE, *PERESOURCE; /* size: 0x0038 */

typedef struct _ETHREAD
{
  /* 0x0000 */ struct _KTHREAD Tcb;
  /* 0x01e0 */ union _LARGE_INTEGER CreateTime;
  union
  {
    /* 0x01e8 */ union _LARGE_INTEGER ExitTime;
    /* 0x01e8 */ struct _LIST_ENTRY KeyedWaitChain;
  }; /* size: 0x0008 */
  union
  {
    /* 0x01f0 */ long ExitStatus;
    /* 0x01f0 */ void* OfsChain;
  }; /* size: 0x0004 */
  union
  {
    /* 0x01f4 */ struct _LIST_ENTRY PostBlockList;
    struct
    {
      /* 0x01f4 */ void* ForwardLinkShadow;
      /* 0x01f8 */ void* StartAddress;
    }; /* size: 0x0008 */
  }; /* size: 0x0008 */
  union
  {
    /* 0x01fc */ struct _TERMINATION_PORT* TerminationPort;
    /* 0x01fc */ struct _ETHREAD* ReaperLink;
    /* 0x01fc */ void* KeyedWaitValue;
    /* 0x01fc */ void* Win32StartParameter;
  }; /* size: 0x0004 */
  /* 0x0200 */ unsigned long ActiveTimerListLock;
  /* 0x0204 */ struct _LIST_ENTRY ActiveTimerListHead;
  /* 0x020c */ struct _CLIENT_ID Cid;
  union
  {
    /* 0x0214 */ struct _KSEMAPHORE KeyedWaitSemaphore;
    /* 0x0214 */ struct _KSEMAPHORE AlpcWaitSemaphore;
  }; /* size: 0x0014 */
  /* 0x0228 */ union _PS_CLIENT_SECURITY_CONTEXT ClientSecurity;
  /* 0x022c */ struct _LIST_ENTRY IrpList;
  /* 0x0234 */ unsigned long TopLevelIrp;
  /* 0x0238 */ struct _DEVICE_OBJECT* DeviceToVerify;
  /* 0x023c */ union _PSP_RATE_APC* RateControlApc;
  /* 0x0240 */ void* Win32StartAddress;
  /* 0x0244 */ void* SparePtr0;
  /* 0x0248 */ struct _LIST_ENTRY ThreadListEntry;
  /* 0x0250 */ struct _EX_RUNDOWN_REF RundownProtect;
  /* 0x0254 */ struct _EX_PUSH_LOCK ThreadLock;
  /* 0x0258 */ unsigned long ReadClusterSize;
  /* 0x025c */ volatile long MmLockOrdering;
  union
  {
    /* 0x0260 */ unsigned long CrossThreadFlags;
    struct /* bitfield */
    {
      /* 0x0260 */ unsigned long Terminated : 1; /* bit position: 0 */
      /* 0x0260 */ unsigned long ThreadInserted : 1; /* bit position: 1 */
      /* 0x0260 */ unsigned long HideFromDebugger : 1; /* bit position: 2 */
      /* 0x0260 */ unsigned long ActiveImpersonationInfo : 1; /* bit position: 3 */
      /* 0x0260 */ unsigned long SystemThread : 1; /* bit position: 4 */
      /* 0x0260 */ unsigned long HardErrorsAreDisabled : 1; /* bit position: 5 */
      /* 0x0260 */ unsigned long BreakOnTermination : 1; /* bit position: 6 */
      /* 0x0260 */ unsigned long SkipCreationMsg : 1; /* bit position: 7 */
      /* 0x0260 */ unsigned long SkipTerminationMsg : 1; /* bit position: 8 */
      /* 0x0260 */ unsigned long CopyTokenOnOpen : 1; /* bit position: 9 */
      /* 0x0260 */ unsigned long ThreadIoPriority : 3; /* bit position: 10 */
      /* 0x0260 */ unsigned long ThreadPagePriority : 3; /* bit position: 13 */
      /* 0x0260 */ unsigned long RundownFail : 1; /* bit position: 16 */
    }; /* bitfield */
  }; /* size: 0x0004 */
  union
  {
    /* 0x0264 */ unsigned long SameThreadPassiveFlags;
    struct /* bitfield */
    {
      /* 0x0264 */ unsigned long ActiveExWorker : 1; /* bit position: 0 */
      /* 0x0264 */ unsigned long ExWorkerCanWaitUser : 1; /* bit position: 1 */
      /* 0x0264 */ unsigned long MemoryMaker : 1; /* bit position: 2 */
      /* 0x0264 */ unsigned long ClonedThread : 1; /* bit position: 3 */
      /* 0x0264 */ unsigned long KeyedEventInUse : 1; /* bit position: 4 */
      /* 0x0264 */ unsigned long RateApcState : 2; /* bit position: 5 */
      /* 0x0264 */ unsigned long SelfTerminate : 1; /* bit position: 7 */
    }; /* bitfield */
  }; /* size: 0x0004 */
  union
  {
    /* 0x0268 */ unsigned long SameThreadApcFlags;
    struct
    {
      struct /* bitfield */
      {
        /* 0x0268 */ unsigned char Spare : 1; /* bit position: 0 */
        /* 0x0268 */ volatile unsigned char StartAddressInvalid : 1; /* bit position: 1 */
        /* 0x0268 */ unsigned char EtwPageFaultCalloutActive : 1; /* bit position: 2 */
        /* 0x0268 */ unsigned char OwnsProcessWorkingSetExclusive : 1; /* bit position: 3 */
        /* 0x0268 */ unsigned char OwnsProcessWorkingSetShared : 1; /* bit position: 4 */
        /* 0x0268 */ unsigned char OwnsSystemWorkingSetExclusive : 1; /* bit position: 5 */
        /* 0x0268 */ unsigned char OwnsSystemWorkingSetShared : 1; /* bit position: 6 */
        /* 0x0268 */ unsigned char OwnsSessionWorkingSetExclusive : 1; /* bit position: 7 */
      }; /* bitfield */
      struct /* bitfield */
      {
        /* 0x0269 */ unsigned char OwnsSessionWorkingSetShared : 1; /* bit position: 0 */
        /* 0x0269 */ unsigned char OwnsProcessAddressSpaceExclusive : 1; /* bit position: 1 */
        /* 0x0269 */ unsigned char OwnsProcessAddressSpaceShared : 1; /* bit position: 2 */
        /* 0x0269 */ unsigned char SuppressSymbolLoad : 1; /* bit position: 3 */
        /* 0x0269 */ unsigned char Prefetching : 1; /* bit position: 4 */
        /* 0x0269 */ unsigned char OwnsDynamicMemoryShared : 1; /* bit position: 5 */
        /* 0x0269 */ unsigned char OwnsChangeControlAreaExclusive : 1; /* bit position: 6 */
        /* 0x0269 */ unsigned char OwnsChangeControlAreaShared : 1; /* bit position: 7 */
      }; /* bitfield */
      /* 0x026a */ unsigned char Spare1 : 8; /* bit position: 0 */
      /* 0x026b */ unsigned char PriorityRegionActive;
    }; /* size: 0x0004 */
  }; /* size: 0x0004 */
  /* 0x026c */ unsigned char CacheManagerActive;
  /* 0x026d */ unsigned char DisablePageFaultClustering;
  /* 0x026e */ unsigned char ActiveFaultCount;
  /* 0x0270 */ unsigned long AlpcMessageId;
  union
  {
    /* 0x0274 */ void* AlpcMessage;
    /* 0x0274 */ unsigned long AlpcReceiveAttributeSet;
  }; /* size: 0x0004 */
  /* 0x0278 */ struct _LIST_ENTRY AlpcWaitListEntry;
  /* 0x0280 */ unsigned long CacheManagerCount;
  /* 0x0284 */ long __PADDING__[1];
} ETHREAD, *PETHREAD; /* size: 0x0288 */

typedef struct _ETIMER
{
  /* 0x0000 */ struct _KTIMER KeTimer;
  /* 0x0028 */ struct _KAPC TimerApc;
  /* 0x0058 */ struct _KDPC TimerDpc;
  /* 0x0078 */ struct _LIST_ENTRY ActiveTimerListEntry;
  /* 0x0080 */ unsigned long Lock;
  /* 0x0084 */ long Period;
  /* 0x0088 */ unsigned char ApcAssociated;
  /* 0x0089 */ unsigned char WakeTimer;
  /* 0x008c */ struct _LIST_ENTRY WakeTimerListEntry;
  /* 0x0094 */ long __PADDING__[1];
} ETIMER, *PETIMER; /* size: 0x0098 */

typedef struct _ETW_BUFFER_CONTEXT
{
  /* 0x0000 */ unsigned char ProcessorNumber;
  /* 0x0001 */ unsigned char Alignment;
  /* 0x0002 */ unsigned short LoggerId;
} ETW_BUFFER_CONTEXT, *PETW_BUFFER_CONTEXT; /* size: 0x0004 */

typedef enum _ETW_BUFFER_STATE
{
  EtwBufferStateFree = 0,
  EtwBufferStateGeneralLogging = 1,
  EtwBufferStateCSwitch = 2,
  EtwBufferStateFlush = 3,
  EtwBufferStateMaximum = 4,
} ETW_BUFFER_STATE, *PETW_BUFFER_STATE;

typedef struct _ETW_GUID_ENTRY
{
  /* 0x0000 */ struct _LIST_ENTRY GuidList;
  /* 0x0008 */ volatile long RefCount;
  /* 0x000c */ struct _GUID Guid;
  /* 0x001c */ struct _LIST_ENTRY RegListHead;
  /* 0x0024 */ void* SecurityDescriptor;
  /* 0x0028 */ struct _ETW_LAST_ENABLE_INFO LastEnable;
  /* 0x0038 */ struct _TRACE_ENABLE_INFO ProviderEnableInfo;
  /* 0x0058 */ struct _TRACE_ENABLE_INFO EnableInfo[8];
} ETW_GUID_ENTRY, *PETW_GUID_ENTRY; /* size: 0x0158 */

typedef enum _ETW_GUID_TYPE
{
  EtwTraceGuidType = 0,
  EtwNotificationGuidType = 1,
  EtwGuidTypeMax = 2,
} ETW_GUID_TYPE, *PETW_GUID_TYPE;

typedef struct _ETW_KERNEL_TRACE_TIMESTAMP
{
  /* 0x0000 */ union _LARGE_INTEGER KernelTraceTimeStamp[2];
} ETW_KERNEL_TRACE_TIMESTAMP, *PETW_KERNEL_TRACE_TIMESTAMP; /* size: 0x0010 */

typedef struct _ETW_LAST_ENABLE_INFO
{
  /* 0x0000 */ union _LARGE_INTEGER EnableFlags;
  /* 0x0008 */ unsigned short LoggerId;
  /* 0x000a */ unsigned char Level;
  struct /* bitfield */
  {
    /* 0x000b */ unsigned char Enabled : 1; /* bit position: 0 */
    /* 0x000b */ unsigned char InternalFlag : 7; /* bit position: 1 */
  }; /* bitfield */
  /* 0x000c */ long __PADDING__[1];
} ETW_LAST_ENABLE_INFO, *PETW_LAST_ENABLE_INFO; /* size: 0x0010 */

typedef enum _ETW_PROVIDER_STATE
{
  EtwProviderStateFree = 0,
  EtwProviderStateTransition = 1,
  EtwProviderStateActive = 2,
  EtwProviderStateMax = 3,
} ETW_PROVIDER_STATE, *PETW_PROVIDER_STATE;

typedef struct _ETW_PROVIDER_TABLE_ENTRY
{
  /* 0x0000 */ long RefCount;
  /* 0x0004 */ enum _ETW_PROVIDER_STATE State;
  /* 0x0008 */ struct _ETW_REG_ENTRY* RegEntry;
  /* 0x000c */ void* Caller;
} ETW_PROVIDER_TABLE_ENTRY, *PETW_PROVIDER_TABLE_ENTRY; /* size: 0x0010 */

typedef struct _ETW_REF_CLOCK
{
  /* 0x0000 */ union _LARGE_INTEGER StartTime;
  /* 0x0008 */ union _LARGE_INTEGER StartPerfClock;
} ETW_REF_CLOCK, *PETW_REF_CLOCK; /* size: 0x0010 */

typedef struct _ETW_REG_ENTRY
{
  /* 0x0000 */ struct _LIST_ENTRY RegList;
  /* 0x0008 */ struct _ETW_GUID_ENTRY* GuidEntry;
  /* 0x000c */ unsigned short Index;
  /* 0x000e */ unsigned short Flags;
  /* 0x0010 */ unsigned char EnableMask;
  union
  {
    /* 0x0014 */ struct _ETW_REPLY_QUEUE* ReplyQueue;
    /* 0x0014 */ struct _ETW_REG_ENTRY* ReplySlot[4];
  }; /* size: 0x0010 */
  union
  {
    /* 0x0024 */ struct _EPROCESS* Process;
    /* 0x0024 */ void* Callback;
  }; /* size: 0x0004 */
  /* 0x0028 */ void* CallbackContext;
} ETW_REG_ENTRY, *PETW_REG_ENTRY; /* size: 0x002c */

typedef struct _ETW_REPLY_QUEUE
{
  /* 0x0000 */ struct _KQUEUE Queue;
  /* 0x0028 */ long EventsLost;
} ETW_REPLY_QUEUE, *PETW_REPLY_QUEUE; /* size: 0x002c */

typedef enum _ETW_RT_EVENT_LOSS
{
  EtwRtEventNoLoss = 0,
  EtwRtEventLost = 1,
  EtwRtBufferLost = 2,
  EtwRtBackupLost = 3,
  EtwRtEventLossMax = 4,
} ETW_RT_EVENT_LOSS, *PETW_RT_EVENT_LOSS;

typedef struct _ETW_SYSTEMTIME
{
  /* 0x0000 */ unsigned short Year;
  /* 0x0002 */ unsigned short Month;
  /* 0x0004 */ unsigned short DayOfWeek;
  /* 0x0006 */ unsigned short Day;
  /* 0x0008 */ unsigned short Hour;
  /* 0x000a */ unsigned short Minute;
  /* 0x000c */ unsigned short Second;
  /* 0x000e */ unsigned short Milliseconds;
} ETW_SYSTEMTIME, *PETW_SYSTEMTIME; /* size: 0x0010 */

typedef struct _EVENT_DATA_DESCRIPTOR
{
  /* 0x0000 */ unsigned __int64 Ptr;
  /* 0x0008 */ unsigned long Size;
  /* 0x000c */ unsigned long Reserved;
} EVENT_DATA_DESCRIPTOR, *PEVENT_DATA_DESCRIPTOR; /* size: 0x0010 */

typedef struct _EVENT_DESCRIPTOR
{
  /* 0x0000 */ unsigned short Id;
  /* 0x0002 */ unsigned char Version;
  /* 0x0003 */ unsigned char Channel;
  /* 0x0004 */ unsigned char Level;
  /* 0x0005 */ unsigned char Opcode;
  /* 0x0006 */ unsigned short Task;
  /* 0x0008 */ unsigned __int64 Keyword;
} EVENT_DESCRIPTOR, *PEVENT_DESCRIPTOR; /* size: 0x0010 */

typedef enum _EVENT_TYPE
{
  NotificationEvent = 0,
  SynchronizationEvent = 1,
} EVENT_TYPE, *PEVENT_TYPE;

typedef enum _EXCEPTION_DISPOSITION
{
  ExceptionContinueExecution = 0,
  ExceptionContinueSearch = 1,
  ExceptionNestedException = 2,
  ExceptionCollidedUnwind = 3,
} EXCEPTION_DISPOSITION, *PEXCEPTION_DISPOSITION;

typedef struct _EXCEPTION_POINTERS
{
  /* 0x0000 */ struct _EXCEPTION_RECORD* ExceptionRecord;
  /* 0x0004 */ struct _CONTEXT* ContextRecord;
} EXCEPTION_POINTERS, *PEXCEPTION_POINTERS; /* size: 0x0008 */

typedef struct _EXCEPTION_RECORD
{
  /* 0x0000 */ long ExceptionCode;
  /* 0x0004 */ unsigned long ExceptionFlags;
  /* 0x0008 */ struct _EXCEPTION_RECORD* ExceptionRecord;
  /* 0x000c */ void* ExceptionAddress;
  /* 0x0010 */ unsigned long NumberParameters;
  /* 0x0014 */ unsigned long ExceptionInformation[15];
} EXCEPTION_RECORD, *PEXCEPTION_RECORD; /* size: 0x0050 */

typedef struct _EXCEPTION_RECORD32
{
  /* 0x0000 */ long ExceptionCode;
  /* 0x0004 */ unsigned long ExceptionFlags;
  /* 0x0008 */ unsigned long ExceptionRecord;
  /* 0x000c */ unsigned long ExceptionAddress;
  /* 0x0010 */ unsigned long NumberParameters;
  /* 0x0014 */ unsigned long ExceptionInformation[15];
} EXCEPTION_RECORD32, *PEXCEPTION_RECORD32; /* size: 0x0050 */

typedef struct _EXCEPTION_RECORD64
{
  /* 0x0000 */ long ExceptionCode;
  /* 0x0004 */ unsigned long ExceptionFlags;
  /* 0x0008 */ unsigned __int64 ExceptionRecord;
  /* 0x0010 */ unsigned __int64 ExceptionAddress;
  /* 0x0018 */ unsigned long NumberParameters;
  /* 0x001c */ unsigned long __unusedAlignment;
  /* 0x0020 */ unsigned __int64 ExceptionInformation[15];
} EXCEPTION_RECORD64, *PEXCEPTION_RECORD64; /* size: 0x0098 */

typedef struct _EXCEPTION_REGISTRATION_RECORD
{
  /* 0x0000 */ struct _EXCEPTION_REGISTRATION_RECORD* Next;
  /* 0x0004 */ void* Handler /* function */;
} EXCEPTION_REGISTRATION_RECORD, *PEXCEPTION_REGISTRATION_RECORD; /* size: 0x0008 */

typedef struct _EX_FAST_REF
{
  union
  {
    /* 0x0000 */ void* Object;
    /* 0x0000 */ unsigned long RefCnt : 3; /* bit position: 0 */
    /* 0x0000 */ unsigned long Value;
  }; /* size: 0x0004 */
} EX_FAST_REF, *PEX_FAST_REF; /* size: 0x0004 */

typedef struct _EX_PUSH_LOCK
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long Locked : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned long Waiting : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned long Waking : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned long MultipleShared : 1; /* bit position: 3 */
      /* 0x0000 */ unsigned long Shared : 28; /* bit position: 4 */
    }; /* bitfield */
    /* 0x0000 */ unsigned long Value;
    /* 0x0000 */ void* Ptr;
  }; /* size: 0x0004 */
} EX_PUSH_LOCK, *PEX_PUSH_LOCK; /* size: 0x0004 */

typedef struct _EX_PUSH_LOCK_CACHE_AWARE
{
  /* 0x0000 */ struct _EX_PUSH_LOCK* Locks[32];
} EX_PUSH_LOCK_CACHE_AWARE, *PEX_PUSH_LOCK_CACHE_AWARE; /* size: 0x0080 */

typedef struct _EX_PUSH_LOCK_WAIT_BLOCK
{
  union
  {
    /* 0x0000 */ struct _KGATE WakeGate;
    /* 0x0000 */ struct _KEVENT WakeEvent;
  }; /* size: 0x0010 */
  /* 0x0010 */ struct _EX_PUSH_LOCK_WAIT_BLOCK* Next;
  /* 0x0014 */ struct _EX_PUSH_LOCK_WAIT_BLOCK* Last;
  /* 0x0018 */ struct _EX_PUSH_LOCK_WAIT_BLOCK* Previous;
  /* 0x001c */ long ShareCount;
  /* 0x0020 */ long Flags;
  /* 0x0024 */ long __PADDING__[3];
} EX_PUSH_LOCK_WAIT_BLOCK, *PEX_PUSH_LOCK_WAIT_BLOCK; /* size: 0x0030 */

typedef struct _EX_RUNDOWN_REF
{
  union
  {
    /* 0x0000 */ unsigned long Count;
    /* 0x0000 */ void* Ptr;
  }; /* size: 0x0004 */
} EX_RUNDOWN_REF, *PEX_RUNDOWN_REF; /* size: 0x0004 */

typedef struct _EX_WORK_QUEUE
{
  /* 0x0000 */ struct _KQUEUE WorkerQueue;
  /* 0x0028 */ unsigned long DynamicThreadCount;
  /* 0x002c */ unsigned long WorkItemsProcessed;
  /* 0x0030 */ unsigned long WorkItemsProcessedLastPass;
  /* 0x0034 */ unsigned long QueueDepthLastPass;
  /* 0x0038 */ union EX_QUEUE_WORKER_INFO Info;
} EX_WORK_QUEUE, *PEX_WORK_QUEUE; /* size: 0x003c */

typedef struct _FAST_IO_DISPATCH
{
  /* 0x0000 */ unsigned long SizeOfFastIoDispatch;
  /* 0x0004 */ void* FastIoCheckIfPossible /* function */;
  /* 0x0008 */ void* FastIoRead /* function */;
  /* 0x000c */ void* FastIoWrite /* function */;
  /* 0x0010 */ void* FastIoQueryBasicInfo /* function */;
  /* 0x0014 */ void* FastIoQueryStandardInfo /* function */;
  /* 0x0018 */ void* FastIoLock /* function */;
  /* 0x001c */ void* FastIoUnlockSingle /* function */;
  /* 0x0020 */ void* FastIoUnlockAll /* function */;
  /* 0x0024 */ void* FastIoUnlockAllByKey /* function */;
  /* 0x0028 */ void* FastIoDeviceControl /* function */;
  /* 0x002c */ void* AcquireFileForNtCreateSection /* function */;
  /* 0x0030 */ void* ReleaseFileForNtCreateSection /* function */;
  /* 0x0034 */ void* FastIoDetachDevice /* function */;
  /* 0x0038 */ void* FastIoQueryNetworkOpenInfo /* function */;
  /* 0x003c */ void* AcquireForModWrite /* function */;
  /* 0x0040 */ void* MdlRead /* function */;
  /* 0x0044 */ void* MdlReadComplete /* function */;
  /* 0x0048 */ void* PrepareMdlWrite /* function */;
  /* 0x004c */ void* MdlWriteComplete /* function */;
  /* 0x0050 */ void* FastIoReadCompressed /* function */;
  /* 0x0054 */ void* FastIoWriteCompressed /* function */;
  /* 0x0058 */ void* MdlReadCompleteCompressed /* function */;
  /* 0x005c */ void* MdlWriteCompleteCompressed /* function */;
  /* 0x0060 */ void* FastIoQueryOpen /* function */;
  /* 0x0064 */ void* ReleaseForModWrite /* function */;
  /* 0x0068 */ void* AcquireForCcFlush /* function */;
  /* 0x006c */ void* ReleaseForCcFlush /* function */;
} FAST_IO_DISPATCH, *PFAST_IO_DISPATCH; /* size: 0x0070 */

typedef struct _FAST_MUTEX
{
  /* 0x0000 */ volatile long Count;
  /* 0x0004 */ struct _KTHREAD* Owner;
  /* 0x0008 */ unsigned long Contention;
  /* 0x000c */ struct _KEVENT Gate;
  /* 0x001c */ unsigned long OldIrql;
} FAST_MUTEX, *PFAST_MUTEX; /* size: 0x0020 */

typedef struct _FILE_BASIC_INFORMATION
{
  /* 0x0000 */ union _LARGE_INTEGER CreationTime;
  /* 0x0008 */ union _LARGE_INTEGER LastAccessTime;
  /* 0x0010 */ union _LARGE_INTEGER LastWriteTime;
  /* 0x0018 */ union _LARGE_INTEGER ChangeTime;
  /* 0x0020 */ unsigned long FileAttributes;
  /* 0x0024 */ long __PADDING__[1];
} FILE_BASIC_INFORMATION, *PFILE_BASIC_INFORMATION; /* size: 0x0028 */

typedef struct _FILE_GET_QUOTA_INFORMATION
{
  /* 0x0000 */ unsigned long NextEntryOffset;
  /* 0x0004 */ unsigned long SidLength;
  /* 0x0008 */ struct _SID Sid;
} FILE_GET_QUOTA_INFORMATION, *PFILE_GET_QUOTA_INFORMATION; /* size: 0x0014 */

typedef enum _FILE_INFORMATION_CLASS
{
  FileDirectoryInformation = 1,
  FileFullDirectoryInformation = 2,
  FileBothDirectoryInformation = 3,
  FileBasicInformation = 4,
  FileStandardInformation = 5,
  FileInternalInformation = 6,
  FileEaInformation = 7,
  FileAccessInformation = 8,
  FileNameInformation = 9,
  FileRenameInformation = 10,
  FileLinkInformation = 11,
  FileNamesInformation = 12,
  FileDispositionInformation = 13,
  FilePositionInformation = 14,
  FileFullEaInformation = 15,
  FileModeInformation = 16,
  FileAlignmentInformation = 17,
  FileAllInformation = 18,
  FileAllocationInformation = 19,
  FileEndOfFileInformation = 20,
  FileAlternateNameInformation = 21,
  FileStreamInformation = 22,
  FilePipeInformation = 23,
  FilePipeLocalInformation = 24,
  FilePipeRemoteInformation = 25,
  FileMailslotQueryInformation = 26,
  FileMailslotSetInformation = 27,
  FileCompressionInformation = 28,
  FileObjectIdInformation = 29,
  FileCompletionInformation = 30,
  FileMoveClusterInformation = 31,
  FileQuotaInformation = 32,
  FileReparsePointInformation = 33,
  FileNetworkOpenInformation = 34,
  FileAttributeTagInformation = 35,
  FileTrackingInformation = 36,
  FileIdBothDirectoryInformation = 37,
  FileIdFullDirectoryInformation = 38,
  FileValidDataLengthInformation = 39,
  FileShortNameInformation = 40,
  FileIoCompletionNotificationInformation = 41,
  FileIoStatusBlockRangeInformation = 42,
  FileIoPriorityHintInformation = 43,
  FileSfioReserveInformation = 44,
  FileSfioVolumeInformation = 45,
  FileHardLinkInformation = 46,
  FileProcessIdsUsingFileInformation = 47,
  FileNormalizedNameInformation = 48,
  FileNetworkPhysicalNameInformation = 49,
  FileIdGlobalTxDirectoryInformation = 50,
  FileMaximumInformation = 51,
} FILE_INFORMATION_CLASS, *PFILE_INFORMATION_CLASS;

typedef struct _FILE_NETWORK_OPEN_INFORMATION
{
  /* 0x0000 */ union _LARGE_INTEGER CreationTime;
  /* 0x0008 */ union _LARGE_INTEGER LastAccessTime;
  /* 0x0010 */ union _LARGE_INTEGER LastWriteTime;
  /* 0x0018 */ union _LARGE_INTEGER ChangeTime;
  /* 0x0020 */ union _LARGE_INTEGER AllocationSize;
  /* 0x0028 */ union _LARGE_INTEGER EndOfFile;
  /* 0x0030 */ unsigned long FileAttributes;
  /* 0x0034 */ long __PADDING__[1];
} FILE_NETWORK_OPEN_INFORMATION, *PFILE_NETWORK_OPEN_INFORMATION; /* size: 0x0038 */

typedef struct _FILE_OBJECT
{
  /* 0x0000 */ short Type;
  /* 0x0002 */ short Size;
  /* 0x0004 */ struct _DEVICE_OBJECT* DeviceObject;
  /* 0x0008 */ struct _VPB* Vpb;
  /* 0x000c */ void* FsContext;
  /* 0x0010 */ void* FsContext2;
  /* 0x0014 */ struct _SECTION_OBJECT_POINTERS* SectionObjectPointer;
  /* 0x0018 */ void* PrivateCacheMap;
  /* 0x001c */ long FinalStatus;
  /* 0x0020 */ struct _FILE_OBJECT* RelatedFileObject;
  /* 0x0024 */ unsigned char LockOperation;
  /* 0x0025 */ unsigned char DeletePending;
  /* 0x0026 */ unsigned char ReadAccess;
  /* 0x0027 */ unsigned char WriteAccess;
  /* 0x0028 */ unsigned char DeleteAccess;
  /* 0x0029 */ unsigned char SharedRead;
  /* 0x002a */ unsigned char SharedWrite;
  /* 0x002b */ unsigned char SharedDelete;
  /* 0x002c */ unsigned long Flags;
  /* 0x0030 */ struct _UNICODE_STRING FileName;
  /* 0x0038 */ union _LARGE_INTEGER CurrentByteOffset;
  /* 0x0040 */ unsigned long Waiters;
  /* 0x0044 */ unsigned long Busy;
  /* 0x0048 */ void* LastLock;
  /* 0x004c */ struct _KEVENT Lock;
  /* 0x005c */ struct _KEVENT Event;
  /* 0x006c */ struct _IO_COMPLETION_CONTEXT* CompletionContext;
  /* 0x0070 */ unsigned long IrpListLock;
  /* 0x0074 */ struct _LIST_ENTRY IrpList;
  /* 0x007c */ void* FileObjectExtension;
} FILE_OBJECT, *PFILE_OBJECT; /* size: 0x0080 */

typedef struct _FILE_STANDARD_INFORMATION
{
  /* 0x0000 */ union _LARGE_INTEGER AllocationSize;
  /* 0x0008 */ union _LARGE_INTEGER EndOfFile;
  /* 0x0010 */ unsigned long NumberOfLinks;
  /* 0x0014 */ unsigned char DeletePending;
  /* 0x0015 */ unsigned char Directory;
  /* 0x0016 */ char __PADDING__[2];
} FILE_STANDARD_INFORMATION, *PFILE_STANDARD_INFORMATION; /* size: 0x0018 */

typedef struct _FIRMWARE_INFORMATION_LOADER_BLOCK
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned long FirmwareTypeEfi : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned long Reserved : 31; /* bit position: 1 */
  }; /* bitfield */
  union
  {
    union
    {
      /* 0x0004 */ struct _EFI_FIRMWARE_INFORMATION EfiInformation;
      /* 0x0004 */ struct _PCAT_FIRMWARE_INFORMATION PcatInformation;
    }; /* size: 0x0010 */
  } /* size: 0x0010 */ u;
} FIRMWARE_INFORMATION_LOADER_BLOCK, *PFIRMWARE_INFORMATION_LOADER_BLOCK; /* size: 0x0014 */

typedef struct _FLOATING_SAVE_AREA
{
  /* 0x0000 */ unsigned long ControlWord;
  /* 0x0004 */ unsigned long StatusWord;
  /* 0x0008 */ unsigned long TagWord;
  /* 0x000c */ unsigned long ErrorOffset;
  /* 0x0010 */ unsigned long ErrorSelector;
  /* 0x0014 */ unsigned long DataOffset;
  /* 0x0018 */ unsigned long DataSelector;
  /* 0x001c */ unsigned char RegisterArea[80];
  /* 0x006c */ unsigned long Cr0NpxState;
} FLOATING_SAVE_AREA, *PFLOATING_SAVE_AREA; /* size: 0x0070 */

struct _FLS_CALLBACK_INFO;

typedef struct _FNSAVE_FORMAT
{
  /* 0x0000 */ unsigned long ControlWord;
  /* 0x0004 */ unsigned long StatusWord;
  /* 0x0008 */ unsigned long TagWord;
  /* 0x000c */ unsigned long ErrorOffset;
  /* 0x0010 */ unsigned long ErrorSelector;
  /* 0x0014 */ unsigned long DataOffset;
  /* 0x0018 */ unsigned long DataSelector;
  /* 0x001c */ unsigned char RegisterArea[80];
} FNSAVE_FORMAT, *PFNSAVE_FORMAT; /* size: 0x006c */

typedef struct _FREE_DISPLAY
{
  /* 0x0000 */ unsigned long RealVectorSize;
  /* 0x0004 */ struct _RTL_BITMAP Display;
} FREE_DISPLAY, *PFREE_DISPLAY; /* size: 0x000c */

typedef enum _FSINFOCLASS
{
  FileFsVolumeInformation = 1,
  FileFsLabelInformation = 2,
  FileFsSizeInformation = 3,
  FileFsDeviceInformation = 4,
  FileFsAttributeInformation = 5,
  FileFsControlInformation = 6,
  FileFsFullSizeInformation = 7,
  FileFsObjectIdInformation = 8,
  FileFsDriverPathInformation = 9,
  FileFsVolumeFlagsInformation = 10,
  FileFsMaximumInformation = 11,
} FSINFOCLASS, *PFSINFOCLASS;

typedef struct _FS_FILTER_CALLBACKS
{
  /* 0x0000 */ unsigned long SizeOfFsFilterCallbacks;
  /* 0x0004 */ unsigned long Reserved;
  /* 0x0008 */ void* PreAcquireForSectionSynchronization /* function */;
  /* 0x000c */ void* PostAcquireForSectionSynchronization /* function */;
  /* 0x0010 */ void* PreReleaseForSectionSynchronization /* function */;
  /* 0x0014 */ void* PostReleaseForSectionSynchronization /* function */;
  /* 0x0018 */ void* PreAcquireForCcFlush /* function */;
  /* 0x001c */ void* PostAcquireForCcFlush /* function */;
  /* 0x0020 */ void* PreReleaseForCcFlush /* function */;
  /* 0x0024 */ void* PostReleaseForCcFlush /* function */;
  /* 0x0028 */ void* PreAcquireForModifiedPageWriter /* function */;
  /* 0x002c */ void* PostAcquireForModifiedPageWriter /* function */;
  /* 0x0030 */ void* PreReleaseForModifiedPageWriter /* function */;
  /* 0x0034 */ void* PostReleaseForModifiedPageWriter /* function */;
} FS_FILTER_CALLBACKS, *PFS_FILTER_CALLBACKS; /* size: 0x0038 */

typedef struct _FS_FILTER_CALLBACK_DATA
{
  /* 0x0000 */ unsigned long SizeOfFsFilterCallbackData;
  /* 0x0004 */ unsigned char Operation;
  /* 0x0005 */ unsigned char Reserved;
  /* 0x0008 */ struct _DEVICE_OBJECT* DeviceObject;
  /* 0x000c */ struct _FILE_OBJECT* FileObject;
  /* 0x0010 */ union _FS_FILTER_PARAMETERS Parameters;
} FS_FILTER_CALLBACK_DATA, *PFS_FILTER_CALLBACK_DATA; /* size: 0x0024 */

typedef union _FS_FILTER_PARAMETERS
{
  union
  {
    struct
    {
      /* 0x0000 */ union _LARGE_INTEGER* EndingOffset;
      /* 0x0004 */ struct _ERESOURCE** ResourceToRelease;
    } /* size: 0x0008 */ AcquireForModifiedPageWriter;
    struct
    {
      /* 0x0000 */ struct _ERESOURCE* ResourceToRelease;
    } /* size: 0x0004 */ ReleaseForModifiedPageWriter;
    struct
    {
      /* 0x0000 */ enum _FS_FILTER_SECTION_SYNC_TYPE SyncType;
      /* 0x0004 */ unsigned long PageProtection;
    } /* size: 0x0008 */ AcquireForSectionSynchronization;
    struct
    {
      /* 0x0000 */ enum _FS_FILTER_STREAM_FO_NOTIFICATION_TYPE NotificationType;
      /* 0x0004 */ unsigned char SafeToRecurse;
      /* 0x0005 */ char __PADDING__[3];
    } /* size: 0x0008 */ NotifyStreamFileObject;
    struct
    {
      /* 0x0000 */ void* Argument1;
      /* 0x0004 */ void* Argument2;
      /* 0x0008 */ void* Argument3;
      /* 0x000c */ void* Argument4;
      /* 0x0010 */ void* Argument5;
    } /* size: 0x0014 */ Others;
  }; /* size: 0x0014 */
} FS_FILTER_PARAMETERS, *PFS_FILTER_PARAMETERS; /* size: 0x0014 */

typedef enum _FS_FILTER_SECTION_SYNC_TYPE
{
  SyncTypeOther = 0,
  SyncTypeCreateSection = 1,
} FS_FILTER_SECTION_SYNC_TYPE, *PFS_FILTER_SECTION_SYNC_TYPE;

typedef enum _FS_FILTER_STREAM_FO_NOTIFICATION_TYPE
{
  NotifyTypeCreate = 0,
  NotifyTypeRetired = 1,
} FS_FILTER_STREAM_FO_NOTIFICATION_TYPE, *PFS_FILTER_STREAM_FO_NOTIFICATION_TYPE;

typedef struct _FXSAVE_FORMAT
{
  /* 0x0000 */ unsigned short ControlWord;
  /* 0x0002 */ unsigned short StatusWord;
  /* 0x0004 */ unsigned short TagWord;
  /* 0x0006 */ unsigned short ErrorOpcode;
  /* 0x0008 */ unsigned long ErrorOffset;
  /* 0x000c */ unsigned long ErrorSelector;
  /* 0x0010 */ unsigned long DataOffset;
  /* 0x0014 */ unsigned long DataSelector;
  /* 0x0018 */ unsigned long MXCsr;
  /* 0x001c */ unsigned long MXCsrMask;
  /* 0x0020 */ unsigned char RegisterArea[128];
  /* 0x00a0 */ unsigned char Reserved3[128];
  /* 0x0120 */ unsigned char Reserved4[224];
  /* 0x0200 */ unsigned char Align16Byte[8];
} FXSAVE_FORMAT, *PFXSAVE_FORMAT; /* size: 0x0208 */

typedef struct _FX_SAVE_AREA
{
  union
  {
    union
    {
      /* 0x0000 */ struct _FNSAVE_FORMAT FnArea;
      /* 0x0000 */ struct _FXSAVE_FORMAT FxArea;
    }; /* size: 0x0208 */
  } /* size: 0x0208 */ U;
  /* 0x0208 */ unsigned long NpxSavedCpu;
  /* 0x020c */ unsigned long Cr0NpxState;
} FX_SAVE_AREA, *PFX_SAVE_AREA; /* size: 0x0210 */

typedef struct _GDI_TEB_BATCH
{
  /* 0x0000 */ unsigned long Offset;
  /* 0x0004 */ unsigned long HDC;
  /* 0x0008 */ unsigned long Buffer[310];
} GDI_TEB_BATCH, *PGDI_TEB_BATCH; /* size: 0x04e0 */

typedef struct _GENERAL_LOOKASIDE
{
  union
  {
    /* 0x0000 */ union _SLIST_HEADER ListHead;
    /* 0x0000 */ struct _SINGLE_LIST_ENTRY SingleListHead;
  }; /* size: 0x0008 */
  /* 0x0008 */ unsigned short Depth;
  /* 0x000a */ unsigned short MaximumDepth;
  /* 0x000c */ unsigned long TotalAllocates;
  union
  {
    /* 0x0010 */ unsigned long AllocateMisses;
    /* 0x0010 */ unsigned long AllocateHits;
  }; /* size: 0x0004 */
  /* 0x0014 */ unsigned long TotalFrees;
  union
  {
    /* 0x0018 */ unsigned long FreeMisses;
    /* 0x0018 */ unsigned long FreeHits;
  }; /* size: 0x0004 */
  /* 0x001c */ enum _POOL_TYPE Type;
  /* 0x0020 */ unsigned long Tag;
  /* 0x0024 */ unsigned long Size;
  union
  {
    /* 0x0028 */ void* AllocateEx /* function */;
    /* 0x0028 */ void* Allocate /* function */;
  }; /* size: 0x0004 */
  union
  {
    /* 0x002c */ void* FreeEx /* function */;
    /* 0x002c */ void* Free /* function */;
  }; /* size: 0x0004 */
  /* 0x0030 */ struct _LIST_ENTRY ListEntry;
  /* 0x0038 */ unsigned long LastTotalAllocates;
  union
  {
    /* 0x003c */ unsigned long LastAllocateMisses;
    /* 0x003c */ unsigned long LastAllocateHits;
  }; /* size: 0x0004 */
  /* 0x0040 */ unsigned long Future[2];
  /* 0x0048 */ long __PADDING__[14];
} GENERAL_LOOKASIDE, *PGENERAL_LOOKASIDE; /* size: 0x0080 */

typedef struct _GENERAL_LOOKASIDE_POOL
{
  union
  {
    /* 0x0000 */ union _SLIST_HEADER ListHead;
    /* 0x0000 */ struct _SINGLE_LIST_ENTRY SingleListHead;
  }; /* size: 0x0008 */
  /* 0x0008 */ unsigned short Depth;
  /* 0x000a */ unsigned short MaximumDepth;
  /* 0x000c */ unsigned long TotalAllocates;
  union
  {
    /* 0x0010 */ unsigned long AllocateMisses;
    /* 0x0010 */ unsigned long AllocateHits;
  }; /* size: 0x0004 */
  /* 0x0014 */ unsigned long TotalFrees;
  union
  {
    /* 0x0018 */ unsigned long FreeMisses;
    /* 0x0018 */ unsigned long FreeHits;
  }; /* size: 0x0004 */
  /* 0x001c */ enum _POOL_TYPE Type;
  /* 0x0020 */ unsigned long Tag;
  /* 0x0024 */ unsigned long Size;
  union
  {
    /* 0x0028 */ void* AllocateEx /* function */;
    /* 0x0028 */ void* Allocate /* function */;
  }; /* size: 0x0004 */
  union
  {
    /* 0x002c */ void* FreeEx /* function */;
    /* 0x002c */ void* Free /* function */;
  }; /* size: 0x0004 */
  /* 0x0030 */ struct _LIST_ENTRY ListEntry;
  /* 0x0038 */ unsigned long LastTotalAllocates;
  union
  {
    /* 0x003c */ unsigned long LastAllocateMisses;
    /* 0x003c */ unsigned long LastAllocateHits;
  }; /* size: 0x0004 */
  /* 0x0040 */ unsigned long Future[2];
} GENERAL_LOOKASIDE_POOL, *PGENERAL_LOOKASIDE_POOL; /* size: 0x0048 */

typedef struct _GENERIC_MAPPING
{
  /* 0x0000 */ unsigned long GenericRead;
  /* 0x0004 */ unsigned long GenericWrite;
  /* 0x0008 */ unsigned long GenericExecute;
  /* 0x000c */ unsigned long GenericAll;
} GENERIC_MAPPING, *PGENERIC_MAPPING; /* size: 0x0010 */

typedef struct _GUID
{
  /* 0x0000 */ unsigned long Data1;
  /* 0x0004 */ unsigned short Data2;
  /* 0x0006 */ unsigned short Data3;
  /* 0x0008 */ unsigned char Data4[8];
} GUID, *PGUID; /* size: 0x0010 */

typedef struct _HANDLE_TABLE
{
  /* 0x0000 */ unsigned long TableCode;
  /* 0x0004 */ struct _EPROCESS* QuotaProcess;
  /* 0x0008 */ void* UniqueProcessId;
  /* 0x000c */ struct _EX_PUSH_LOCK HandleLock;
  /* 0x0010 */ struct _LIST_ENTRY HandleTableList;
  /* 0x0018 */ struct _EX_PUSH_LOCK HandleContentionEvent;
  /* 0x001c */ struct _HANDLE_TRACE_DEBUG_INFO* DebugInfo;
  /* 0x0020 */ long ExtraInfoPages;
  union
  {
    /* 0x0024 */ unsigned long Flags;
    /* 0x0024 */ unsigned char StrictFIFO : 1; /* bit position: 0 */
  }; /* size: 0x0004 */
  /* 0x0028 */ long FirstFreeHandle;
  /* 0x002c */ struct _HANDLE_TABLE_ENTRY* LastFreeHandleEntry;
  /* 0x0030 */ long HandleCount;
  /* 0x0034 */ unsigned long NextHandleNeedingPool;
} HANDLE_TABLE, *PHANDLE_TABLE; /* size: 0x0038 */

typedef struct _HANDLE_TABLE_ENTRY
{
  union
  {
    /* 0x0000 */ void* Object;
    /* 0x0000 */ unsigned long ObAttributes;
    /* 0x0000 */ struct _HANDLE_TABLE_ENTRY_INFO* InfoTable;
    /* 0x0000 */ unsigned long Value;
  }; /* size: 0x0004 */
  union
  {
    /* 0x0004 */ unsigned long GrantedAccess;
    struct
    {
      /* 0x0004 */ unsigned short GrantedAccessIndex;
      /* 0x0006 */ unsigned short CreatorBackTraceIndex;
    }; /* size: 0x0004 */
    /* 0x0004 */ long NextFreeTableEntry;
  }; /* size: 0x0004 */
} HANDLE_TABLE_ENTRY, *PHANDLE_TABLE_ENTRY; /* size: 0x0008 */

typedef struct _HANDLE_TABLE_ENTRY_INFO
{
  /* 0x0000 */ unsigned long AuditMask;
} HANDLE_TABLE_ENTRY_INFO, *PHANDLE_TABLE_ENTRY_INFO; /* size: 0x0004 */

typedef struct _HANDLE_TRACE_DB_ENTRY
{
  /* 0x0000 */ struct _CLIENT_ID ClientId;
  /* 0x0008 */ void* Handle;
  /* 0x000c */ unsigned long Type;
  /* 0x0010 */ void* StackTrace[16];
} HANDLE_TRACE_DB_ENTRY, *PHANDLE_TRACE_DB_ENTRY; /* size: 0x0050 */

typedef struct _HANDLE_TRACE_DEBUG_INFO
{
  /* 0x0000 */ long RefCount;
  /* 0x0004 */ unsigned long TableSize;
  /* 0x0008 */ unsigned long BitMaskFlags;
  /* 0x000c */ struct _FAST_MUTEX CloseCompactionLock;
  /* 0x002c */ unsigned long CurrentStackIndex;
  /* 0x0030 */ struct _HANDLE_TRACE_DB_ENTRY TraceDb[1];
} HANDLE_TRACE_DEBUG_INFO, *PHANDLE_TRACE_DEBUG_INFO; /* size: 0x0080 */

typedef struct _HARDWARE_PTE
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned long Valid : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned long Write : 1; /* bit position: 1 */
    /* 0x0000 */ unsigned long Owner : 1; /* bit position: 2 */
    /* 0x0000 */ unsigned long WriteThrough : 1; /* bit position: 3 */
    /* 0x0000 */ unsigned long CacheDisable : 1; /* bit position: 4 */
    /* 0x0000 */ unsigned long Accessed : 1; /* bit position: 5 */
    /* 0x0000 */ unsigned long Dirty : 1; /* bit position: 6 */
    /* 0x0000 */ unsigned long LargePage : 1; /* bit position: 7 */
    /* 0x0000 */ unsigned long Global : 1; /* bit position: 8 */
    /* 0x0000 */ unsigned long CopyOnWrite : 1; /* bit position: 9 */
    /* 0x0000 */ unsigned long Prototype : 1; /* bit position: 10 */
    /* 0x0000 */ unsigned long reserved : 1; /* bit position: 11 */
    /* 0x0000 */ unsigned long PageFrameNumber : 20; /* bit position: 12 */
  }; /* bitfield */
} HARDWARE_PTE, *PHARDWARE_PTE; /* size: 0x0004 */

typedef struct _HBASE_BLOCK
{
  /* 0x0000 */ unsigned long Signature;
  /* 0x0004 */ unsigned long Sequence1;
  /* 0x0008 */ unsigned long Sequence2;
  /* 0x000c */ union _LARGE_INTEGER TimeStamp;
  /* 0x0014 */ unsigned long Major;
  /* 0x0018 */ unsigned long Minor;
  /* 0x001c */ unsigned long Type;
  /* 0x0020 */ unsigned long Format;
  /* 0x0024 */ unsigned long RootCell;
  /* 0x0028 */ unsigned long Length;
  /* 0x002c */ unsigned long Cluster;
  /* 0x0030 */ unsigned char FileName[64];
  /* 0x0070 */ struct _GUID RmId;
  /* 0x0080 */ struct _GUID LogId;
  /* 0x0090 */ unsigned long Flags;
  /* 0x0094 */ struct _GUID TmId;
  /* 0x00a4 */ unsigned long GuidSignature;
  /* 0x00a8 */ unsigned long Reserved1[85];
  /* 0x01fc */ unsigned long CheckSum;
  /* 0x0200 */ unsigned long Reserved2[882];
  /* 0x0fc8 */ struct _GUID ThawTmId;
  /* 0x0fd8 */ struct _GUID ThawRmId;
  /* 0x0fe8 */ struct _GUID ThawLogId;
  /* 0x0ff8 */ unsigned long BootType;
  /* 0x0ffc */ unsigned long BootRecover;
} HBASE_BLOCK, *PHBASE_BLOCK; /* size: 0x1000 */

typedef struct _HEADLESS_LOADER_BLOCK
{
  /* 0x0000 */ unsigned char UsedBiosSettings;
  /* 0x0001 */ unsigned char DataBits;
  /* 0x0002 */ unsigned char StopBits;
  /* 0x0003 */ unsigned char Parity;
  /* 0x0004 */ unsigned long BaudRate;
  /* 0x0008 */ unsigned long PortNumber;
  /* 0x000c */ unsigned char* PortAddress;
  /* 0x0010 */ unsigned short PciDeviceId;
  /* 0x0012 */ unsigned short PciVendorId;
  /* 0x0014 */ unsigned char PciBusNumber;
  /* 0x0016 */ unsigned short PciBusSegment;
  /* 0x0018 */ unsigned char PciSlotNumber;
  /* 0x0019 */ unsigned char PciFunctionNumber;
  /* 0x001c */ unsigned long PciFlags;
  /* 0x0020 */ struct _GUID SystemGUID;
  /* 0x0030 */ unsigned char IsMMIODevice;
  /* 0x0031 */ unsigned char TerminalType;
  /* 0x0032 */ char __PADDING__[2];
} HEADLESS_LOADER_BLOCK, *PHEADLESS_LOADER_BLOCK; /* size: 0x0034 */

typedef struct _HEAP
{
  /* 0x0000 */ struct _HEAP_ENTRY Entry;
  /* 0x0008 */ unsigned long SegmentSignature;
  /* 0x000c */ unsigned long SegmentFlags;
  /* 0x0010 */ struct _LIST_ENTRY SegmentListEntry;
  /* 0x0018 */ struct _HEAP* Heap;
  /* 0x001c */ void* BaseAddress;
  /* 0x0020 */ unsigned long NumberOfPages;
  /* 0x0024 */ struct _HEAP_ENTRY* FirstEntry;
  /* 0x0028 */ struct _HEAP_ENTRY* LastValidEntry;
  /* 0x002c */ unsigned long NumberOfUnCommittedPages;
  /* 0x0030 */ unsigned long NumberOfUnCommittedRanges;
  /* 0x0034 */ unsigned short SegmentAllocatorBackTraceIndex;
  /* 0x0036 */ unsigned short Reserved;
  /* 0x0038 */ struct _LIST_ENTRY UCRSegmentList;
  /* 0x0040 */ unsigned long Flags;
  /* 0x0044 */ unsigned long ForceFlags;
  /* 0x0048 */ unsigned long CompatibilityFlags;
  /* 0x004c */ unsigned long EncodeFlagMask;
  /* 0x0050 */ struct _HEAP_ENTRY Encoding;
  /* 0x0058 */ unsigned long PointerKey;
  /* 0x005c */ unsigned long Interceptor;
  /* 0x0060 */ unsigned long VirtualMemoryThreshold;
  /* 0x0064 */ unsigned long Signature;
  /* 0x0068 */ unsigned long SegmentReserve;
  /* 0x006c */ unsigned long SegmentCommit;
  /* 0x0070 */ unsigned long DeCommitFreeBlockThreshold;
  /* 0x0074 */ unsigned long DeCommitTotalFreeThreshold;
  /* 0x0078 */ unsigned long TotalFreeSize;
  /* 0x007c */ unsigned long MaximumAllocationSize;
  /* 0x0080 */ unsigned short ProcessHeapsListIndex;
  /* 0x0082 */ unsigned short HeaderValidateLength;
  /* 0x0084 */ void* HeaderValidateCopy;
  /* 0x0088 */ unsigned short NextAvailableTagIndex;
  /* 0x008a */ unsigned short MaximumTagIndex;
  /* 0x008c */ struct _HEAP_TAG_ENTRY* TagEntries;
  /* 0x0090 */ struct _LIST_ENTRY UCRList;
  /* 0x0098 */ unsigned long AlignRound;
  /* 0x009c */ unsigned long AlignMask;
  /* 0x00a0 */ struct _LIST_ENTRY VirtualAllocdBlocks;
  /* 0x00a8 */ struct _LIST_ENTRY SegmentList;
  /* 0x00b0 */ unsigned short AllocatorBackTraceIndex;
  /* 0x00b4 */ unsigned long NonDedicatedListLength;
  /* 0x00b8 */ void* BlocksIndex;
  /* 0x00bc */ void* UCRIndex;
  /* 0x00c0 */ struct _HEAP_PSEUDO_TAG_ENTRY* PseudoTagEntries;
  /* 0x00c4 */ struct _LIST_ENTRY FreeLists;
  /* 0x00cc */ struct _HEAP_LOCK* LockVariable;
  /* 0x00d0 */ void* CommitRoutine /* function */;
  /* 0x00d4 */ void* FrontEndHeap;
  /* 0x00d8 */ unsigned short FrontHeapLockCount;
  /* 0x00da */ unsigned char FrontEndHeapType;
  /* 0x00dc */ struct _HEAP_COUNTERS Counters;
  /* 0x0124 */ struct _HEAP_TUNING_PARAMETERS TuningParameters;
  /* 0x012c */ long __PADDING__[1];
} HEAP, *PHEAP; /* size: 0x0130 */

typedef struct _HEAP_COUNTERS
{
  /* 0x0000 */ unsigned long TotalMemoryReserved;
  /* 0x0004 */ unsigned long TotalMemoryCommitted;
  /* 0x0008 */ unsigned long TotalMemoryLargeUCR;
  /* 0x000c */ unsigned long TotalSizeInVirtualBlocks;
  /* 0x0010 */ unsigned long TotalSegments;
  /* 0x0014 */ unsigned long TotalUCRs;
  /* 0x0018 */ unsigned long CommittOps;
  /* 0x001c */ unsigned long DeCommitOps;
  /* 0x0020 */ unsigned long LockAcquires;
  /* 0x0024 */ unsigned long LockCollisions;
  /* 0x0028 */ unsigned long CommitRate;
  /* 0x002c */ unsigned long DecommittRate;
  /* 0x0030 */ unsigned long CommitFailures;
  /* 0x0034 */ unsigned long InBlockCommitFailures;
  /* 0x0038 */ unsigned long CompactHeapCalls;
  /* 0x003c */ unsigned long CompactedUCRs;
  /* 0x0040 */ unsigned long InBlockDeccommits;
  /* 0x0044 */ unsigned long InBlockDeccomitSize;
} HEAP_COUNTERS, *PHEAP_COUNTERS; /* size: 0x0048 */

typedef struct _HEAP_DEBUGGING_INFORMATION
{
  /* 0x0000 */ void* InterceptorFunction;
  /* 0x0004 */ unsigned short InterceptorValue;
  /* 0x0008 */ unsigned long ExtendedOptions;
  /* 0x000c */ unsigned long StackTraceDepth;
  /* 0x0010 */ unsigned long MinTotalBlockSize;
  /* 0x0014 */ unsigned long MaxTotalBlockSize;
  /* 0x0018 */ void* HeapLeakEnumerationRoutine /* function */;
} HEAP_DEBUGGING_INFORMATION, *PHEAP_DEBUGGING_INFORMATION; /* size: 0x001c */

typedef struct _HEAP_ENTRY
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned short Size;
      /* 0x0002 */ unsigned char Flags;
      /* 0x0003 */ unsigned char SmallTagIndex;
    }; /* size: 0x0004 */
    struct
    {
      /* 0x0000 */ void* volatile SubSegmentCode;
      /* 0x0004 */ unsigned short PreviousSize;
      union
      {
        /* 0x0006 */ unsigned char SegmentOffset;
        struct
        {
          /* 0x0006 */ unsigned char LFHFlags;
          /* 0x0007 */ unsigned char UnusedBytes;
        }; /* size: 0x0002 */
      }; /* size: 0x0002 */
    }; /* size: 0x0008 */
    struct
    {
      /* 0x0000 */ unsigned short FunctionIndex;
      /* 0x0002 */ unsigned short ContextValue;
    }; /* size: 0x0004 */
    struct
    {
      /* 0x0000 */ unsigned long InterceptorValue;
      /* 0x0004 */ unsigned short UnusedBytesLength;
      /* 0x0006 */ unsigned char EntryOffset;
      /* 0x0007 */ unsigned char ExtendedBlockSignature;
    }; /* size: 0x0008 */
    struct
    {
      /* 0x0000 */ unsigned long Code1;
      /* 0x0004 */ unsigned short Code2;
      /* 0x0006 */ unsigned char Code3;
      /* 0x0007 */ unsigned char Code4;
    }; /* size: 0x0008 */
    /* 0x0000 */ unsigned __int64 AgregateCode;
  }; /* size: 0x0008 */
} HEAP_ENTRY, *PHEAP_ENTRY; /* size: 0x0008 */

typedef struct _HEAP_ENTRY_EXTRA
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned short AllocatorBackTraceIndex;
      /* 0x0002 */ unsigned short TagIndex;
      /* 0x0004 */ unsigned long Settable;
    }; /* size: 0x0008 */
    /* 0x0000 */ unsigned __int64 ZeroInit;
  }; /* size: 0x0008 */
} HEAP_ENTRY_EXTRA, *PHEAP_ENTRY_EXTRA; /* size: 0x0008 */

typedef enum _HEAP_FAILURE_TYPE
{
  heap_failure_internal = 0,
  heap_failure_unknown = 1,
  heap_failure_generic = 2,
  heap_failure_entry_corruption = 3,
  heap_failure_multiple_entries_corruption = 4,
  heap_failure_virtual_block_corruption = 5,
  heap_failure_buffer_overrun = 6,
  heap_failure_buffer_underrun = 7,
  heap_failure_block_not_busy = 8,
  heap_failure_invalid_argument = 9,
  heap_failure_usage_after_free = 10,
  heap_failure_cross_heap_operation = 11,
  heap_failure_freelists_corruption = 12,
  heap_failure_listentry_corruption = 13,
} HEAP_FAILURE_TYPE, *PHEAP_FAILURE_TYPE;

typedef struct _HEAP_FREE_ENTRY
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned short Size;
      /* 0x0002 */ unsigned char Flags;
      /* 0x0003 */ unsigned char SmallTagIndex;
    }; /* size: 0x0004 */
    struct
    {
      /* 0x0000 */ void* volatile SubSegmentCode;
      /* 0x0004 */ unsigned short PreviousSize;
      union
      {
        /* 0x0006 */ unsigned char SegmentOffset;
        struct
        {
          /* 0x0006 */ unsigned char LFHFlags;
          /* 0x0007 */ unsigned char UnusedBytes;
        }; /* size: 0x0002 */
      }; /* size: 0x0002 */
    }; /* size: 0x0008 */
    struct
    {
      /* 0x0000 */ unsigned short FunctionIndex;
      /* 0x0002 */ unsigned short ContextValue;
    }; /* size: 0x0004 */
    struct
    {
      /* 0x0000 */ unsigned long InterceptorValue;
      /* 0x0004 */ unsigned short UnusedBytesLength;
      /* 0x0006 */ unsigned char EntryOffset;
      /* 0x0007 */ unsigned char ExtendedBlockSignature;
    }; /* size: 0x0008 */
    struct
    {
      /* 0x0000 */ unsigned long Code1;
      /* 0x0004 */ unsigned short Code2;
      /* 0x0006 */ unsigned char Code3;
      /* 0x0007 */ unsigned char Code4;
    }; /* size: 0x0008 */
    /* 0x0000 */ unsigned __int64 AgregateCode;
  }; /* size: 0x0008 */
  /* 0x0008 */ struct _LIST_ENTRY FreeList;
} HEAP_FREE_ENTRY, *PHEAP_FREE_ENTRY; /* size: 0x0010 */

typedef struct _HEAP_FREE_ENTRY_EXTRA
{
  /* 0x0000 */ unsigned short TagIndex;
  /* 0x0002 */ unsigned short FreeBackTraceIndex;
} HEAP_FREE_ENTRY_EXTRA, *PHEAP_FREE_ENTRY_EXTRA; /* size: 0x0004 */

typedef struct _HEAP_LIST_LOOKUP
{
  /* 0x0000 */ struct _HEAP_LIST_LOOKUP* ExtendedLookup;
  /* 0x0004 */ unsigned long ArraySize;
  /* 0x0008 */ unsigned long ExtraItem;
  /* 0x000c */ unsigned long ItemCount;
  /* 0x0010 */ unsigned long OutOfRangeItems;
  /* 0x0014 */ unsigned long BaseIndex;
  /* 0x0018 */ struct _LIST_ENTRY* ListHead;
  /* 0x001c */ unsigned long* ListsInUseUlong;
  /* 0x0020 */ struct _LIST_ENTRY** ListHints;
} HEAP_LIST_LOOKUP, *PHEAP_LIST_LOOKUP; /* size: 0x0024 */

struct _HEAP_LOCAL_SEGMENT_INFO;

typedef struct _HEAP_LOCK
{
  union
  {
    /* 0x0000 */ struct _RTL_CRITICAL_SECTION CriticalSection;
  } /* size: 0x0018 */ Lock;
} HEAP_LOCK, *PHEAP_LOCK; /* size: 0x0018 */

typedef struct _HEAP_LOOKASIDE
{
  /* 0x0000 */ union _SLIST_HEADER ListHead;
  /* 0x0008 */ unsigned short Depth;
  /* 0x000a */ unsigned short MaximumDepth;
  /* 0x000c */ unsigned long TotalAllocates;
  /* 0x0010 */ unsigned long AllocateMisses;
  /* 0x0014 */ unsigned long TotalFrees;
  /* 0x0018 */ unsigned long FreeMisses;
  /* 0x001c */ unsigned long LastTotalAllocates;
  /* 0x0020 */ unsigned long LastAllocateMisses;
  /* 0x0024 */ unsigned long Counters[2];
  /* 0x002c */ long __PADDING__[1];
} HEAP_LOOKASIDE, *PHEAP_LOOKASIDE; /* size: 0x0030 */

typedef struct _HEAP_PSEUDO_TAG_ENTRY
{
  /* 0x0000 */ unsigned long Allocs;
  /* 0x0004 */ unsigned long Frees;
  /* 0x0008 */ unsigned long Size;
} HEAP_PSEUDO_TAG_ENTRY, *PHEAP_PSEUDO_TAG_ENTRY; /* size: 0x000c */

typedef struct _HEAP_SEGMENT
{
  /* 0x0000 */ struct _HEAP_ENTRY Entry;
  /* 0x0008 */ unsigned long SegmentSignature;
  /* 0x000c */ unsigned long SegmentFlags;
  /* 0x0010 */ struct _LIST_ENTRY SegmentListEntry;
  /* 0x0018 */ struct _HEAP* Heap;
  /* 0x001c */ void* BaseAddress;
  /* 0x0020 */ unsigned long NumberOfPages;
  /* 0x0024 */ struct _HEAP_ENTRY* FirstEntry;
  /* 0x0028 */ struct _HEAP_ENTRY* LastValidEntry;
  /* 0x002c */ unsigned long NumberOfUnCommittedPages;
  /* 0x0030 */ unsigned long NumberOfUnCommittedRanges;
  /* 0x0034 */ unsigned short SegmentAllocatorBackTraceIndex;
  /* 0x0036 */ unsigned short Reserved;
  /* 0x0038 */ struct _LIST_ENTRY UCRSegmentList;
} HEAP_SEGMENT, *PHEAP_SEGMENT; /* size: 0x0040 */

typedef struct _HEAP_STOP_ON_TAG
{
  union
  {
    /* 0x0000 */ unsigned long HeapAndTagIndex;
    struct
    {
      /* 0x0000 */ unsigned short TagIndex;
      /* 0x0002 */ unsigned short HeapIndex;
    }; /* size: 0x0004 */
  }; /* size: 0x0004 */
} HEAP_STOP_ON_TAG, *PHEAP_STOP_ON_TAG; /* size: 0x0004 */

typedef struct _HEAP_STOP_ON_VALUES
{
  /* 0x0000 */ unsigned long AllocAddress;
  /* 0x0004 */ struct _HEAP_STOP_ON_TAG AllocTag;
  /* 0x0008 */ unsigned long ReAllocAddress;
  /* 0x000c */ struct _HEAP_STOP_ON_TAG ReAllocTag;
  /* 0x0010 */ unsigned long FreeAddress;
  /* 0x0014 */ struct _HEAP_STOP_ON_TAG FreeTag;
} HEAP_STOP_ON_VALUES, *PHEAP_STOP_ON_VALUES; /* size: 0x0018 */

typedef struct _HEAP_SUBSEGMENT
{
  /* 0x0000 */ struct _HEAP_LOCAL_SEGMENT_INFO* LocalInfo;
  /* 0x0004 */ volatile struct _HEAP_USERDATA_HEADER* UserBlocks;
  /* 0x0008 */ struct _INTERLOCK_SEQ AggregateExchg;
  union
  {
    struct
    {
      /* 0x0010 */ unsigned short BlockSize;
      /* 0x0012 */ unsigned short Flags;
      /* 0x0014 */ unsigned short BlockCount;
      /* 0x0016 */ unsigned char SizeIndex;
      /* 0x0017 */ unsigned char AffinityIndex;
    }; /* size: 0x0008 */
    /* 0x0010 */ unsigned long Alignment[2];
  }; /* size: 0x0008 */
  /* 0x0018 */ struct _SINGLE_LIST_ENTRY SFreeListEntry;
  /* 0x001c */ volatile unsigned long Lock;
} HEAP_SUBSEGMENT, *PHEAP_SUBSEGMENT; /* size: 0x0020 */

typedef struct _HEAP_TAG_ENTRY
{
  /* 0x0000 */ unsigned long Allocs;
  /* 0x0004 */ unsigned long Frees;
  /* 0x0008 */ unsigned long Size;
  /* 0x000c */ unsigned short TagIndex;
  /* 0x000e */ unsigned short CreatorBackTraceIndex;
  /* 0x0010 */ wchar_t TagName[24];
} HEAP_TAG_ENTRY, *PHEAP_TAG_ENTRY; /* size: 0x0040 */

typedef struct _HEAP_TUNING_PARAMETERS
{
  /* 0x0000 */ unsigned long CommittThresholdShift;
  /* 0x0004 */ unsigned long MaxPreCommittThreshold;
} HEAP_TUNING_PARAMETERS, *PHEAP_TUNING_PARAMETERS; /* size: 0x0008 */

typedef struct _HEAP_UCR_DESCRIPTOR
{
  /* 0x0000 */ struct _LIST_ENTRY ListEntry;
  /* 0x0008 */ struct _LIST_ENTRY SegmentEntry;
  /* 0x0010 */ void* Address;
  /* 0x0014 */ unsigned long Size;
} HEAP_UCR_DESCRIPTOR, *PHEAP_UCR_DESCRIPTOR; /* size: 0x0018 */

typedef struct _HEAP_USERDATA_HEADER
{
  union
  {
    /* 0x0000 */ struct _SINGLE_LIST_ENTRY SFreeListEntry;
    /* 0x0000 */ struct _HEAP_SUBSEGMENT* SubSegment;
  }; /* size: 0x0004 */
  /* 0x0004 */ void* Reserved;
  /* 0x0008 */ unsigned long SizeIndex;
  /* 0x000c */ unsigned long Signature;
} HEAP_USERDATA_HEADER, *PHEAP_USERDATA_HEADER; /* size: 0x0010 */

typedef struct _HEAP_VIRTUAL_ALLOC_ENTRY
{
  /* 0x0000 */ struct _LIST_ENTRY Entry;
  /* 0x0008 */ struct _HEAP_ENTRY_EXTRA ExtraStuff;
  /* 0x0010 */ unsigned long CommitSize;
  /* 0x0014 */ unsigned long ReserveSize;
  /* 0x0018 */ struct _HEAP_ENTRY BusyBlock;
} HEAP_VIRTUAL_ALLOC_ENTRY, *PHEAP_VIRTUAL_ALLOC_ENTRY; /* size: 0x0020 */

typedef struct _HHIVE
{
  /* 0x0000 */ unsigned long Signature;
  /* 0x0004 */ void* GetCellRoutine /* function */;
  /* 0x0008 */ void* ReleaseCellRoutine /* function */;
  /* 0x000c */ void* Allocate /* function */;
  /* 0x0010 */ void* Free /* function */;
  /* 0x0014 */ void* FileSetSize /* function */;
  /* 0x0018 */ void* FileWrite /* function */;
  /* 0x001c */ void* FileRead /* function */;
  /* 0x0020 */ void* FileFlush /* function */;
  /* 0x0024 */ struct _HBASE_BLOCK* BaseBlock;
  /* 0x0028 */ struct _RTL_BITMAP DirtyVector;
  /* 0x0030 */ unsigned long DirtyCount;
  /* 0x0034 */ unsigned long DirtyAlloc;
  /* 0x0038 */ unsigned long BaseBlockAlloc;
  /* 0x003c */ unsigned long Cluster;
  /* 0x0040 */ unsigned char Flat;
  /* 0x0041 */ unsigned char ReadOnly;
  /* 0x0042 */ unsigned char DirtyFlag;
  /* 0x0044 */ unsigned long HvBinHeadersUse;
  /* 0x0048 */ unsigned long HvFreeCellsUse;
  /* 0x004c */ unsigned long HvUsedCellsUse;
  /* 0x0050 */ unsigned long CmUsedCellsUse;
  /* 0x0054 */ unsigned long HiveFlags;
  /* 0x0058 */ unsigned long CurrentLog;
  /* 0x005c */ unsigned long LogSize[2];
  /* 0x0064 */ unsigned long RefreshCount;
  /* 0x0068 */ unsigned long StorageTypeCount;
  /* 0x006c */ unsigned long Version;
  /* 0x0070 */ struct _DUAL Storage[2];
} HHIVE, *PHHIVE; /* size: 0x02e8 */

typedef struct _HIVE_LIST_ENTRY
{
  /* 0x0000 */ unsigned short* FileName;
  /* 0x0004 */ unsigned short* BaseName;
  /* 0x0008 */ unsigned short* RegRootName;
  /* 0x000c */ struct _CMHIVE* CmHive;
  /* 0x0010 */ unsigned long HHiveFlags;
  /* 0x0014 */ unsigned long CmHiveFlags;
  /* 0x0018 */ struct _CMHIVE* CmHive2;
  /* 0x001c */ unsigned char ThreadFinished;
  /* 0x001d */ unsigned char ThreadStarted;
  /* 0x001e */ unsigned char Allocate;
  /* 0x001f */ unsigned char WinPERequired;
} HIVE_LIST_ENTRY, *PHIVE_LIST_ENTRY; /* size: 0x0020 */

typedef struct _HMAP_DIRECTORY
{
  /* 0x0000 */ struct _HMAP_TABLE* Directory[1024];
} HMAP_DIRECTORY, *PHMAP_DIRECTORY; /* size: 0x1000 */

typedef struct _HMAP_ENTRY
{
  /* 0x0000 */ unsigned long BlockAddress;
  /* 0x0004 */ unsigned long BinAddress;
  /* 0x0008 */ struct _CM_VIEW_OF_FILE* CmView;
  /* 0x000c */ unsigned long MemAlloc;
} HMAP_ENTRY, *PHMAP_ENTRY; /* size: 0x0010 */

typedef struct _HMAP_TABLE
{
  /* 0x0000 */ struct _HMAP_ENTRY Table[512];
} HMAP_TABLE, *PHMAP_TABLE; /* size: 0x2000 */

typedef struct _I386_LOADER_BLOCK
{
  /* 0x0000 */ void* CommonDataArea;
  /* 0x0004 */ unsigned long MachineType;
  /* 0x0008 */ unsigned long VirtualBias;
} I386_LOADER_BLOCK, *PI386_LOADER_BLOCK; /* size: 0x000c */

typedef struct _IA64_DBGKD_CONTROL_SET
{
  /* 0x0000 */ unsigned long Continue;
  /* 0x0004 */ unsigned __int64 CurrentSymbolStart;
  /* 0x000c */ unsigned __int64 CurrentSymbolEnd;
} IA64_DBGKD_CONTROL_SET, *PIA64_DBGKD_CONTROL_SET; /* size: 0x0014 */

typedef struct _IA64_LOADER_BLOCK
{
  /* 0x0000 */ unsigned long PlaceHolder;
} IA64_LOADER_BLOCK, *PIA64_LOADER_BLOCK; /* size: 0x0004 */

typedef struct _IMAGE_DATA_DIRECTORY
{
  /* 0x0000 */ unsigned long VirtualAddress;
  /* 0x0004 */ unsigned long Size;
} IMAGE_DATA_DIRECTORY, *PIMAGE_DATA_DIRECTORY; /* size: 0x0008 */

typedef struct _IMAGE_DEBUG_DIRECTORY
{
  /* 0x0000 */ unsigned long Characteristics;
  /* 0x0004 */ unsigned long TimeDateStamp;
  /* 0x0008 */ unsigned short MajorVersion;
  /* 0x000a */ unsigned short MinorVersion;
  /* 0x000c */ unsigned long Type;
  /* 0x0010 */ unsigned long SizeOfData;
  /* 0x0014 */ unsigned long AddressOfRawData;
  /* 0x0018 */ unsigned long PointerToRawData;
} IMAGE_DEBUG_DIRECTORY, *PIMAGE_DEBUG_DIRECTORY; /* size: 0x001c */

typedef struct _IMAGE_DOS_HEADER
{
  /* 0x0000 */ unsigned short e_magic;
  /* 0x0002 */ unsigned short e_cblp;
  /* 0x0004 */ unsigned short e_cp;
  /* 0x0006 */ unsigned short e_crlc;
  /* 0x0008 */ unsigned short e_cparhdr;
  /* 0x000a */ unsigned short e_minalloc;
  /* 0x000c */ unsigned short e_maxalloc;
  /* 0x000e */ unsigned short e_ss;
  /* 0x0010 */ unsigned short e_sp;
  /* 0x0012 */ unsigned short e_csum;
  /* 0x0014 */ unsigned short e_ip;
  /* 0x0016 */ unsigned short e_cs;
  /* 0x0018 */ unsigned short e_lfarlc;
  /* 0x001a */ unsigned short e_ovno;
  /* 0x001c */ unsigned short e_res[4];
  /* 0x0024 */ unsigned short e_oemid;
  /* 0x0026 */ unsigned short e_oeminfo;
  /* 0x0028 */ unsigned short e_res2[10];
  /* 0x003c */ long e_lfanew;
} IMAGE_DOS_HEADER, *PIMAGE_DOS_HEADER; /* size: 0x0040 */

typedef struct _IMAGE_FILE_HEADER
{
  /* 0x0000 */ unsigned short Machine;
  /* 0x0002 */ unsigned short NumberOfSections;
  /* 0x0004 */ unsigned long TimeDateStamp;
  /* 0x0008 */ unsigned long PointerToSymbolTable;
  /* 0x000c */ unsigned long NumberOfSymbols;
  /* 0x0010 */ unsigned short SizeOfOptionalHeader;
  /* 0x0012 */ unsigned short Characteristics;
} IMAGE_FILE_HEADER, *PIMAGE_FILE_HEADER; /* size: 0x0014 */

typedef struct _IMAGE_NT_HEADERS
{
  /* 0x0000 */ unsigned long Signature;
  /* 0x0004 */ struct _IMAGE_FILE_HEADER FileHeader;
  /* 0x0018 */ struct _IMAGE_OPTIONAL_HEADER OptionalHeader;
} IMAGE_NT_HEADERS, *PIMAGE_NT_HEADERS; /* size: 0x00f8 */

typedef struct _IMAGE_OPTIONAL_HEADER
{
  /* 0x0000 */ unsigned short Magic;
  /* 0x0002 */ unsigned char MajorLinkerVersion;
  /* 0x0003 */ unsigned char MinorLinkerVersion;
  /* 0x0004 */ unsigned long SizeOfCode;
  /* 0x0008 */ unsigned long SizeOfInitializedData;
  /* 0x000c */ unsigned long SizeOfUninitializedData;
  /* 0x0010 */ unsigned long AddressOfEntryPoint;
  /* 0x0014 */ unsigned long BaseOfCode;
  /* 0x0018 */ unsigned long BaseOfData;
  /* 0x001c */ unsigned long ImageBase;
  /* 0x0020 */ unsigned long SectionAlignment;
  /* 0x0024 */ unsigned long FileAlignment;
  /* 0x0028 */ unsigned short MajorOperatingSystemVersion;
  /* 0x002a */ unsigned short MinorOperatingSystemVersion;
  /* 0x002c */ unsigned short MajorImageVersion;
  /* 0x002e */ unsigned short MinorImageVersion;
  /* 0x0030 */ unsigned short MajorSubsystemVersion;
  /* 0x0032 */ unsigned short MinorSubsystemVersion;
  /* 0x0034 */ unsigned long Win32VersionValue;
  /* 0x0038 */ unsigned long SizeOfImage;
  /* 0x003c */ unsigned long SizeOfHeaders;
  /* 0x0040 */ unsigned long CheckSum;
  /* 0x0044 */ unsigned short Subsystem;
  /* 0x0046 */ unsigned short DllCharacteristics;
  /* 0x0048 */ unsigned long SizeOfStackReserve;
  /* 0x004c */ unsigned long SizeOfStackCommit;
  /* 0x0050 */ unsigned long SizeOfHeapReserve;
  /* 0x0054 */ unsigned long SizeOfHeapCommit;
  /* 0x0058 */ unsigned long LoaderFlags;
  /* 0x005c */ unsigned long NumberOfRvaAndSizes;
  /* 0x0060 */ struct _IMAGE_DATA_DIRECTORY DataDirectory[16];
} IMAGE_OPTIONAL_HEADER, *PIMAGE_OPTIONAL_HEADER; /* size: 0x00e0 */

typedef struct _IMAGE_ROM_OPTIONAL_HEADER
{
  /* 0x0000 */ unsigned short Magic;
  /* 0x0002 */ unsigned char MajorLinkerVersion;
  /* 0x0003 */ unsigned char MinorLinkerVersion;
  /* 0x0004 */ unsigned long SizeOfCode;
  /* 0x0008 */ unsigned long SizeOfInitializedData;
  /* 0x000c */ unsigned long SizeOfUninitializedData;
  /* 0x0010 */ unsigned long AddressOfEntryPoint;
  /* 0x0014 */ unsigned long BaseOfCode;
  /* 0x0018 */ unsigned long BaseOfData;
  /* 0x001c */ unsigned long BaseOfBss;
  /* 0x0020 */ unsigned long GprMask;
  /* 0x0024 */ unsigned long CprMask[4];
  /* 0x0034 */ unsigned long GpValue;
} IMAGE_ROM_OPTIONAL_HEADER, *PIMAGE_ROM_OPTIONAL_HEADER; /* size: 0x0038 */

typedef struct _IMAGE_SECTION_HEADER
{
  /* 0x0000 */ unsigned char Name[8];
  union
  {
    union
    {
      /* 0x0008 */ unsigned long PhysicalAddress;
      /* 0x0008 */ unsigned long VirtualSize;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ Misc;
  /* 0x000c */ unsigned long VirtualAddress;
  /* 0x0010 */ unsigned long SizeOfRawData;
  /* 0x0014 */ unsigned long PointerToRawData;
  /* 0x0018 */ unsigned long PointerToRelocations;
  /* 0x001c */ unsigned long PointerToLinenumbers;
  /* 0x0020 */ unsigned short NumberOfRelocations;
  /* 0x0022 */ unsigned short NumberOfLinenumbers;
  /* 0x0024 */ unsigned long Characteristics;
} IMAGE_SECTION_HEADER, *PIMAGE_SECTION_HEADER; /* size: 0x0028 */

typedef struct _IMAGE_SECURITY_CONTEXT
{
  union
  {
    /* 0x0000 */ void* PageHashes;
    /* 0x0000 */ unsigned long Value;
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long SecurityBeingCreated : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned long SecurityMandatory : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned long Unused : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned long PageHashPointer : 29; /* bit position: 3 */
    }; /* bitfield */
  }; /* size: 0x0004 */
} IMAGE_SECURITY_CONTEXT, *PIMAGE_SECURITY_CONTEXT; /* size: 0x0004 */

typedef struct _INITIAL_PRIVILEGE_SET
{
  /* 0x0000 */ unsigned long PrivilegeCount;
  /* 0x0004 */ unsigned long Control;
  /* 0x0008 */ struct _LUID_AND_ATTRIBUTES Privilege[3];
} INITIAL_PRIVILEGE_SET, *PINITIAL_PRIVILEGE_SET; /* size: 0x002c */

typedef struct _INTERFACE
{
  /* 0x0000 */ unsigned short Size;
  /* 0x0002 */ unsigned short Version;
  /* 0x0004 */ void* Context;
  /* 0x0008 */ void* InterfaceReference /* function */;
  /* 0x000c */ void* InterfaceDereference /* function */;
} INTERFACE, *PINTERFACE; /* size: 0x0010 */

typedef enum _INTERFACE_TYPE
{
  InterfaceTypeUndefined = -1,
  Internal = 0,
  Isa = 1,
  Eisa = 2,
  MicroChannel = 3,
  TurboChannel = 4,
  PCIBus = 5,
  VMEBus = 6,
  NuBus = 7,
  PCMCIABus = 8,
  CBus = 9,
  MPIBus = 10,
  MPSABus = 11,
  ProcessorInternal = 12,
  InternalPowerBus = 13,
  PNPISABus = 14,
  PNPBus = 15,
  Vmcs = 16,
  MaximumInterfaceType = 17,
} INTERFACE_TYPE, *PINTERFACE_TYPE;

typedef struct _INTERLOCK_SEQ
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned short Depth;
      /* 0x0002 */ unsigned short FreeEntryOffset;
    }; /* size: 0x0004 */
    struct
    {
      /* 0x0000 */ volatile unsigned long OffsetAndDepth;
      /* 0x0004 */ volatile unsigned long Sequence;
    }; /* size: 0x0008 */
    /* 0x0000 */ volatile __int64 Exchg;
  }; /* size: 0x0008 */
} INTERLOCK_SEQ, *PINTERLOCK_SEQ; /* size: 0x0008 */

typedef struct _IOV_FORCED_PENDING_TRACE
{
  /* 0x0000 */ struct _IRP* Irp;
  /* 0x0004 */ void* StackTrace[63];
} IOV_FORCED_PENDING_TRACE, *PIOV_FORCED_PENDING_TRACE; /* size: 0x0100 */

typedef enum _IO_ALLOCATION_ACTION
{
  KeepObject = 1,
  DeallocateObject = 2,
  DeallocateObjectKeepRegisters = 3,
} IO_ALLOCATION_ACTION, *PIO_ALLOCATION_ACTION;

typedef struct _IO_CLIENT_EXTENSION
{
  /* 0x0000 */ struct _IO_CLIENT_EXTENSION* NextExtension;
  /* 0x0004 */ void* ClientIdentificationAddress;
} IO_CLIENT_EXTENSION, *PIO_CLIENT_EXTENSION; /* size: 0x0008 */

typedef struct _IO_COMPLETION_CONTEXT
{
  /* 0x0000 */ void* Port;
  /* 0x0004 */ void* Key;
} IO_COMPLETION_CONTEXT, *PIO_COMPLETION_CONTEXT; /* size: 0x0008 */

typedef struct _IO_DRIVER_CREATE_CONTEXT
{
  /* 0x0000 */ short Size;
  /* 0x0004 */ struct _ECP_LIST* ExtraCreateParameter;
  /* 0x0008 */ void* DeviceObjectHint;
  /* 0x000c */ struct _TXN_PARAMETER_BLOCK* TxnParameters;
} IO_DRIVER_CREATE_CONTEXT, *PIO_DRIVER_CREATE_CONTEXT; /* size: 0x0010 */

typedef enum _IO_PAGING_PRIORITY
{
  IoPagingPriorityInvalid = 0,
  IoPagingPriorityNormal = 1,
  IoPagingPriorityHigh = 2,
  IoPagingPriorityReserved1 = 3,
  IoPagingPriorityReserved2 = 4,
} IO_PAGING_PRIORITY, *PIO_PAGING_PRIORITY;

typedef enum _IO_PRIORITY_HINT
{
  IoPriorityVeryLow = 0,
  IoPriorityLow = 1,
  IoPriorityNormal = 2,
  IoPriorityHigh = 3,
  IoPriorityCritical = 4,
  MaxIoPriorityTypes = 5,
} IO_PRIORITY_HINT, *PIO_PRIORITY_HINT;

typedef struct _IO_PRIORITY_INFO
{
  /* 0x0000 */ unsigned long Size;
  /* 0x0004 */ unsigned long ThreadPriority;
  /* 0x0008 */ unsigned long PagePriority;
  /* 0x000c */ enum _IO_PRIORITY_HINT IoPriority;
} IO_PRIORITY_INFO, *PIO_PRIORITY_INFO; /* size: 0x0010 */

typedef struct _IO_RESOURCE_DESCRIPTOR
{
  /* 0x0000 */ unsigned char Option;
  /* 0x0001 */ unsigned char Type;
  /* 0x0002 */ unsigned char ShareDisposition;
  /* 0x0003 */ unsigned char Spare1;
  /* 0x0004 */ unsigned short Flags;
  /* 0x0006 */ unsigned short Spare2;
  union
  {
    union
    {
      struct
      {
        /* 0x0008 */ unsigned long Length;
        /* 0x000c */ unsigned long Alignment;
        /* 0x0010 */ union _LARGE_INTEGER MinimumAddress;
        /* 0x0018 */ union _LARGE_INTEGER MaximumAddress;
      } /* size: 0x0018 */ Port;
      struct
      {
        /* 0x0008 */ unsigned long Length;
        /* 0x000c */ unsigned long Alignment;
        /* 0x0010 */ union _LARGE_INTEGER MinimumAddress;
        /* 0x0018 */ union _LARGE_INTEGER MaximumAddress;
      } /* size: 0x0018 */ Memory;
      struct
      {
        /* 0x0008 */ unsigned long MinimumVector;
        /* 0x000c */ unsigned long MaximumVector;
        /* 0x0010 */ enum _IRQ_DEVICE_POLICY AffinityPolicy;
        /* 0x0014 */ enum _IRQ_PRIORITY PriorityPolicy;
        /* 0x0018 */ unsigned long TargetedProcessors;
      } /* size: 0x0014 */ Interrupt;
      struct
      {
        /* 0x0008 */ unsigned long MinimumChannel;
        /* 0x000c */ unsigned long MaximumChannel;
      } /* size: 0x0008 */ Dma;
      struct
      {
        /* 0x0008 */ unsigned long Length;
        /* 0x000c */ unsigned long Alignment;
        /* 0x0010 */ union _LARGE_INTEGER MinimumAddress;
        /* 0x0018 */ union _LARGE_INTEGER MaximumAddress;
      } /* size: 0x0018 */ Generic;
      struct
      {
        /* 0x0008 */ unsigned long Data[3];
      } /* size: 0x000c */ DevicePrivate;
      struct
      {
        /* 0x0008 */ unsigned long Length;
        /* 0x000c */ unsigned long MinBusNumber;
        /* 0x0010 */ unsigned long MaxBusNumber;
        /* 0x0014 */ unsigned long Reserved;
      } /* size: 0x0010 */ BusNumber;
      struct
      {
        /* 0x0008 */ unsigned long Priority;
        /* 0x000c */ unsigned long Reserved1;
        /* 0x0010 */ unsigned long Reserved2;
      } /* size: 0x000c */ ConfigData;
      struct
      {
        /* 0x0008 */ unsigned long Length40;
        /* 0x000c */ unsigned long Alignment40;
        /* 0x0010 */ union _LARGE_INTEGER MinimumAddress;
        /* 0x0018 */ union _LARGE_INTEGER MaximumAddress;
      } /* size: 0x0018 */ Memory40;
      struct
      {
        /* 0x0008 */ unsigned long Length48;
        /* 0x000c */ unsigned long Alignment48;
        /* 0x0010 */ union _LARGE_INTEGER MinimumAddress;
        /* 0x0018 */ union _LARGE_INTEGER MaximumAddress;
      } /* size: 0x0018 */ Memory48;
      struct
      {
        /* 0x0008 */ unsigned long Length64;
        /* 0x000c */ unsigned long Alignment64;
        /* 0x0010 */ union _LARGE_INTEGER MinimumAddress;
        /* 0x0018 */ union _LARGE_INTEGER MaximumAddress;
      } /* size: 0x0018 */ Memory64;
    }; /* size: 0x0018 */
  } /* size: 0x0018 */ u;
} IO_RESOURCE_DESCRIPTOR, *PIO_RESOURCE_DESCRIPTOR; /* size: 0x0020 */

typedef struct _IO_RESOURCE_LIST
{
  /* 0x0000 */ unsigned short Version;
  /* 0x0002 */ unsigned short Revision;
  /* 0x0004 */ unsigned long Count;
  /* 0x0008 */ struct _IO_RESOURCE_DESCRIPTOR Descriptors[1];
} IO_RESOURCE_LIST, *PIO_RESOURCE_LIST; /* size: 0x0028 */

typedef struct _IO_RESOURCE_REQUIREMENTS_LIST
{
  /* 0x0000 */ unsigned long ListSize;
  /* 0x0004 */ enum _INTERFACE_TYPE InterfaceType;
  /* 0x0008 */ unsigned long BusNumber;
  /* 0x000c */ unsigned long SlotNumber;
  /* 0x0010 */ unsigned long Reserved[3];
  /* 0x001c */ unsigned long AlternativeLists;
  /* 0x0020 */ struct _IO_RESOURCE_LIST List[1];
} IO_RESOURCE_REQUIREMENTS_LIST, *PIO_RESOURCE_REQUIREMENTS_LIST; /* size: 0x0048 */

typedef struct _IO_SECURITY_CONTEXT
{
  /* 0x0000 */ struct _SECURITY_QUALITY_OF_SERVICE* SecurityQos;
  /* 0x0004 */ struct _ACCESS_STATE* AccessState;
  /* 0x0008 */ unsigned long DesiredAccess;
  /* 0x000c */ unsigned long FullCreateOptions;
} IO_SECURITY_CONTEXT, *PIO_SECURITY_CONTEXT; /* size: 0x0010 */

typedef struct _IO_STACK_LOCATION
{
  /* 0x0000 */ unsigned char MajorFunction;
  /* 0x0001 */ unsigned char MinorFunction;
  /* 0x0002 */ unsigned char Flags;
  /* 0x0003 */ unsigned char Control;
  union
  {
    union
    {
      struct
      {
        /* 0x0004 */ struct _IO_SECURITY_CONTEXT* SecurityContext;
        /* 0x0008 */ unsigned long Options;
        /* 0x000c */ unsigned short FileAttributes;
        /* 0x000e */ unsigned short ShareAccess;
        /* 0x0010 */ unsigned long EaLength;
      } /* size: 0x0010 */ Create;
      struct
      {
        /* 0x0004 */ struct _IO_SECURITY_CONTEXT* SecurityContext;
        /* 0x0008 */ unsigned long Options;
        /* 0x000c */ unsigned short Reserved;
        /* 0x000e */ unsigned short ShareAccess;
        /* 0x0010 */ struct _NAMED_PIPE_CREATE_PARAMETERS* Parameters;
      } /* size: 0x0010 */ CreatePipe;
      struct
      {
        /* 0x0004 */ struct _IO_SECURITY_CONTEXT* SecurityContext;
        /* 0x0008 */ unsigned long Options;
        /* 0x000c */ unsigned short Reserved;
        /* 0x000e */ unsigned short ShareAccess;
        /* 0x0010 */ struct _MAILSLOT_CREATE_PARAMETERS* Parameters;
      } /* size: 0x0010 */ CreateMailslot;
      struct
      {
        /* 0x0004 */ unsigned long Length;
        /* 0x0008 */ unsigned long Key;
        /* 0x000c */ union _LARGE_INTEGER ByteOffset;
      } /* size: 0x0010 */ Read;
      struct
      {
        /* 0x0004 */ unsigned long Length;
        /* 0x0008 */ unsigned long Key;
        /* 0x000c */ union _LARGE_INTEGER ByteOffset;
      } /* size: 0x0010 */ Write;
      struct
      {
        /* 0x0004 */ unsigned long Length;
        /* 0x0008 */ struct _UNICODE_STRING* FileName;
        /* 0x000c */ enum _FILE_INFORMATION_CLASS FileInformationClass;
        /* 0x0010 */ unsigned long FileIndex;
      } /* size: 0x0010 */ QueryDirectory;
      struct
      {
        /* 0x0004 */ unsigned long Length;
        /* 0x0008 */ unsigned long CompletionFilter;
      } /* size: 0x0008 */ NotifyDirectory;
      struct
      {
        /* 0x0004 */ unsigned long Length;
        /* 0x0008 */ enum _FILE_INFORMATION_CLASS FileInformationClass;
      } /* size: 0x0008 */ QueryFile;
      struct
      {
        /* 0x0004 */ unsigned long Length;
        /* 0x0008 */ enum _FILE_INFORMATION_CLASS FileInformationClass;
        /* 0x000c */ struct _FILE_OBJECT* FileObject;
        union
        {
          struct
          {
            /* 0x0010 */ unsigned char ReplaceIfExists;
            /* 0x0011 */ unsigned char AdvanceOnly;
          }; /* size: 0x0002 */
          /* 0x0010 */ unsigned long ClusterCount;
          /* 0x0010 */ void* DeleteHandle;
        }; /* size: 0x0004 */
      } /* size: 0x0010 */ SetFile;
      struct
      {
        /* 0x0004 */ unsigned long Length;
        /* 0x0008 */ void* EaList;
        /* 0x000c */ unsigned long EaListLength;
        /* 0x0010 */ unsigned long EaIndex;
      } /* size: 0x0010 */ QueryEa;
      struct
      {
        /* 0x0004 */ unsigned long Length;
      } /* size: 0x0004 */ SetEa;
      struct
      {
        /* 0x0004 */ unsigned long Length;
        /* 0x0008 */ enum _FSINFOCLASS FsInformationClass;
      } /* size: 0x0008 */ QueryVolume;
      struct
      {
        /* 0x0004 */ unsigned long Length;
        /* 0x0008 */ enum _FSINFOCLASS FsInformationClass;
      } /* size: 0x0008 */ SetVolume;
      struct
      {
        /* 0x0004 */ unsigned long OutputBufferLength;
        /* 0x0008 */ unsigned long InputBufferLength;
        /* 0x000c */ unsigned long FsControlCode;
        /* 0x0010 */ void* Type3InputBuffer;
      } /* size: 0x0010 */ FileSystemControl;
      struct
      {
        /* 0x0004 */ union _LARGE_INTEGER* Length;
        /* 0x0008 */ unsigned long Key;
        /* 0x000c */ union _LARGE_INTEGER ByteOffset;
      } /* size: 0x0010 */ LockControl;
      struct
      {
        /* 0x0004 */ unsigned long OutputBufferLength;
        /* 0x0008 */ unsigned long InputBufferLength;
        /* 0x000c */ unsigned long IoControlCode;
        /* 0x0010 */ void* Type3InputBuffer;
      } /* size: 0x0010 */ DeviceIoControl;
      struct
      {
        /* 0x0004 */ unsigned long SecurityInformation;
        /* 0x0008 */ unsigned long Length;
      } /* size: 0x0008 */ QuerySecurity;
      struct
      {
        /* 0x0004 */ unsigned long SecurityInformation;
        /* 0x0008 */ void* SecurityDescriptor;
      } /* size: 0x0008 */ SetSecurity;
      struct
      {
        /* 0x0004 */ struct _VPB* Vpb;
        /* 0x0008 */ struct _DEVICE_OBJECT* DeviceObject;
      } /* size: 0x0008 */ MountVolume;
      struct
      {
        /* 0x0004 */ struct _VPB* Vpb;
        /* 0x0008 */ struct _DEVICE_OBJECT* DeviceObject;
      } /* size: 0x0008 */ VerifyVolume;
      struct
      {
        /* 0x0004 */ struct _SCSI_REQUEST_BLOCK* Srb;
      } /* size: 0x0004 */ Scsi;
      struct
      {
        /* 0x0004 */ unsigned long Length;
        /* 0x0008 */ void* StartSid;
        /* 0x000c */ struct _FILE_GET_QUOTA_INFORMATION* SidList;
        /* 0x0010 */ unsigned long SidListLength;
      } /* size: 0x0010 */ QueryQuota;
      struct
      {
        /* 0x0004 */ unsigned long Length;
      } /* size: 0x0004 */ SetQuota;
      struct
      {
        /* 0x0004 */ enum _DEVICE_RELATION_TYPE Type;
      } /* size: 0x0004 */ QueryDeviceRelations;
      struct
      {
        /* 0x0004 */ const struct _GUID* InterfaceType;
        /* 0x0008 */ unsigned short Size;
        /* 0x000a */ unsigned short Version;
        /* 0x000c */ struct _INTERFACE* Interface;
        /* 0x0010 */ void* InterfaceSpecificData;
      } /* size: 0x0010 */ QueryInterface;
      struct
      {
        /* 0x0004 */ struct _DEVICE_CAPABILITIES* Capabilities;
      } /* size: 0x0004 */ DeviceCapabilities;
      struct
      {
        /* 0x0004 */ struct _IO_RESOURCE_REQUIREMENTS_LIST* IoResourceRequirementList;
      } /* size: 0x0004 */ FilterResourceRequirements;
      struct
      {
        /* 0x0004 */ unsigned long WhichSpace;
        /* 0x0008 */ void* Buffer;
        /* 0x000c */ unsigned long Offset;
        /* 0x0010 */ unsigned long Length;
      } /* size: 0x0010 */ ReadWriteConfig;
      struct
      {
        /* 0x0004 */ unsigned char Lock;
      } /* size: 0x0001 */ SetLock;
      struct
      {
        /* 0x0004 */ enum BUS_QUERY_ID_TYPE IdType;
      } /* size: 0x0004 */ QueryId;
      struct
      {
        /* 0x0004 */ enum DEVICE_TEXT_TYPE DeviceTextType;
        /* 0x0008 */ unsigned long LocaleId;
      } /* size: 0x0008 */ QueryDeviceText;
      struct
      {
        /* 0x0004 */ unsigned char InPath;
        /* 0x0005 */ unsigned char Reserved[3];
        /* 0x0008 */ enum _DEVICE_USAGE_NOTIFICATION_TYPE Type;
      } /* size: 0x0008 */ UsageNotification;
      struct
      {
        /* 0x0004 */ enum _SYSTEM_POWER_STATE PowerState;
      } /* size: 0x0004 */ WaitWake;
      struct
      {
        /* 0x0004 */ struct _POWER_SEQUENCE* PowerSequence;
      } /* size: 0x0004 */ PowerSequence;
      struct
      {
        union
        {
          /* 0x0004 */ unsigned long SystemContext;
          /* 0x0004 */ struct _SYSTEM_POWER_STATE_CONTEXT SystemPowerStateContext;
        }; /* size: 0x0004 */
        /* 0x0008 */ enum _POWER_STATE_TYPE Type;
        /* 0x000c */ union _POWER_STATE State;
        /* 0x0010 */ enum POWER_ACTION ShutdownType;
      } /* size: 0x0010 */ Power;
      struct
      {
        /* 0x0004 */ struct _CM_RESOURCE_LIST* AllocatedResources;
        /* 0x0008 */ struct _CM_RESOURCE_LIST* AllocatedResourcesTranslated;
      } /* size: 0x0008 */ StartDevice;
      struct
      {
        /* 0x0004 */ unsigned long ProviderId;
        /* 0x0008 */ void* DataPath;
        /* 0x000c */ unsigned long BufferSize;
        /* 0x0010 */ void* Buffer;
      } /* size: 0x0010 */ WMI;
      struct
      {
        /* 0x0004 */ void* Argument1;
        /* 0x0008 */ void* Argument2;
        /* 0x000c */ void* Argument3;
        /* 0x0010 */ void* Argument4;
      } /* size: 0x0010 */ Others;
    }; /* size: 0x0010 */
  } /* size: 0x0010 */ Parameters;
  /* 0x0014 */ struct _DEVICE_OBJECT* DeviceObject;
  /* 0x0018 */ struct _FILE_OBJECT* FileObject;
  /* 0x001c */ void* CompletionRoutine /* function */;
  /* 0x0020 */ void* Context;
} IO_STACK_LOCATION, *PIO_STACK_LOCATION; /* size: 0x0024 */

typedef struct _IO_STATUS_BLOCK
{
  union
  {
    /* 0x0000 */ long Status;
    /* 0x0000 */ void* Pointer;
  }; /* size: 0x0004 */
  /* 0x0004 */ unsigned long Information;
} IO_STATUS_BLOCK, *PIO_STATUS_BLOCK; /* size: 0x0008 */

typedef struct _IO_TIMER
{
  /* 0x0000 */ short Type;
  /* 0x0002 */ short TimerFlag;
  /* 0x0004 */ struct _LIST_ENTRY TimerList;
  /* 0x000c */ void* TimerRoutine /* function */;
  /* 0x0010 */ void* Context;
  /* 0x0014 */ struct _DEVICE_OBJECT* DeviceObject;
} IO_TIMER, *PIO_TIMER; /* size: 0x0018 */

typedef struct _IRP
{
  /* 0x0000 */ short Type;
  /* 0x0002 */ unsigned short Size;
  /* 0x0004 */ struct _MDL* MdlAddress;
  /* 0x0008 */ unsigned long Flags;
  union
  {
    union
    {
      /* 0x000c */ struct _IRP* MasterIrp;
      /* 0x000c */ long IrpCount;
      /* 0x000c */ void* SystemBuffer;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ AssociatedIrp;
  /* 0x0010 */ struct _LIST_ENTRY ThreadListEntry;
  /* 0x0018 */ struct _IO_STATUS_BLOCK IoStatus;
  /* 0x0020 */ char RequestorMode;
  /* 0x0021 */ unsigned char PendingReturned;
  /* 0x0022 */ char StackCount;
  /* 0x0023 */ char CurrentLocation;
  /* 0x0024 */ unsigned char Cancel;
  /* 0x0025 */ unsigned char CancelIrql;
  /* 0x0026 */ char ApcEnvironment;
  /* 0x0027 */ unsigned char AllocationFlags;
  /* 0x0028 */ struct _IO_STATUS_BLOCK* UserIosb;
  /* 0x002c */ struct _KEVENT* UserEvent;
  union
  {
    union
    {
      struct
      {
        union
        {
          /* 0x0030 */ void* UserApcRoutine /* function */;
          /* 0x0030 */ void* IssuingProcess;
        }; /* size: 0x0004 */
        /* 0x0034 */ void* UserApcContext;
      } /* size: 0x0008 */ AsynchronousParameters;
      /* 0x0030 */ union _LARGE_INTEGER AllocationSize;
    }; /* size: 0x0008 */
  } /* size: 0x0008 */ Overlay;
  /* 0x0038 */ void* CancelRoutine /* function */;
  /* 0x003c */ void* UserBuffer;
  union
  {
    union
    {
      struct
      {
        union
        {
          /* 0x0040 */ struct _KDEVICE_QUEUE_ENTRY DeviceQueueEntry;
          /* 0x0040 */ void* DriverContext[4];
        }; /* size: 0x0010 */
        /* 0x0050 */ struct _ETHREAD* Thread;
        /* 0x0054 */ char* AuxiliaryBuffer;
        /* 0x0058 */ struct _LIST_ENTRY ListEntry;
        union
        {
          /* 0x0060 */ struct _IO_STACK_LOCATION* CurrentStackLocation;
          /* 0x0060 */ unsigned long PacketType;
        }; /* size: 0x0004 */
        /* 0x0064 */ struct _FILE_OBJECT* OriginalFileObject;
      } /* size: 0x0028 */ Overlay;
      /* 0x0040 */ struct _KAPC Apc;
      /* 0x0040 */ void* CompletionKey;
    }; /* size: 0x0030 */
  } /* size: 0x0030 */ Tail;
} IRP, *PIRP; /* size: 0x0070 */

typedef enum _IRQ_DEVICE_POLICY
{
  IrqPolicyMachineDefault = 0,
  IrqPolicyAllCloseProcessors = 1,
  IrqPolicyOneCloseProcessor = 2,
  IrqPolicyAllProcessorsInMachine = 3,
  IrqPolicySpecifiedProcessors = 4,
  IrqPolicySpreadMessagesAcrossAllProcessors = 5,
} IRQ_DEVICE_POLICY, *PIRQ_DEVICE_POLICY;

typedef enum _IRQ_PRIORITY
{
  IrqPriorityUndefined = 0,
  IrqPriorityLow = 1,
  IrqPriorityNormal = 2,
  IrqPriorityHigh = 3,
} IRQ_PRIORITY, *PIRQ_PRIORITY;

struct _JOB_ACCESS_STATE;

typedef struct _KALPC_HANDLE_DATA
{
  /* 0x0000 */ unsigned long Flags;
  /* 0x0004 */ unsigned long ObjectType;
  /* 0x0008 */ struct _OB_DUPLICATE_OBJECT_STATE* DuplicateContext;
} KALPC_HANDLE_DATA, *PKALPC_HANDLE_DATA; /* size: 0x000c */

typedef struct _KALPC_MESSAGE
{
  /* 0x0000 */ struct _LIST_ENTRY Entry;
  /* 0x0008 */ void* ExtensionBuffer;
  /* 0x000c */ unsigned long ExtensionBufferSize;
  union
  {
    /* 0x0010 */ struct _EPROCESS* QuotaProcess;
    /* 0x0010 */ void* QuotaBlock;
  }; /* size: 0x0004 */
  /* 0x0014 */ long SequenceNo;
  union
  {
    union
    {
      struct
      {
        struct /* bitfield */
        {
          /* 0x0018 */ unsigned long QueueType : 2; /* bit position: 0 */
          /* 0x0018 */ unsigned long QueuePortType : 4; /* bit position: 2 */
          /* 0x0018 */ unsigned long Canceled : 1; /* bit position: 6 */
          /* 0x0018 */ unsigned long Ready : 1; /* bit position: 7 */
          /* 0x0018 */ unsigned long ReleaseMessage : 1; /* bit position: 8 */
          /* 0x0018 */ unsigned long SharedQuota : 1; /* bit position: 9 */
          /* 0x0018 */ unsigned long ReplyWaitReply : 1; /* bit position: 10 */
          /* 0x0018 */ unsigned long OwnerPortReference : 1; /* bit position: 11 */
          /* 0x0018 */ unsigned long ReserveReference : 1; /* bit position: 12 */
          /* 0x0018 */ unsigned long ReceiverReference : 1; /* bit position: 13 */
        }; /* bitfield */
      } /* size: 0x0004 */ s1;
      /* 0x0018 */ unsigned long State;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ u1;
  /* 0x001c */ struct _ALPC_PORT* CancelSequencePort;
  /* 0x0020 */ struct _ALPC_PORT* CancelQueuePort;
  /* 0x0024 */ long CancelSequenceNo;
  /* 0x0028 */ struct _LIST_ENTRY CancelListEntry;
  /* 0x0030 */ struct _ETHREAD* WaitingThread;
  /* 0x0034 */ struct _KALPC_RESERVE* Reserve;
  /* 0x0038 */ struct _ALPC_PORT* volatile PortQueue;
  /* 0x003c */ struct _ALPC_PORT* OwnerPort;
  /* 0x0040 */ struct _HANDLE_TABLE_ENTRY* UniqueTableEntry;
  /* 0x0044 */ struct _KALPC_MESSAGE_ATTRIBUTES MessageAttributes;
  /* 0x0060 */ void* DataUserVa;
  /* 0x0064 */ void* DataSystemVa;
  /* 0x0068 */ struct _ALPC_COMMUNICATION_INFO* CommunicationInfo;
  /* 0x006c */ struct _ALPC_PORT* ConnectionPort;
  /* 0x0070 */ struct _ETHREAD* ServerThread;
  /* 0x0078 */ struct _PORT_MESSAGE PortMessage;
} KALPC_MESSAGE, *PKALPC_MESSAGE; /* size: 0x0090 */

typedef struct _KALPC_MESSAGE_ATTRIBUTES
{
  /* 0x0000 */ void* ClientContext;
  /* 0x0004 */ void* ServerContext;
  /* 0x0008 */ void* PortContext;
  /* 0x000c */ void* CancelPortContext;
  /* 0x0010 */ struct _KALPC_SECURITY_DATA* SecurityData;
  /* 0x0014 */ struct _KALPC_VIEW* View;
  /* 0x0018 */ struct _KALPC_HANDLE_DATA* HandleData;
} KALPC_MESSAGE_ATTRIBUTES, *PKALPC_MESSAGE_ATTRIBUTES; /* size: 0x001c */

typedef struct _KALPC_REGION
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned long Secure : 1; /* bit position: 0 */
    } /* size: 0x0004 */ s1;
  } /* size: 0x0004 */ u1;
  /* 0x0004 */ struct _LIST_ENTRY RegionListEntry;
  /* 0x000c */ struct _KALPC_SECTION* Section;
  /* 0x0010 */ unsigned long Offset;
  /* 0x0014 */ unsigned long Size;
  /* 0x0018 */ unsigned long ViewSize;
  /* 0x001c */ struct _KALPC_VIEW* ReadOnlyView;
  /* 0x0020 */ struct _KALPC_VIEW* ReadWriteView;
  /* 0x0024 */ unsigned long NumberOfViews;
  /* 0x0028 */ struct _LIST_ENTRY ViewListHead;
} KALPC_REGION, *PKALPC_REGION; /* size: 0x0030 */

typedef struct _KALPC_RESERVE
{
  /* 0x0000 */ struct _ALPC_PORT* OwnerPort;
  /* 0x0004 */ struct _ALPC_HANDLE_TABLE* HandleTable;
  /* 0x0008 */ void* Handle;
  /* 0x000c */ struct _KALPC_MESSAGE* Message;
  /* 0x0010 */ volatile long Active;
} KALPC_RESERVE, *PKALPC_RESERVE; /* size: 0x0014 */

typedef struct _KALPC_SECTION
{
  union
  {
    struct
    {
      struct /* bitfield */
      {
        /* 0x0000 */ unsigned long Internal : 1; /* bit position: 0 */
        /* 0x0000 */ unsigned long Secure : 1; /* bit position: 1 */
      }; /* bitfield */
    } /* size: 0x0004 */ s1;
  } /* size: 0x0004 */ u1;
  /* 0x0004 */ void* SectionObject;
  /* 0x0008 */ unsigned long Size;
  /* 0x000c */ struct _ALPC_HANDLE_TABLE* HandleTable;
  /* 0x0010 */ void* SectionHandle;
  /* 0x0014 */ struct _EPROCESS* OwnerProcess;
  /* 0x0018 */ struct _ALPC_PORT* OwnerPort;
  /* 0x001c */ unsigned long NumberOfRegions;
  /* 0x0020 */ struct _LIST_ENTRY RegionListHead;
} KALPC_SECTION, *PKALPC_SECTION; /* size: 0x0028 */

typedef struct _KALPC_SECURITY_DATA
{
  /* 0x0000 */ struct _ALPC_HANDLE_TABLE* HandleTable;
  /* 0x0004 */ void* ContextHandle;
  /* 0x0008 */ struct _EPROCESS* OwningProcess;
  /* 0x000c */ struct _ALPC_PORT* OwnerPort;
  /* 0x0010 */ struct _SECURITY_CLIENT_CONTEXT DynamicSecurity;
  union
  {
    struct
    {
      struct /* bitfield */
      {
        /* 0x004c */ unsigned long Revoked : 1; /* bit position: 0 */
        /* 0x004c */ unsigned long Impersonated : 1; /* bit position: 1 */
      }; /* bitfield */
    } /* size: 0x0004 */ s1;
  } /* size: 0x0004 */ u1;
} KALPC_SECURITY_DATA, *PKALPC_SECURITY_DATA; /* size: 0x0050 */

typedef struct _KALPC_VIEW
{
  /* 0x0000 */ struct _LIST_ENTRY ViewListEntry;
  union
  {
    struct
    {
      struct /* bitfield */
      {
        /* 0x0008 */ unsigned long WriteAccess : 1; /* bit position: 0 */
        /* 0x0008 */ unsigned long AutoRelease : 1; /* bit position: 1 */
        /* 0x0008 */ unsigned long ForceUnlink : 1; /* bit position: 2 */
      }; /* bitfield */
    } /* size: 0x0004 */ s1;
  } /* size: 0x0004 */ u1;
  /* 0x000c */ struct _KALPC_REGION* Region;
  /* 0x0010 */ struct _ALPC_PORT* OwnerPort;
  /* 0x0014 */ struct _EPROCESS* OwnerProcess;
  /* 0x0018 */ void* Address;
  /* 0x001c */ unsigned long Size;
  /* 0x0020 */ void* SecureViewHandle;
  /* 0x0024 */ void* WriteAccessHandle;
  /* 0x0028 */ unsigned long NumberOfOwnerMessages;
  /* 0x002c */ struct _LIST_ENTRY ProcessViewListEntry;
} KALPC_VIEW, *PKALPC_VIEW; /* size: 0x0034 */

typedef struct _KAPC
{
  /* 0x0000 */ unsigned char Type;
  /* 0x0001 */ unsigned char SpareByte0;
  /* 0x0002 */ unsigned char Size;
  /* 0x0003 */ unsigned char SpareByte1;
  /* 0x0004 */ unsigned long SpareLong0;
  /* 0x0008 */ struct _KTHREAD* Thread;
  /* 0x000c */ struct _LIST_ENTRY ApcListEntry;
  /* 0x0014 */ void* KernelRoutine /* function */;
  /* 0x0018 */ void* RundownRoutine /* function */;
  /* 0x001c */ void* NormalRoutine /* function */;
  /* 0x0020 */ void* NormalContext;
  /* 0x0024 */ void* SystemArgument1;
  /* 0x0028 */ void* SystemArgument2;
  /* 0x002c */ char ApcStateIndex;
  /* 0x002d */ char ApcMode;
  /* 0x002e */ unsigned char Inserted;
  /* 0x002f */ char __PADDING__[1];
} KAPC, *PKAPC; /* size: 0x0030 */

typedef struct _KAPC_STATE
{
  /* 0x0000 */ struct _LIST_ENTRY ApcListHead[2];
  /* 0x0010 */ struct _KPROCESS* Process;
  /* 0x0014 */ unsigned char KernelApcInProgress;
  /* 0x0015 */ unsigned char KernelApcPending;
  /* 0x0016 */ unsigned char UserApcPending;
  /* 0x0017 */ char __PADDING__[1];
} KAPC_STATE, *PKAPC_STATE; /* size: 0x0018 */

typedef struct _KDEVICE_QUEUE
{
  /* 0x0000 */ short Type;
  /* 0x0002 */ short Size;
  /* 0x0004 */ struct _LIST_ENTRY DeviceListHead;
  /* 0x000c */ unsigned long Lock;
  /* 0x0010 */ unsigned char Busy;
  /* 0x0011 */ char __PADDING__[3];
} KDEVICE_QUEUE, *PKDEVICE_QUEUE; /* size: 0x0014 */

typedef struct _KDEVICE_QUEUE_ENTRY
{
  /* 0x0000 */ struct _LIST_ENTRY DeviceListEntry;
  /* 0x0008 */ unsigned long SortKey;
  /* 0x000c */ unsigned char Inserted;
  /* 0x000d */ char __PADDING__[3];
} KDEVICE_QUEUE_ENTRY, *PKDEVICE_QUEUE_ENTRY; /* size: 0x0010 */

typedef struct _KDPC
{
  /* 0x0000 */ unsigned char Type;
  /* 0x0001 */ unsigned char Importance;
  /* 0x0002 */ volatile unsigned short Number;
  /* 0x0004 */ struct _LIST_ENTRY DpcListEntry;
  /* 0x000c */ void* DeferredRoutine /* function */;
  /* 0x0010 */ void* DeferredContext;
  /* 0x0014 */ void* SystemArgument1;
  /* 0x0018 */ void* SystemArgument2;
  /* 0x001c */ void* DpcData;
} KDPC, *PKDPC; /* size: 0x0020 */

typedef struct _KDPC_DATA
{
  /* 0x0000 */ struct _LIST_ENTRY DpcListHead;
  /* 0x0008 */ unsigned long DpcLock;
  /* 0x000c */ volatile long DpcQueueDepth;
  /* 0x0010 */ unsigned long DpcCount;
} KDPC_DATA, *PKDPC_DATA; /* size: 0x0014 */

typedef struct _KENLISTMENT
{
  /* 0x0000 */ unsigned long cookie;
  /* 0x0004 */ struct _KTMOBJECT_NAMESPACE_LINK NamespaceLink;
  /* 0x0018 */ struct _GUID EnlistmentId;
  /* 0x0028 */ struct _KMUTANT Mutex;
  /* 0x0048 */ struct _LIST_ENTRY NextSameTx;
  /* 0x0050 */ struct _LIST_ENTRY NextSameRm;
  /* 0x0058 */ struct _KRESOURCEMANAGER* ResourceManager;
  /* 0x005c */ struct _KTRANSACTION* Transaction;
  /* 0x0060 */ enum _KENLISTMENT_STATE State;
  /* 0x0064 */ unsigned long Flags;
  /* 0x0068 */ unsigned long NotificationMask;
  /* 0x006c */ void* Key;
  /* 0x0070 */ unsigned long KeyRefCount;
  /* 0x0074 */ void* RecoveryInformation;
  /* 0x0078 */ unsigned long RecoveryInformationLength;
  /* 0x007c */ void* DynamicNameInformation;
  /* 0x0080 */ unsigned long DynamicNameInformationLength;
  /* 0x0084 */ struct _KTMNOTIFICATION_PACKET* FinalNotification;
  /* 0x0088 */ struct _KENLISTMENT* SupSubEnlistment;
  /* 0x008c */ void* SupSubEnlHandle;
  /* 0x0090 */ void* SubordinateTxHandle;
  /* 0x0094 */ struct _GUID CrmEnlistmentEnId;
  /* 0x00a4 */ struct _GUID CrmEnlistmentTmId;
  /* 0x00b4 */ struct _GUID CrmEnlistmentRmId;
  /* 0x00c4 */ unsigned long NextHistory;
  /* 0x00c8 */ struct _KENLISTMENT_HISTORY History[20];
} KENLISTMENT, *PKENLISTMENT; /* size: 0x0168 */

typedef struct _KENLISTMENT_HISTORY
{
  /* 0x0000 */ unsigned long Notification;
  /* 0x0004 */ enum _KENLISTMENT_STATE NewState;
} KENLISTMENT_HISTORY, *PKENLISTMENT_HISTORY; /* size: 0x0008 */

typedef enum _KENLISTMENT_STATE
{
  KEnlistmentUninitialized = 0,
  KEnlistmentActive = 256,
  KEnlistmentPreparing = 257,
  KEnlistmentPrepared = 258,
  KEnlistmentInDoubt = 259,
  KEnlistmentCommitted = 260,
  KEnlistmentCommittedNotify = 261,
  KEnlistmentCommitRequested = 262,
  KEnlistmentAborted = 263,
  KEnlistmentDelegated = 264,
  KEnlistmentDelegatedDisconnected = 265,
  KEnlistmentPrePreparing = 266,
  KEnlistmentForgotten = 267,
  KEnlistmentRecovering = 268,
  KEnlistmentAborting = 269,
  KEnlistmentReadOnly = 270,
  KEnlistmentOutcomeUnavailable = 271,
  KEnlistmentOffline = 272,
  KEnlistmentPrePrepared = 273,
  KEnlistmentInitialized = 274,
} KENLISTMENT_STATE, *PKENLISTMENT_STATE;

typedef struct _KERNEL_STACK_CONTROL
{
  union
  {
    /* 0x0000 */ struct _KTRAP_FRAME* PreviousTrapFrame;
    /* 0x0000 */ void* PreviousExceptionList;
  }; /* size: 0x0004 */
  union
  {
    /* 0x0004 */ unsigned long StackControlFlags;
    struct /* bitfield */
    {
      /* 0x0004 */ unsigned long PreviousLargeStack : 1; /* bit position: 0 */
      /* 0x0004 */ unsigned long PreviousSegmentsPresent : 1; /* bit position: 1 */
      /* 0x0004 */ unsigned long ExpandCalloutStack : 1; /* bit position: 2 */
    }; /* bitfield */
  }; /* size: 0x0004 */
  /* 0x0008 */ struct _KERNEL_STACK_SEGMENT Previous;
} KERNEL_STACK_CONTROL, *PKERNEL_STACK_CONTROL; /* size: 0x001c */

typedef struct _KERNEL_STACK_SEGMENT
{
  /* 0x0000 */ unsigned long StackBase;
  /* 0x0004 */ unsigned long StackLimit;
  /* 0x0008 */ unsigned long KernelStack;
  /* 0x000c */ unsigned long InitialStack;
  /* 0x0010 */ unsigned long ActualLimit;
} KERNEL_STACK_SEGMENT, *PKERNEL_STACK_SEGMENT; /* size: 0x0014 */

typedef struct _KEVENT
{
  /* 0x0000 */ struct _DISPATCHER_HEADER Header;
} KEVENT, *PKEVENT; /* size: 0x0010 */

typedef struct _KEXECUTE_OPTIONS
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned char ExecuteDisable : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned char ExecuteEnable : 1; /* bit position: 1 */
    /* 0x0000 */ unsigned char DisableThunkEmulation : 1; /* bit position: 2 */
    /* 0x0000 */ unsigned char Permanent : 1; /* bit position: 3 */
    /* 0x0000 */ unsigned char ExecuteDispatchEnable : 1; /* bit position: 4 */
    /* 0x0000 */ unsigned char ImageDispatchEnable : 1; /* bit position: 5 */
    /* 0x0000 */ unsigned char DisableExceptionChainValidation : 1; /* bit position: 6 */
    /* 0x0000 */ unsigned char Spare : 1; /* bit position: 7 */
  }; /* bitfield */
} KEXECUTE_OPTIONS, *PKEXECUTE_OPTIONS; /* size: 0x0001 */

typedef struct _KGATE
{
  /* 0x0000 */ struct _DISPATCHER_HEADER Header;
} KGATE, *PKGATE; /* size: 0x0010 */

typedef struct _KGDTENTRY
{
  /* 0x0000 */ unsigned short LimitLow;
  /* 0x0002 */ unsigned short BaseLow;
  union
  {
    union
    {
      struct
      {
        /* 0x0004 */ unsigned char BaseMid;
        /* 0x0005 */ unsigned char Flags1;
        /* 0x0006 */ unsigned char Flags2;
        /* 0x0007 */ unsigned char BaseHi;
      } /* size: 0x0004 */ Bytes;
      struct
      {
        struct /* bitfield */
        {
          /* 0x0004 */ unsigned long BaseMid : 8; /* bit position: 0 */
          /* 0x0004 */ unsigned long Type : 5; /* bit position: 8 */
          /* 0x0004 */ unsigned long Dpl : 2; /* bit position: 13 */
          /* 0x0004 */ unsigned long Pres : 1; /* bit position: 15 */
          /* 0x0004 */ unsigned long LimitHi : 4; /* bit position: 16 */
          /* 0x0004 */ unsigned long Sys : 1; /* bit position: 20 */
          /* 0x0004 */ unsigned long Reserved_0 : 1; /* bit position: 21 */
          /* 0x0004 */ unsigned long Default_Big : 1; /* bit position: 22 */
          /* 0x0004 */ unsigned long Granularity : 1; /* bit position: 23 */
          /* 0x0004 */ unsigned long BaseHi : 8; /* bit position: 24 */
        }; /* bitfield */
      } /* size: 0x0004 */ Bits;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ HighWord;
} KGDTENTRY, *PKGDTENTRY; /* size: 0x0008 */

typedef struct _KGUARDED_MUTEX
{
  /* 0x0000 */ volatile long Count;
  /* 0x0004 */ struct _KTHREAD* Owner;
  /* 0x0008 */ unsigned long Contention;
  /* 0x000c */ struct _KGATE Gate;
  union
  {
    struct
    {
      /* 0x001c */ short KernelApcDisable;
      /* 0x001e */ short SpecialApcDisable;
    }; /* size: 0x0004 */
    /* 0x001c */ unsigned long CombinedApcDisable;
  }; /* size: 0x0004 */
} KGUARDED_MUTEX, *PKGUARDED_MUTEX; /* size: 0x0020 */

typedef struct _KIDTENTRY
{
  /* 0x0000 */ unsigned short Offset;
  /* 0x0002 */ unsigned short Selector;
  /* 0x0004 */ unsigned short Access;
  /* 0x0006 */ unsigned short ExtendedOffset;
} KIDTENTRY, *PKIDTENTRY; /* size: 0x0008 */

typedef struct _KINTERRUPT
{
  /* 0x0000 */ short Type;
  /* 0x0002 */ short Size;
  /* 0x0004 */ struct _LIST_ENTRY InterruptListEntry;
  /* 0x000c */ void* ServiceRoutine /* function */;
  /* 0x0010 */ void* MessageServiceRoutine /* function */;
  /* 0x0014 */ unsigned long MessageIndex;
  /* 0x0018 */ void* ServiceContext;
  /* 0x001c */ unsigned long SpinLock;
  /* 0x0020 */ unsigned long TickCount;
  /* 0x0024 */ unsigned long* ActualLock;
  /* 0x0028 */ void* DispatchAddress /* function */;
  /* 0x002c */ unsigned long Vector;
  /* 0x0030 */ unsigned char Irql;
  /* 0x0031 */ unsigned char SynchronizeIrql;
  /* 0x0032 */ unsigned char FloatingSave;
  /* 0x0033 */ unsigned char Connected;
  /* 0x0034 */ char Number;
  /* 0x0035 */ unsigned char ShareVector;
  /* 0x0038 */ enum _KINTERRUPT_MODE Mode;
  /* 0x003c */ enum _KINTERRUPT_POLARITY Polarity;
  /* 0x0040 */ unsigned long ServiceCount;
  /* 0x0044 */ unsigned long DispatchCount;
  /* 0x0048 */ unsigned __int64 Rsvd1;
  /* 0x0050 */ unsigned long DispatchCode[135];
  /* 0x026c */ long __PADDING__[1];
} KINTERRUPT, *PKINTERRUPT; /* size: 0x0270 */

typedef enum _KINTERRUPT_MODE
{
  LevelSensitive = 0,
  Latched = 1,
} KINTERRUPT_MODE, *PKINTERRUPT_MODE;

typedef enum _KINTERRUPT_POLARITY
{
  InterruptPolarityUnknown = 0,
  InterruptActiveHigh = 1,
  InterruptActiveLow = 2,
} KINTERRUPT_POLARITY, *PKINTERRUPT_POLARITY;

typedef struct _KLOCK_QUEUE_HANDLE
{
  /* 0x0000 */ struct _KSPIN_LOCK_QUEUE LockQueue;
  /* 0x0008 */ unsigned char OldIrql;
  /* 0x0009 */ char __PADDING__[3];
} KLOCK_QUEUE_HANDLE, *PKLOCK_QUEUE_HANDLE; /* size: 0x000c */

typedef struct _KMUTANT
{
  /* 0x0000 */ struct _DISPATCHER_HEADER Header;
  /* 0x0010 */ struct _LIST_ENTRY MutantListEntry;
  /* 0x0018 */ struct _KTHREAD* OwnerThread;
  /* 0x001c */ unsigned char Abandoned;
  /* 0x001d */ unsigned char ApcDisable;
  /* 0x001e */ char __PADDING__[2];
} KMUTANT, *PKMUTANT; /* size: 0x0020 */

typedef struct _KNODE
{
  /* 0x0000 */ union _SLIST_HEADER PagedPoolSListHead;
  /* 0x0008 */ union _SLIST_HEADER NonPagedPoolSListHead[3];
  /* 0x0020 */ union _SLIST_HEADER PfnDereferenceSListHead;
  /* 0x0028 */ unsigned long ProcessorMask;
  /* 0x002c */ unsigned char Color;
  /* 0x002d */ unsigned char Seed;
  /* 0x002e */ unsigned char NodeNumber;
  /* 0x002f */ struct _flags Flags;
  /* 0x0030 */ unsigned long MmShiftedColor;
  /* 0x0034 */ unsigned long FreeCount[2];
  /* 0x003c */ struct _SINGLE_LIST_ENTRY* volatile PfnDeferredList;
  /* 0x0040 */ struct _CACHED_KSTACK_LIST CachedKernelStacks;
  /* 0x0058 */ long __PADDING__[10];
} KNODE, *PKNODE; /* size: 0x0080 */

typedef enum _KOBJECTS
{
  EventNotificationObject = 0,
  EventSynchronizationObject = 1,
  MutantObject = 2,
  ProcessObject = 3,
  QueueObject = 4,
  SemaphoreObject = 5,
  ThreadObject = 6,
  GateObject = 7,
  TimerNotificationObject = 8,
  TimerSynchronizationObject = 9,
  Spare2Object = 10,
  Spare3Object = 11,
  Spare4Object = 12,
  Spare5Object = 13,
  Spare6Object = 14,
  Spare7Object = 15,
  Spare8Object = 16,
  Spare9Object = 17,
  ApcObject = 18,
  DpcObject = 19,
  DeviceQueueObject = 20,
  EventPairObject = 21,
  InterruptObject = 22,
  ProfileObject = 23,
  ThreadedDpcObject = 24,
  MaximumKernelObject = 25,
} KOBJECTS, *PKOBJECTS;

typedef struct _KPCR
{
  union
  {
    /* 0x0000 */ struct _NT_TIB NtTib;
    struct
    {
      /* 0x0000 */ struct _EXCEPTION_REGISTRATION_RECORD* Used_ExceptionList;
      /* 0x0004 */ void* Used_StackBase;
      /* 0x0008 */ void* Spare2;
      /* 0x000c */ void* TssCopy;
      /* 0x0010 */ unsigned long ContextSwitches;
      /* 0x0014 */ unsigned long SetMemberCopy;
      /* 0x0018 */ void* Used_Self;
    }; /* size: 0x001c */
  }; /* size: 0x001c */
  /* 0x001c */ struct _KPCR* SelfPcr;
  /* 0x0020 */ struct _KPRCB* Prcb;
  /* 0x0024 */ unsigned char Irql;
  /* 0x0028 */ unsigned long IRR;
  /* 0x002c */ unsigned long IrrActive;
  /* 0x0030 */ unsigned long IDR;
  /* 0x0034 */ void* KdVersionBlock;
  /* 0x0038 */ struct _KIDTENTRY* IDT;
  /* 0x003c */ struct _KGDTENTRY* GDT;
  /* 0x0040 */ struct _KTSS* TSS;
  /* 0x0044 */ unsigned short MajorVersion;
  /* 0x0046 */ unsigned short MinorVersion;
  /* 0x0048 */ unsigned long SetMember;
  /* 0x004c */ unsigned long StallScaleFactor;
  /* 0x0050 */ unsigned char SpareUnused;
  /* 0x0051 */ unsigned char Number;
  /* 0x0052 */ unsigned char Spare0;
  /* 0x0053 */ unsigned char SecondLevelCacheAssociativity;
  /* 0x0054 */ unsigned long VdmAlert;
  /* 0x0058 */ unsigned long KernelReserved[14];
  /* 0x0090 */ unsigned long SecondLevelCacheSize;
  /* 0x0094 */ unsigned long HalReserved[16];
  /* 0x00d4 */ unsigned long InterruptMode;
  /* 0x00d8 */ unsigned char Spare1;
  /* 0x00dc */ unsigned long KernelReserved2[17];
  /* 0x0120 */ struct _KPRCB PrcbData;
} KPCR, *PKPCR; /* size: 0x2128 */

typedef struct _KPRCB
{
  /* 0x0000 */ unsigned short MinorVersion;
  /* 0x0002 */ unsigned short MajorVersion;
  /* 0x0004 */ struct _KTHREAD* CurrentThread;
  /* 0x0008 */ struct _KTHREAD* NextThread;
  /* 0x000c */ struct _KTHREAD* IdleThread;
  /* 0x0010 */ unsigned char Number;
  /* 0x0011 */ unsigned char NestingLevel;
  /* 0x0012 */ unsigned short BuildType;
  /* 0x0014 */ unsigned long SetMember;
  /* 0x0018 */ char CpuType;
  /* 0x0019 */ char CpuID;
  union
  {
    /* 0x001a */ unsigned short CpuStep;
    struct
    {
      /* 0x001a */ unsigned char CpuStepping;
      /* 0x001b */ unsigned char CpuModel;
    }; /* size: 0x0002 */
  }; /* size: 0x0002 */
  /* 0x001c */ struct _KPROCESSOR_STATE ProcessorState;
  /* 0x033c */ unsigned long KernelReserved[16];
  /* 0x037c */ unsigned long HalReserved[16];
  /* 0x03bc */ unsigned long CFlushSize;
  /* 0x03c0 */ unsigned char CoresPerPhysicalProcessor;
  /* 0x03c1 */ unsigned char LogicalProcessorsPerCore;
  /* 0x03c2 */ unsigned char PrcbPad0[2];
  /* 0x03c4 */ unsigned long MHz;
  /* 0x03c8 */ unsigned char PrcbPad1[80];
  /* 0x0418 */ struct _KSPIN_LOCK_QUEUE LockQueue[49];
  /* 0x05a0 */ struct _KTHREAD* NpxThread;
  /* 0x05a4 */ unsigned long InterruptCount;
  /* 0x05a8 */ unsigned long KernelTime;
  /* 0x05ac */ unsigned long UserTime;
  /* 0x05b0 */ unsigned long DpcTime;
  /* 0x05b4 */ unsigned long DpcTimeCount;
  /* 0x05b8 */ unsigned long InterruptTime;
  /* 0x05bc */ unsigned long AdjustDpcThreshold;
  /* 0x05c0 */ unsigned long PageColor;
  /* 0x05c4 */ unsigned char SkipTick;
  /* 0x05c5 */ unsigned char DebuggerSavedIRQL;
  /* 0x05c6 */ unsigned char NodeColor;
  /* 0x05c7 */ unsigned char PollSlot;
  /* 0x05c8 */ unsigned long NodeShiftedColor;
  /* 0x05cc */ struct _KNODE* ParentNode;
  /* 0x05d0 */ unsigned long MultiThreadProcessorSet;
  /* 0x05d4 */ struct _KPRCB* MultiThreadSetMaster;
  /* 0x05d8 */ unsigned long SecondaryColorMask;
  /* 0x05dc */ unsigned long DpcTimeLimit;
  /* 0x05e0 */ unsigned long CcFastReadNoWait;
  /* 0x05e4 */ unsigned long CcFastReadWait;
  /* 0x05e8 */ unsigned long CcFastReadNotPossible;
  /* 0x05ec */ unsigned long CcCopyReadNoWait;
  /* 0x05f0 */ unsigned long CcCopyReadWait;
  /* 0x05f4 */ unsigned long CcCopyReadNoWaitMiss;
  /* 0x05f8 */ volatile long MmSpinLockOrdering;
  /* 0x05fc */ volatile long IoReadOperationCount;
  /* 0x0600 */ volatile long IoWriteOperationCount;
  /* 0x0604 */ volatile long IoOtherOperationCount;
  /* 0x0608 */ union _LARGE_INTEGER IoReadTransferCount;
  /* 0x0610 */ union _LARGE_INTEGER IoWriteTransferCount;
  /* 0x0618 */ union _LARGE_INTEGER IoOtherTransferCount;
  /* 0x0620 */ unsigned long CcFastMdlReadNoWait;
  /* 0x0624 */ unsigned long CcFastMdlReadWait;
  /* 0x0628 */ unsigned long CcFastMdlReadNotPossible;
  /* 0x062c */ unsigned long CcMapDataNoWait;
  /* 0x0630 */ unsigned long CcMapDataWait;
  /* 0x0634 */ unsigned long CcPinMappedDataCount;
  /* 0x0638 */ unsigned long CcPinReadNoWait;
  /* 0x063c */ unsigned long CcPinReadWait;
  /* 0x0640 */ unsigned long CcMdlReadNoWait;
  /* 0x0644 */ unsigned long CcMdlReadWait;
  /* 0x0648 */ unsigned long CcLazyWriteHotSpots;
  /* 0x064c */ unsigned long CcLazyWriteIos;
  /* 0x0650 */ unsigned long CcLazyWritePages;
  /* 0x0654 */ unsigned long CcDataFlushes;
  /* 0x0658 */ unsigned long CcDataPages;
  /* 0x065c */ unsigned long CcLostDelayedWrites;
  /* 0x0660 */ unsigned long CcFastReadResourceMiss;
  /* 0x0664 */ unsigned long CcCopyReadWaitMiss;
  /* 0x0668 */ unsigned long CcFastMdlReadResourceMiss;
  /* 0x066c */ unsigned long CcMapDataNoWaitMiss;
  /* 0x0670 */ unsigned long CcMapDataWaitMiss;
  /* 0x0674 */ unsigned long CcPinReadNoWaitMiss;
  /* 0x0678 */ unsigned long CcPinReadWaitMiss;
  /* 0x067c */ unsigned long CcMdlReadNoWaitMiss;
  /* 0x0680 */ unsigned long CcMdlReadWaitMiss;
  /* 0x0684 */ unsigned long CcReadAheadIos;
  /* 0x0688 */ unsigned long KeAlignmentFixupCount;
  /* 0x068c */ unsigned long KeExceptionDispatchCount;
  /* 0x0690 */ unsigned long KeSystemCalls;
  /* 0x0694 */ unsigned long PrcbPad2[3];
  /* 0x06a0 */ struct _PP_LOOKASIDE_LIST PPLookasideList[16];
  /* 0x0720 */ struct _GENERAL_LOOKASIDE_POOL PPNPagedLookasideList[32];
  /* 0x1020 */ struct _GENERAL_LOOKASIDE_POOL PPPagedLookasideList[32];
  /* 0x1920 */ volatile unsigned long PacketBarrier;
  /* 0x1924 */ volatile long ReverseStall;
  /* 0x1928 */ void* IpiFrame;
  /* 0x192c */ unsigned char PrcbPad3[52];
  /* 0x1960 */ void* volatile CurrentPacket[3];
  /* 0x196c */ volatile unsigned long TargetSet;
  /* 0x1970 */ void* volatile WorkerRoutine /* function */;
  /* 0x1974 */ volatile unsigned long IpiFrozen;
  /* 0x1978 */ unsigned char PrcbPad4[40];
  /* 0x19a0 */ volatile unsigned long RequestSummary;
  /* 0x19a4 */ struct _KPRCB* volatile SignalDone;
  /* 0x19a8 */ unsigned char PrcbPad5[56];
  /* 0x19e0 */ struct _KDPC_DATA DpcData[2];
  /* 0x1a08 */ void* DpcStack;
  /* 0x1a0c */ long MaximumDpcQueueDepth;
  /* 0x1a10 */ unsigned long DpcRequestRate;
  /* 0x1a14 */ unsigned long MinimumDpcRate;
  /* 0x1a18 */ volatile unsigned char DpcInterruptRequested;
  /* 0x1a19 */ volatile unsigned char DpcThreadRequested;
  /* 0x1a1a */ volatile unsigned char DpcRoutineActive;
  /* 0x1a1b */ volatile unsigned char DpcThreadActive;
  /* 0x1a1c */ unsigned long PrcbLock;
  /* 0x1a20 */ unsigned long DpcLastCount;
  /* 0x1a24 */ volatile unsigned long TimerHand;
  /* 0x1a28 */ volatile unsigned long TimerRequest;
  /* 0x1a2c */ void* PrcbPad41;
  /* 0x1a30 */ struct _KEVENT DpcEvent;
  /* 0x1a40 */ unsigned char ThreadDpcEnable;
  /* 0x1a41 */ volatile unsigned char QuantumEnd;
  /* 0x1a42 */ unsigned char PrcbPad50;
  /* 0x1a43 */ volatile unsigned char IdleSchedule;
  /* 0x1a44 */ long DpcSetEventRequest;
  /* 0x1a48 */ long Sleeping;
  /* 0x1a4c */ unsigned long PeriodicCount;
  /* 0x1a50 */ unsigned long PeriodicBias;
  /* 0x1a54 */ unsigned char PrcbPad51[6];
  /* 0x1a5c */ long TickOffset;
  /* 0x1a60 */ struct _KDPC CallDpc;
  /* 0x1a80 */ long ClockKeepAlive;
  /* 0x1a84 */ unsigned char ClockCheckSlot;
  /* 0x1a85 */ unsigned char ClockPollCycle;
  /* 0x1a86 */ unsigned char PrcbPad6[2];
  /* 0x1a88 */ long DpcWatchdogPeriod;
  /* 0x1a8c */ long DpcWatchdogCount;
  /* 0x1a90 */ long ThreadWatchdogPeriod;
  /* 0x1a94 */ long ThreadWatchdogCount;
  /* 0x1a98 */ unsigned long PrcbPad70[2];
  /* 0x1aa0 */ struct _LIST_ENTRY WaitListHead;
  /* 0x1aa8 */ unsigned long WaitLock;
  /* 0x1aac */ unsigned long ReadySummary;
  /* 0x1ab0 */ unsigned long QueueIndex;
  /* 0x1ab4 */ struct _SINGLE_LIST_ENTRY DeferredReadyListHead;
  /* 0x1ab8 */ unsigned __int64 StartCycles;
  /* 0x1ac0 */ unsigned __int64 CycleTime;
  /* 0x1ac8 */ unsigned __int64 PrcbPad71[3];
  /* 0x1ae0 */ struct _LIST_ENTRY DispatcherReadyListHead[32];
  /* 0x1be0 */ void* ChainedInterruptList;
  /* 0x1be4 */ long LookasideIrpFloat;
  /* 0x1be8 */ volatile long MmPageFaultCount;
  /* 0x1bec */ volatile long MmCopyOnWriteCount;
  /* 0x1bf0 */ volatile long MmTransitionCount;
  /* 0x1bf4 */ volatile long MmCacheTransitionCount;
  /* 0x1bf8 */ volatile long MmDemandZeroCount;
  /* 0x1bfc */ volatile long MmPageReadCount;
  /* 0x1c00 */ volatile long MmPageReadIoCount;
  /* 0x1c04 */ volatile long MmCacheReadCount;
  /* 0x1c08 */ volatile long MmCacheIoCount;
  /* 0x1c0c */ volatile long MmDirtyPagesWriteCount;
  /* 0x1c10 */ volatile long MmDirtyWriteIoCount;
  /* 0x1c14 */ volatile long MmMappedPagesWriteCount;
  /* 0x1c18 */ volatile long MmMappedWriteIoCount;
  /* 0x1c1c */ volatile unsigned long CachedCommit;
  /* 0x1c20 */ volatile unsigned long CachedResidentAvailable;
  /* 0x1c24 */ void* HyperPte;
  /* 0x1c28 */ unsigned char CpuVendor;
  /* 0x1c29 */ unsigned char PrcbPad8[3];
  /* 0x1c2c */ unsigned char VendorString[13];
  /* 0x1c39 */ unsigned char InitialApicId;
  /* 0x1c3a */ unsigned char LogicalProcessorsPerPhysicalProcessor;
  /* 0x1c3b */ unsigned char PrcbPad9[5];
  /* 0x1c40 */ unsigned long FeatureBits;
  /* 0x1c48 */ union _LARGE_INTEGER UpdateSignature;
  /* 0x1c50 */ volatile unsigned __int64 IsrTime;
  /* 0x1c58 */ unsigned __int64 SpareField1;
  /* 0x1c60 */ struct _FX_SAVE_AREA NpxSaveArea;
  /* 0x1e70 */ struct _PROCESSOR_POWER_STATE PowerState;
  /* 0x1f38 */ struct _KDPC DpcWatchdogDpc;
  /* 0x1f58 */ struct _KTIMER DpcWatchdogTimer;
  /* 0x1f80 */ void* WheaInfo;
  /* 0x1f84 */ void* EtwSupport;
  /* 0x1f88 */ union _SLIST_HEADER InterruptObjectPool;
  /* 0x1f90 */ union _SLIST_HEADER HypercallPageList;
  /* 0x1f98 */ void* HypercallPageVirtual;
  /* 0x1f9c */ void* VirtualApicAssist;
  /* 0x1fa0 */ unsigned __int64* StatisticsPage;
  /* 0x1fa4 */ void* RateControl;
  /* 0x1fa8 */ struct _CACHE_DESCRIPTOR Cache[5];
  /* 0x1fe4 */ unsigned long CacheCount;
  /* 0x1fe8 */ unsigned long CacheProcessorMask[5];
  /* 0x1ffc */ unsigned long PackageProcessorSet;
  /* 0x2000 */ unsigned long CoreProcessorSet;
  /* 0x2004 */ long __PADDING__[1];
} KPRCB, *PKPRCB; /* size: 0x2008 */

typedef struct _KPROCESS
{
  /* 0x0000 */ struct _DISPATCHER_HEADER Header;
  /* 0x0010 */ struct _LIST_ENTRY ProfileListHead;
  /* 0x0018 */ unsigned long DirectoryTableBase;
  /* 0x001c */ unsigned long Unused0;
  /* 0x0020 */ struct _KGDTENTRY LdtDescriptor;
  /* 0x0028 */ struct _KIDTENTRY Int21Descriptor;
  /* 0x0030 */ unsigned short IopmOffset;
  /* 0x0032 */ unsigned char Unused1;
  /* 0x0033 */ unsigned char Unused2;
  /* 0x0034 */ volatile unsigned long ActiveProcessors;
  /* 0x0038 */ unsigned long KernelTime;
  /* 0x003c */ unsigned long UserTime;
  /* 0x0040 */ struct _LIST_ENTRY ReadyListHead;
  /* 0x0048 */ struct _SINGLE_LIST_ENTRY SwapListEntry;
  /* 0x004c */ void* VdmTrapcHandler;
  /* 0x0050 */ struct _LIST_ENTRY ThreadListHead;
  /* 0x0058 */ unsigned long ProcessLock;
  /* 0x005c */ unsigned long Affinity;
  union
  {
    struct /* bitfield */
    {
      /* 0x0060 */ volatile long AutoAlignment : 1; /* bit position: 0 */
      /* 0x0060 */ volatile long DisableBoost : 1; /* bit position: 1 */
      /* 0x0060 */ volatile long DisableQuantum : 1; /* bit position: 2 */
      /* 0x0060 */ volatile long ReservedFlags : 29; /* bit position: 3 */
    }; /* bitfield */
    /* 0x0060 */ volatile long ProcessFlags;
  }; /* size: 0x0004 */
  /* 0x0064 */ char BasePriority;
  /* 0x0065 */ char QuantumReset;
  /* 0x0066 */ unsigned char State;
  /* 0x0067 */ unsigned char ThreadSeed;
  /* 0x0068 */ unsigned char PowerState;
  /* 0x0069 */ unsigned char IdealNode;
  /* 0x006a */ unsigned char Visited;
  union
  {
    /* 0x006b */ struct _KEXECUTE_OPTIONS Flags;
    /* 0x006b */ unsigned char ExecuteOptions;
  }; /* size: 0x0001 */
  /* 0x006c */ unsigned long StackCount;
  /* 0x0070 */ struct _LIST_ENTRY ProcessListEntry;
  /* 0x0078 */ volatile unsigned __int64 CycleTime;
} KPROCESS, *PKPROCESS; /* size: 0x0080 */

typedef struct _KPROCESSOR_STATE
{
  /* 0x0000 */ struct _CONTEXT ContextFrame;
  /* 0x02cc */ struct _KSPECIAL_REGISTERS SpecialRegisters;
} KPROCESSOR_STATE, *PKPROCESSOR_STATE; /* size: 0x0320 */

typedef struct _KQUEUE
{
  /* 0x0000 */ struct _DISPATCHER_HEADER Header;
  /* 0x0010 */ struct _LIST_ENTRY EntryListHead;
  /* 0x0018 */ unsigned long CurrentCount;
  /* 0x001c */ unsigned long MaximumCount;
  /* 0x0020 */ struct _LIST_ENTRY ThreadListHead;
} KQUEUE, *PKQUEUE; /* size: 0x0028 */

typedef struct _KRESOURCEMANAGER
{
  /* 0x0000 */ struct _KEVENT NotificationAvailable;
  /* 0x0010 */ unsigned long cookie;
  /* 0x0014 */ enum _KRESOURCEMANAGER_STATE State;
  /* 0x0018 */ unsigned long Flags;
  /* 0x001c */ struct _KMUTANT Mutex;
  /* 0x003c */ struct _KTMOBJECT_NAMESPACE_LINK NamespaceLink;
  /* 0x0050 */ struct _GUID RmId;
  /* 0x0060 */ struct _KQUEUE NotificationQueue;
  /* 0x0088 */ struct _KMUTANT NotificationMutex;
  /* 0x00a8 */ struct _LIST_ENTRY EnlistmentHead;
  /* 0x00b0 */ unsigned long EnlistmentCount;
  /* 0x00b4 */ void* NotificationRoutine /* function */;
  /* 0x00b8 */ void* Key;
  /* 0x00bc */ struct _LIST_ENTRY ProtocolListHead;
  /* 0x00c4 */ struct _LIST_ENTRY PendingPropReqListHead;
  /* 0x00cc */ struct _LIST_ENTRY CRMListEntry;
  /* 0x00d4 */ struct _KTM* Tm;
  /* 0x00d8 */ struct _UNICODE_STRING Description;
  /* 0x00e0 */ struct _KTMOBJECT_NAMESPACE Enlistments;
  /* 0x0140 */ struct _KRESOURCEMANAGER_COMPLETION_BINDING CompletionBinding;
} KRESOURCEMANAGER, *PKRESOURCEMANAGER; /* size: 0x0154 */

typedef struct _KRESOURCEMANAGER_COMPLETION_BINDING
{
  /* 0x0000 */ struct _LIST_ENTRY NotificationListHead;
  /* 0x0008 */ void* Port;
  /* 0x000c */ unsigned long Key;
  /* 0x0010 */ struct _EPROCESS* BindingProcess;
} KRESOURCEMANAGER_COMPLETION_BINDING, *PKRESOURCEMANAGER_COMPLETION_BINDING; /* size: 0x0014 */

typedef enum _KRESOURCEMANAGER_STATE
{
  KResourceManagerUninitialized = 0,
  KResourceManagerOffline = 1,
  KResourceManagerOnline = 2,
} KRESOURCEMANAGER_STATE, *PKRESOURCEMANAGER_STATE;

typedef struct _KSEMAPHORE
{
  /* 0x0000 */ struct _DISPATCHER_HEADER Header;
  /* 0x0010 */ long Limit;
} KSEMAPHORE, *PKSEMAPHORE; /* size: 0x0014 */

typedef struct _KSPECIAL_REGISTERS
{
  /* 0x0000 */ unsigned long Cr0;
  /* 0x0004 */ unsigned long Cr2;
  /* 0x0008 */ unsigned long Cr3;
  /* 0x000c */ unsigned long Cr4;
  /* 0x0010 */ unsigned long KernelDr0;
  /* 0x0014 */ unsigned long KernelDr1;
  /* 0x0018 */ unsigned long KernelDr2;
  /* 0x001c */ unsigned long KernelDr3;
  /* 0x0020 */ unsigned long KernelDr6;
  /* 0x0024 */ unsigned long KernelDr7;
  /* 0x0028 */ struct _DESCRIPTOR Gdtr;
  /* 0x0030 */ struct _DESCRIPTOR Idtr;
  /* 0x0038 */ unsigned short Tr;
  /* 0x003a */ unsigned short Ldtr;
  /* 0x003c */ unsigned long Reserved[6];
} KSPECIAL_REGISTERS, *PKSPECIAL_REGISTERS; /* size: 0x0054 */

typedef struct _KSPIN_LOCK_QUEUE
{
  /* 0x0000 */ struct _KSPIN_LOCK_QUEUE* volatile Next;
  /* 0x0004 */ unsigned long* volatile Lock;
} KSPIN_LOCK_QUEUE, *PKSPIN_LOCK_QUEUE; /* size: 0x0008 */

typedef enum _KSPIN_LOCK_QUEUE_NUMBER
{
  LockQueueDispatcherLock = 0,
  LockQueueExpansionLock = 1,
  LockQueuePfnLock = 2,
  LockQueueSystemSpaceLock = 3,
  LockQueueVacbLock = 4,
  LockQueueMasterLock = 5,
  LockQueueNonPagedPoolLock = 6,
  LockQueueIoCancelLock = 7,
  LockQueueWorkQueueLock = 8,
  LockQueueIoVpbLock = 9,
  LockQueueIoDatabaseLock = 10,
  LockQueueIoCompletionLock = 11,
  LockQueueNtfsStructLock = 12,
  LockQueueAfdWorkQueueLock = 13,
  LockQueueBcbLock = 14,
  LockQueueMmNonPagedPoolLock = 15,
  LockQueueUnusedSpare16 = 16,
  LockQueueTimerTableLock = 17,
  LockQueueMaximumLock = 49,
} KSPIN_LOCK_QUEUE_NUMBER, *PKSPIN_LOCK_QUEUE_NUMBER;

typedef struct _KSYSTEM_TIME
{
  /* 0x0000 */ unsigned long LowPart;
  /* 0x0004 */ long High1Time;
  /* 0x0008 */ long High2Time;
} KSYSTEM_TIME, *PKSYSTEM_TIME; /* size: 0x000c */

typedef struct _KTHREAD
{
  /* 0x0000 */ struct _DISPATCHER_HEADER Header;
  /* 0x0010 */ volatile unsigned __int64 CycleTime;
  /* 0x0018 */ volatile unsigned long HighCycleTime;
  /* 0x0020 */ unsigned __int64 QuantumTarget;
  /* 0x0028 */ void* InitialStack;
  /* 0x002c */ void* volatile StackLimit;
  /* 0x0030 */ void* KernelStack;
  /* 0x0034 */ unsigned long ThreadLock;
  union
  {
    /* 0x0038 */ struct _KAPC_STATE ApcState;
    struct
    {
      /* 0x0038 */ unsigned char ApcStateFill[23];
      /* 0x004f */ char Priority;
    }; /* size: 0x0018 */
  }; /* size: 0x0018 */
  /* 0x0050 */ volatile unsigned short NextProcessor;
  /* 0x0052 */ volatile unsigned short DeferredProcessor;
  /* 0x0054 */ unsigned long ApcQueueLock;
  /* 0x0058 */ unsigned long ContextSwitches;
  /* 0x005c */ volatile unsigned char State;
  /* 0x005d */ unsigned char NpxState;
  /* 0x005e */ unsigned char WaitIrql;
  /* 0x005f */ char WaitMode;
  /* 0x0060 */ long WaitStatus;
  union
  {
    /* 0x0064 */ struct _KWAIT_BLOCK* WaitBlockList;
    /* 0x0064 */ struct _KGATE* GateObject;
  }; /* size: 0x0004 */
  union
  {
    struct /* bitfield */
    {
      /* 0x0068 */ unsigned long KernelStackResident : 1; /* bit position: 0 */
      /* 0x0068 */ unsigned long ReadyTransition : 1; /* bit position: 1 */
      /* 0x0068 */ unsigned long ProcessReadyQueue : 1; /* bit position: 2 */
      /* 0x0068 */ unsigned long WaitNext : 1; /* bit position: 3 */
      /* 0x0068 */ unsigned long SystemAffinityActive : 1; /* bit position: 4 */
      /* 0x0068 */ unsigned long Alertable : 1; /* bit position: 5 */
      /* 0x0068 */ unsigned long GdiFlushActive : 1; /* bit position: 6 */
      /* 0x0068 */ unsigned long UserStackWalkActive : 1; /* bit position: 7 */
      /* 0x0068 */ unsigned long Reserved : 24; /* bit position: 8 */
    }; /* bitfield */
    /* 0x0068 */ long MiscFlags;
  }; /* size: 0x0004 */
  /* 0x006c */ unsigned char WaitReason;
  /* 0x006d */ volatile unsigned char SwapBusy;
  /* 0x006e */ unsigned char Alerted[2];
  union
  {
    /* 0x0070 */ struct _LIST_ENTRY WaitListEntry;
    /* 0x0070 */ struct _SINGLE_LIST_ENTRY SwapListEntry;
  }; /* size: 0x0008 */
  /* 0x0078 */ struct _KQUEUE* Queue;
  /* 0x007c */ unsigned long WaitTime;
  union
  {
    struct
    {
      /* 0x0080 */ short KernelApcDisable;
      /* 0x0082 */ short SpecialApcDisable;
    }; /* size: 0x0004 */
    /* 0x0080 */ unsigned long CombinedApcDisable;
  }; /* size: 0x0004 */
  /* 0x0084 */ void* Teb;
  union
  {
    /* 0x0088 */ struct _KTIMER Timer;
    /* 0x0088 */ unsigned char TimerFill[40];
  }; /* size: 0x0028 */
  union
  {
    struct /* bitfield */
    {
      /* 0x00b0 */ volatile unsigned long AutoAlignment : 1; /* bit position: 0 */
      /* 0x00b0 */ volatile unsigned long DisableBoost : 1; /* bit position: 1 */
      /* 0x00b0 */ volatile unsigned long EtwStackTraceApc1Inserted : 1; /* bit position: 2 */
      /* 0x00b0 */ volatile unsigned long EtwStackTraceApc2Inserted : 1; /* bit position: 3 */
      /* 0x00b0 */ volatile unsigned long CycleChargePending : 1; /* bit position: 4 */
      /* 0x00b0 */ volatile unsigned long CalloutActive : 1; /* bit position: 5 */
      /* 0x00b0 */ volatile unsigned long ApcQueueable : 1; /* bit position: 6 */
      /* 0x00b0 */ volatile unsigned long EnableStackSwap : 1; /* bit position: 7 */
      /* 0x00b0 */ volatile unsigned long GuiThread : 1; /* bit position: 8 */
      /* 0x00b0 */ volatile unsigned long ReservedFlags : 23; /* bit position: 9 */
    }; /* bitfield */
    /* 0x00b0 */ volatile long ThreadFlags;
  }; /* size: 0x0004 */
  union
  {
    /* 0x00b8 */ struct _KWAIT_BLOCK WaitBlock[4];
    struct
    {
      /* 0x00b8 */ unsigned char WaitBlockFill0[23];
      /* 0x00cf */ unsigned char IdealProcessor;
    }; /* size: 0x0018 */
    struct
    {
      /* 0x00b8 */ unsigned char WaitBlockFill1[47];
      /* 0x00e7 */ char PreviousMode;
    }; /* size: 0x0030 */
    struct
    {
      /* 0x00b8 */ unsigned char WaitBlockFill2[71];
      /* 0x00ff */ unsigned char ResourceIndex;
    }; /* size: 0x0048 */
    struct
    {
      /* 0x00b8 */ unsigned char WaitBlockFill3[95];
      /* 0x0117 */ unsigned char LargeStack;
    }; /* size: 0x0060 */
  }; /* size: 0x0060 */
  /* 0x0118 */ struct _LIST_ENTRY QueueListEntry;
  /* 0x0120 */ struct _KTRAP_FRAME* TrapFrame;
  /* 0x0124 */ void* FirstArgument;
  union
  {
    /* 0x0128 */ void* CallbackStack;
    /* 0x0128 */ unsigned long CallbackDepth;
  }; /* size: 0x0004 */
  /* 0x012c */ void* ServiceTable;
  /* 0x0130 */ unsigned char ApcStateIndex;
  /* 0x0131 */ char BasePriority;
  /* 0x0132 */ char PriorityDecrement;
  /* 0x0133 */ unsigned char Preempted;
  /* 0x0134 */ unsigned char AdjustReason;
  /* 0x0135 */ char AdjustIncrement;
  /* 0x0136 */ unsigned char Spare01;
  /* 0x0137 */ char Saturation;
  /* 0x0138 */ unsigned long SystemCallNumber;
  /* 0x013c */ unsigned long FreezeCount;
  /* 0x0140 */ unsigned long UserAffinity;
  /* 0x0144 */ struct _KPROCESS* Process;
  /* 0x0148 */ volatile unsigned long Affinity;
  /* 0x014c */ struct _KAPC_STATE* ApcStatePointer[2];
  union
  {
    /* 0x0154 */ struct _KAPC_STATE SavedApcState;
    struct
    {
      /* 0x0154 */ unsigned char SavedApcStateFill[23];
      /* 0x016b */ unsigned char Spare02;
    }; /* size: 0x0018 */
  }; /* size: 0x0018 */
  /* 0x016c */ char SuspendCount;
  /* 0x016d */ unsigned char UserIdealProcessor;
  /* 0x016e */ unsigned char Spare03;
  /* 0x016f */ unsigned char OtherPlatformFill;
  /* 0x0170 */ void* volatile Win32Thread;
  /* 0x0174 */ void* StackBase;
  union
  {
    /* 0x0178 */ struct _KAPC SuspendApc;
    struct
    {
      /* 0x0178 */ unsigned char SuspendApcFill0[1];
      /* 0x0179 */ char Spare04;
    }; /* size: 0x0002 */
    struct
    {
      /* 0x0178 */ unsigned char SuspendApcFill1[3];
      /* 0x017b */ unsigned char QuantumReset;
    }; /* size: 0x0004 */
    struct
    {
      /* 0x0178 */ unsigned char SuspendApcFill2[4];
      /* 0x017c */ unsigned long KernelTime;
    }; /* size: 0x0008 */
    struct
    {
      /* 0x0178 */ unsigned char SuspendApcFill3[36];
      /* 0x019c */ struct _KPRCB* WaitPrcb;
    }; /* size: 0x0028 */
    struct
    {
      /* 0x0178 */ unsigned char SuspendApcFill4[40];
      /* 0x01a0 */ void* LegoData;
    }; /* size: 0x002c */
    struct
    {
      /* 0x0178 */ unsigned char SuspendApcFill5[47];
      /* 0x01a7 */ unsigned char PowerState;
    }; /* size: 0x0030 */
  }; /* size: 0x0030 */
  /* 0x01a8 */ unsigned long UserTime;
  union
  {
    /* 0x01ac */ struct _KSEMAPHORE SuspendSemaphore;
    /* 0x01ac */ unsigned char SuspendSemaphorefill[20];
  }; /* size: 0x0014 */
  /* 0x01c0 */ unsigned long SListFaultCount;
  /* 0x01c4 */ struct _LIST_ENTRY ThreadListEntry;
  /* 0x01cc */ struct _LIST_ENTRY MutantListHead;
  /* 0x01d4 */ void* SListFaultAddress;
  /* 0x01d8 */ void* volatile MdlForLockedTeb;
  /* 0x01dc */ long __PADDING__[1];
} KTHREAD, *PKTHREAD; /* size: 0x01e0 */

typedef enum _KTHREAD_STATE
{
  Initialized = 0,
  Ready = 1,
  Running = 2,
  Standby = 3,
  Terminated = 4,
  Waiting = 5,
  Transition = 6,
  DeferredReady = 7,
  GateWait = 8,
} KTHREAD_STATE, *PKTHREAD_STATE;

typedef struct _KTIMER
{
  /* 0x0000 */ struct _DISPATCHER_HEADER Header;
  /* 0x0010 */ union _ULARGE_INTEGER DueTime;
  /* 0x0018 */ struct _LIST_ENTRY TimerListEntry;
  /* 0x0020 */ struct _KDPC* Dpc;
  /* 0x0024 */ long Period;
} KTIMER, *PKTIMER; /* size: 0x0028 */

typedef struct _KTIMER_TABLE_ENTRY
{
  /* 0x0000 */ struct _LIST_ENTRY Entry;
  /* 0x0008 */ union _ULARGE_INTEGER Time;
} KTIMER_TABLE_ENTRY, *PKTIMER_TABLE_ENTRY; /* size: 0x0010 */

typedef struct _KTM
{
  /* 0x0000 */ unsigned long cookie;
  /* 0x0004 */ struct _KMUTANT Mutex;
  /* 0x0024 */ enum KTM_STATE State;
  /* 0x0028 */ struct _KTMOBJECT_NAMESPACE_LINK NamespaceLink;
  /* 0x003c */ struct _GUID TmIdentity;
  /* 0x004c */ unsigned long Flags;
  /* 0x0050 */ unsigned long VolatileFlags;
  /* 0x0054 */ struct _UNICODE_STRING LogFileName;
  /* 0x005c */ struct _FILE_OBJECT* LogFileObject;
  /* 0x0060 */ void* MarshallingContext;
  /* 0x0064 */ void* LogManagementContext;
  /* 0x0068 */ struct _KTMOBJECT_NAMESPACE Transactions;
  /* 0x00c8 */ struct _KTMOBJECT_NAMESPACE ResourceManagers;
  /* 0x0128 */ struct _KMUTANT LsnOrderedMutex;
  /* 0x0148 */ struct _LIST_ENTRY LsnOrderedList;
  /* 0x0150 */ union _LARGE_INTEGER CommitVirtualClock;
  /* 0x0158 */ struct _FAST_MUTEX CommitVirtualClockMutex;
  /* 0x0178 */ union _CLS_LSN BaseLsn;
  /* 0x0180 */ union _CLS_LSN CurrentReadLsn;
  /* 0x0188 */ union _CLS_LSN LastRecoveredLsn;
  /* 0x0190 */ void* TmRmHandle;
  /* 0x0194 */ struct _KRESOURCEMANAGER* TmRm;
  /* 0x0198 */ struct _KEVENT LogFullNotifyEvent;
  /* 0x01a8 */ struct _WORK_QUEUE_ITEM CheckpointWorkItem;
  /* 0x01b8 */ union _CLS_LSN CheckpointTargetLsn;
  /* 0x01c0 */ struct _WORK_QUEUE_ITEM LogFullCompletedWorkItem;
  /* 0x01d0 */ struct _ERESOURCE LogWriteResource;
  /* 0x0208 */ unsigned long LogFlags;
  /* 0x020c */ long LogFullStatus;
  /* 0x0210 */ long RecoveryStatus;
  /* 0x0218 */ union _CLS_LSN LastCheckBaseLsn;
  /* 0x0220 */ struct _LIST_ENTRY RestartOrderedList;
} KTM, *PKTM; /* size: 0x0228 */

struct _KTMNOTIFICATION_PACKET;

typedef struct _KTMOBJECT_NAMESPACE
{
  /* 0x0000 */ struct _RTL_AVL_TABLE Table;
  /* 0x0038 */ struct _KMUTANT Mutex;
  /* 0x0058 */ unsigned short LinksOffset;
  /* 0x005a */ unsigned short GuidOffset;
  /* 0x005c */ unsigned char Expired;
  /* 0x005d */ char __PADDING__[3];
} KTMOBJECT_NAMESPACE, *PKTMOBJECT_NAMESPACE; /* size: 0x0060 */

typedef struct _KTMOBJECT_NAMESPACE_LINK
{
  /* 0x0000 */ struct _RTL_BALANCED_LINKS Links;
  /* 0x0010 */ unsigned char Expired;
  /* 0x0011 */ char __PADDING__[3];
} KTMOBJECT_NAMESPACE_LINK, *PKTMOBJECT_NAMESPACE_LINK; /* size: 0x0014 */

typedef struct _KTRANSACTION
{
  /* 0x0000 */ struct _KEVENT OutcomeEvent;
  /* 0x0010 */ unsigned long cookie;
  /* 0x0014 */ struct _KMUTANT Mutex;
  /* 0x0034 */ struct _KTRANSACTION* TreeTx;
  /* 0x0038 */ struct _KTMOBJECT_NAMESPACE_LINK GlobalNamespaceLink;
  /* 0x004c */ struct _KTMOBJECT_NAMESPACE_LINK TmNamespaceLink;
  /* 0x0060 */ struct _GUID UOW;
  /* 0x0070 */ enum _KTRANSACTION_STATE State;
  /* 0x0074 */ unsigned long Flags;
  /* 0x0078 */ struct _LIST_ENTRY EnlistmentHead;
  /* 0x0080 */ unsigned long EnlistmentCount;
  /* 0x0084 */ unsigned long RecoverableEnlistmentCount;
  /* 0x0088 */ unsigned long PrePrepareRequiredEnlistmentCount;
  /* 0x008c */ unsigned long PrepareRequiredEnlistmentCount;
  /* 0x0090 */ unsigned long OutcomeRequiredEnlistmentCount;
  /* 0x0094 */ unsigned long PendingResponses;
  /* 0x0098 */ struct _KENLISTMENT* SuperiorEnlistment;
  /* 0x00a0 */ union _CLS_LSN LastLsn;
  /* 0x00a8 */ struct _LIST_ENTRY PromotedEntry;
  /* 0x00b0 */ struct _KTRANSACTION* PromoterTransaction;
  /* 0x00b4 */ void* PromotePropagation;
  /* 0x00b8 */ unsigned long IsolationLevel;
  /* 0x00bc */ unsigned long IsolationFlags;
  /* 0x00c0 */ union _LARGE_INTEGER Timeout;
  /* 0x00c8 */ struct _UNICODE_STRING Description;
  /* 0x00d0 */ struct _KTHREAD* RollbackThread;
  /* 0x00d4 */ struct _WORK_QUEUE_ITEM RollbackWorkItem;
  /* 0x00e4 */ struct _KDPC RollbackDpc;
  /* 0x0108 */ struct _KTIMER RollbackTimer;
  /* 0x0130 */ struct _LIST_ENTRY LsnOrderedEntry;
  /* 0x0138 */ enum _KTRANSACTION_OUTCOME Outcome;
  /* 0x013c */ struct _KTM* Tm;
  /* 0x0140 */ __int64 CommitReservation;
  /* 0x0148 */ struct _KTRANSACTION_HISTORY TransactionHistory[10];
  /* 0x0198 */ unsigned long TransactionHistoryCount;
  /* 0x019c */ void* DTCPrivateInformation;
  /* 0x01a0 */ unsigned long DTCPrivateInformationLength;
  /* 0x01a4 */ struct _KMUTANT DTCPrivateInformationMutex;
  /* 0x01c4 */ void* PromotedTxSelfHandle;
  /* 0x01c8 */ unsigned long PendingPromotionCount;
  /* 0x01cc */ struct _KEVENT PromotionCompletedEvent;
  /* 0x01dc */ long __PADDING__[1];
} KTRANSACTION, *PKTRANSACTION; /* size: 0x01e0 */

typedef struct _KTRANSACTION_HISTORY
{
  /* 0x0000 */ enum _TAG_UNNAMED_1 RecordType;
  /* 0x0004 */ unsigned long Payload;
} KTRANSACTION_HISTORY, *PKTRANSACTION_HISTORY; /* size: 0x0008 */

typedef enum _KTRANSACTION_OUTCOME
{
  KTxOutcomeUninitialized = 0,
  KTxOutcomeUndetermined = 1,
  KTxOutcomeCommitted = 2,
  KTxOutcomeAborted = 3,
  KTxOutcomeUnavailable = 4,
} KTRANSACTION_OUTCOME, *PKTRANSACTION_OUTCOME;

typedef enum _KTRANSACTION_STATE
{
  KTransactionUninitialized = 0,
  KTransactionActive = 1,
  KTransactionPreparing = 2,
  KTransactionPrepared = 3,
  KTransactionInDoubt = 4,
  KTransactionCommitted = 5,
  KTransactionAborted = 6,
  KTransactionDelegated = 7,
  KTransactionPrePreparing = 8,
  KTransactionForgotten = 9,
  KTransactionRecovering = 10,
  KTransactionPrePrepared = 11,
} KTRANSACTION_STATE, *PKTRANSACTION_STATE;

typedef struct _KTRAP_FRAME
{
  /* 0x0000 */ unsigned long DbgEbp;
  /* 0x0004 */ unsigned long DbgEip;
  /* 0x0008 */ unsigned long DbgArgMark;
  /* 0x000c */ unsigned long DbgArgPointer;
  /* 0x0010 */ unsigned short TempSegCs;
  /* 0x0012 */ unsigned char Logging;
  /* 0x0013 */ unsigned char Reserved;
  /* 0x0014 */ unsigned long TempEsp;
  /* 0x0018 */ unsigned long Dr0;
  /* 0x001c */ unsigned long Dr1;
  /* 0x0020 */ unsigned long Dr2;
  /* 0x0024 */ unsigned long Dr3;
  /* 0x0028 */ unsigned long Dr6;
  /* 0x002c */ unsigned long Dr7;
  /* 0x0030 */ unsigned long SegGs;
  /* 0x0034 */ unsigned long SegEs;
  /* 0x0038 */ unsigned long SegDs;
  /* 0x003c */ unsigned long Edx;
  /* 0x0040 */ unsigned long Ecx;
  /* 0x0044 */ unsigned long Eax;
  /* 0x0048 */ unsigned long PreviousPreviousMode;
  /* 0x004c */ struct _EXCEPTION_REGISTRATION_RECORD* ExceptionList;
  /* 0x0050 */ unsigned long SegFs;
  /* 0x0054 */ unsigned long Edi;
  /* 0x0058 */ unsigned long Esi;
  /* 0x005c */ unsigned long Ebx;
  /* 0x0060 */ unsigned long Ebp;
  /* 0x0064 */ unsigned long ErrCode;
  /* 0x0068 */ unsigned long Eip;
  /* 0x006c */ unsigned long SegCs;
  /* 0x0070 */ unsigned long EFlags;
  /* 0x0074 */ unsigned long HardwareEsp;
  /* 0x0078 */ unsigned long HardwareSegSs;
  /* 0x007c */ unsigned long V86Es;
  /* 0x0080 */ unsigned long V86Ds;
  /* 0x0084 */ unsigned long V86Fs;
  /* 0x0088 */ unsigned long V86Gs;
} KTRAP_FRAME, *PKTRAP_FRAME; /* size: 0x008c */

typedef struct _KTSS
{
  /* 0x0000 */ unsigned short Backlink;
  /* 0x0002 */ unsigned short Reserved0;
  /* 0x0004 */ unsigned long Esp0;
  /* 0x0008 */ unsigned short Ss0;
  /* 0x000a */ unsigned short Reserved1;
  /* 0x000c */ unsigned long NotUsed1[4];
  /* 0x001c */ unsigned long CR3;
  /* 0x0020 */ unsigned long Eip;
  /* 0x0024 */ unsigned long EFlags;
  /* 0x0028 */ unsigned long Eax;
  /* 0x002c */ unsigned long Ecx;
  /* 0x0030 */ unsigned long Edx;
  /* 0x0034 */ unsigned long Ebx;
  /* 0x0038 */ unsigned long Esp;
  /* 0x003c */ unsigned long Ebp;
  /* 0x0040 */ unsigned long Esi;
  /* 0x0044 */ unsigned long Edi;
  /* 0x0048 */ unsigned short Es;
  /* 0x004a */ unsigned short Reserved2;
  /* 0x004c */ unsigned short Cs;
  /* 0x004e */ unsigned short Reserved3;
  /* 0x0050 */ unsigned short Ss;
  /* 0x0052 */ unsigned short Reserved4;
  /* 0x0054 */ unsigned short Ds;
  /* 0x0056 */ unsigned short Reserved5;
  /* 0x0058 */ unsigned short Fs;
  /* 0x005a */ unsigned short Reserved6;
  /* 0x005c */ unsigned short Gs;
  /* 0x005e */ unsigned short Reserved7;
  /* 0x0060 */ unsigned short LDT;
  /* 0x0062 */ unsigned short Reserved8;
  /* 0x0064 */ unsigned short Flags;
  /* 0x0066 */ unsigned short IoMapBase;
  /* 0x0068 */ struct _KiIoAccessMap IoMaps[1];
  /* 0x208c */ unsigned char IntDirectionMap[32];
} KTSS, *PKTSS; /* size: 0x20ac */

typedef struct _KUSER_SHARED_DATA
{
  /* 0x0000 */ unsigned long TickCountLowDeprecated;
  /* 0x0004 */ unsigned long TickCountMultiplier;
  /* 0x0008 */ volatile struct _KSYSTEM_TIME InterruptTime;
  /* 0x0014 */ volatile struct _KSYSTEM_TIME SystemTime;
  /* 0x0020 */ volatile struct _KSYSTEM_TIME TimeZoneBias;
  /* 0x002c */ unsigned short ImageNumberLow;
  /* 0x002e */ unsigned short ImageNumberHigh;
  /* 0x0030 */ wchar_t NtSystemRoot[260];
  /* 0x0238 */ unsigned long MaxStackTraceDepth;
  /* 0x023c */ unsigned long CryptoExponent;
  /* 0x0240 */ unsigned long TimeZoneId;
  /* 0x0244 */ unsigned long LargePageMinimum;
  /* 0x0248 */ unsigned long Reserved2[7];
  /* 0x0264 */ enum _NT_PRODUCT_TYPE NtProductType;
  /* 0x0268 */ unsigned char ProductTypeIsValid;
  /* 0x026c */ unsigned long NtMajorVersion;
  /* 0x0270 */ unsigned long NtMinorVersion;
  /* 0x0274 */ unsigned char ProcessorFeatures[64];
  /* 0x02b4 */ unsigned long Reserved1;
  /* 0x02b8 */ unsigned long Reserved3;
  /* 0x02bc */ volatile unsigned long TimeSlip;
  /* 0x02c0 */ enum _ALTERNATIVE_ARCHITECTURE_TYPE AlternativeArchitecture;
  /* 0x02c8 */ union _LARGE_INTEGER SystemExpirationDate;
  /* 0x02d0 */ unsigned long SuiteMask;
  /* 0x02d4 */ unsigned char KdDebuggerEnabled;
  /* 0x02d5 */ unsigned char NXSupportPolicy;
  /* 0x02d8 */ volatile unsigned long ActiveConsoleId;
  /* 0x02dc */ volatile unsigned long DismountCount;
  /* 0x02e0 */ unsigned long ComPlusPackage;
  /* 0x02e4 */ unsigned long LastSystemRITEventTickCount;
  /* 0x02e8 */ unsigned long NumberOfPhysicalPages;
  /* 0x02ec */ unsigned char SafeBootMode;
  union
  {
    /* 0x02f0 */ unsigned long SharedDataFlags;
    struct /* bitfield */
    {
      /* 0x02f0 */ unsigned long DbgErrorPortPresent : 1; /* bit position: 0 */
      /* 0x02f0 */ unsigned long DbgElevationEnabled : 1; /* bit position: 1 */
      /* 0x02f0 */ unsigned long DbgVirtEnabled : 1; /* bit position: 2 */
      /* 0x02f0 */ unsigned long DbgInstallerDetectEnabled : 1; /* bit position: 3 */
      /* 0x02f0 */ unsigned long DbgSystemDllRelocated : 1; /* bit position: 4 */
      /* 0x02f0 */ unsigned long DbgDynProcessorEnabled : 1; /* bit position: 5 */
      /* 0x02f0 */ unsigned long DbgSEHValidationEnabled : 1; /* bit position: 6 */
      /* 0x02f0 */ unsigned long SpareBits : 25; /* bit position: 7 */
    }; /* bitfield */
  }; /* size: 0x0004 */
  /* 0x02f8 */ unsigned __int64 TestRetInstruction;
  /* 0x0300 */ unsigned long SystemCall;
  /* 0x0304 */ unsigned long SystemCallReturn;
  /* 0x0308 */ unsigned __int64 SystemCallPad[3];
  union
  {
    /* 0x0320 */ volatile struct _KSYSTEM_TIME TickCount;
    /* 0x0320 */ volatile unsigned __int64 TickCountQuad;
  }; /* size: 0x000c */
  /* 0x0330 */ unsigned long Cookie;
  /* 0x0338 */ __int64 ConsoleSessionForegroundProcessId;
  /* 0x0340 */ unsigned long Wow64SharedInformation[16];
  /* 0x0380 */ unsigned short UserModeGlobalLogger[8];
  /* 0x0390 */ unsigned long HeapTracingPid[2];
  /* 0x0398 */ unsigned long CritSecTracingPid[2];
  /* 0x03a0 */ unsigned long ImageFileExecutionOptions;
  /* 0x03a4 */ unsigned long LangGenerationCount;
  union
  {
    /* 0x03a8 */ unsigned __int64 AffinityPad;
    /* 0x03a8 */ unsigned long ActiveProcessorAffinity;
  }; /* size: 0x0008 */
  /* 0x03b0 */ volatile unsigned __int64 InterruptTimeBias;
} KUSER_SHARED_DATA, *PKUSER_SHARED_DATA; /* size: 0x03b8 */

typedef struct _KWAIT_BLOCK
{
  /* 0x0000 */ struct _LIST_ENTRY WaitListEntry;
  /* 0x0008 */ struct _KTHREAD* Thread;
  /* 0x000c */ void* Object;
  /* 0x0010 */ struct _KWAIT_BLOCK* NextWaitBlock;
  /* 0x0014 */ unsigned short WaitKey;
  /* 0x0016 */ unsigned char WaitType;
  /* 0x0017 */ unsigned char SpareByte;
} KWAIT_BLOCK, *PKWAIT_BLOCK; /* size: 0x0018 */

typedef enum _KWAIT_REASON
{
  Executive = 0,
  FreePage = 1,
  PageIn = 2,
  PoolAllocation = 3,
  DelayExecution = 4,
  Suspended = 5,
  UserRequest = 6,
  WrExecutive = 7,
  WrFreePage = 8,
  WrPageIn = 9,
  WrPoolAllocation = 10,
  WrDelayExecution = 11,
  WrSuspended = 12,
  WrUserRequest = 13,
  WrEventPair = 14,
  WrQueue = 15,
  WrLpcReceive = 16,
  WrLpcReply = 17,
  WrVirtualMemory = 18,
  WrPageOut = 19,
  WrRendezvous = 20,
  Spare2 = 21,
  Spare3 = 22,
  Spare4 = 23,
  Spare5 = 24,
  WrCalloutStack = 25,
  WrKernel = 26,
  WrResource = 27,
  WrPushLock = 28,
  WrMutex = 29,
  WrQuantumEnd = 30,
  WrDispatchInt = 31,
  WrPreempted = 32,
  WrYieldExecution = 33,
  WrFastMutex = 34,
  WrGuardedMutex = 35,
  WrRundown = 36,
  MaximumWaitReason = 37,
} KWAIT_REASON, *PKWAIT_REASON;

typedef struct _KiIoAccessMap
{
  /* 0x0000 */ unsigned char DirectionMap[32];
  /* 0x0020 */ unsigned char IoMap[8196];
} KiIoAccessMap, *PKiIoAccessMap; /* size: 0x2024 */

typedef union _LARGE_INTEGER
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned long LowPart;
      /* 0x0004 */ long HighPart;
    }; /* size: 0x0008 */
    struct
    {
      /* 0x0000 */ unsigned long LowPart;
      /* 0x0004 */ long HighPart;
    } /* size: 0x0008 */ u;
    /* 0x0000 */ __int64 QuadPart;
  }; /* size: 0x0008 */
} LARGE_INTEGER, *PLARGE_INTEGER; /* size: 0x0008 */

typedef struct _LAZY_WRITER
{
  /* 0x0000 */ struct _LIST_ENTRY WorkQueue;
  /* 0x0008 */ struct _KDPC ScanDpc;
  /* 0x0028 */ struct _KTIMER ScanTimer;
  /* 0x0050 */ unsigned char ScanActive;
  /* 0x0051 */ unsigned char OtherWork;
  /* 0x0052 */ unsigned char PendingTeardown;
  /* 0x0053 */ char __PADDING__[5];
} LAZY_WRITER, *PLAZY_WRITER; /* size: 0x0058 */

typedef struct _LDR_DATA_TABLE_ENTRY
{
  /* 0x0000 */ struct _LIST_ENTRY InLoadOrderLinks;
  /* 0x0008 */ struct _LIST_ENTRY InMemoryOrderLinks;
  /* 0x0010 */ struct _LIST_ENTRY InInitializationOrderLinks;
  /* 0x0018 */ void* DllBase;
  /* 0x001c */ void* EntryPoint;
  /* 0x0020 */ unsigned long SizeOfImage;
  /* 0x0024 */ struct _UNICODE_STRING FullDllName;
  /* 0x002c */ struct _UNICODE_STRING BaseDllName;
  /* 0x0034 */ unsigned long Flags;
  /* 0x0038 */ unsigned short LoadCount;
  /* 0x003a */ unsigned short TlsIndex;
  union
  {
    /* 0x003c */ struct _LIST_ENTRY HashLinks;
    struct
    {
      /* 0x003c */ void* SectionPointer;
      /* 0x0040 */ unsigned long CheckSum;
    }; /* size: 0x0008 */
  }; /* size: 0x0008 */
  union
  {
    /* 0x0044 */ unsigned long TimeDateStamp;
    /* 0x0044 */ void* LoadedImports;
  }; /* size: 0x0004 */
  /* 0x0048 */ struct _ACTIVATION_CONTEXT* EntryPointActivationContext;
  /* 0x004c */ void* PatchInformation;
  /* 0x0050 */ struct _LIST_ENTRY ForwarderLinks;
  /* 0x0058 */ struct _LIST_ENTRY ServiceTagLinks;
  /* 0x0060 */ struct _LIST_ENTRY StaticLinks;
} LDR_DATA_TABLE_ENTRY, *PLDR_DATA_TABLE_ENTRY; /* size: 0x0068 */

typedef struct _LIST_ENTRY
{
  /* 0x0000 */ struct _LIST_ENTRY* Flink;
  /* 0x0004 */ struct _LIST_ENTRY* Blink;
} LIST_ENTRY, *PLIST_ENTRY; /* size: 0x0008 */

typedef struct _LOADER_PARAMETER_BLOCK
{
  /* 0x0000 */ struct _LIST_ENTRY LoadOrderListHead;
  /* 0x0008 */ struct _LIST_ENTRY MemoryDescriptorListHead;
  /* 0x0010 */ struct _LIST_ENTRY BootDriverListHead;
  /* 0x0018 */ unsigned long KernelStack;
  /* 0x001c */ unsigned long Prcb;
  /* 0x0020 */ unsigned long Process;
  /* 0x0024 */ unsigned long Thread;
  /* 0x0028 */ unsigned long RegistryLength;
  /* 0x002c */ void* RegistryBase;
  /* 0x0030 */ struct _CONFIGURATION_COMPONENT_DATA* ConfigurationRoot;
  /* 0x0034 */ char* ArcBootDeviceName;
  /* 0x0038 */ char* ArcHalDeviceName;
  /* 0x003c */ char* NtBootPathName;
  /* 0x0040 */ char* NtHalPathName;
  /* 0x0044 */ char* LoadOptions;
  /* 0x0048 */ struct _NLS_DATA_BLOCK* NlsData;
  /* 0x004c */ struct _ARC_DISK_INFORMATION* ArcDiskInformation;
  /* 0x0050 */ void* OemFontFile;
  /* 0x0054 */ struct _SETUP_LOADER_BLOCK* SetupLoaderBlock;
  /* 0x0058 */ struct _LOADER_PARAMETER_EXTENSION* Extension;
  union
  {
    union
    {
      /* 0x005c */ struct _I386_LOADER_BLOCK I386;
      /* 0x005c */ struct _ALPHA_LOADER_BLOCK Alpha;
      /* 0x005c */ struct _IA64_LOADER_BLOCK Ia64;
    }; /* size: 0x000c */
  } /* size: 0x000c */ u;
  /* 0x0068 */ struct _FIRMWARE_INFORMATION_LOADER_BLOCK FirmwareInformation;
} LOADER_PARAMETER_BLOCK, *PLOADER_PARAMETER_BLOCK; /* size: 0x007c */

typedef struct _LOADER_PARAMETER_EXTENSION
{
  /* 0x0000 */ unsigned long Size;
  /* 0x0004 */ struct _PROFILE_PARAMETER_BLOCK Profile;
  /* 0x0014 */ unsigned long MajorVersion;
  /* 0x0018 */ unsigned long MinorVersion;
  /* 0x001c */ void* EmInfFileImage;
  /* 0x0020 */ unsigned long EmInfFileSize;
  /* 0x0024 */ void* TriageDumpBlock;
  /* 0x0028 */ unsigned long LoaderPagesSpanned;
  /* 0x002c */ struct _HEADLESS_LOADER_BLOCK* HeadlessLoaderBlock;
  /* 0x0030 */ struct _SMBIOS_TABLE_HEADER* SMBiosEPSHeader;
  /* 0x0034 */ void* DrvDBImage;
  /* 0x0038 */ unsigned long DrvDBSize;
  /* 0x003c */ struct _NETWORK_LOADER_BLOCK* NetworkLoaderBlock;
  /* 0x0040 */ unsigned char* HalpIRQLToTPR;
  /* 0x0044 */ unsigned char* HalpVectorToIRQL;
  /* 0x0048 */ struct _LIST_ENTRY FirmwareDescriptorListHead;
  /* 0x0050 */ void* AcpiTable;
  /* 0x0054 */ unsigned long AcpiTableSize;
  struct /* bitfield */
  {
    /* 0x0058 */ unsigned long BootViaWinload : 1; /* bit position: 0 */
    /* 0x0058 */ unsigned long Reserved : 31; /* bit position: 1 */
  }; /* bitfield */
  /* 0x005c */ struct _LOADER_PERFORMANCE_DATA* LoaderPerformanceData;
  /* 0x0060 */ struct _LIST_ENTRY BootApplicationPersistentData;
  /* 0x0068 */ void* WmdTestResult;
  /* 0x006c */ struct _GUID BootIdentifier;
  /* 0x007c */ unsigned long ResumePages;
  /* 0x0080 */ void* DumpHeader;
} LOADER_PARAMETER_EXTENSION, *PLOADER_PARAMETER_EXTENSION; /* size: 0x0084 */

typedef struct _LOADER_PERFORMANCE_DATA
{
  /* 0x0000 */ unsigned __int64 StartTime;
  /* 0x0008 */ unsigned __int64 EndTime;
} LOADER_PERFORMANCE_DATA, *PLOADER_PERFORMANCE_DATA; /* size: 0x0010 */

typedef struct _LOOKASIDE_LIST_EX
{
  /* 0x0000 */ struct _GENERAL_LOOKASIDE_POOL L;
} LOOKASIDE_LIST_EX, *PLOOKASIDE_LIST_EX; /* size: 0x0048 */

typedef struct _LPCP_MESSAGE
{
  union
  {
    /* 0x0000 */ struct _LIST_ENTRY Entry;
    struct
    {
      /* 0x0000 */ struct _SINGLE_LIST_ENTRY FreeEntry;
      /* 0x0004 */ unsigned long Reserved0;
    }; /* size: 0x0008 */
  }; /* size: 0x0008 */
  /* 0x0008 */ void* SenderPort;
  /* 0x000c */ struct _ETHREAD* RepliedToThread;
  /* 0x0010 */ void* PortContext;
  /* 0x0018 */ struct _PORT_MESSAGE Request;
} LPCP_MESSAGE, *PLPCP_MESSAGE; /* size: 0x0030 */

typedef struct _LPCP_NONPAGED_PORT_QUEUE
{
  /* 0x0000 */ struct _KSEMAPHORE Semaphore;
  /* 0x0014 */ struct _LPCP_PORT_OBJECT* BackPointer;
} LPCP_NONPAGED_PORT_QUEUE, *PLPCP_NONPAGED_PORT_QUEUE; /* size: 0x0018 */

typedef struct _LPCP_PORT_OBJECT
{
  /* 0x0000 */ struct _LPCP_PORT_OBJECT* ConnectionPort;
  /* 0x0004 */ struct _LPCP_PORT_OBJECT* ConnectedPort;
  /* 0x0008 */ struct _LPCP_PORT_QUEUE MsgQueue;
  /* 0x0018 */ struct _CLIENT_ID Creator;
  /* 0x0020 */ void* ClientSectionBase;
  /* 0x0024 */ void* ServerSectionBase;
  /* 0x0028 */ void* PortContext;
  /* 0x002c */ struct _ETHREAD* ClientThread;
  /* 0x0030 */ struct _SECURITY_QUALITY_OF_SERVICE SecurityQos;
  /* 0x003c */ struct _SECURITY_CLIENT_CONTEXT StaticSecurity;
  /* 0x0078 */ struct _LIST_ENTRY LpcReplyChainHead;
  /* 0x0080 */ struct _LIST_ENTRY LpcDataInfoChainHead;
  union
  {
    /* 0x0088 */ struct _EPROCESS* ServerProcess;
    /* 0x0088 */ struct _EPROCESS* MappingProcess;
  }; /* size: 0x0004 */
  /* 0x008c */ unsigned short MaxMessageLength;
  /* 0x008e */ unsigned short MaxConnectionInfoLength;
  /* 0x0090 */ unsigned long Flags;
  /* 0x0094 */ struct _KEVENT WaitEvent;
} LPCP_PORT_OBJECT, *PLPCP_PORT_OBJECT; /* size: 0x00a4 */

typedef struct _LPCP_PORT_QUEUE
{
  /* 0x0000 */ struct _LPCP_NONPAGED_PORT_QUEUE* NonPagedPortQueue;
  /* 0x0004 */ struct _KSEMAPHORE* Semaphore;
  /* 0x0008 */ struct _LIST_ENTRY ReceiveHead;
} LPCP_PORT_QUEUE, *PLPCP_PORT_QUEUE; /* size: 0x0010 */

typedef struct _LUID
{
  /* 0x0000 */ unsigned long LowPart;
  /* 0x0004 */ long HighPart;
} LUID, *PLUID; /* size: 0x0008 */

typedef struct _LUID_AND_ATTRIBUTES
{
  /* 0x0000 */ struct _LUID Luid;
  /* 0x0008 */ unsigned long Attributes;
} LUID_AND_ATTRIBUTES, *PLUID_AND_ATTRIBUTES; /* size: 0x000c */

typedef struct _MAILSLOT_CREATE_PARAMETERS
{
  /* 0x0000 */ unsigned long MailslotQuota;
  /* 0x0004 */ unsigned long MaximumMessageSize;
  /* 0x0008 */ union _LARGE_INTEGER ReadTimeout;
  /* 0x0010 */ unsigned char TimeoutSpecified;
  /* 0x0011 */ char __PADDING__[7];
} MAILSLOT_CREATE_PARAMETERS, *PMAILSLOT_CREATE_PARAMETERS; /* size: 0x0018 */

typedef struct _MAPPED_FILE_SEGMENT
{
  /* 0x0000 */ struct _CONTROL_AREA* ControlArea;
  /* 0x0004 */ unsigned long TotalNumberOfPtes;
  /* 0x0008 */ struct _SEGMENT_FLAGS SegmentFlags;
  /* 0x000c */ unsigned long NumberOfCommittedPages;
  /* 0x0010 */ unsigned __int64 SizeOfSegment;
  union
  {
    /* 0x0018 */ struct _MMEXTEND_INFO* ExtendInfo;
    /* 0x0018 */ void* BasedAddress;
  }; /* size: 0x0004 */
  /* 0x001c */ struct _EX_PUSH_LOCK SegmentLock;
  /* 0x0020 */ struct _MSUBSECTION* LastSubsectionHint;
  /* 0x0024 */ long __PADDING__[1];
} MAPPED_FILE_SEGMENT, *PMAPPED_FILE_SEGMENT; /* size: 0x0028 */

typedef struct _MBCB
{
  /* 0x0000 */ short NodeTypeCode;
  /* 0x0002 */ short NodeIsInZone;
  /* 0x0004 */ unsigned long PagesToWrite;
  /* 0x0008 */ unsigned long DirtyPages;
  /* 0x000c */ unsigned long Reserved;
  /* 0x0010 */ struct _LIST_ENTRY BitmapRanges;
  /* 0x0018 */ __int64 ResumeWritePage;
  /* 0x0020 */ struct _BITMAP_RANGE BitmapRange1;
  /* 0x0040 */ struct _BITMAP_RANGE BitmapRange2;
  /* 0x0060 */ struct _BITMAP_RANGE BitmapRange3;
} MBCB, *PMBCB; /* size: 0x0080 */

typedef struct _MDL
{
  /* 0x0000 */ struct _MDL* Next;
  /* 0x0004 */ short Size;
  /* 0x0006 */ short MdlFlags;
  /* 0x0008 */ struct _EPROCESS* Process;
  /* 0x000c */ void* MappedSystemVa;
  /* 0x0010 */ void* StartVa;
  /* 0x0014 */ unsigned long ByteCount;
  /* 0x0018 */ unsigned long ByteOffset;
} MDL, *PMDL; /* size: 0x001c */

typedef struct _MEMORY_ALLOCATION_DESCRIPTOR
{
  /* 0x0000 */ struct _LIST_ENTRY ListEntry;
  /* 0x0008 */ enum _TYPE_OF_MEMORY MemoryType;
  /* 0x000c */ unsigned long BasePage;
  /* 0x0010 */ unsigned long PageCount;
} MEMORY_ALLOCATION_DESCRIPTOR, *PMEMORY_ALLOCATION_DESCRIPTOR; /* size: 0x0014 */

typedef enum _MEMORY_CACHING_TYPE
{
  MmNonCached = 0,
  MmCached = 1,
  MmWriteCombined = 2,
  MmHardwareCoherentCached = 3,
  MmNonCachedUnordered = 4,
  MmUSWCCached = 5,
  MmMaximumCacheType = 6,
} MEMORY_CACHING_TYPE, *PMEMORY_CACHING_TYPE;

typedef enum _MEMORY_CACHING_TYPE_ORIG
{
  MmFrameBufferCached = 2,
} MEMORY_CACHING_TYPE_ORIG, *PMEMORY_CACHING_TYPE_ORIG;

typedef struct _MI_COLOR_BASE
{
  /* 0x0000 */ unsigned short* ColorPointer;
  /* 0x0004 */ unsigned short ColorMask;
  /* 0x0006 */ unsigned short ColorNode;
} MI_COLOR_BASE, *PMI_COLOR_BASE; /* size: 0x0008 */

typedef enum _MI_DYNAMIC_MEMORY_LOCKTYPE
{
  AlreadyHeld = 0,
  AcquiredShared = 1,
  UseSpinLock = 2,
  UseSpinLockRaiseIrql = 3,
} MI_DYNAMIC_MEMORY_LOCKTYPE, *PMI_DYNAMIC_MEMORY_LOCKTYPE;

typedef struct _MI_EXTRA_IMAGE_INFORMATION
{
  /* 0x0000 */ unsigned long SizeOfHeaders;
  /* 0x0004 */ void* ImageMerge;
} MI_EXTRA_IMAGE_INFORMATION, *PMI_EXTRA_IMAGE_INFORMATION; /* size: 0x0008 */

typedef struct _MI_IMAGE_SECURITY_REFERENCE
{
  /* 0x0000 */ struct _IMAGE_SECURITY_CONTEXT SecurityContext;
  /* 0x0004 */ void* DynamicRelocations;
  /* 0x0008 */ volatile long ReferenceCount;
} MI_IMAGE_SECURITY_REFERENCE, *PMI_IMAGE_SECURITY_REFERENCE; /* size: 0x000c */

typedef struct _MI_PAGEFILE_TRACES
{
  /* 0x0000 */ long Status;
  /* 0x0004 */ unsigned char Priority;
  /* 0x0005 */ unsigned char IrpPriority;
  /* 0x0008 */ union _LARGE_INTEGER CurrentTime;
  /* 0x0010 */ unsigned long AvailablePages;
  /* 0x0014 */ unsigned long ModifiedPagesTotal;
  /* 0x0018 */ unsigned long ModifiedPagefilePages;
  /* 0x001c */ unsigned long ModifiedNoWritePages;
  struct
  {
    /* 0x0020 */ struct _MDL Mdl;
    /* 0x003c */ unsigned long Page[1];
  } /* size: 0x0020 */ MdlHack;
} MI_PAGEFILE_TRACES, *PMI_PAGEFILE_TRACES; /* size: 0x0040 */

typedef struct _MI_PER_SESSION_PROTOS
{
  union
  {
    union
    {
      /* 0x0000 */ long Balance : 2; /* bit position: 0 */
      /* 0x0000 */ struct _MMADDRESS_NODE* Parent;
      /* 0x0000 */ struct _MI_PER_SESSION_PROTOS* NextToFree;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ u1;
  /* 0x0004 */ struct _MMADDRESS_NODE* LeftChild;
  /* 0x0008 */ struct _MMADDRESS_NODE* RightChild;
  union
  {
    /* 0x000c */ unsigned long SessionId;
    /* 0x000c */ unsigned long StartingVpn;
    /* 0x000c */ struct _SUBSECTION* Subsection;
  }; /* size: 0x0004 */
  /* 0x0010 */ unsigned long EndingVpn;
  /* 0x0014 */ struct _MMPTE* SubsectionBase;
  union
  {
    union
    {
      /* 0x0018 */ unsigned long ReferenceCount;
      /* 0x0018 */ unsigned long NumberOfPtesToFree;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ u2;
} MI_PER_SESSION_PROTOS, *PMI_PER_SESSION_PROTOS; /* size: 0x001c */

typedef enum _MI_PFN_CACHE_ATTRIBUTE
{
  MiNonCached = 0,
  MiCached = 1,
  MiWriteCombined = 2,
  MiNotMapped = 3,
} MI_PFN_CACHE_ATTRIBUTE, *PMI_PFN_CACHE_ATTRIBUTE;

typedef struct _MI_SECTION_CREATION_GATE
{
  /* 0x0000 */ struct _MI_SECTION_CREATION_GATE* Next;
  /* 0x0004 */ struct _KGATE Gate;
} MI_SECTION_CREATION_GATE, *PMI_SECTION_CREATION_GATE; /* size: 0x0014 */

typedef struct _MI_SECTION_IMAGE_INFORMATION
{
  /* 0x0000 */ struct _SECTION_IMAGE_INFORMATION ExportedImageInformation;
  /* 0x0030 */ struct _MI_EXTRA_IMAGE_INFORMATION InternalImageInformation;
} MI_SECTION_IMAGE_INFORMATION, *PMI_SECTION_IMAGE_INFORMATION; /* size: 0x0038 */

typedef struct _MI_SPECIAL_POOL
{
  /* 0x0000 */ struct _MMPTE* PteBase;
  /* 0x0004 */ struct _MMPTE FreePteHead;
  /* 0x0008 */ struct _MMPTE FreePteTail;
  /* 0x000c */ volatile long PagesInUse;
  /* 0x0010 */ struct _RTL_BITMAP SpecialPoolPdes;
} MI_SPECIAL_POOL, *PMI_SPECIAL_POOL; /* size: 0x0018 */

typedef struct _MI_SYSTEM_PTE_TYPE
{
  /* 0x0000 */ struct _RTL_BITMAP Bitmap;
  /* 0x0008 */ unsigned long Hint;
  /* 0x000c */ struct _MMPTE* BasePte;
  /* 0x0010 */ unsigned long* FailureCount;
  /* 0x0014 */ struct _MMSUPPORT* Vm;
  /* 0x0018 */ volatile long TotalSystemPtes;
  /* 0x001c */ volatile long TotalFreeSystemPtes;
  /* 0x0020 */ volatile long CachedPteCount;
  /* 0x0024 */ unsigned long PteFailures;
  /* 0x0028 */ struct _KGUARDED_MUTEX* GlobalMutex;
} MI_SYSTEM_PTE_TYPE, *PMI_SYSTEM_PTE_TYPE; /* size: 0x002c */

typedef enum _MI_SYSTEM_VA_TYPE
{
  MiVaUnused = 0,
  MiVaSessionSpace = 1,
  MiVaProcessSpace = 2,
  MiVaBootLoaded = 3,
  MiVaPfnDatabase = 4,
  MiVaNonPagedPool = 5,
  MiVaPagedPool = 6,
  MiVaSpecialPool = 7,
  MiVaSystemCache = 8,
  MiVaSystemPtes = 9,
  MiVaHal = 10,
  MiVaSessionGlobalSpace = 11,
  MiVaDriverImages = 12,
  MiVaMaximumType = 13,
} MI_SYSTEM_VA_TYPE, *PMI_SYSTEM_VA_TYPE;

typedef enum _MI_VAD_TYPE
{
  VadNone = 0,
  VadDevicePhysicalMemory = 1,
  VadImageMap = 2,
  VadAwe = 3,
  VadWriteWatch = 4,
  VadLargePages = 5,
  VadRotatePhysical = 6,
  VadLargePageSection = 7,
} MI_VAD_TYPE, *PMI_VAD_TYPE;

typedef struct _MI_VERIFIER_DRIVER_ENTRY
{
  /* 0x0000 */ struct _LIST_ENTRY Links;
  /* 0x0008 */ unsigned long Loads;
  /* 0x000c */ unsigned long Unloads;
  /* 0x0010 */ struct _UNICODE_STRING BaseName;
  /* 0x0018 */ void* StartAddress;
  /* 0x001c */ void* EndAddress;
  /* 0x0020 */ unsigned long Flags;
  /* 0x0024 */ unsigned long Signature;
  /* 0x0028 */ union _SLIST_HEADER PoolPageHeaders;
  /* 0x0030 */ union _SLIST_HEADER PoolTrackers;
  /* 0x0038 */ unsigned long CurrentPagedPoolAllocations;
  /* 0x003c */ unsigned long CurrentNonPagedPoolAllocations;
  /* 0x0040 */ unsigned long PeakPagedPoolAllocations;
  /* 0x0044 */ unsigned long PeakNonPagedPoolAllocations;
  /* 0x0048 */ unsigned long PagedBytes;
  /* 0x004c */ unsigned long NonPagedBytes;
  /* 0x0050 */ unsigned long PeakPagedBytes;
  /* 0x0054 */ unsigned long PeakNonPagedBytes;
} MI_VERIFIER_DRIVER_ENTRY, *PMI_VERIFIER_DRIVER_ENTRY; /* size: 0x0058 */

typedef struct _MI_VERIFIER_POOL_HEADER
{
  /* 0x0000 */ struct _VI_POOL_ENTRY* VerifierPoolEntry;
} MI_VERIFIER_POOL_HEADER, *PMI_VERIFIER_POOL_HEADER; /* size: 0x0004 */

typedef struct _MMADDRESS_LIST
{
  union
  {
    union
    {
      /* 0x0000 */ struct _MMSECURE_FLAGS Flags;
      /* 0x0000 */ void* StartVa;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ u1;
  /* 0x0004 */ void* EndVa;
} MMADDRESS_LIST, *PMMADDRESS_LIST; /* size: 0x0008 */

typedef struct _MMADDRESS_NODE
{
  union
  {
    union
    {
      /* 0x0000 */ long Balance : 2; /* bit position: 0 */
      /* 0x0000 */ struct _MMADDRESS_NODE* Parent;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ u1;
  /* 0x0004 */ struct _MMADDRESS_NODE* LeftChild;
  /* 0x0008 */ struct _MMADDRESS_NODE* RightChild;
  /* 0x000c */ unsigned long StartingVpn;
  /* 0x0010 */ unsigned long EndingVpn;
} MMADDRESS_NODE, *PMMADDRESS_NODE; /* size: 0x0014 */

typedef struct _MMBANKED_SECTION
{
  /* 0x0000 */ unsigned long BasePhysicalPage;
  /* 0x0004 */ struct _MMPTE* BasedPte;
  /* 0x0008 */ unsigned long BankSize;
  /* 0x000c */ unsigned long BankShift;
  /* 0x0010 */ void* BankedRoutine /* function */;
  /* 0x0014 */ void* Context;
  /* 0x0018 */ struct _MMPTE* CurrentMappedPte;
  /* 0x001c */ struct _MMPTE BankTemplate[1];
} MMBANKED_SECTION, *PMMBANKED_SECTION; /* size: 0x0020 */

typedef struct _MMEXTEND_INFO
{
  /* 0x0000 */ unsigned __int64 CommittedSize;
  /* 0x0008 */ unsigned long ReferenceCount;
  /* 0x000c */ long __PADDING__[1];
} MMEXTEND_INFO, *PMMEXTEND_INFO; /* size: 0x0010 */

typedef enum _MMLISTS
{
  ZeroedPageList = 0,
  FreePageList = 1,
  StandbyPageList = 2,
  ModifiedPageList = 3,
  ModifiedNoWritePageList = 4,
  BadPageList = 5,
  ActiveAndValid = 6,
  TransitionPage = 7,
} MMLISTS, *PMMLISTS;

typedef struct _MMMOD_WRITER_MDL_ENTRY
{
  /* 0x0000 */ struct _LIST_ENTRY Links;
  union
  {
    /* 0x0008 */ struct _IO_STATUS_BLOCK IoStatus;
  } /* size: 0x0008 */ u;
  /* 0x0010 */ struct _IRP* Irp;
  union
  {
    /* 0x0014 */ unsigned long KeepForever;
  } /* size: 0x0004 */ u1;
  /* 0x0018 */ struct _MMPAGING_FILE* PagingFile;
  /* 0x001c */ struct _FILE_OBJECT* File;
  /* 0x0020 */ struct _CONTROL_AREA* ControlArea;
  /* 0x0024 */ struct _ERESOURCE* FileResource;
  /* 0x0028 */ union _LARGE_INTEGER WriteOffset;
  /* 0x0030 */ union _LARGE_INTEGER IssueTime;
  /* 0x0038 */ struct _MDL* PointerMdl;
  /* 0x003c */ struct _MDL Mdl;
  /* 0x0058 */ unsigned long Page[1];
  /* 0x005c */ long __PADDING__[1];
} MMMOD_WRITER_MDL_ENTRY, *PMMMOD_WRITER_MDL_ENTRY; /* size: 0x0060 */

typedef struct _MMPAGING_FILE
{
  /* 0x0000 */ unsigned long Size;
  /* 0x0004 */ unsigned long MaximumSize;
  /* 0x0008 */ unsigned long MinimumSize;
  /* 0x000c */ unsigned long FreeSpace;
  /* 0x0010 */ unsigned long PeakUsage;
  /* 0x0014 */ unsigned long HighestPage;
  /* 0x0018 */ struct _FILE_OBJECT* File;
  /* 0x001c */ struct _MMMOD_WRITER_MDL_ENTRY* Entry[2];
  /* 0x0024 */ struct _UNICODE_STRING PageFileName;
  /* 0x002c */ struct _RTL_BITMAP* volatile Bitmap;
  /* 0x0030 */ unsigned long BitmapHint;
  /* 0x0034 */ unsigned long LastAllocationSize;
  struct /* bitfield */
  {
    /* 0x0038 */ unsigned short PageFileNumber : 4; /* bit position: 0 */
    /* 0x0038 */ unsigned short BootPartition : 1; /* bit position: 4 */
    /* 0x0038 */ unsigned short Spare0 : 11; /* bit position: 5 */
  }; /* bitfield */
  struct /* bitfield */
  {
    /* 0x003a */ unsigned short AdriftMdls : 1; /* bit position: 0 */
    /* 0x003a */ unsigned short Spare1 : 15; /* bit position: 1 */
  }; /* bitfield */
  /* 0x003c */ void* FileHandle;
  /* 0x0040 */ union _SLIST_HEADER AvailableList;
  /* 0x0048 */ union _SLIST_HEADER NeedProcessingList;
} MMPAGING_FILE, *PMMPAGING_FILE; /* size: 0x0050 */

typedef struct _MMPAGING_FILE_FREE_ENTRY
{
  /* 0x0000 */ struct _SINGLE_LIST_ENTRY ListEntry;
  /* 0x0004 */ unsigned long FreeBit;
} MMPAGING_FILE_FREE_ENTRY, *PMMPAGING_FILE_FREE_ENTRY; /* size: 0x0008 */

typedef struct _MMPFN
{
  union
  {
    union
    {
      /* 0x0000 */ unsigned long Flink;
      /* 0x0000 */ unsigned long WsIndex;
      /* 0x0000 */ struct _KEVENT* Event;
      /* 0x0000 */ void* Next;
      /* 0x0000 */ void* volatile VolatileNext;
      /* 0x0000 */ struct _KTHREAD* KernelStackOwner;
      /* 0x0000 */ struct _SINGLE_LIST_ENTRY NextStackPfn;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ u1;
  union
  {
    union
    {
      /* 0x0004 */ unsigned long Blink;
      /* 0x0004 */ struct _MMPTE* ImageProtoPte;
      /* 0x0004 */ unsigned long ShareCount;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ u2;
  union
  {
    /* 0x0008 */ struct _MMPTE* PteAddress;
    /* 0x0008 */ void* volatile VolatilePteAddress;
  }; /* size: 0x0004 */
  union
  {
    union
    {
      struct
      {
        /* 0x000c */ unsigned short ReferenceCount;
        /* 0x000e */ struct _MMPFNENTRY e1;
      }; /* size: 0x0004 */
      struct
      {
        union
        {
          /* 0x000c */ unsigned short ReferenceCount;
          /* 0x000c */ volatile short VolatileReferenceCount;
        }; /* size: 0x0002 */
        /* 0x000e */ unsigned short ShortFlags;
      } /* size: 0x0004 */ e2;
      struct
      {
        /* 0x000c */ unsigned short ReferenceCount;
        /* 0x000e */ unsigned char ByteFlags;
        /* 0x000f */ unsigned char InterlockedByteFlags;
      } /* size: 0x0004 */ e3;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ u3;
  union
  {
    /* 0x0010 */ struct _MMPTE OriginalPte;
    /* 0x0010 */ volatile long AweReferenceCount;
  }; /* size: 0x0004 */
  union
  {
    struct /* bitfield */
    {
      /* 0x0014 */ unsigned long PteFrame : 25; /* bit position: 0 */
      /* 0x0014 */ unsigned long PfnImageVerified : 1; /* bit position: 25 */
      /* 0x0014 */ unsigned long AweAllocation : 1; /* bit position: 26 */
      /* 0x0014 */ unsigned long PrototypePte : 1; /* bit position: 27 */
      /* 0x0014 */ unsigned long PageColor : 4; /* bit position: 28 */
    }; /* bitfield */
  } /* size: 0x0004 */ u4;
} MMPFN, *PMMPFN; /* size: 0x0018 */

typedef struct _MMPFNENTRY
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned char PageLocation : 3; /* bit position: 0 */
    /* 0x0000 */ unsigned char WriteInProgress : 1; /* bit position: 3 */
    /* 0x0000 */ unsigned char Modified : 1; /* bit position: 4 */
    /* 0x0000 */ unsigned char ReadInProgress : 1; /* bit position: 5 */
    /* 0x0000 */ unsigned char CacheAttribute : 2; /* bit position: 6 */
  }; /* bitfield */
  struct /* bitfield */
  {
    /* 0x0001 */ unsigned char Priority : 3; /* bit position: 0 */
    /* 0x0001 */ unsigned char Rom : 1; /* bit position: 3 */
    /* 0x0001 */ unsigned char InPageError : 1; /* bit position: 4 */
    /* 0x0001 */ unsigned char KernelStack : 1; /* bit position: 5 */
    /* 0x0001 */ unsigned char RemovalRequested : 1; /* bit position: 6 */
    /* 0x0001 */ unsigned char ParityError : 1; /* bit position: 7 */
  }; /* bitfield */
} MMPFNENTRY, *PMMPFNENTRY; /* size: 0x0002 */

typedef struct _MMPFNLIST
{
  /* 0x0000 */ unsigned long Total;
  /* 0x0004 */ enum _MMLISTS ListName;
  /* 0x0008 */ unsigned long Flink;
  /* 0x000c */ unsigned long Blink;
} MMPFNLIST, *PMMPFNLIST; /* size: 0x0010 */

typedef struct _MMPTE
{
  union
  {
    union
    {
      /* 0x0000 */ unsigned long Long;
      /* 0x0000 */ volatile unsigned long VolatileLong;
      /* 0x0000 */ struct _HARDWARE_PTE Flush;
      /* 0x0000 */ struct _MMPTE_HARDWARE Hard;
      /* 0x0000 */ struct _MMPTE_PROTOTYPE Proto;
      /* 0x0000 */ struct _MMPTE_SOFTWARE Soft;
      /* 0x0000 */ struct _MMPTE_TIMESTAMP TimeStamp;
      /* 0x0000 */ struct _MMPTE_TRANSITION Trans;
      /* 0x0000 */ struct _MMPTE_SUBSECTION Subsect;
      /* 0x0000 */ struct _MMPTE_LIST List;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ u;
} MMPTE, *PMMPTE; /* size: 0x0004 */

typedef struct _MMPTE_FLUSH_LIST
{
  /* 0x0000 */ unsigned long Count;
  /* 0x0004 */ unsigned long MaximumCount;
  /* 0x0008 */ void* FlushVa[33];
} MMPTE_FLUSH_LIST, *PMMPTE_FLUSH_LIST; /* size: 0x008c */

typedef struct _MMPTE_HARDWARE
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned long Valid : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned long Dirty1 : 1; /* bit position: 1 */
    /* 0x0000 */ unsigned long Owner : 1; /* bit position: 2 */
    /* 0x0000 */ unsigned long WriteThrough : 1; /* bit position: 3 */
    /* 0x0000 */ unsigned long CacheDisable : 1; /* bit position: 4 */
    /* 0x0000 */ unsigned long Accessed : 1; /* bit position: 5 */
    /* 0x0000 */ unsigned long Dirty : 1; /* bit position: 6 */
    /* 0x0000 */ unsigned long LargePage : 1; /* bit position: 7 */
    /* 0x0000 */ unsigned long Global : 1; /* bit position: 8 */
    /* 0x0000 */ unsigned long CopyOnWrite : 1; /* bit position: 9 */
    /* 0x0000 */ unsigned long Prototype : 1; /* bit position: 10 */
    /* 0x0000 */ unsigned long Write : 1; /* bit position: 11 */
    /* 0x0000 */ unsigned long PageFrameNumber : 20; /* bit position: 12 */
  }; /* bitfield */
} MMPTE_HARDWARE, *PMMPTE_HARDWARE; /* size: 0x0004 */

typedef struct _MMPTE_LIST
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned long Valid : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned long OneEntry : 1; /* bit position: 1 */
    /* 0x0000 */ unsigned long filler0 : 8; /* bit position: 2 */
    /* 0x0000 */ unsigned long Prototype : 1; /* bit position: 10 */
    /* 0x0000 */ unsigned long filler1 : 1; /* bit position: 11 */
    /* 0x0000 */ unsigned long NextEntry : 20; /* bit position: 12 */
  }; /* bitfield */
} MMPTE_LIST, *PMMPTE_LIST; /* size: 0x0004 */

typedef struct _MMPTE_PROTOTYPE
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned long Valid : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned long ProtoAddressLow : 8; /* bit position: 1 */
    /* 0x0000 */ unsigned long ReadOnly : 1; /* bit position: 9 */
    /* 0x0000 */ unsigned long Prototype : 1; /* bit position: 10 */
    /* 0x0000 */ unsigned long ProtoAddressHigh : 21; /* bit position: 11 */
  }; /* bitfield */
} MMPTE_PROTOTYPE, *PMMPTE_PROTOTYPE; /* size: 0x0004 */

typedef struct _MMPTE_SOFTWARE
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned long Valid : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned long PageFileLow : 4; /* bit position: 1 */
    /* 0x0000 */ unsigned long Protection : 5; /* bit position: 5 */
    /* 0x0000 */ unsigned long Prototype : 1; /* bit position: 10 */
    /* 0x0000 */ unsigned long Transition : 1; /* bit position: 11 */
    /* 0x0000 */ unsigned long PageFileHigh : 20; /* bit position: 12 */
  }; /* bitfield */
} MMPTE_SOFTWARE, *PMMPTE_SOFTWARE; /* size: 0x0004 */

typedef struct _MMPTE_SUBSECTION
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned long Valid : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned long SubsectionAddressLow : 9; /* bit position: 1 */
    /* 0x0000 */ unsigned long Prototype : 1; /* bit position: 10 */
    /* 0x0000 */ unsigned long SubsectionAddressHigh : 21; /* bit position: 11 */
  }; /* bitfield */
} MMPTE_SUBSECTION, *PMMPTE_SUBSECTION; /* size: 0x0004 */

typedef struct _MMPTE_TIMESTAMP
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned long MustBeZero : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned long PageFileLow : 4; /* bit position: 1 */
    /* 0x0000 */ unsigned long Protection : 5; /* bit position: 5 */
    /* 0x0000 */ unsigned long Prototype : 1; /* bit position: 10 */
    /* 0x0000 */ unsigned long Transition : 1; /* bit position: 11 */
    /* 0x0000 */ unsigned long GlobalTimeStamp : 20; /* bit position: 12 */
  }; /* bitfield */
} MMPTE_TIMESTAMP, *PMMPTE_TIMESTAMP; /* size: 0x0004 */

typedef struct _MMPTE_TRANSITION
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned long Valid : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned long Write : 1; /* bit position: 1 */
    /* 0x0000 */ unsigned long Owner : 1; /* bit position: 2 */
    /* 0x0000 */ unsigned long WriteThrough : 1; /* bit position: 3 */
    /* 0x0000 */ unsigned long CacheDisable : 1; /* bit position: 4 */
    /* 0x0000 */ unsigned long Protection : 5; /* bit position: 5 */
    /* 0x0000 */ unsigned long Prototype : 1; /* bit position: 10 */
    /* 0x0000 */ unsigned long Transition : 1; /* bit position: 11 */
    /* 0x0000 */ unsigned long PageFrameNumber : 20; /* bit position: 12 */
  }; /* bitfield */
} MMPTE_TRANSITION, *PMMPTE_TRANSITION; /* size: 0x0004 */

typedef struct _MMSECTION_FLAGS
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned int BeingDeleted : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned int BeingCreated : 1; /* bit position: 1 */
    /* 0x0000 */ unsigned int BeingPurged : 1; /* bit position: 2 */
    /* 0x0000 */ unsigned int NoModifiedWriting : 1; /* bit position: 3 */
    /* 0x0000 */ unsigned int FailAllIo : 1; /* bit position: 4 */
    /* 0x0000 */ unsigned int Image : 1; /* bit position: 5 */
    /* 0x0000 */ unsigned int Based : 1; /* bit position: 6 */
    /* 0x0000 */ unsigned int File : 1; /* bit position: 7 */
    /* 0x0000 */ unsigned int Networked : 1; /* bit position: 8 */
    /* 0x0000 */ unsigned int Rom : 1; /* bit position: 9 */
    /* 0x0000 */ unsigned int PhysicalMemory : 1; /* bit position: 10 */
    /* 0x0000 */ unsigned int CopyOnWrite : 1; /* bit position: 11 */
    /* 0x0000 */ unsigned int Reserve : 1; /* bit position: 12 */
    /* 0x0000 */ unsigned int Commit : 1; /* bit position: 13 */
    /* 0x0000 */ unsigned int Accessed : 1; /* bit position: 14 */
    /* 0x0000 */ unsigned int WasPurged : 1; /* bit position: 15 */
    /* 0x0000 */ unsigned int UserReference : 1; /* bit position: 16 */
    /* 0x0000 */ unsigned int GlobalMemory : 1; /* bit position: 17 */
    /* 0x0000 */ unsigned int DeleteOnClose : 1; /* bit position: 18 */
    /* 0x0000 */ unsigned int FilePointerNull : 1; /* bit position: 19 */
    /* 0x0000 */ unsigned int GlobalOnlyPerSession : 1; /* bit position: 20 */
    /* 0x0000 */ unsigned int SetMappedFileIoComplete : 1; /* bit position: 21 */
    /* 0x0000 */ unsigned int CollidedFlush : 1; /* bit position: 22 */
    /* 0x0000 */ unsigned int NoChange : 1; /* bit position: 23 */
    /* 0x0000 */ unsigned int Spare : 1; /* bit position: 24 */
    /* 0x0000 */ unsigned int UserWritable : 1; /* bit position: 25 */
    /* 0x0000 */ unsigned int PreferredNode : 6; /* bit position: 26 */
  }; /* bitfield */
} MMSECTION_FLAGS, *PMMSECTION_FLAGS; /* size: 0x0004 */

typedef struct _MMSECURE_FLAGS
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned long ReadOnly : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned long NoWrite : 1; /* bit position: 1 */
    /* 0x0000 */ unsigned long Spare : 10; /* bit position: 2 */
  }; /* bitfield */
} MMSECURE_FLAGS, *PMMSECURE_FLAGS; /* size: 0x0004 */

typedef struct _MMSESSION
{
  /* 0x0000 */ struct _KGUARDED_MUTEX SystemSpaceViewLock;
  /* 0x0020 */ struct _KGUARDED_MUTEX* SystemSpaceViewLockPointer;
  /* 0x0024 */ struct _MMVIEW* SystemSpaceViewTable;
  /* 0x0028 */ unsigned long SystemSpaceHashSize;
  /* 0x002c */ unsigned long SystemSpaceHashEntries;
  /* 0x0030 */ unsigned long SystemSpaceHashKey;
  /* 0x0034 */ unsigned long BitmapFailures;
} MMSESSION, *PMMSESSION; /* size: 0x0038 */

typedef struct _MMSUBSECTION_FLAGS
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned short SubsectionAccessed : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned short Protection : 5; /* bit position: 1 */
    /* 0x0000 */ unsigned short StartingSector4132 : 10; /* bit position: 6 */
  }; /* bitfield */
  struct /* bitfield */
  {
    /* 0x0002 */ unsigned short SubsectionStatic : 1; /* bit position: 0 */
    /* 0x0002 */ unsigned short GlobalMemory : 1; /* bit position: 1 */
    /* 0x0002 */ unsigned short DirtyPages : 1; /* bit position: 2 */
    /* 0x0002 */ unsigned short Spare : 1; /* bit position: 3 */
    /* 0x0002 */ unsigned short SectorEndOffset : 12; /* bit position: 4 */
  }; /* bitfield */
} MMSUBSECTION_FLAGS, *PMMSUBSECTION_FLAGS; /* size: 0x0004 */

typedef struct _MMSUBSECTION_NODE
{
  union
  {
    union
    {
      /* 0x0000 */ unsigned long LongFlags;
      /* 0x0000 */ struct _MMSUBSECTION_FLAGS SubsectionFlags;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ u;
  /* 0x0004 */ unsigned long StartingSector;
  /* 0x0008 */ unsigned long NumberOfFullSectors;
  union
  {
    union
    {
      /* 0x000c */ long Balance : 2; /* bit position: 0 */
      /* 0x000c */ struct _MMSUBSECTION_NODE* Parent;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ u1;
  /* 0x0010 */ struct _MMSUBSECTION_NODE* LeftChild;
  /* 0x0014 */ struct _MMSUBSECTION_NODE* RightChild;
} MMSUBSECTION_NODE, *PMMSUBSECTION_NODE; /* size: 0x0018 */

typedef struct _MMSUPPORT
{
  /* 0x0000 */ struct _LIST_ENTRY WorkingSetExpansionLinks;
  /* 0x0008 */ unsigned short LastTrimStamp;
  /* 0x000a */ unsigned short NextPageColor;
  /* 0x000c */ struct _MMSUPPORT_FLAGS Flags;
  /* 0x0010 */ unsigned long PageFaultCount;
  /* 0x0014 */ unsigned long PeakWorkingSetSize;
  /* 0x0018 */ unsigned long ChargedWslePages;
  /* 0x001c */ unsigned long MinimumWorkingSetSize;
  /* 0x0020 */ unsigned long MaximumWorkingSetSize;
  /* 0x0024 */ struct _MMWSL* VmWorkingSetList;
  /* 0x0028 */ unsigned long Claim;
  /* 0x002c */ unsigned long ActualWslePages;
  /* 0x0030 */ unsigned long WorkingSetPrivateSize;
  /* 0x0034 */ unsigned long WorkingSetSizeOverhead;
  /* 0x0038 */ unsigned long WorkingSetSize;
  /* 0x003c */ struct _KGATE* ExitGate;
  /* 0x0040 */ struct _EX_PUSH_LOCK WorkingSetMutex;
  /* 0x0044 */ void* AccessLog;
} MMSUPPORT, *PMMSUPPORT; /* size: 0x0048 */

typedef struct _MMSUPPORT_FLAGS
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned char SessionSpace : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned char ModwriterAttached : 1; /* bit position: 1 */
    /* 0x0000 */ unsigned char TrimHard : 1; /* bit position: 2 */
    /* 0x0000 */ unsigned char MaximumWorkingSetHard : 1; /* bit position: 3 */
    /* 0x0000 */ unsigned char ForceTrim : 1; /* bit position: 4 */
    /* 0x0000 */ unsigned char MinimumWorkingSetHard : 1; /* bit position: 5 */
    /* 0x0000 */ unsigned char SessionMaster : 1; /* bit position: 6 */
    /* 0x0000 */ unsigned char TrimmerAttached : 1; /* bit position: 7 */
  }; /* bitfield */
  struct /* bitfield */
  {
    /* 0x0001 */ unsigned char TrimmerDetaching : 1; /* bit position: 0 */
    /* 0x0001 */ unsigned char Reserved : 3; /* bit position: 1 */
    /* 0x0001 */ unsigned char PageStealers : 4; /* bit position: 4 */
  }; /* bitfield */
  /* 0x0002 */ unsigned char MemoryPriority : 8; /* bit position: 0 */
  struct /* bitfield */
  {
    /* 0x0003 */ unsigned char WsleDeleted : 1; /* bit position: 0 */
    /* 0x0003 */ unsigned char VmExiting : 1; /* bit position: 1 */
    /* 0x0003 */ unsigned char ExpansionFailed : 1; /* bit position: 2 */
    /* 0x0003 */ unsigned char Available : 5; /* bit position: 3 */
  }; /* bitfield */
} MMSUPPORT_FLAGS, *PMMSUPPORT_FLAGS; /* size: 0x0004 */

typedef struct _MMVAD
{
  union
  {
    union
    {
      /* 0x0000 */ long Balance : 2; /* bit position: 0 */
      /* 0x0000 */ struct _MMVAD* Parent;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ u1;
  /* 0x0004 */ struct _MMVAD* LeftChild;
  /* 0x0008 */ struct _MMVAD* RightChild;
  /* 0x000c */ unsigned long StartingVpn;
  /* 0x0010 */ unsigned long EndingVpn;
  union
  {
    union
    {
      /* 0x0014 */ unsigned long LongFlags;
      /* 0x0014 */ struct _MMVAD_FLAGS VadFlags;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ u;
  /* 0x0018 */ struct _EX_PUSH_LOCK PushLock;
  union
  {
    union
    {
      /* 0x001c */ unsigned long LongFlags3;
      /* 0x001c */ struct _MMVAD_FLAGS3 VadFlags3;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ u5;
  union
  {
    union
    {
      /* 0x0020 */ unsigned long LongFlags2;
      /* 0x0020 */ struct _MMVAD_FLAGS2 VadFlags2;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ u2;
  union
  {
    /* 0x0024 */ struct _SUBSECTION* Subsection;
    /* 0x0024 */ struct _MSUBSECTION* MappedSubsection;
  }; /* size: 0x0004 */
  /* 0x0028 */ struct _MMPTE* FirstPrototypePte;
  /* 0x002c */ struct _MMPTE* LastContiguousPte;
} MMVAD, *PMMVAD; /* size: 0x0030 */

typedef struct _MMVAD_FLAGS
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned long CommitCharge : 19; /* bit position: 0 */
    /* 0x0000 */ unsigned long NoChange : 1; /* bit position: 19 */
    /* 0x0000 */ unsigned long VadType : 3; /* bit position: 20 */
    /* 0x0000 */ unsigned long MemCommit : 1; /* bit position: 23 */
    /* 0x0000 */ unsigned long Protection : 5; /* bit position: 24 */
    /* 0x0000 */ unsigned long Spare : 2; /* bit position: 29 */
    /* 0x0000 */ unsigned long PrivateMemory : 1; /* bit position: 31 */
  }; /* bitfield */
} MMVAD_FLAGS, *PMMVAD_FLAGS; /* size: 0x0004 */

typedef struct _MMVAD_FLAGS2
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned int FileOffset : 24; /* bit position: 0 */
    /* 0x0000 */ unsigned int SecNoChange : 1; /* bit position: 24 */
    /* 0x0000 */ unsigned int OneSecured : 1; /* bit position: 25 */
    /* 0x0000 */ unsigned int MultipleSecured : 1; /* bit position: 26 */
    /* 0x0000 */ unsigned int Spare : 1; /* bit position: 27 */
    /* 0x0000 */ unsigned int LongVad : 1; /* bit position: 28 */
    /* 0x0000 */ unsigned int ExtendableFile : 1; /* bit position: 29 */
    /* 0x0000 */ unsigned int Inherit : 1; /* bit position: 30 */
    /* 0x0000 */ unsigned int CopyOnWrite : 1; /* bit position: 31 */
  }; /* bitfield */
} MMVAD_FLAGS2, *PMMVAD_FLAGS2; /* size: 0x0004 */

typedef struct _MMVAD_FLAGS3
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned long PreferredNode : 6; /* bit position: 0 */
    /* 0x0000 */ unsigned long Teb : 1; /* bit position: 6 */
    /* 0x0000 */ unsigned long Spare : 1; /* bit position: 7 */
    /* 0x0000 */ unsigned long SequentialAccess : 1; /* bit position: 8 */
    /* 0x0000 */ unsigned long LastSequentialTrim : 15; /* bit position: 9 */
    /* 0x0000 */ unsigned long Spare2 : 8; /* bit position: 24 */
  }; /* bitfield */
} MMVAD_FLAGS3, *PMMVAD_FLAGS3; /* size: 0x0004 */

typedef struct _MMVAD_LONG
{
  union
  {
    union
    {
      /* 0x0000 */ long Balance : 2; /* bit position: 0 */
      /* 0x0000 */ struct _MMVAD* Parent;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ u1;
  /* 0x0004 */ struct _MMVAD* LeftChild;
  /* 0x0008 */ struct _MMVAD* RightChild;
  /* 0x000c */ unsigned long StartingVpn;
  /* 0x0010 */ unsigned long EndingVpn;
  union
  {
    union
    {
      /* 0x0014 */ unsigned long LongFlags;
      /* 0x0014 */ struct _MMVAD_FLAGS VadFlags;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ u;
  /* 0x0018 */ struct _EX_PUSH_LOCK PushLock;
  union
  {
    union
    {
      /* 0x001c */ unsigned long LongFlags3;
      /* 0x001c */ struct _MMVAD_FLAGS3 VadFlags3;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ u5;
  union
  {
    union
    {
      /* 0x0020 */ unsigned long LongFlags2;
      /* 0x0020 */ struct _MMVAD_FLAGS2 VadFlags2;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ u2;
  /* 0x0024 */ struct _SUBSECTION* Subsection;
  /* 0x0028 */ struct _MMPTE* FirstPrototypePte;
  /* 0x002c */ struct _MMPTE* LastContiguousPte;
  union
  {
    union
    {
      /* 0x0030 */ struct _LIST_ENTRY List;
      /* 0x0030 */ struct _MMADDRESS_LIST Secured;
    }; /* size: 0x0008 */
  } /* size: 0x0008 */ u3;
  union
  {
    union
    {
      /* 0x0038 */ struct _MMBANKED_SECTION* Banked;
      /* 0x0038 */ struct _MMEXTEND_INFO* ExtendedInfo;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ u4;
} MMVAD_LONG, *PMMVAD_LONG; /* size: 0x003c */

typedef struct _MMVAD_SHORT
{
  union
  {
    union
    {
      /* 0x0000 */ long Balance : 2; /* bit position: 0 */
      /* 0x0000 */ struct _MMVAD* Parent;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ u1;
  /* 0x0004 */ struct _MMVAD* LeftChild;
  /* 0x0008 */ struct _MMVAD* RightChild;
  /* 0x000c */ unsigned long StartingVpn;
  /* 0x0010 */ unsigned long EndingVpn;
  union
  {
    union
    {
      /* 0x0014 */ unsigned long LongFlags;
      /* 0x0014 */ struct _MMVAD_FLAGS VadFlags;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ u;
  /* 0x0018 */ struct _EX_PUSH_LOCK PushLock;
  union
  {
    union
    {
      /* 0x001c */ unsigned long LongFlags3;
      /* 0x001c */ struct _MMVAD_FLAGS3 VadFlags3;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ u5;
} MMVAD_SHORT, *PMMVAD_SHORT; /* size: 0x0020 */

typedef struct _MMVIEW
{
  /* 0x0000 */ unsigned long Entry;
  union
  {
    /* 0x0004 */ unsigned long Writable : 1; /* bit position: 0 */
    /* 0x0004 */ struct _CONTROL_AREA* ControlArea;
  }; /* size: 0x0004 */
} MMVIEW, *PMMVIEW; /* size: 0x0008 */

typedef struct _MMWSL
{
  /* 0x0000 */ unsigned long FirstFree;
  /* 0x0004 */ unsigned long FirstDynamic;
  /* 0x0008 */ unsigned long LastEntry;
  /* 0x000c */ unsigned long NextSlot;
  /* 0x0010 */ struct _MMWSLE* Wsle;
  /* 0x0014 */ void* LowestPagableAddress;
  /* 0x0018 */ unsigned long LastInitializedWsle;
  /* 0x001c */ unsigned long NextEstimationSlot;
  /* 0x0020 */ unsigned long NextAgingSlot;
  /* 0x0024 */ unsigned long EstimatedAvailable;
  /* 0x0028 */ unsigned long GrowthSinceLastEstimate;
  /* 0x002c */ unsigned long NumberOfCommittedPageTables;
  /* 0x0030 */ unsigned long VadBitMapHint;
  /* 0x0034 */ unsigned long NonDirectCount;
  /* 0x0038 */ unsigned long LastVadBit;
  /* 0x003c */ unsigned long MaximumLastVadBit;
  /* 0x0040 */ unsigned long LastAllocationSizeHint;
  /* 0x0044 */ unsigned long LastAllocationSize;
  /* 0x0048 */ struct _MMWSLE_NONDIRECT_HASH* NonDirectHash;
  /* 0x004c */ struct _MMWSLE_HASH* HashTableStart;
  /* 0x0050 */ struct _MMWSLE_HASH* HighestPermittedHashAddress;
  /* 0x0054 */ void* HighestUserAddress;
  /* 0x0058 */ unsigned short UsedPageTableEntries[768];
  /* 0x0658 */ unsigned long CommittedPageTables[24];
} MMWSL, *PMMWSL; /* size: 0x06b8 */

typedef struct _MMWSLE
{
  union
  {
    union
    {
      /* 0x0000 */ void* VirtualAddress;
      /* 0x0000 */ unsigned long Long;
      /* 0x0000 */ struct _MMWSLENTRY e1;
      /* 0x0000 */ struct _MMWSLE_FREE_ENTRY e2;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ u1;
} MMWSLE, *PMMWSLE; /* size: 0x0004 */

typedef struct _MMWSLENTRY
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned long Valid : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned long LockedInWs : 1; /* bit position: 1 */
    /* 0x0000 */ unsigned long LockedInMemory : 1; /* bit position: 2 */
    /* 0x0000 */ unsigned long Protection : 5; /* bit position: 3 */
    /* 0x0000 */ unsigned long Hashed : 1; /* bit position: 8 */
    /* 0x0000 */ unsigned long Direct : 1; /* bit position: 9 */
    /* 0x0000 */ unsigned long Age : 2; /* bit position: 10 */
    /* 0x0000 */ unsigned long VirtualPageNumber : 20; /* bit position: 12 */
  }; /* bitfield */
} MMWSLENTRY, *PMMWSLENTRY; /* size: 0x0004 */

typedef struct _MMWSLE_FREE_ENTRY
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned long MustBeZero : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned long PreviousFree : 11; /* bit position: 1 */
    /* 0x0000 */ unsigned long NextFree : 20; /* bit position: 12 */
  }; /* bitfield */
} MMWSLE_FREE_ENTRY, *PMMWSLE_FREE_ENTRY; /* size: 0x0004 */

typedef struct _MMWSLE_HASH
{
  /* 0x0000 */ unsigned long Index;
} MMWSLE_HASH, *PMMWSLE_HASH; /* size: 0x0004 */

typedef struct _MMWSLE_NONDIRECT_HASH
{
  /* 0x0000 */ void* Key;
  /* 0x0004 */ unsigned long Index;
} MMWSLE_NONDIRECT_HASH, *PMMWSLE_NONDIRECT_HASH; /* size: 0x0008 */

typedef struct _MM_AVL_TABLE
{
  /* 0x0000 */ struct _MMADDRESS_NODE BalancedRoot;
  struct /* bitfield */
  {
    /* 0x0014 */ unsigned long DepthOfTree : 5; /* bit position: 0 */
    /* 0x0014 */ unsigned long Unused : 3; /* bit position: 5 */
    /* 0x0014 */ unsigned long NumberGenericTableElements : 24; /* bit position: 8 */
  }; /* bitfield */
  /* 0x0018 */ void* NodeHint;
  /* 0x001c */ void* NodeFreeHint;
} MM_AVL_TABLE, *PMM_AVL_TABLE; /* size: 0x0020 */

typedef struct _MM_DRIVER_VERIFIER_DATA
{
  /* 0x0000 */ unsigned long Level;
  /* 0x0004 */ unsigned long RaiseIrqls;
  /* 0x0008 */ unsigned long AcquireSpinLocks;
  /* 0x000c */ unsigned long SynchronizeExecutions;
  /* 0x0010 */ unsigned long AllocationsAttempted;
  /* 0x0014 */ unsigned long AllocationsSucceeded;
  /* 0x0018 */ volatile unsigned long AllocationsSucceededSpecialPool;
  /* 0x001c */ unsigned long AllocationsWithNoTag;
  /* 0x0020 */ unsigned long TrimRequests;
  /* 0x0024 */ unsigned long Trims;
  /* 0x0028 */ unsigned long AllocationsFailed;
  /* 0x002c */ unsigned long AllocationsFailedDeliberately;
  /* 0x0030 */ unsigned long Loads;
  /* 0x0034 */ unsigned long Unloads;
  /* 0x0038 */ unsigned long UnTrackedPool;
  /* 0x003c */ unsigned long UserTrims;
  /* 0x0040 */ unsigned long CurrentPagedPoolAllocations;
  /* 0x0044 */ unsigned long CurrentNonPagedPoolAllocations;
  /* 0x0048 */ unsigned long PeakPagedPoolAllocations;
  /* 0x004c */ unsigned long PeakNonPagedPoolAllocations;
  /* 0x0050 */ unsigned long PagedBytes;
  /* 0x0054 */ unsigned long NonPagedBytes;
  /* 0x0058 */ unsigned long PeakPagedBytes;
  /* 0x005c */ unsigned long PeakNonPagedBytes;
  /* 0x0060 */ unsigned long BurstAllocationsFailedDeliberately;
  /* 0x0064 */ unsigned long SessionTrims;
  /* 0x0068 */ unsigned long OptionChanges;
  /* 0x006c */ unsigned long VerifyMode;
  /* 0x0070 */ struct _UNICODE_STRING PreviousBucketName;
} MM_DRIVER_VERIFIER_DATA, *PMM_DRIVER_VERIFIER_DATA; /* size: 0x0078 */

typedef struct _MM_PAGED_POOL_INFO
{
  /* 0x0000 */ struct _KGUARDED_MUTEX Mutex;
  /* 0x0020 */ struct _RTL_BITMAP PagedPoolAllocationMap;
  /* 0x0028 */ struct _MMPTE* FirstPteForPagedPool;
  /* 0x002c */ unsigned long PagedPoolHint;
  /* 0x0030 */ volatile unsigned long PagedPoolCommit;
  /* 0x0034 */ volatile unsigned long AllocatedPagedPool;
} MM_PAGED_POOL_INFO, *PMM_PAGED_POOL_INFO; /* size: 0x0038 */

typedef struct _MM_PAGE_ACCESS_INFO
{
  union
  {
    /* 0x0000 */ union _MM_PAGE_ACCESS_INFO_FLAGS Flags;
    /* 0x0000 */ unsigned __int64 FileOffset;
    /* 0x0000 */ void* VirtualAddress;
    struct
    {
      struct /* bitfield */
      {
        /* 0x0000 */ unsigned long DontUse0 : 3; /* bit position: 0 */
        /* 0x0000 */ unsigned long Spare0 : 29; /* bit position: 3 */
      }; /* bitfield */
      /* 0x0004 */ void* PointerProtoPte;
    }; /* size: 0x0008 */
  }; /* size: 0x0008 */
} MM_PAGE_ACCESS_INFO, *PMM_PAGE_ACCESS_INFO; /* size: 0x0008 */

typedef union _MM_PAGE_ACCESS_INFO_FLAGS
{
  union
  {
    struct
    {
      struct /* bitfield */
      {
        /* 0x0000 */ unsigned long FilePointerIndex : 9; /* bit position: 0 */
        /* 0x0000 */ unsigned long HardFault : 1; /* bit position: 9 */
        /* 0x0000 */ unsigned long Image : 1; /* bit position: 10 */
        /* 0x0000 */ unsigned long Spare0 : 1; /* bit position: 11 */
      }; /* bitfield */
    } /* size: 0x0004 */ File;
    struct
    {
      struct /* bitfield */
      {
        /* 0x0000 */ unsigned long FilePointerIndex : 9; /* bit position: 0 */
        /* 0x0000 */ unsigned long HardFault : 1; /* bit position: 9 */
        /* 0x0000 */ unsigned long Spare1 : 2; /* bit position: 10 */
      }; /* bitfield */
    } /* size: 0x0004 */ Private;
  }; /* size: 0x0004 */
} MM_PAGE_ACCESS_INFO_FLAGS, *PMM_PAGE_ACCESS_INFO_FLAGS; /* size: 0x0004 */

typedef struct _MM_PAGE_ACCESS_INFO_HEADER
{
  /* 0x0000 */ struct _SINGLE_LIST_ENTRY Link;
  /* 0x0004 */ enum _MM_PAGE_ACCESS_TYPE Type;
  union
  {
    /* 0x0008 */ unsigned long EmptySequenceNumber;
    /* 0x0008 */ unsigned long CurrentFileIndex;
  }; /* size: 0x0004 */
  /* 0x0010 */ unsigned __int64 CreateTime;
  union
  {
    /* 0x0018 */ unsigned __int64 EmptyTime;
    /* 0x0018 */ struct _MM_PAGE_ACCESS_INFO* TempEntry;
  }; /* size: 0x0008 */
  union
  {
    struct
    {
      /* 0x0020 */ struct _MM_PAGE_ACCESS_INFO* PageEntry;
      /* 0x0024 */ unsigned long* FileEntry;
      /* 0x0028 */ unsigned long* FirstFileEntry;
      /* 0x002c */ struct _EPROCESS* Process;
      /* 0x0030 */ unsigned long SessionId;
    }; /* size: 0x0014 */
    struct
    {
      /* 0x0020 */ unsigned long* PageFrameEntry;
      /* 0x0024 */ unsigned long* LastPageFrameEntry;
      /* 0x0028 */ long __PADDING__[4];
    }; /* size: 0x0018 */
  }; /* size: 0x0018 */
} MM_PAGE_ACCESS_INFO_HEADER, *PMM_PAGE_ACCESS_INFO_HEADER; /* size: 0x0038 */

typedef enum _MM_PAGE_ACCESS_TYPE
{
  MmPteAccessType = 0,
  MmCcReadAheadType = 1,
  MmPfnRepurposeType = 2,
  MmMaximumPageAccessType = 3,
} MM_PAGE_ACCESS_TYPE, *PMM_PAGE_ACCESS_TYPE;

typedef enum _MM_POOL_FAILURE_REASONS
{
  MmNonPagedNoPtes = 0,
  MmPriorityTooLow = 1,
  MmNonPagedNoPagesAvailable = 2,
  MmPagedNoPtes = 3,
  MmSessionPagedNoPtes = 4,
  MmPagedNoPagesAvailable = 5,
  MmSessionPagedNoPagesAvailable = 6,
  MmPagedNoCommit = 7,
  MmSessionPagedNoCommit = 8,
  MmNonPagedNoResidentAvailable = 9,
  MmNonPagedNoCommit = 10,
  MmMaximumFailureReason = 11,
} MM_POOL_FAILURE_REASONS, *PMM_POOL_FAILURE_REASONS;

typedef enum _MM_POOL_PRIORITIES
{
  MmHighPriority = 0,
  MmNormalPriority = 1,
  MmLowPriority = 2,
  MmMaximumPoolPriority = 3,
} MM_POOL_PRIORITIES, *PMM_POOL_PRIORITIES;

typedef enum _MM_POOL_TYPES
{
  MmNonPagedPool = 0,
  MmPagedPool = 1,
  MmSessionPagedPool = 2,
  MmMaximumPoolType = 3,
} MM_POOL_TYPES, *PMM_POOL_TYPES;

typedef enum _MM_PREEMPTIVE_TRIMS
{
  MmPreemptForNonPaged = 0,
  MmPreemptForPaged = 1,
  MmPreemptForNonPagedPriority = 2,
  MmPreemptForPagedPriority = 3,
  MmMaximumPreempt = 4,
} MM_PREEMPTIVE_TRIMS, *PMM_PREEMPTIVE_TRIMS;

typedef struct _MM_SESSION_SPACE
{
  /* 0x0000 */ volatile long ReferenceCount;
  union
  {
    union
    {
      /* 0x0004 */ unsigned long LongFlags;
      /* 0x0004 */ struct _MM_SESSION_SPACE_FLAGS Flags;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ u;
  /* 0x0008 */ unsigned long SessionId;
  /* 0x000c */ volatile long ProcessReferenceToSession;
  /* 0x0010 */ struct _LIST_ENTRY ProcessList;
  /* 0x0018 */ union _LARGE_INTEGER LastProcessSwappedOutTime;
  /* 0x0020 */ unsigned long SessionPageDirectoryIndex;
  /* 0x0024 */ volatile unsigned long NonPagablePages;
  /* 0x0028 */ volatile unsigned long CommittedPages;
  /* 0x002c */ void* PagedPoolStart;
  /* 0x0030 */ void* PagedPoolEnd;
  /* 0x0034 */ void* SessionObject;
  /* 0x0038 */ void* SessionObjectHandle;
  /* 0x003c */ volatile long ResidentProcessCount;
  /* 0x0040 */ volatile long ImageLoadingCount;
  /* 0x0044 */ unsigned long SessionPoolAllocationFailures[4];
  /* 0x0054 */ struct _LIST_ENTRY ImageList;
  /* 0x005c */ unsigned long LocaleId;
  /* 0x0060 */ unsigned long AttachCount;
  /* 0x0064 */ struct _KGATE AttachGate;
  /* 0x0074 */ struct _LIST_ENTRY WsListEntry;
  /* 0x0080 */ struct _GENERAL_LOOKASIDE Lookaside[25];
  /* 0x0d00 */ struct _MMSESSION Session;
  /* 0x0d38 */ struct _MM_PAGED_POOL_INFO PagedPoolInfo;
  /* 0x0d70 */ struct _MMSUPPORT Vm;
  /* 0x0db8 */ struct _MMWSLE* Wsle;
  /* 0x0dbc */ void* volatile DriverUnload /* function */;
  /* 0x0dc0 */ struct _POOL_DESCRIPTOR PagedPool;
  /* 0x1df4 */ struct _MMPTE* PageTables;
  /* 0x1df8 */ struct _MI_SPECIAL_POOL SpecialPool;
  /* 0x1e10 */ struct _KGUARDED_MUTEX SessionPteLock;
  /* 0x1e30 */ long PoolBigEntriesInUse;
  /* 0x1e34 */ unsigned long PagedPoolPdeCount;
  /* 0x1e38 */ unsigned long SpecialPoolPdeCount;
  /* 0x1e3c */ unsigned long DynamicSessionPdeCount;
  /* 0x1e40 */ struct _MI_SYSTEM_PTE_TYPE SystemPteInfo;
  /* 0x1e6c */ void* PoolTrackTableExpansion;
  /* 0x1e70 */ unsigned long PoolTrackTableExpansionSize;
  /* 0x1e74 */ void* PoolTrackBigPages;
  /* 0x1e78 */ unsigned long PoolTrackBigPagesSize;
  /* 0x1e7c */ struct _RTL_BITMAP SessionPoolPdes;
  /* 0x1e84 */ long __PADDING__[15];
} MM_SESSION_SPACE, *PMM_SESSION_SPACE; /* size: 0x1ec0 */

typedef struct _MM_SESSION_SPACE_FLAGS
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned long Initialized : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned long DeletePending : 1; /* bit position: 1 */
    /* 0x0000 */ unsigned long PoolInitialized : 1; /* bit position: 2 */
    /* 0x0000 */ unsigned long DynamicVaInitialized : 1; /* bit position: 3 */
    /* 0x0000 */ unsigned long WsInitialized : 1; /* bit position: 4 */
    /* 0x0000 */ unsigned long PoolDestroyed : 1; /* bit position: 5 */
    /* 0x0000 */ unsigned long ObjectInitialized : 1; /* bit position: 6 */
    /* 0x0000 */ unsigned long Filler : 25; /* bit position: 7 */
  }; /* bitfield */
} MM_SESSION_SPACE_FLAGS, *PMM_SESSION_SPACE_FLAGS; /* size: 0x0004 */

typedef struct _MM_SUBSECTION_AVL_TABLE
{
  /* 0x0000 */ struct _MMSUBSECTION_NODE BalancedRoot;
  struct /* bitfield */
  {
    /* 0x0018 */ unsigned long DepthOfTree : 5; /* bit position: 0 */
    /* 0x0018 */ unsigned long Unused : 3; /* bit position: 5 */
    /* 0x0018 */ unsigned long NumberGenericTableElements : 24; /* bit position: 8 */
  }; /* bitfield */
  /* 0x001c */ void* NodeHint;
} MM_SUBSECTION_AVL_TABLE, *PMM_SUBSECTION_AVL_TABLE; /* size: 0x0020 */

typedef enum _MODE
{
  KernelMode = 0,
  UserMode = 1,
  MaximumMode = 2,
} MODE, *PMODE;

typedef struct _MSUBSECTION
{
  /* 0x0000 */ struct _CONTROL_AREA* ControlArea;
  /* 0x0004 */ struct _MMPTE* SubsectionBase;
  union
  {
    /* 0x0008 */ struct _SUBSECTION* NextSubsection;
    /* 0x0008 */ struct _MSUBSECTION* NextMappedSubsection;
  }; /* size: 0x0004 */
  /* 0x000c */ unsigned long PtesInSubsection;
  union
  {
    /* 0x0010 */ unsigned long UnusedPtes;
    /* 0x0010 */ struct _MM_AVL_TABLE* GlobalPerSessionHead;
  }; /* size: 0x0004 */
  union
  {
    union
    {
      /* 0x0014 */ unsigned long LongFlags;
      /* 0x0014 */ struct _MMSUBSECTION_FLAGS SubsectionFlags;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ u;
  /* 0x0018 */ unsigned long StartingSector;
  /* 0x001c */ unsigned long NumberOfFullSectors;
  union
  {
    union
    {
      /* 0x0020 */ long Balance : 2; /* bit position: 0 */
      /* 0x0020 */ struct _MMSUBSECTION_NODE* Parent;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ u1;
  /* 0x0024 */ struct _MMSUBSECTION_NODE* LeftChild;
  /* 0x0028 */ struct _MMSUBSECTION_NODE* RightChild;
  /* 0x002c */ struct _LIST_ENTRY DereferenceList;
  /* 0x0034 */ unsigned long NumberOfMappedViews;
} MSUBSECTION, *PMSUBSECTION; /* size: 0x0038 */

typedef struct _NAMED_PIPE_CREATE_PARAMETERS
{
  /* 0x0000 */ unsigned long NamedPipeType;
  /* 0x0004 */ unsigned long ReadMode;
  /* 0x0008 */ unsigned long CompletionMode;
  /* 0x000c */ unsigned long MaximumInstances;
  /* 0x0010 */ unsigned long InboundQuota;
  /* 0x0014 */ unsigned long OutboundQuota;
  /* 0x0018 */ union _LARGE_INTEGER DefaultTimeout;
  /* 0x0020 */ unsigned char TimeoutSpecified;
  /* 0x0021 */ char __PADDING__[7];
} NAMED_PIPE_CREATE_PARAMETERS, *PNAMED_PIPE_CREATE_PARAMETERS; /* size: 0x0028 */

typedef struct _NETWORK_LOADER_BLOCK
{
  /* 0x0000 */ unsigned char* DHCPServerACK;
  /* 0x0004 */ unsigned long DHCPServerACKLength;
  /* 0x0008 */ unsigned char* BootServerReplyPacket;
  /* 0x000c */ unsigned long BootServerReplyPacketLength;
} NETWORK_LOADER_BLOCK, *PNETWORK_LOADER_BLOCK; /* size: 0x0010 */

typedef struct _NLS_DATA_BLOCK
{
  /* 0x0000 */ void* AnsiCodePageData;
  /* 0x0004 */ void* OemCodePageData;
  /* 0x0008 */ void* UnicodeCaseTableData;
} NLS_DATA_BLOCK, *PNLS_DATA_BLOCK; /* size: 0x000c */

typedef struct _NPAGED_LOOKASIDE_LIST
{
  /* 0x0000 */ struct _GENERAL_LOOKASIDE L;
  /* 0x0080 */ unsigned long Lock__ObsoleteButDoNotDelete;
  /* 0x0084 */ long __PADDING__[15];
} NPAGED_LOOKASIDE_LIST, *PNPAGED_LOOKASIDE_LIST; /* size: 0x00c0 */

typedef enum _NT_PRODUCT_TYPE
{
  NtProductWinNt = 1,
  NtProductLanManNt = 2,
  NtProductServer = 3,
} NT_PRODUCT_TYPE, *PNT_PRODUCT_TYPE;

typedef struct _NT_TIB
{
  /* 0x0000 */ struct _EXCEPTION_REGISTRATION_RECORD* ExceptionList;
  /* 0x0004 */ void* StackBase;
  /* 0x0008 */ void* StackLimit;
  /* 0x000c */ void* SubSystemTib;
  union
  {
    /* 0x0010 */ void* FiberData;
    /* 0x0010 */ unsigned long Version;
  }; /* size: 0x0004 */
  /* 0x0014 */ void* ArbitraryUserPointer;
  /* 0x0018 */ struct _NT_TIB* Self;
} NT_TIB, *PNT_TIB; /* size: 0x001c */

typedef struct _OBJECT_ATTRIBUTES
{
  /* 0x0000 */ unsigned long Length;
  /* 0x0004 */ void* RootDirectory;
  /* 0x0008 */ struct _UNICODE_STRING* ObjectName;
  /* 0x000c */ unsigned long Attributes;
  /* 0x0010 */ void* SecurityDescriptor;
  /* 0x0014 */ void* SecurityQualityOfService;
} OBJECT_ATTRIBUTES, *POBJECT_ATTRIBUTES; /* size: 0x0018 */

typedef struct _OBJECT_CREATE_INFORMATION
{
  /* 0x0000 */ unsigned long Attributes;
  /* 0x0004 */ void* RootDirectory;
  /* 0x0008 */ void* ParseContext;
  /* 0x000c */ char ProbeMode;
  /* 0x0010 */ unsigned long PagedPoolCharge;
  /* 0x0014 */ unsigned long NonPagedPoolCharge;
  /* 0x0018 */ unsigned long SecurityDescriptorCharge;
  /* 0x001c */ void* SecurityDescriptor;
  /* 0x0020 */ struct _SECURITY_QUALITY_OF_SERVICE* SecurityQos;
  /* 0x0024 */ struct _SECURITY_QUALITY_OF_SERVICE SecurityQualityOfService;
} OBJECT_CREATE_INFORMATION, *POBJECT_CREATE_INFORMATION; /* size: 0x0030 */

typedef struct _OBJECT_DIRECTORY
{
  /* 0x0000 */ struct _OBJECT_DIRECTORY_ENTRY* HashBuckets[37];
  /* 0x0094 */ struct _EX_PUSH_LOCK Lock;
  /* 0x0098 */ struct _DEVICE_MAP* DeviceMap;
  /* 0x009c */ unsigned long SessionId;
  /* 0x00a0 */ void* NamespaceEntry;
  /* 0x00a4 */ unsigned long Flags;
} OBJECT_DIRECTORY, *POBJECT_DIRECTORY; /* size: 0x00a8 */

typedef struct _OBJECT_DIRECTORY_ENTRY
{
  /* 0x0000 */ struct _OBJECT_DIRECTORY_ENTRY* ChainLink;
  /* 0x0004 */ void* Object;
  /* 0x0008 */ unsigned long HashValue;
} OBJECT_DIRECTORY_ENTRY, *POBJECT_DIRECTORY_ENTRY; /* size: 0x000c */

typedef struct _OBJECT_DUMP_CONTROL
{
  /* 0x0000 */ void* Stream;
  /* 0x0004 */ unsigned long Detail;
} OBJECT_DUMP_CONTROL, *POBJECT_DUMP_CONTROL; /* size: 0x0008 */

typedef struct _OBJECT_HANDLE_COUNT_DATABASE
{
  /* 0x0000 */ unsigned long CountEntries;
  /* 0x0004 */ struct _OBJECT_HANDLE_COUNT_ENTRY HandleCountEntries[1];
} OBJECT_HANDLE_COUNT_DATABASE, *POBJECT_HANDLE_COUNT_DATABASE; /* size: 0x000c */

typedef struct _OBJECT_HANDLE_COUNT_ENTRY
{
  /* 0x0000 */ struct _EPROCESS* Process;
  struct /* bitfield */
  {
    /* 0x0004 */ unsigned long HandleCount : 24; /* bit position: 0 */
    /* 0x0004 */ unsigned long LockCount : 8; /* bit position: 24 */
  }; /* bitfield */
} OBJECT_HANDLE_COUNT_ENTRY, *POBJECT_HANDLE_COUNT_ENTRY; /* size: 0x0008 */

typedef struct _OBJECT_HANDLE_INFORMATION
{
  /* 0x0000 */ unsigned long HandleAttributes;
  /* 0x0004 */ unsigned long GrantedAccess;
} OBJECT_HANDLE_INFORMATION, *POBJECT_HANDLE_INFORMATION; /* size: 0x0008 */

typedef struct _OBJECT_HEADER
{
  /* 0x0000 */ long PointerCount;
  union
  {
    /* 0x0004 */ long HandleCount;
    /* 0x0004 */ void* NextToFree;
  }; /* size: 0x0004 */
  /* 0x0008 */ struct _OBJECT_TYPE* Type;
  /* 0x000c */ unsigned char NameInfoOffset;
  /* 0x000d */ unsigned char HandleInfoOffset;
  /* 0x000e */ unsigned char QuotaInfoOffset;
  /* 0x000f */ unsigned char Flags;
  union
  {
    /* 0x0010 */ struct _OBJECT_CREATE_INFORMATION* ObjectCreateInfo;
    /* 0x0010 */ void* QuotaBlockCharged;
  }; /* size: 0x0004 */
  /* 0x0014 */ void* SecurityDescriptor;
  /* 0x0018 */ struct _QUAD Body;
} OBJECT_HEADER, *POBJECT_HEADER; /* size: 0x0020 */

typedef struct _OBJECT_HEADER_CREATOR_INFO
{
  /* 0x0000 */ struct _LIST_ENTRY TypeList;
  /* 0x0008 */ void* CreatorUniqueProcess;
  /* 0x000c */ unsigned short CreatorBackTraceIndex;
  /* 0x000e */ unsigned short Reserved;
} OBJECT_HEADER_CREATOR_INFO, *POBJECT_HEADER_CREATOR_INFO; /* size: 0x0010 */

typedef struct _OBJECT_HEADER_HANDLE_INFO
{
  union
  {
    /* 0x0000 */ struct _OBJECT_HANDLE_COUNT_DATABASE* HandleCountDataBase;
    /* 0x0000 */ struct _OBJECT_HANDLE_COUNT_ENTRY SingleEntry;
  }; /* size: 0x0008 */
} OBJECT_HEADER_HANDLE_INFO, *POBJECT_HEADER_HANDLE_INFO; /* size: 0x0008 */

typedef struct _OBJECT_HEADER_NAME_INFO
{
  /* 0x0000 */ struct _OBJECT_DIRECTORY* Directory;
  /* 0x0004 */ struct _UNICODE_STRING Name;
  /* 0x000c */ unsigned long QueryReferences;
} OBJECT_HEADER_NAME_INFO, *POBJECT_HEADER_NAME_INFO; /* size: 0x0010 */

typedef struct _OBJECT_HEADER_QUOTA_INFO
{
  /* 0x0000 */ unsigned long PagedPoolCharge;
  /* 0x0004 */ unsigned long NonPagedPoolCharge;
  /* 0x0008 */ unsigned long SecurityDescriptorCharge;
  /* 0x000c */ struct _EPROCESS* ExclusiveProcess;
} OBJECT_HEADER_QUOTA_INFO, *POBJECT_HEADER_QUOTA_INFO; /* size: 0x0010 */

typedef enum _OBJECT_INFORMATION_CLASS
{
  ObjectBasicInformation = 0,
  ObjectNameInformation = 1,
  ObjectTypeInformation = 2,
  ObjectTypesInformation = 3,
  ObjectHandleFlagInformation = 4,
  ObjectSessionInformation = 5,
  MaxObjectInfoClass = 6,
} OBJECT_INFORMATION_CLASS, *POBJECT_INFORMATION_CLASS;

typedef struct _OBJECT_NAME_INFORMATION
{
  /* 0x0000 */ struct _UNICODE_STRING Name;
} OBJECT_NAME_INFORMATION, *POBJECT_NAME_INFORMATION; /* size: 0x0008 */

typedef struct _OBJECT_REF_INFO
{
  /* 0x0000 */ struct _OBJECT_HEADER* ObjectHeader;
  /* 0x0004 */ void* NextRef;
  /* 0x0008 */ unsigned char ImageFileName[16];
  /* 0x0018 */ unsigned short NextPos;
  /* 0x001a */ unsigned short MaxStacks;
  /* 0x001c */ struct _OBJECT_REF_STACK_INFO* StackInfo /* zero-length array */;
} OBJECT_REF_INFO, *POBJECT_REF_INFO; /* size: 0x001c */

typedef struct _OBJECT_REF_STACK_INFO
{
  /* 0x0000 */ unsigned long Sequence;
  /* 0x0004 */ unsigned short Index;
  /* 0x0006 */ unsigned short NumTraces;
} OBJECT_REF_STACK_INFO, *POBJECT_REF_STACK_INFO; /* size: 0x0008 */

typedef struct _OBJECT_REF_TRACE
{
  /* 0x0000 */ void* StackTrace[16];
} OBJECT_REF_TRACE, *POBJECT_REF_TRACE; /* size: 0x0040 */

typedef struct _OBJECT_SYMBOLIC_LINK
{
  /* 0x0000 */ union _LARGE_INTEGER CreationTime;
  /* 0x0008 */ struct _UNICODE_STRING LinkTarget;
  /* 0x0010 */ struct _UNICODE_STRING LinkTargetRemaining;
  /* 0x0018 */ void* LinkTargetObject;
  /* 0x001c */ unsigned long DosDeviceDriveIndex;
} OBJECT_SYMBOLIC_LINK, *POBJECT_SYMBOLIC_LINK; /* size: 0x0020 */

typedef struct _OBJECT_TYPE
{
  /* 0x0000 */ struct _LIST_ENTRY TypeList;
  /* 0x0008 */ struct _UNICODE_STRING Name;
  /* 0x0010 */ void* DefaultObject;
  /* 0x0014 */ unsigned long Index;
  /* 0x0018 */ unsigned long TotalNumberOfObjects;
  /* 0x001c */ unsigned long TotalNumberOfHandles;
  /* 0x0020 */ unsigned long HighWaterNumberOfObjects;
  /* 0x0024 */ unsigned long HighWaterNumberOfHandles;
  /* 0x0028 */ struct _OBJECT_TYPE_INITIALIZER TypeInfo;
  /* 0x0078 */ struct _ERESOURCE Mutex;
  /* 0x00b0 */ struct _EX_PUSH_LOCK TypeLock;
  /* 0x00b4 */ unsigned long Key;
  /* 0x00b8 */ struct _EX_PUSH_LOCK ObjectLocks[32];
  /* 0x0138 */ struct _LIST_ENTRY CallbackList;
