enum _TAG_UNNAMED_1;
enum _TAG_UNNAMED_2;
enum _TAG_UNNAMED_3;
enum _TAG_UNNAMED_4;
enum _TAG_UNNAMED_5;
enum _TAG_UNNAMED_6;
enum _TAG_UNNAMED_7;
enum _TAG_UNNAMED_8;
enum _TAG_UNNAMED_9;
enum _TAG_UNNAMED_10;
enum ACTCTX_COMPATIBILITY_ELEMENT_TYPE;
enum ACTCTX_REQUESTED_RUN_LEVEL;
struct ACTIVATION_PROPERTIES;
enum ACTIVATION_PROPERTIES::eFlags;
enum ADDRESS_MODE;
enum ADDTOINDEX_DISPOSITION;
struct AENTRY;
struct ANON_OBJECT_HEADER;
struct ANON_OBJECT_HEADER_BIGOBJ;
struct ANON_OBJECT_HEADER_V2;
struct API_VERSION;
enum APPDOCLISTTYPE;
struct ARRAY_INFO;
enum ASSOCCLASS;
struct ASSOCIATIONELEMENT_;
enum ASSOCIATIONLEVEL;
enum ASSOCIATIONTYPE;
enum AWSTYPE;
struct A_SHA_CTX;
class ActivationProperties;
enum _TAG_UNNAMED_11;
class ActivationPropertiesIn;
class ActivationPropertiesOut;
class ActivationPropertiesOut::OutSerializer;
struct AllocateThrow;
class AllocationWrapper;
struct ApartmentEntry;
class AppRegistration;
struct AsyncIAdviseSink;
struct AsyncIAdviseSink2;
struct AsyncIAdviseSink2Vtbl;
struct AsyncIAdviseSinkVtbl;
struct AsyncIMultiQI;
struct AsyncIPipeByte;
struct AsyncIPipeDouble;
struct AsyncIPipeLong;
struct AsyncIRemUnknown;
struct AsyncIRemUnknown2;
struct AsyncIUnknown;
struct BATTERY_REPORTING_SCALE;
enum BCacheMode;
struct BITMAPV4HEADER;
struct BITMAPV5HEADER;
struct BSMINFO;
struct BSTR_INTERNAL;
class BUCL::CByteAllocator;
class BUCL::CDequeBase;
class BUCL::CDequeLinkage;
class BUCL::CMultiplier<unsigned __int64,BUCL::Rtl::CCallDisposition>;

struct tagWIN16RECT;
struct tagWINDOWINFO;
struct tagWINDOWPLACEMENT;
struct tagWINDOWPOS;
struct tagWNDCLASSA;
struct tagWNDCLASSEXA;
struct tagWNDCLASSEXW;
struct tagWNDCLASSW;
struct tagWNODE_ALL_DATA;
struct tagWNODE_EVENT_ITEM;
struct tagWNODE_EVENT_REFERENCE;
struct tagWNODE_METHOD_ITEM;
struct tagWNODE_SINGLE_INSTANCE;
struct tagWNODE_SINGLE_ITEM;
struct tagWNODE_TOO_SMALL;
struct tagWTSSESSION_NOTIFICATION;
struct tagXAptAddRefData;
struct tagXAptCallback;
struct tagXAptQIData;
struct tagXAptReleaseData;
struct tagXCtxDisconnectData;
struct tagXCtxMarshalData;
struct tagXCtxQIData;
struct tagXCtxWrapperData;
struct tagXFORM;
enum tagXFORMCOORDS;
enum tagXMLEMEM_TYPE;
struct threadlocaleinfostruct;
struct threadmbcinfostruct;
struct tm;
class type_info;
struct val_context;
struct value_entA;
struct value_entW;

typedef enum _TAG_UNNAMED_1
{
  QIC_STATICMARSHAL = 1,
  QIC_DISCONNECTED = 2,
  QIC_ASYNC = 4,
  QIC_WEAKCLIENT = 8,
  QIC_BEGINCALLED = 16,
} TAG_UNNAMED_1, *PTAG_UNNAMED_1;

typedef enum _TAG_UNNAMED_2
{
  AUMGR_ALLLOCAL = 1,
  AUMGR_IUNKNOWN = 2,
  AUMGR_IMULTIQI = 3,
} TAG_UNNAMED_2, *PTAG_UNNAMED_2;

typedef enum _TAG_UNNAMED_3
{
  sevInfo = 0,
  sevProblem = 1,
  sevAttn = 2,
  sevFatal = 3,
  sevMax = 4,
} TAG_UNNAMED_3, *PTAG_UNNAMED_3;

typedef enum _TAG_UNNAMED_4
{
  dliStartProcessing = 0,
  dliNotePreLoadLibrary = 1,
  dliNotePreGetProcAddress = 2,
  dliFailLoadLib = 3,
  dliFailGetProc = 4,
  dliNoteEndProcessing = 5,
} TAG_UNNAMED_4, *PTAG_UNNAMED_4;

typedef enum _TAG_UNNAMED_5
{
  hdBase = 0,
  hdSym = 1,
  hdSrc = 2,
  hdMax = 3,
} TAG_UNNAMED_5, *PTAG_UNNAMED_5;

typedef enum _TAG_UNNAMED_6
{
  sfImage = 0,
  sfDbg = 1,
  sfPdb = 2,
  sfMpd = 3,
  sfMax = 4,
} TAG_UNNAMED_6, *PTAG_UNNAMED_6;

typedef enum _TAG_UNNAMED_7
{
  RIFFLG_HASCOUNTERPART = 1,
  RIFFLG_HASCLSID = 2,
} TAG_UNNAMED_7, *PTAG_UNNAMED_7;

typedef enum _TAG_UNNAMED_8
{
  WPP_VER_WIN2K_CB_FORWARD_PTR = 1,
  WPP_VER_WHISTLER_CB_FORWARD_PTR = 2,
  WPP_VER_LH_CB_FORWARD_PTR = 3,
} TAG_UNNAMED_8, *PTAG_UNNAMED_8;

typedef enum _TAG_UNNAMED_9
{
  IMETHOD_FIRST = 3,
  IMETHOD_GetTypeInfoCount = 3,
  IMETHOD_GetTypeInfo = 4,
  IMETHOD_GetIDsOfNames = 5,
  IMETHOD_Invoke = 6,
  IMETHOD_DISPATCH_MAX = 7,
  IPARAM_Invoke_DispId = 0,
  IPARAM_Invoke_Iid = 1,
  IPARAM_Invoke_Lcid = 2,
  IPARAM_Invoke_WFlags = 3,
  IPARAM_Invoke_DispParams = 4,
  IPARAM_Invoke_PVarResult = 5,
  IPARAM_Invoke_PExcepInfo = 6,
  IPARAM_Invoke_PUArgErr = 7,
} TAG_UNNAMED_9, *PTAG_UNNAMED_9;

typedef enum _TAG_UNNAMED_10
{
  WPP_TRACE_OPTIONS = 43,
} TAG_UNNAMED_10, *PTAG_UNNAMED_10;

enum ACTCTX_COMPATIBILITY_ELEMENT_TYPE
{
  ACTCTX_COMPATIBILITY_ELEMENT_TYPE_UNKNOWN = 0,
  ACTCTX_COMPATIBILITY_ELEMENT_TYPE_OS = 1,
  ACTCTX_COMPATIBILITY_ELEMENT_TYPE_MITIGATION = 2,
};

enum ACTCTX_REQUESTED_RUN_LEVEL
{
  ACTCTX_RUN_LEVEL_UNSPECIFIED = 0,
  ACTCTX_RUN_LEVEL_AS_INVOKER = 1,
  ACTCTX_RUN_LEVEL_HIGHEST_AVAILABLE = 2,
  ACTCTX_RUN_LEVEL_REQUIRE_ADMIN = 3,
  ACTCTX_RUN_LEVEL_NUMBERS = 4,
};

struct ACTIVATION_PROPERTIES
{
  /* 0x0000 */ const struct _GUID& _rclsid;
  /* 0x0008 */ struct _GUID _partition;
  /* 0x0018 */ const struct _GUID& _riid;
  /* 0x0020 */ unsigned long _dwFlags;
  /* 0x0024 */ unsigned long _dwActvFlags;
  /* 0x0028 */ unsigned long _dwContext;
  /* 0x002c */ unsigned long _dwDllServerType;
  /* 0x0030 */ wchar_t* _pwszDllServer;
  /* 0x0038 */ struct IUnknown** _ppUnk;
  /* 0x0040 */ struct IComClassInfo* _pCI;
}; /* size: 0x0048 */

enum ACTIVATION_PROPERTIES::eFlags
{
  fFOR_SCM = 1,
  fSURROGATE = 4,
  fDO_NOT_LOAD = 8,
  fRELOAD_DARWIN = 16,
  fLSVR_ONLY = 32,
};

enum ADDRESS_MODE
{
  AddrMode1616 = 0,
  AddrMode1632 = 1,
  AddrModeReal = 2,
  AddrModeFlat = 3,
};

enum ADDTOINDEX_DISPOSITION
{
  ATID_IMPLICIT = 0,
  ATID_EXPLICIT = 1,
};

struct AENTRY
{
  /* 0x0000 */ unsigned long dwCollision;
  /* 0x0008 */ void* pAllocation;
}; /* size: 0x0010 */

struct ANON_OBJECT_HEADER
{
  /* 0x0000 */ unsigned short Sig1;
  /* 0x0002 */ unsigned short Sig2;
  /* 0x0004 */ unsigned short Version;
  /* 0x0006 */ unsigned short Machine;
  /* 0x0008 */ unsigned long TimeDateStamp;
  /* 0x000c */ struct _GUID ClassID;
  /* 0x001c */ unsigned long SizeOfData;
}; /* size: 0x0020 */

struct ANON_OBJECT_HEADER_BIGOBJ
{
  /* 0x0000 */ unsigned short Sig1;
  /* 0x0002 */ unsigned short Sig2;
  /* 0x0004 */ unsigned short Version;
  /* 0x0006 */ unsigned short Machine;
  /* 0x0008 */ unsigned long TimeDateStamp;
  /* 0x000c */ struct _GUID ClassID;
  /* 0x001c */ unsigned long SizeOfData;
  /* 0x0020 */ unsigned long Flags;
  /* 0x0024 */ unsigned long MetaDataSize;
  /* 0x0028 */ unsigned long MetaDataOffset;
  /* 0x002c */ unsigned long NumberOfSections;
  /* 0x0030 */ unsigned long PointerToSymbolTable;
  /* 0x0034 */ unsigned long NumberOfSymbols;
}; /* size: 0x0038 */

struct ANON_OBJECT_HEADER_V2
{
  /* 0x0000 */ unsigned short Sig1;
  /* 0x0002 */ unsigned short Sig2;
  /* 0x0004 */ unsigned short Version;
  /* 0x0006 */ unsigned short Machine;
  /* 0x0008 */ unsigned long TimeDateStamp;
  /* 0x000c */ struct _GUID ClassID;
  /* 0x001c */ unsigned long SizeOfData;
  /* 0x0020 */ unsigned long Flags;
  /* 0x0024 */ unsigned long MetaDataSize;
  /* 0x0028 */ unsigned long MetaDataOffset;
}; /* size: 0x002c */

struct API_VERSION
{
  /* 0x0000 */ unsigned short MajorVersion;
  /* 0x0002 */ unsigned short MinorVersion;
  /* 0x0004 */ unsigned short Revision;
  /* 0x0006 */ unsigned short Reserved;
}; /* size: 0x0008 */

enum APPDOCLISTTYPE
{
  ADLT_RECENT = 0,
  ADLT_FREQUENT = 1,
};

struct ARRAY_INFO
{
  /* 0x0000 */ long Dimension;
  /* 0x0008 */ unsigned long* BufferConformanceMark;
  /* 0x0010 */ unsigned long* BufferVarianceMark;
  /* 0x0018 */ unsigned long* MaxCountArray;
  /* 0x0020 */ unsigned long* OffsetArray;
  /* 0x0028 */ unsigned long* ActualCountArray;
}; /* size: 0x0030 */

enum ASSOCCLASS
{
  ASSOCCLASS_SHELL_KEY = 0,
  ASSOCCLASS_PROGID_KEY = 1,
  ASSOCCLASS_PROGID_STR = 2,
  ASSOCCLASS_CLSID_KEY = 3,
  ASSOCCLASS_CLSID_STR = 4,
  ASSOCCLASS_APP_KEY = 5,
  ASSOCCLASS_APP_STR = 6,
  ASSOCCLASS_SYSTEM_STR = 7,
  ASSOCCLASS_FOLDER = 8,
  ASSOCCLASS_STAR = 9,
};

struct ASSOCIATIONELEMENT_
{
  /* 0x0000 */ enum ASSOCCLASS ac;
  /* 0x0008 */ struct HKEY__* hkClass;
  /* 0x0010 */ const wchar_t* pszClass;
}; /* size: 0x0018 */

enum ASSOCIATIONLEVEL
{
  AL_MACHINE = 0,
  AL_EFFECTIVE = 1,
  AL_USER = 2,
};

enum ASSOCIATIONTYPE
{
  AT_FILEEXTENSION = 0,
  AT_URLPROTOCOL = 1,
  AT_STARTMENUCLIENT = 2,
  AT_MIMETYPE = 3,
};

enum AWSTYPE
{
  AWS_SCURVE = 0,
  AWS_LINEAR = 1,
};

struct A_SHA_CTX
{
  union
  {
    union
    {
      /* 0x0000 */ unsigned __int64 buffer64[8];
      /* 0x0000 */ unsigned char buffer[64];
    }; /* size: 0x0040 */
  } /* size: 0x0040 */ u;
  /* 0x0040 */ unsigned long state[5];
  /* 0x0054 */ unsigned long count[2];
  /* 0x005c */ long __PADDING__[1];
}; /* size: 0x0060 */

class ActivationProperties
{
  /* 0x0018 */ enum _TAG_UNNAMED_11 _marshalState;
  /* 0x001c */ struct _GUID _actCLSID;
  /* 0x002c */ int _unSerialized;
  /* 0x0030 */ int _unSerializedInproc;
  /* 0x0034 */ long _refCount;
  /* 0x0038 */ struct tagCustomHeader _serHeader;
  /* 0x0078 */ struct tagCustomHeader _unSerHeader;
  /* 0x00b8 */ unsigned long _marshalFlags;
  /* 0x00bc */ unsigned long _size;
  /* 0x00c0 */ int _toDelete;
  /* 0x00c4 */ int _fDestruct;
  /* 0x00c8 */ int _fInprocSerializationRequired;
  /* 0x00cc */ unsigned long _totalSize;
  /* 0x00d0 */ class SerializableProperty* serializableIfsCollection[10];
  /* 0x0120 */ unsigned long _ifsIndex;
  /* 0x0124 */ struct _GUID _clsidArray[10];
  /* 0x01c4 */ unsigned long _sizeArray[10];
  /* 0x01ec */ unsigned long _headerSize;
  /* 0x01f0 */ class Serializer* _pUnSer;
  /* 0x01f8 */ void* _blob;
}; /* size: 0x0200 */

typedef enum _TAG_UNNAMED_11
{
  NOT_MARSHALLED = 1,
  SIZED = 2,
  MARSHALLED = 3,
  UNMARSHALLED = 4,
} TAG_UNNAMED_11, *PTAG_UNNAMED_11;

class ActivationPropertiesIn
{
  /* 0x0218 */ enum tagACTIVATION_STAGE _stage;
  /* 0x021c */ unsigned long _cCustomAct;
  /* 0x0220 */ unsigned long _customIndex;
  /* 0x0224 */ unsigned long _dwInitialContext;
  /* 0x0228 */ int _delegated;
  /* 0x0230 */ void* _clientToken;
  /* 0x0238 */ int _fUseSystemIdentity;
  /* 0x023c */ int _fComplusOnly;
  /* 0x0240 */ struct IComClassInfo* _pClassInfo;
  /* 0x0248 */ struct ISystemActivator** _customActList;
  /* 0x0250 */ class InstantiationInfo* _pinst;
  /* 0x0258 */ class InstanceInfo* _pPersist;
  /* 0x0260 */ class ContextInfo* _pContextInfo;
  /* 0x0268 */ class ServerLocationInfo* _pServerLocationInfo;
  /* 0x0270 */ class SecurityInfo* _pSecurityInfo;
  /* 0x0278 */ class SpecialProperties* _pSpecialProperties;
  /* 0x0280 */ class ActivationPropertiesOut _actOut;
  /* 0x05d0 */ class SecurityInfo _securityInfo;
  /* 0x0630 */ class ServerLocationInfo _serverLocationInfo;
  /* 0x0678 */ class InstantiationInfo _instantiationInfo;
  /* 0x0770 */ class ContextInfo _contextInfo;
  /* 0x07e0 */ class InstanceInfo _instanceInfo;
  /* 0x0828 */ class ScmRequestInfo _scmRequestInfo;
  /* 0x0858 */ class SpecialProperties _specialProperties;
  /* 0x08d0 */ void* _pDip;
  /* 0x08d8 */ struct IClassFactory* _pCF;
}; /* size: 0x08e0 */

class ActivationPropertiesOut
{
  /* 0x0210 */ class ActivationPropertiesOut::OutSerializer* _pOutSer;
  /* 0x0218 */ class ActivationPropertiesOut::OutSerializer _outSer;
  /* 0x0318 */ class ScmReplyInfo _scmReplyInfo;
  /* 0x0348 */ struct tagCOMVERSION _clientCOMVersion;
  /* 0x034c */ int _fBrokenRefCount;
}; /* size: 0x0350 */

class ActivationPropertiesOut::OutSerializer
{
  /* 0x0018 */ struct tagPropsOutInfo _info;
  /* 0x0038 */ struct IUnknown* _pUnk;
  /* 0x0040 */ void** _ppvObj;
  /* 0x0048 */ unsigned long _size;
  /* 0x0050 */ struct tagCOMVERSION* _pClientCOMVersion;
  /* 0x0058 */ struct _GUID _pIIDs[10];
  /* 0x00f8 */ int _fBrokenRefCount;
  /* 0x00fc */ int _fToReleaseIFD;
}; /* size: 0x0100 */

struct AllocateThrow
{
}; /* size: 0x0001 */

class AllocationWrapper
{
}; /* size: 0x0001 */

struct ApartmentEntry
{
  /* 0x0000 */ struct SDWORDHashNode node;
  /* 0x0018 */ unsigned long hActivator;
  /* 0x001c */ long __PADDING__[1];
}; /* size: 0x0020 */

class AppRegistration
{
  /* 0x0000 */ struct _GUID appid;
  /* 0x0010 */ const wchar_t* appName;
  /* 0x0018 */ int dllSurrogate;
  /* 0x0020 */ struct HINSTANCE__* hModuleSurrogate;
}; /* size: 0x0028 */

struct AsyncIAdviseSink
{
  /* 0x0000 */ struct AsyncIAdviseSinkVtbl* lpVtbl;
}; /* size: 0x0008 */

struct AsyncIAdviseSink2
{
  /* 0x0000 */ struct AsyncIAdviseSink2Vtbl* lpVtbl;
}; /* size: 0x0008 */

struct AsyncIAdviseSink2Vtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* Begin_OnDataChange /* function */;
  /* 0x0020 */ void* Finish_OnDataChange /* function */;
  /* 0x0028 */ void* Begin_OnViewChange /* function */;
  /* 0x0030 */ void* Finish_OnViewChange /* function */;
  /* 0x0038 */ void* Begin_OnRename /* function */;
  /* 0x0040 */ void* Finish_OnRename /* function */;
  /* 0x0048 */ void* Begin_OnSave /* function */;
  /* 0x0050 */ void* Finish_OnSave /* function */;
  /* 0x0058 */ void* Begin_OnClose /* function */;
  /* 0x0060 */ void* Finish_OnClose /* function */;
  /* 0x0068 */ void* Begin_OnLinkSrcChange /* function */;
  /* 0x0070 */ void* Finish_OnLinkSrcChange /* function */;
}; /* size: 0x0078 */

struct AsyncIAdviseSinkVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* Begin_OnDataChange /* function */;
  /* 0x0020 */ void* Finish_OnDataChange /* function */;
  /* 0x0028 */ void* Begin_OnViewChange /* function */;
  /* 0x0030 */ void* Finish_OnViewChange /* function */;
  /* 0x0038 */ void* Begin_OnRename /* function */;
  /* 0x0040 */ void* Finish_OnRename /* function */;
  /* 0x0048 */ void* Begin_OnSave /* function */;
  /* 0x0050 */ void* Finish_OnSave /* function */;
  /* 0x0058 */ void* Begin_OnClose /* function */;
  /* 0x0060 */ void* Finish_OnClose /* function */;
}; /* size: 0x0068 */

struct AsyncIMultiQI
{
}; /* size: 0x0008 */

struct AsyncIPipeByte
{
}; /* size: 0x0008 */

struct AsyncIPipeDouble
{
}; /* size: 0x0008 */

struct AsyncIPipeLong
{
}; /* size: 0x0008 */

struct AsyncIRemUnknown
{
}; /* size: 0x0008 */

struct AsyncIRemUnknown2
{
}; /* size: 0x0008 */

struct AsyncIUnknown
{
}; /* size: 0x0008 */

struct BATTERY_REPORTING_SCALE
{
  /* 0x0000 */ unsigned long Granularity;
  /* 0x0004 */ unsigned long Capacity;
}; /* size: 0x0008 */

enum BCacheMode
{
  BCacheModeCached = 0,
  BCacheModeDirect = 1,
};

struct BITMAPV4HEADER
{
  /* 0x0000 */ unsigned long bV4Size;
  /* 0x0004 */ long bV4Width;
  /* 0x0008 */ long bV4Height;
  /* 0x000c */ unsigned short bV4Planes;
  /* 0x000e */ unsigned short bV4BitCount;
  /* 0x0010 */ unsigned long bV4V4Compression;
  /* 0x0014 */ unsigned long bV4SizeImage;
  /* 0x0018 */ long bV4XPelsPerMeter;
  /* 0x001c */ long bV4YPelsPerMeter;
  /* 0x0020 */ unsigned long bV4ClrUsed;
  /* 0x0024 */ unsigned long bV4ClrImportant;
  /* 0x0028 */ unsigned long bV4RedMask;
  /* 0x002c */ unsigned long bV4GreenMask;
  /* 0x0030 */ unsigned long bV4BlueMask;
  /* 0x0034 */ unsigned long bV4AlphaMask;
  /* 0x0038 */ unsigned long bV4CSType;
  /* 0x003c */ struct tagICEXYZTRIPLE bV4Endpoints;
  /* 0x0060 */ unsigned long bV4GammaRed;
  /* 0x0064 */ unsigned long bV4GammaGreen;
  /* 0x0068 */ unsigned long bV4GammaBlue;
}; /* size: 0x006c */

struct BITMAPV5HEADER
{
  /* 0x0000 */ unsigned long bV5Size;
  /* 0x0004 */ long bV5Width;
  /* 0x0008 */ long bV5Height;
  /* 0x000c */ unsigned short bV5Planes;
  /* 0x000e */ unsigned short bV5BitCount;
  /* 0x0010 */ unsigned long bV5Compression;
  /* 0x0014 */ unsigned long bV5SizeImage;
  /* 0x0018 */ long bV5XPelsPerMeter;
  /* 0x001c */ long bV5YPelsPerMeter;
  /* 0x0020 */ unsigned long bV5ClrUsed;
  /* 0x0024 */ unsigned long bV5ClrImportant;
  /* 0x0028 */ unsigned long bV5RedMask;
  /* 0x002c */ unsigned long bV5GreenMask;
  /* 0x0030 */ unsigned long bV5BlueMask;
  /* 0x0034 */ unsigned long bV5AlphaMask;
  /* 0x0038 */ unsigned long bV5CSType;
  /* 0x003c */ struct tagICEXYZTRIPLE bV5Endpoints;
  /* 0x0060 */ unsigned long bV5GammaRed;
  /* 0x0064 */ unsigned long bV5GammaGreen;
  /* 0x0068 */ unsigned long bV5GammaBlue;
  /* 0x006c */ unsigned long bV5Intent;
  /* 0x0070 */ unsigned long bV5ProfileData;
  /* 0x0074 */ unsigned long bV5ProfileSize;
  /* 0x0078 */ unsigned long bV5Reserved;
}; /* size: 0x007c */

struct BSMINFO
{
  /* 0x0000 */ unsigned int cbSize;
  /* 0x0008 */ struct HDESK__* hdesk;
  /* 0x0010 */ struct HWND__* hwnd;
  /* 0x0018 */ struct _LUID luid;
}; /* size: 0x0020 */

struct BSTR_INTERNAL
{
  /* 0x0000 */ unsigned long cbPayload;
  /* 0x0004 */ wchar_t* sz /* zero-length array */;
}; /* size: 0x0004 */

class BUCL::CByteAllocator
{
}; /* size: 0x0001 */

class BUCL::CDequeBase
{
  /* 0x0000 */ class BUCL::CDequeLinkage m_Head;
  /* 0x0018 */ unsigned __int64 m_EntryCount;
}; /* size: 0x0020 */

class BUCL::CDequeLinkage
{
  /* 0x0010 */ class BUCL::CDequeBase* m_pDeque;
}; /* size: 0x0018 */

class BUCL::CMultiplier<unsigned __int64,BUCL::Rtl::CCallDisposition>
{
}; /* size: 0x0001 */

struct BUCL::ComparisonResultKind<BUCL::Rtl::CCallDisposition>
{
  /* 0x0000 */ BOOL fSuccess;
  /* 0x0001 */ char iResult;
  /* 0x0004 */ class BUCL::Rtl::CCallDisposition StatusCode;
}; /* size: 0x0008 */

class BUCL::Rtl::CCallDisposition
{
  /* 0x0000 */ long m_NtStatus;
}; /* size: 0x0004 */

struct BULK_SECURITY_TEST_DATA
{
  /* 0x0000 */ unsigned long DesiredAccess;
  /* 0x0004 */ unsigned long SecurityIds[1];
}; /* size: 0x0008 */

class C2Security
{
  /* 0x0000 */ int m_bProtectionMode;
}; /* size: 0x0004 */

class CALLFRAME_CACHE<INTERFACE_HELPER_CLSID>
{
  /* 0x00b8 */ class XSLOCK m_xslAgeOutLock;
  /* 0x0138 */ volatile unsigned long m_dwLastAgeOutTime;
  /* 0x013c */ unsigned long m_dwNumPtrsInPage;
}; /* size: 0x0140 */

class CALLFRAME_CACHE<TYPEINFOVTBL>
{
  /* 0x00b8 */ class XSLOCK m_xslAgeOutLock;
  /* 0x0138 */ volatile unsigned long m_dwLastAgeOutTime;
  /* 0x013c */ unsigned long m_dwNumPtrsInPage;
}; /* size: 0x0140 */

class CALLFRAME_CACHE_ENTRY<INTERFACE_HELPER_CLSID>
{
  /* 0x0008 */ unsigned long m_dwReleaseTime;
  /* 0x0010 */ class CALLFRAME_CACHE<INTERFACE_HELPER_CLSID>* m_pcache;
  /* 0x0018 */ volatile long m_refs;
  /* 0x001c */ struct _GUID m_guidkey;
}; /* size: 0x0030 */

class CALLFRAME_CACHE_ENTRY<TYPEINFOVTBL>
{
  /* 0x0008 */ unsigned long m_dwReleaseTime;
  /* 0x0010 */ class CALLFRAME_CACHE<TYPEINFOVTBL>* m_pcache;
  /* 0x0018 */ volatile long m_refs;
  /* 0x001c */ struct _GUID m_guidkey;
}; /* size: 0x0030 */

enum CALLFRAME_FREE
{
  CALLFRAME_FREE_NONE = 0,
  CALLFRAME_FREE_IN = 1,
  CALLFRAME_FREE_INOUT = 2,
  CALLFRAME_FREE_OUT = 4,
  CALLFRAME_FREE_TOP_INOUT = 8,
  CALLFRAME_FREE_TOP_OUT = 16,
  CALLFRAME_FREE_ALL = 31,
};

enum CALLFRAME_NULL
{
  CALLFRAME_NULL_NONE = 0,
  CALLFRAME_NULL_INOUT = 2,
  CALLFRAME_NULL_OUT = 4,
  CALLFRAME_NULL_ALL = 6,
};

enum CALLFRAME_WALK
{
  CALLFRAME_WALK_IN = 1,
  CALLFRAME_WALK_INOUT = 2,
  CALLFRAME_WALK_OUT = 4,
};

enum CASE_REQUIREMENT
{
  CASE_REQUIREMENT_ANY = 0,
  CASE_REQUIREMENT_UPPER_IF_AQS = 1,
};

class CAddrControl
{
}; /* size: 0x0010 */

class CAddrExclusionList
{
  /* 0x0008 */ long _lRefs;
  /* 0x000c */ unsigned long _dwCursor;
  /* 0x0010 */ unsigned long _dwNumStrings;
  /* 0x0018 */ wchar_t** _ppszStrings;
}; /* size: 0x0020 */

class CAggId
{
  /* 0x0008 */ unsigned long _cRefs;
  /* 0x0010 */ struct IUnknown* _punkInner;
  /* 0x0018 */ struct IMarshal* _pmshInner;
  /* 0x0020 */ class CStdIdentity* _pStdId;
}; /* size: 0x0028 */

class CAntiMoniker
{
  /* 0x0028 */ unsigned long m_count;
}; /* size: 0x0030 */

class CApartmentActivator
{
}; /* size: 0x0008 */

class CApartmentHashTable
{
  union
  {
    struct
    {
      /* 0x0000 */ class CDWORDHashTable _hashtbl;
      /* 0x0028 */ int _fTableInitialized;
    }; /* size: 0x002c */
    /* 0x0000 */ class COleStaticMutexSem _mxsAptTblLock;
  }; /* size: 0x0050 */
}; /* size: 0x0030 */

class CAptCallCtrl
{
  /* 0x0000 */ struct IMessageFilter* _pMF;
  /* 0x0008 */ int _fInMsgFilter;
  /* 0x0010 */ class CCliModalLoop* _pTopCML;
  /* 0x0018 */ struct tagSWindowData _WD[2];
}; /* size: 0x0038 */

class CAptRpcChnl
{
  /* 0x0060 */ unsigned long _dwTIDCallee;
  /* 0x0064 */ unsigned long _dwAptId;
}; /* size: 0x0068 */

class CArray<CCacheNode>
{
  /* 0x0000 */ unsigned long m_refs;
  /* 0x0004 */ unsigned long m_ulFlags;
  /* 0x0008 */ unsigned long m_ulStepSize;
  /* 0x000c */ unsigned long m_ulCurSize;
  /* 0x0010 */ unsigned long m_ulLength;
  /* 0x0014 */ unsigned long m_ulResSlots;
  /* 0x0018 */ unsigned long m_ulHeadNode;
  /* 0x001c */ unsigned long m_ulTailNode;
  /* 0x0020 */ int m_iFree;
  /* 0x0028 */ int* m_piAllocList;
  /* 0x0030 */ struct CArray<CCacheNode>::ArrayNode* m_pBuffer;
}; /* size: 0x0038 */

struct CArray<CCacheNode>::ArrayNode
{
  /* 0x0000 */ class CCacheNode item;
  /* 0x0078 */ unsigned long next;
  /* 0x007c */ unsigned long prev;
}; /* size: 0x0080 */

class CArray<CFormatEtc>
{
  /* 0x0000 */ unsigned long m_refs;
  /* 0x0004 */ unsigned long m_ulFlags;
  /* 0x0008 */ unsigned long m_ulStepSize;
  /* 0x000c */ unsigned long m_ulCurSize;
  /* 0x0010 */ unsigned long m_ulLength;
  /* 0x0014 */ unsigned long m_ulResSlots;
  /* 0x0018 */ unsigned long m_ulHeadNode;
  /* 0x001c */ unsigned long m_ulTailNode;
  /* 0x0020 */ int m_iFree;
  /* 0x0028 */ int* m_piAllocList;
  /* 0x0030 */ struct CArray<CFormatEtc>::ArrayNode* m_pBuffer;
}; /* size: 0x0038 */

struct CArray<CFormatEtc>::ArrayNode
{
  /* 0x0000 */ class CFormatEtc item;
  /* 0x0028 */ unsigned long next;
  /* 0x002c */ unsigned long prev;
}; /* size: 0x0030 */

class CArray<CStatData>
{
  /* 0x0000 */ unsigned long m_refs;
  /* 0x0004 */ unsigned long m_ulFlags;
  /* 0x0008 */ unsigned long m_ulStepSize;
  /* 0x000c */ unsigned long m_ulCurSize;
  /* 0x0010 */ unsigned long m_ulLength;
  /* 0x0014 */ unsigned long m_ulResSlots;
  /* 0x0018 */ unsigned long m_ulHeadNode;
  /* 0x001c */ unsigned long m_ulTailNode;
  /* 0x0020 */ int m_iFree;
  /* 0x0028 */ int* m_piAllocList;
  /* 0x0030 */ struct CArray<CStatData>::ArrayNode* m_pBuffer;
}; /* size: 0x0038 */

struct CArray<CStatData>::ArrayNode
{
  /* 0x0000 */ class CStatData item;
  /* 0x0040 */ unsigned long next;
  /* 0x0044 */ unsigned long prev;
}; /* size: 0x0048 */

class CArrayFValue
{
  /* 0x0000 */ unsigned char* m_pData;
  /* 0x0008 */ unsigned int m_cbValue;
  /* 0x000c */ int m_nSize;
  /* 0x0010 */ int m_nMaxSize;
  /* 0x0014 */ int m_nGrowBy;
}; /* size: 0x0018 */

class CAsyncCall
{
  /* 0x0138 */ unsigned long _iRefCount;
  /* 0x013c */ unsigned long _lFlags;
  /* 0x0140 */ class CChannelObject* _pChnlObj;
  /* 0x0148 */ void* _pRequestBuffer;
  /* 0x0150 */ unsigned long _lApt;
  /* 0x0158 */ struct _RPC_ASYNC_STATE _AsyncState;
  /* 0x01c8 */ struct HWND__* _hwndSTA;
  /* 0x01d0 */ class CAsyncCall* _pNext;
  /* 0x01d8 */ enum ESignalState _eSignalState;
  union
  {
    /* 0x0000 */ class CAsyncCall* _aList[8];
    /* 0x0000 */ unsigned long _iNext;
  }; /* size: 0x0040 */
}; /* size: 0x01e0 */

class CAsyncConnection
{
  /* 0x0008 */ struct IConnectionPointContainer* _pCPC;
  /* 0x0010 */ struct IDocfileAsyncConnectionPoint* _pdacp;
  /* 0x0018 */ unsigned long _dwAsyncFlags;
  /* 0x001c */ long _cReferences;
}; /* size: 0x0020 */

class CAsyncConnectionContainer
{
  /* 0x0008 */ class CAsyncConnection _cpoint;
}; /* size: 0x0028 */

class CAsyncStateMachine
{
  /* 0x0008 */ unsigned long _dwState;
  /* 0x000c */ HRESULT _hr;
  /* 0x0010 */ enum _TAG_UNNAMED_12 eflags;
}; /* size: 0x0018 */

typedef enum _TAG_UNNAMED_12
{
  STATE_WAITINGFORBEGIN = 1,
  STATE_WAITINGFORFINISH = 2,
  STATE_BEGINABORTED = 3,
  STATE_EXECUTINGFINISH = 4,
  STATE_INITIALIZINGOBJECT = 5,
} TAG_UNNAMED_12, *PTAG_UNNAMED_12;

class CAsyncUnknownMgr
{
  /* 0x0028 */ class CAsyncUnknownMgr::CPrivUnknown _privUnk;
  /* 0x0030 */ unsigned long _dwFlags;
  /* 0x0038 */ class CClientCallMgr* _pNextMgr;
  /* 0x0040 */ unsigned long _cRefs;
  /* 0x0048 */ struct IUnknown* _pUnkOuter;
  /* 0x0050 */ class CStdIdentity* _pStdId;
  /* 0x0058 */ struct IUnknown* _pARUObj;
  /* 0x0060 */ struct AsyncIRemUnknown2* _pARU;
  /* 0x0068 */ struct tagMULTI_QI _MQI;
  /* 0x0080 */ unsigned long _ulRefs;
  /* 0x0088 */ struct tagQICONTEXT* _pQIC;
  /* 0x0090 */ unsigned long _cAcquired;
  /* 0x0094 */ unsigned long _cMQIs;
  /* 0x0098 */ struct _GUID* _pIIDs;
  /* 0x00a0 */ struct tagMULTI_QI** _ppMQI;
  /* 0x00a8 */ struct tagMULTI_QI* _pMQISave;
}; /* size: 0x00b0 */

class CAsyncUnknownMgr::CPrivUnknown
{
}; /* size: 0x0008 */

class CAtom
{
  /* 0x0000 */ unsigned short m_atom;
}; /* size: 0x0002 */

class CAuthInfo
{
  union
  {
    /* 0x0000 */ struct tagSOLE_AUTHENTICATION_LIST* _sList;
    /* 0x0000 */ int _fNeedSSL;
  }; /* size: 0x0008 */
}; /* size: 0x0001 */

class CBaseMoniker
{
  /* 0x0010 */ unsigned long m_refs;
  /* 0x0018 */ class CMarshalImplPStream m_marshal;
}; /* size: 0x0028 */

class CBaseStorageVariant
{
}; /* size: 0x0018 */

class CBasedBytePtr
{
  /* 0x0000 */ unsigned __int64 _p;
}; /* size: 0x0008 */

class CBasedContextPtr
{
  /* 0x0000 */ unsigned __int64 _p;
}; /* size: 0x0008 */

class CBasedDFBasisPtr
{
  /* 0x0000 */ unsigned __int64 _p;
}; /* size: 0x0008 */

class CBasedDeltaBlockPtr
{
  /* 0x0000 */ unsigned __int64 _p;
}; /* size: 0x0008 */

class CBasedDeltaBlockPtrPtr
{
  /* 0x0000 */ unsigned __int64 _p;
}; /* size: 0x0008 */

class CBasedDeltaListPtr
{
  /* 0x0000 */ unsigned __int64 _p;
}; /* size: 0x0008 */

class CBasedDirectStreamPtr
{
  /* 0x0000 */ unsigned __int64 _p;
}; /* size: 0x0008 */

class CBasedDlElementPtr
{
  /* 0x0000 */ unsigned __int64 _p;
}; /* size: 0x0008 */

class CBasedDocFilePtr
{
  /* 0x0000 */ unsigned __int64 _p;
}; /* size: 0x0008 */

class CBasedFatPtr
{
  /* 0x0000 */ unsigned __int64 _p;
}; /* size: 0x0008 */

class CBasedFreeBlockPtr
{
  /* 0x0000 */ unsigned __int64 _p;
}; /* size: 0x0008 */

class CBasedGlobalContextPtr
{
  /* 0x0000 */ unsigned __int64 _p;
}; /* size: 0x0008 */

class CBasedGlobalFileStreamPtr
{
  /* 0x0000 */ unsigned __int64 _p;
}; /* size: 0x0008 */

class CBasedILockBytesPtrPtr
{
  /* 0x0000 */ unsigned __int64 _p;
}; /* size: 0x0008 */

class CBasedMSFPagePtr
{
  /* 0x0000 */ unsigned __int64 _p;
}; /* size: 0x0008 */

class CBasedMSFPagePtrPtr
{
  /* 0x0000 */ unsigned __int64 _p;
}; /* size: 0x0008 */

class CBasedMSFPageTablePtr
{
  /* 0x0000 */ unsigned __int64 _p;
}; /* size: 0x0008 */

class CBasedMStreamPtr
{
  /* 0x0000 */ unsigned __int64 _p;
}; /* size: 0x0008 */

class CBasedMappedStreamPtr
{
  /* 0x0000 */ unsigned __int64 _p;
}; /* size: 0x0008 */

class CBasedMarshalListPtr
{
  /* 0x0000 */ unsigned __int64 _p;
}; /* size: 0x0008 */

class CBasedPagedVectorPtr
{
  /* 0x0000 */ unsigned __int64 _p;
}; /* size: 0x0008 */

class CBasedPerContextPtr
{
  /* 0x0000 */ unsigned __int64 _p;
}; /* size: 0x0008 */

class CBasedPubDocFilePtr
{
  /* 0x0000 */ unsigned __int64 _p;
}; /* size: 0x0008 */

class CBasedPubStreamPtr
{
  /* 0x0000 */ unsigned __int64 _p;
}; /* size: 0x0008 */

class CBasedRevertablePtr
{
  /* 0x0000 */ unsigned __int64 _p;
}; /* size: 0x0008 */

class CBasedSStreamPtr
{
  /* 0x0000 */ unsigned __int64 _p;
}; /* size: 0x0008 */

class CBasedSeekPointerPtr
{
  /* 0x0000 */ unsigned __int64 _p;
}; /* size: 0x0008 */

class CBasedTSetMemberPtr
{
  /* 0x0000 */ unsigned __int64 _p;
}; /* size: 0x0008 */

class CBasedTransactedStreamPtr
{
  /* 0x0000 */ unsigned __int64 _p;
}; /* size: 0x0008 */

class CBasedUpdatePtr
{
  /* 0x0000 */ unsigned __int64 _p;
}; /* size: 0x0008 */

class CBasedVectBitsPtr
{
  /* 0x0000 */ unsigned __int64 _p;
}; /* size: 0x0008 */

class CBindCtx
{
  /* 0x0008 */ unsigned long m_refs;
  /* 0x0010 */ struct tagBIND_OPTS3 m_bindopts;
  /* 0x0040 */ class CBindCtx::CObjList* m_pFirstObj;
  /* 0x0048 */ class CMapStringToPtr* m_pMap;
}; /* size: 0x0050 */

class CBindCtx::CObjList
{
  /* 0x0000 */ struct IUnknown* m_punk;
  /* 0x0008 */ class CBindCtx::CObjList* m_pNext;
}; /* size: 0x0010 */

class CBindStatusCallback
{
  /* 0x0010 */ long _cRef;
  /* 0x0014 */ HRESULT _hr;
  /* 0x0018 */ void* _hEvent;
}; /* size: 0x0020 */

class CBlockHeader
{
  /* 0x0010 */ unsigned __int64 _ulNext;
}; /* size: 0x0018 */

class CBlockPreHeader
{
  /* 0x0000 */ unsigned __int64 _ulSize;
  /* 0x0008 */ int _fFree;
}; /* size: 0x0010 */

class CBool
{
  /* 0x0000 */ int value;
}; /* size: 0x0004 */

class CCOMSurrogate
{
  union
  {
    /* 0x0000 */ struct ISurrogate* _pSurrogate;
    /* 0x0000 */ int _fNewStyleSurrogate;
  }; /* size: 0x0008 */
}; /* size: 0x0001 */

class CCache
{
  /* 0x0000 */ struct _RTL_SRWLOCK m_srwLock;
  /* 0x0008 */ struct tagElement** m_paBuckets;
  /* 0x0010 */ unsigned long m_cBuckets;
  /* 0x0014 */ unsigned long m_cElements;
  /* 0x0018 */ __int64 m_i64LocalCacheCount;
}; /* size: 0x0020 */

class CCacheNode
{
  /* 0x0000 */ struct _GUID m_clsid;
  /* 0x0010 */ struct tagFORMATETC m_foretc;
  /* 0x0030 */ unsigned long m_advf;
  /* 0x0034 */ long m_lWidth;
  /* 0x0038 */ long m_lHeight;
  /* 0x003c */ unsigned long m_dwFlags;
  /* 0x0040 */ struct IStorage* m_pStg;
  /* 0x0048 */ int m_iStreamNum;
  /* 0x004c */ unsigned long m_dwPresBitsPos;
  /* 0x0050 */ unsigned long m_dwSavedPresBitsPos;
  /* 0x0054 */ int m_fConvert;
  /* 0x0058 */ struct IOlePresObj* m_pPresObj;
  /* 0x0060 */ struct IOlePresObj* m_pPresObjAfterFreeze;
  /* 0x0068 */ struct IDataObject* m_pDataObject;
  /* 0x0070 */ unsigned long m_dwAdvConnId;
}; /* size: 0x0078 */

class CCallTable
{
  union
  {
    /* 0x0000 */ unsigned long m_cCalls;
    /* 0x0000 */ int m_fInitialized;
    /* 0x0000 */ class CPageAllocator m_Allocator;
  }; /* size: 0x0068 */
}; /* size: 0x0004 */

class CChannelHandle
{
  /* 0x0000 */ void* _hRpc;
  /* 0x0008 */ unsigned long _lAuthn;
  /* 0x000c */ unsigned long _lImp;
  /* 0x0010 */ void* _hToken;
  /* 0x0018 */ long _eState;
  /* 0x001c */ int _fFirstCall;
  /* 0x0020 */ unsigned long _cRef;
  /* 0x0028 */ struct _SCHANNEL_CRED _sCred;
  /* 0x0078 */ const struct _CERT_CONTEXT* _pCert;
}; /* size: 0x0080 */

class CChannelObject
{
  /* 0x0030 */ volatile unsigned long _dwState;
  /* 0x0034 */ unsigned long _cRefs;
  /* 0x0038 */ unsigned long _dwAptID;
  /* 0x0040 */ class CClientCallMgr* _pCallMgr;
  /* 0x0048 */ class CCtxComChnl* _pChnl;
  /* 0x0050 */ HRESULT _hr;
  /* 0x0058 */ class CAsyncCall* _pCall;
  /* 0x0060 */ struct ISynchronize* _pSync;
  /* 0x0068 */ struct SPendingCall _pendingCall;
  /* 0x0080 */ struct tagRPCOLEMESSAGE _msg;
}; /* size: 0x00d0 */

enum CChannelObject::eState
{
  STATE_ERROR = 1,
  STATE_READYFORNEGOTIATE = 2,
  STATE_READYFORGETBUFFER = 3,
  STATE_READYFORSEND = 4,
  STATE_SENDING = 5,
  STATE_READYFORSIGNAL = 6,
  STATE_RECEIVING = 7,
  STATE_READYFORRECEIVE = 8,
  STATE_READYFORFREEBUFFER = 9,
  STATE_AMBIGUOUS = 10,
};

class CChildInstanceList
{
  /* 0x0000 */ class CBasedRevertablePtr _prvHead;
}; /* size: 0x0008 */

class CClass
{
  /* 0x0000 */ struct _GUID m_clsid;
  /* 0x0010 */ wchar_t* m_szClsid;
}; /* size: 0x0018 */

class CClassCache
{
  union
  {
    /* 0x0000 */ unsigned long _dwFlags;
    /* 0x0000 */ class CRWLock _mxs;
    /* 0x0000 */ class CClassCache::CCEHashTable _ClassEntries;
    /* 0x0000 */ class CClassCache::CDPEHashTable _DllPathEntries;
    /* 0x0000 */ const unsigned long _cCEBuckets;
    /* 0x0000 */ const unsigned long _cDPEBuckets;
    /* 0x0000 */ struct SHashChain _CEBuckets[23];
    /* 0x0000 */ struct SHashChain _DPEBuckets[23];
    /* 0x0000 */ class CClassCache::CLSvrClassEntry* _MTALSvrsFront;
    /* 0x0000 */ class CClassCache::CLSvrClassEntry* _NTALSvrsFront;
    /* 0x0000 */ unsigned long _cRefsServerProcess;
    /* 0x0000 */ const unsigned long _CollectAtObjectCount;
    /* 0x0000 */ const unsigned long _CollectAtInterval;
    /* 0x0000 */ unsigned long _LastCollectionTickCount;
    /* 0x0000 */ unsigned long _LastObjectCount;
    /* 0x0000 */ class CClassCache::CCollectable* _ObjectsForCollection;
  }; /* size: 0x0170 */
}; /* size: 0x0001 */

class CClassCache::CBaseClassEntry
{
  /* 0x0008 */ class CClassCache::CBaseClassEntry* _pNext;
  /* 0x0010 */ class CClassCache::CBaseClassEntry* _pPrev;
  /* 0x0018 */ class CClassCache::CClassEntry* _pClassEntry;
  /* 0x0020 */ unsigned long _dwContext;
  /* 0x0024 */ unsigned long _dwSig;
}; /* size: 0x0028 */

class CClassCache::CCEHashTable
{
}; /* size: 0x0028 */

enum CClassCache::CCEHashTable::eFlags
{
  fTREAT_AS = 1,
  fINCOMPLETE = 2,
  fDO_NOT_HASH = 4,
  fCOMPLUS = 8,
  fSIDE_BY_SIDE = 16,
  fSIDE_BY_SIDE_WITH_NO_HASHING = 32,
};

class CClassCache::CClassEntry
{
  /* 0x0018 */ struct SMultiGUIDHashNode _hashNode;
  /* 0x0038 */ struct _GUID _guids[2];
  /* 0x0058 */ unsigned long _dwSig;
  /* 0x005c */ unsigned long _dwFlags;
  /* 0x0060 */ class CClassCache::CClassEntry* _pTreatAsList;
  /* 0x0068 */ class CClassCache::CBaseClassEntry* _pBCEListFront;
  /* 0x0070 */ class CClassCache::CBaseClassEntry* _pBCEListBack;
  /* 0x0078 */ unsigned long _cLocks;
  /* 0x007c */ unsigned long _dwFailedContexts;
  /* 0x0080 */ struct IComClassInfo* _pCI;
  union
  {
    /* 0x0000 */ const unsigned long TREAT_AS_SIG;
    /* 0x0000 */ const unsigned long CLASS_ENTRY_SIG;
    /* 0x0000 */ const unsigned long INCOMPLETE_ENTRY_SIG;
    /* 0x0000 */ unsigned long _dwSxSMaxHashCount;
    /* 0x0000 */ unsigned long _dwSxSHashCount;
    /* 0x0000 */ class CPageAllocator _palloc;
    /* 0x0000 */ const unsigned long _cNumPerPage;
  }; /* size: 0x0068 */
}; /* size: 0x0088 */

enum CClassCache::CClassEntry::eFlags
{
  fTREAT_AS = 1,
  fINCOMPLETE = 2,
  fDO_NOT_HASH = 4,
  fCOMPLUS = 8,
  fSIDE_BY_SIDE = 16,
  fSIDE_BY_SIDE_WITH_NO_HASHING = 32,
};

enum CClassCache::CClassEntry::eGUIDIndex
{
  iCLSID = 0,
  iPartition = 1,
  iTotal = 2,
};

class CClassCache::CCollectable
{
  union
  {
    struct
    {
      /* 0x0000 */ class CClassCache::CCollectable* NOT_COLLECTED;
      /* 0x0008 */ class CClassCache::CCollectable* _pNextCollectee;
      /* 0x0010 */ unsigned long _dwTickLastTouched;
    }; /* size: 0x0014 */
    /* 0x0000 */ unsigned long _dwCollectionGracePeriod;
    /* 0x0000 */ unsigned long _dwCollectionFrequency;
  }; /* size: 0x0014 */
}; /* size: 0x0018 */

class CClassCache::CDPEHashTable
{
}; /* size: 0x0028 */

class CClassCache::CDllAptEntry
{
  union
  {
    struct
    {
      /* 0x0000 */ class CClassCache::CDllAptEntry* _pNext;
      /* 0x0008 */ class CClassCache::CDllAptEntry* _pPrev;
      /* 0x0010 */ unsigned long _dwSig;
      /* 0x0014 */ unsigned long _hApt;
      /* 0x0018 */ struct HINSTANCE__* _hDll;
    }; /* size: 0x0020 */
    /* 0x0000 */ const unsigned long SIG;
    /* 0x0000 */ class CPageAllocator _palloc;
    /* 0x0000 */ const unsigned long _cNumPerPage;
  }; /* size: 0x0068 */
}; /* size: 0x0020 */

class CClassCache::CDllClassEntry
{
  /* 0x0028 */ unsigned long _dwDllThreadModel;
  /* 0x0030 */ class CClassCache::CDllPathEntry* _pDllPathEntry;
  /* 0x0038 */ class CClassCache::CDllClassEntry* _pDllClsNext;
  /* 0x0040 */ struct _GUID _impclsid;
  union
  {
    /* 0x0000 */ const unsigned long SIG;
    /* 0x0000 */ class CPageAllocator _palloc;
    /* 0x0000 */ const unsigned long _cNumPerPage;
  }; /* size: 0x0068 */
}; /* size: 0x0050 */

class CClassCache::CDllFnPtrMoniker
{
  /* 0x0008 */ unsigned long _cRefs;
  /* 0x0010 */ class CClassCache::CDllClassEntry* _pDCE;
}; /* size: 0x0018 */

class CClassCache::CDllPathEntry
{
  union
  {
    struct
    {
      /* 0x0000 */ class CClassCache::CDllPathEntry* _pNext;
      /* 0x0008 */ class CClassCache::CDllPathEntry* _pPrev;
      /* 0x0010 */ unsigned long _dwHash;
      /* 0x0018 */ wchar_t* _psPath;
      /* 0x0020 */ unsigned long _dwSig;
      /* 0x0028 */ void* _pfnGetClassObject /* function */;
      /* 0x0030 */ void* _pfnDllCanUnload /* function */;
      /* 0x0038 */ unsigned long _dwFlags;
      /* 0x003c */ int _fGCO_WAS_HERE;
      /* 0x0040 */ class CClassCache::CDllClassEntry* _p1stClass;
      /* 0x0048 */ unsigned long _cUsing;
      /* 0x0050 */ class CClassCache::CDllAptEntry* _pAptEntryFront;
      /* 0x0058 */ class CClassCache::CDllAptEntry* _pAptEntryBack;
      /* 0x0060 */ struct HINSTANCE__* _hDll32;
      /* 0x0068 */ unsigned long _dwExpireTime;
    }; /* size: 0x0060 */
    /* 0x0000 */ const unsigned long DLL_DELAY_UNLOAD_TIME;
    /* 0x0000 */ const char* DLL_GET_CLASS_OBJECT_EP /* zero-length array */;
    /* 0x0000 */ const char* DLL_CAN_UNLOAD_EP /* zero-length array */;
    /* 0x0000 */ const unsigned long SIG;
    /* 0x0000 */ class CPageAllocator _palloc;
    /* 0x0000 */ const unsigned long _cNumPerPage;
  }; /* size: 0x0068 */
}; /* size: 0x0070 */

class CClassCache::CDllPathEntry::CFinishObject
{
  /* 0x0008 */ struct HINSTANCE__* _hDll;
  /* 0x0010 */ unsigned long _dwFlags;
}; /* size: 0x0018 */

enum CClassCache::CDllPathEntry::eFlags
{
  fSIXTEEN_BIT = 1,
  fWX86 = 2,
  fIS_OLE32 = 4,
  fDELAYED_UNLOAD = 16,
};

class CClassCache::CFinishComposite
{
  /* 0x0000 */ struct CClassCache::CFinishComposite::node* _pFinishNodesFront;
  /* 0x0008 */ struct CClassCache::CFinishComposite::node* _pFinishNodesBack;
}; /* size: 0x0010 */

struct CClassCache::CFinishComposite::node
{
  /* 0x0000 */ struct CClassCache::CFinishComposite::node* _pNext;
  /* 0x0008 */ struct CClassCache::CFinishComposite::node* _pPrev;
  /* 0x0010 */ class IFinish* _pIF;
}; /* size: 0x0018 */

class CClassCache::CLSvrClassEntry
{
  /* 0x0028 */ class CClassCache::CLSvrClassEntry* _pNextLSvr;
  /* 0x0030 */ class CClassCache::CLSvrClassEntry* _pPrevLSvr;
  /* 0x0038 */ struct IUnknown* _pUnk;
  /* 0x0040 */ unsigned long _dwRegFlags;
  /* 0x0044 */ unsigned long _dwFlags;
  /* 0x0048 */ unsigned long _dwScmReg;
  /* 0x004c */ unsigned long _hApt;
  /* 0x0050 */ struct HWND__* _hWndDdeServer;
  /* 0x0058 */ class CObjServer* _pObjServer;
  /* 0x0060 */ unsigned long _dwCookie;
  /* 0x0064 */ unsigned long _cUsing;
  union
  {
    /* 0x0000 */ const unsigned long SIG;
    /* 0x0000 */ const unsigned long DUMMY_SIG;
    /* 0x0000 */ const unsigned long NO_SCM_REG;
    /* 0x0000 */ unsigned long _dwNextCookieCount;
    /* 0x0000 */ unsigned long _cOutstandingObjects;
    /* 0x0000 */ class CPageAllocator _palloc;
    /* 0x0000 */ const unsigned long _cNumPerPage;
  }; /* size: 0x0068 */
}; /* size: 0x0068 */

class CClassCache::CLSvrClassEntry::CFinishObject
{
  /* 0x0008 */ unsigned long _dwScmReg;
  /* 0x0010 */ struct HWND__* _hWndDdeServer;
  /* 0x0018 */ struct IUnknown* _pUnk;
  /* 0x0020 */ struct _GUID _clsid;
}; /* size: 0x0030 */

enum CClassCache::CLSvrClassEntry::eFlags
{
  fAT_STORAGE = 1,
  fREVOKE_PENDING = 2,
  fBEEN_USED = 16,
};

class CClassCache::CpUnkMoniker
{
  /* 0x0008 */ unsigned long _cRefs;
  /* 0x0010 */ struct IUnknown* _pUnk;
}; /* size: 0x0018 */

class CClassCache::IMiniMoniker
{
}; /* size: 0x0008 */

struct CClassCache::ReleaseCatalogObjects::__l2::STmpCI;

struct CClassCache::SDPEHashKey
{
  /* 0x0000 */ wchar_t* _pstr;
  /* 0x0008 */ unsigned long _dwDIPFlags;
  /* 0x000c */ long __PADDING__[1];
}; /* size: 0x0010 */

enum CClassCache::eFlags
{
  fINITIALIZED = 1,
  fSHUTTINGDOWN = 2,
};

class CClassMoniker
{
  /* 0x0018 */ long _cRefs;
  /* 0x001c */ struct ClassMonikerData _data;
  /* 0x0030 */ void* _pExtra;
  /* 0x0038 */ wchar_t* _pszCodeBase;
  /* 0x0040 */ unsigned long _dwFileVersionMS;
  /* 0x0044 */ unsigned long _dwFileVersionLS;
}; /* size: 0x0048 */

class CClassMonikerFactory
{
}; /* size: 0x0010 */

class CCliModalLoop
{
  /* 0x0000 */ HRESULT _hr;
  /* 0x0008 */ class CCliModalLoop* _pPrev;
  /* 0x0010 */ unsigned long _dwTIDCallee;
  /* 0x0014 */ unsigned long _dwMsgQInputFlag;
  /* 0x0018 */ struct _GUID _lid;
  /* 0x0028 */ unsigned long _dwFlags;
  /* 0x002c */ unsigned long _dwWaitFlags;
  /* 0x0030 */ unsigned int _wQuitCode;
  /* 0x0034 */ unsigned long _dwTimeOfCall;
  /* 0x0038 */ unsigned long _dwWakeup;
  /* 0x003c */ unsigned long _dwMillSecToWait;
  /* 0x0040 */ unsigned long _dwBlockTime;
  /* 0x0044 */ unsigned long _dwCancelTimeout;
  /* 0x0048 */ int _fUseOldModalLoop;
  /* 0x0050 */ class CAptCallCtrl* _pACC;
  /* 0x0058 */ void* _hToken;
  /* 0x0060 */ int _fCoWaitCalled;
}; /* size: 0x0068 */

class CCliRotHintTable
{
  /* 0x0008 */ void* _hSm;
}; /* size: 0x0010 */

class CClientCall
{
  /* 0x0138 */ unsigned long m_cRefs;
  /* 0x013c */ unsigned long m_dwFlags;
  /* 0x0140 */ void* m_hThread;
  /* 0x0148 */ unsigned long m_dwThreadId;
  union
  {
    /* 0x0000 */ void* _aList[8];
    /* 0x0000 */ unsigned long _iNext;
  }; /* size: 0x0040 */
}; /* size: 0x0150 */

class CClientCallMgr
{
  /* 0x0020 */ class CClientCallMgr::CPrivUnknown _privUnk;
  /* 0x0028 */ unsigned long _dwFlags;
  /* 0x002c */ unsigned long _cRefs;
  /* 0x0030 */ struct IUnknown* _pUnkOuter;
  /* 0x0038 */ class CClientCallMgr* _pNextMgr;
  /* 0x0040 */ struct _GUID _asyncIID;
  /* 0x0050 */ class CStdIdentity* _pStdId;
  /* 0x0058 */ struct IRpcProxyBuffer* _pProxyObj;
  /* 0x0060 */ class CChannelObject* _pChnlObj;
  /* 0x0068 */ struct IClientSecurity* _pICS;
  /* 0x0070 */ struct ICancelMethodCalls* _pICMC;
  /* 0x0078 */ class CStdEvent _cStdEvent;
}; /* size: 0x00b0 */

class CClientCallMgr::CPrivUnknown
{
}; /* size: 0x0008 */

class CClientContextActivator
{
}; /* size: 0x0008 */

class CClientSecurity
{
  /* 0x0008 */ class CStdIdentity* _pStdId;
}; /* size: 0x0010 */

class CClipDataObject
{
  /* 0x0010 */ void* m_hOle1;
  /* 0x0018 */ struct IUnknown* m_pUnkOle1;
  /* 0x0020 */ unsigned long m_refs;
  /* 0x0024 */ unsigned long m_Internalrefs;
  /* 0x0028 */ struct FORMATETCDATAARRAY* m_pFormatEtcDataArray;
  /* 0x0030 */ struct IDataObject* m_pDataObject;
  /* 0x0038 */ int m_fTriedToGetDataObject;
}; /* size: 0x0040 */

class CCoTaskAllocator
{
}; /* size: 0x0008 */

class CComActivator
{
  /* 0x0018 */ long _ulRef;
  /* 0x0020 */ class OpaqueDataInfo* _pOpaqueData;
  /* 0x0028 */ class SpecialProperties* _pProps;
  /* 0x0030 */ int _fActPropsInitNecessary;
}; /* size: 0x0038 */

class CComApartment
{
  /* 0x0008 */ unsigned long _cRefs;
  /* 0x000c */ unsigned long _dwState;
  /* 0x0010 */ enum tagAPTKIND _AptKind;
  /* 0x0014 */ unsigned long _AptId;
  /* 0x0018 */ class OXIDEntry* _pOXIDEntry;
  /* 0x0020 */ class CRemoteUnknown* _pRemUnk;
  /* 0x0028 */ long _cWaiters;
  /* 0x0030 */ void* _hEventOID;
  /* 0x0038 */ unsigned long _cPreRegOidsAvail;
  /* 0x0040 */ unsigned __int64 _arPreRegOids[20];
  /* 0x00e0 */ unsigned long _cOidsReturn;
  /* 0x00e8 */ unsigned __int64 _arOidsReturn[20];
  /* 0x0188 */ struct CComApartment::MessageListHead _arMessageParams[8];
  /* 0x0208 */ int _fInitializedCS;
  /* 0x0210 */ struct _RTL_CRITICAL_SECTION _csMessageParams;
}; /* size: 0x0238 */

struct CComApartment::MessageListHead
{
  /* 0x0000 */ class IMessageParam* pFirst;
  /* 0x0008 */ class IMessageParam* pLast;
}; /* size: 0x0010 */

class CComCat
{
  /* 0x0010 */ class CComCat::CInnerUnk* m_punkInner;
  /* 0x0018 */ struct IUnknown* m_punkOuter;
  /* 0x0020 */ struct ICatInformation* m_pcsICatInfo;
  /* 0x0028 */ struct _RTL_CRITICAL_SECTION m_csCatInfoInit;
  /* 0x0050 */ unsigned long m_dwRefCount;
  /* 0x0054 */ int m_fCsFlag;
  /* 0x0058 */ int m_bLockValid;
}; /* size: 0x0060 */

class CComCat::CInnerUnk
{
  /* 0x0008 */ class CComCat* m_pObj;
}; /* size: 0x0010 */

class CComCatalog
{
  /* 0x0030 */ long m_cRef;
  /* 0x0038 */ struct IComCatalogInternal* m_pCatalogRegNative;
  /* 0x0040 */ struct IComCatalogInternal* m_pCatalogCOMBaseInCLB;
  /* 0x0048 */ struct IComCatalogInternal* m_pCatalogRegNonNative;
  /* 0x0050 */ struct IComCatalogInternal* m_pCatalogCLB;
  /* 0x0058 */ struct IComCatalogInternal* m_pCatalogSxS;
  union
  {
    /* 0x0000 */ int ms_fComPlusEnabled;
    /* 0x0000 */ int ms_fComPlusEnabledInitialized;
    /* 0x0000 */ int ms_fComPlusCatalogsResolved;
    /* 0x0000 */ int ms_fInitialized;
  }; /* size: 0x0004 */
}; /* size: 0x0060 */

class CComClassInfo
{
  /* 0x0028 */ long m_cRef;
  /* 0x002c */ long m_cLocks;
  /* 0x0030 */ struct _GUID m_clsid;
  /* 0x0040 */ struct _GUID m_guidProcessId;
  /* 0x0050 */ enum tagLocalServerType m_serverType;
  /* 0x0058 */ struct IUnknown* m_pProcessInfo;
  /* 0x0060 */ wchar_t m_wszClsidString[45];
  /* 0x00c0 */ wchar_t* m_pwszProgid;
  /* 0x00c8 */ wchar_t* m_pwszClassName;
  /* 0x00d0 */ int m_clsctx;
  /* 0x00d4 */ int m_threadingmodel;
  /* 0x00d8 */ unsigned long m_regOwningCatalog;
  /* 0x00dc */ unsigned long m_regView;
  /* 0x00e0 */ wchar_t* m_pwszInprocServer32;
  /* 0x00e8 */ wchar_t* m_pwszInprocHandler32;
  /* 0x00f0 */ wchar_t* m_pwszLocalServer;
  /* 0x00f8 */ wchar_t* m_pwszInprocServer16;
  /* 0x0100 */ wchar_t* m_pwszInprocHandler16;
  /* 0x0108 */ wchar_t* m_pwszSurrogateCommand;
  /* 0x0110 */ wchar_t* m_pwszServerExecutable;
  /* 0x0118 */ unsigned long m_dwPreferredServerBitness;
  /* 0x011c */ unsigned long m_dwLocalServer32BinaryBitness;
  /* 0x0120 */ int m_bLUAEnabled;
  /* 0x0128 */ wchar_t* m_pwszDisplayName;
  /* 0x0130 */ wchar_t* m_pwszBinaryName;
  /* 0x0138 */ wchar_t* m_pwszIconReference;
  /* 0x0140 */ struct _KEY_FULL_INFORMATION* m_pKeyInformation;
  /* 0x0148 */ struct _KEY_NAME_INFORMATION* m_pKeyNameInformation;
}; /* size: 0x0150 */

class CComNoClassInfo
{
  /* 0x0018 */ long m_cRef;
  /* 0x001c */ struct _GUID m_clsid;
  /* 0x0030 */ wchar_t* m_wszProgID;
  /* 0x0038 */ unsigned long m_ValueFlags;
}; /* size: 0x0040 */

class CComProcessInfo
{
  /* 0x0018 */ long m_cRef;
  /* 0x001c */ struct _GUID m_guidProcessId;
  /* 0x0030 */ wchar_t* m_pwszProcessName;
  /* 0x0038 */ enum tagProcessType m_eProcessType;
  /* 0x0040 */ wchar_t* m_pwszServiceName;
  /* 0x0048 */ wchar_t* m_pwszServiceParameters;
  /* 0x0050 */ int m_fActivateAtStorage;
  /* 0x0058 */ wchar_t* m_pwszRunAsUser;
  /* 0x0060 */ enum tagRunAsType m_eRunAsType;
  /* 0x0068 */ wchar_t* m_pwszSurrogatePath;
  /* 0x0070 */ struct _SECURITY_DESCRIPTOR* m_pLaunchPermission;
  /* 0x0078 */ unsigned long m_cbLaunchPermission;
  /* 0x007c */ unsigned long m_dwAuthenticationLevel;
  /* 0x0080 */ unsigned long m_dwROTFlags;
  /* 0x0084 */ unsigned long m_dwAppIDFlags;
  /* 0x0088 */ wchar_t* m_pwszRemoteServerName;
  /* 0x0090 */ unsigned long m_dwFlags;
  /* 0x0094 */ unsigned long m_dwSaferTrustLevel;
  /* 0x0098 */ struct _KEY_FULL_INFORMATION* m_pKeyInformation;
  /* 0x00a0 */ struct _KEY_NAME_INFORMATION* m_pKeyNameInformation;
  union
  {
    /* 0x0000 */ int m_fGotLegacyLevels;
    /* 0x0000 */ unsigned long m_dwLegacyAuthenticationLevel;
    /* 0x0000 */ unsigned long m_dwLegacyImpersonationLevel;
  }; /* size: 0x0004 */
  /* 0x00a8 */ unsigned long m_dwPreferredServerBitness;
  /* 0x00b0 */ wchar_t* m_pwszSurrogateCommandDebug;
  /* 0x00b8 */ wchar_t* m_pwszServerExecutable;
  /* 0x00c0 */ int m_bLoadUserSettings;
  /* 0x00c4 */ int m_fDebugSurrogate;
}; /* size: 0x00c8 */

class CComRegCatalog
{
  /* 0x0008 */ unsigned long m_regView;
  /* 0x000c */ unsigned long m_regViewOther;
  /* 0x0010 */ long m_cRef;
  /* 0x0018 */ struct HKEY__* m_hkeyClassesRoot;
}; /* size: 0x0020 */

class CComSxSCatalog
{
  /* 0x0008 */ long m_cRef;
}; /* size: 0x0010 */

class CComSxSClassInfo
{
  /* 0x0018 */ long m_cRef;
  /* 0x001c */ long m_cLocks;
  /* 0x0020 */ long m_cLocksExternal;
  /* 0x0028 */ void* m_hActCtx;
  /* 0x0030 */ const struct _ACTIVATION_CONTEXT_DATA_COM_SERVER_REDIRECTION* m_pData;
  /* 0x0038 */ unsigned long m_ulDataLength;
  /* 0x0040 */ void* m_pSectionBase;
  /* 0x0048 */ unsigned long m_ulSectionLength;
  /* 0x004c */ wchar_t m_bufModulePath[260];
}; /* size: 0x0258 */

class CCompositeMoniker
{
  /* 0x0028 */ class CTrackingCompositeMoniker _tcm;
  /* 0x0038 */ struct IMoniker* m_pmkLeft;
  /* 0x0040 */ struct IMoniker* m_pmkRight;
  /* 0x0048 */ int m_fReduced;
  /* 0x004c */ int m_fReduceForced;
}; /* size: 0x0050 */

class CCompositeMonikerEnum
{
  /* 0x0008 */ unsigned long m_refs;
  /* 0x0010 */ class CCompositeMoniker* m_pCM;
  /* 0x0018 */ int m_fForward;
  /* 0x0020 */ struct CCompositeMonikerEnum::se* m_pBase;
  /* 0x0028 */ struct CCompositeMonikerEnum::se* m_pTop;
  /* 0x0030 */ struct IMoniker* m_pNext;
}; /* size: 0x0038 */

struct CCompositeMonikerEnum::se
{
  /* 0x0000 */ class CCompositeMoniker* m_pCM;
  /* 0x0008 */ struct CCompositeMonikerEnum::se* m_pseNext;
  /* 0x0010 */ struct CCompositeMonikerEnum::se* m_psePrev;
}; /* size: 0x0018 */

class CConnectionPoint
{
  /* 0x0008 */ unsigned long _dwCookie;
  /* 0x000c */ long _cReferences;
  /* 0x0010 */ class CSinkList* _pSinkHead;
  /* 0x0018 */ struct IDocfileAsyncConnectionPoint* _pParentCP;
  /* 0x0020 */ int _fCSInitialized;
  /* 0x0028 */ struct _RTL_CRITICAL_SECTION _csSinkList;
}; /* size: 0x0050 */

class CContext
{
  /* 0x0000 */ unsigned long ctxid;
  /* 0x0008 */ class CBasedContextPtr pctxNext;
}; /* size: 0x0010 */

class CContextLife
{
  /* 0x0000 */ unsigned long _dwAlive;
  /* 0x0004 */ long _cRefs;
}; /* size: 0x0008 */

class CContextList
{
  /* 0x0000 */ class CBasedContextPtr _pctxHead;
  /* 0x0008 */ long _cReferences;
}; /* size: 0x0010 */

class CContextPropList
{
  union
  {
    struct
    {
      /* 0x0000 */ int _Max;
      /* 0x0004 */ int _iFirst;
      /* 0x0008 */ int _iLast;
      /* 0x000c */ int _Count;
      /* 0x0010 */ int _cCompareProps;
      /* 0x0014 */ unsigned long _Hash;
      /* 0x0018 */ int _slotIdx;
      /* 0x0020 */ struct tagContextProperty* _pProps;
      /* 0x0028 */ int* _pSlots;
      /* 0x0030 */ struct tagContextProperty* _pCompareBuffer;
      /* 0x0038 */ struct _tagSCtxListIndex* _pIndex;
    }; /* size: 0x003c */
    /* 0x0000 */ class CPageAllocator s_NodeAllocator;
  }; /* size: 0x0068 */
}; /* size: 0x0040 */

class CContextSwitcher
{
  /* 0x0008 */ class CObjectContext* _context;
  /* 0x0010 */ long _cRefs;
}; /* size: 0x0018 */

class CContinue
{
  /* 0x0008 */ long _cRef;
  /* 0x0010 */ void* _pfnContinue /* function */;
  /* 0x0018 */ __int64 _dwContinue;
}; /* size: 0x0020 */

class CCtxCall
{
  /* 0x0008 */ unsigned long _dwFlags;
  /* 0x000c */ unsigned long _dwStage;
  /* 0x0010 */ unsigned long _cMarshalItfs;
  /* 0x0014 */ unsigned long _cUnmarshalItfs;
  /* 0x0018 */ unsigned long _cFree;
  /* 0x001c */ unsigned long _cError;
  /* 0x0020 */ int _fError;
  /* 0x0024 */ unsigned long _dwDestCtx;
  /* 0x0028 */ unsigned long _cItfs;
  /* 0x002c */ unsigned long _idx;
  /* 0x0030 */ void** _ppItfs;
  /* 0x0038 */ unsigned long _cPolicies;
  /* 0x003c */ unsigned long _cbExtent;
  /* 0x0040 */ void* _pvExtent;
  /* 0x0048 */ HRESULT _hr;
  /* 0x0050 */ class CPolicySet* _pPS;
  /* 0x0058 */ class CObjectContext* _pContext;
  /* 0x0060 */ unsigned long _dataRep;
  /* 0x0064 */ HRESULT _hrServer;
  union
  {
    /* 0x0000 */ void* s_pAllocList[20];
    /* 0x0000 */ int s_iAvailable;
    /* 0x0000 */ class COleStaticMutexSem _mxsCtxCallLock;
  }; /* size: 0x00a0 */
}; /* size: 0x0068 */

class CCtxChnl
{
  /* 0x0018 */ unsigned long _dwState;
  /* 0x001c */ unsigned long _cRefs;
  /* 0x0020 */ class IFaceEntry* _pIFaceEntry;
  /* 0x0028 */ class CStdWrapper* _pStdWrapper;
  /* 0x0000 */ class CPageAllocator s_allocator;
}; /* size: 0x0030 */

class CCtxComChnl
{
  union
  {
    /* 0x0000 */ class CPageAllocator s_allocator;
    /* 0x0000 */ class COleStaticMutexSem _mxsCtxChnlLock;
  }; /* size: 0x0068 */
  /* 0x0068 */ class CObjectContext* _disconnectCtx;
}; /* size: 0x0070 */

class CCtxConnectionManager
{
  /* 0x0000 */ class CpUnkList* _pUnkList;
  /* 0x0008 */ class CObjServer* _pobjServer;
  /* 0x0010 */ volatile int _cObjRefs;
  /* 0x0014 */ BOOL _disconnecting;
  /* 0x0018 */ void* _hdisconnectEvent;
  /* 0x0020 */ class CMutexSem2 _mutex;
  /* 0x0050 */ unsigned long _cRefs;
}; /* size: 0x0058 */

class CCtxHook
{
}; /* size: 0x0008 */

class CCtxPropHashTable
{
}; /* size: 0x0028 */

class CCtxTable
{
  union
  {
    /* 0x0000 */ class CCtxPropHashTable s_CtxPropHashTable;
    /* 0x0000 */ class CCtxUUIDHashTable s_CtxUUIDHashTable;
    /* 0x0000 */ struct SHashChain s_CtxPropBuckets[23];
    /* 0x0000 */ struct SHashChain s_CtxUUIDBuckets[23];
    /* 0x0000 */ int s_fInitialized;
  }; /* size: 0x0170 */
}; /* size: 0x0001 */

class CCtxUUIDHashTable
{
}; /* size: 0x0028 */

class CDAHolder
{
  /* 0x0020 */ unsigned long m_dwConnection;
  /* 0x0024 */ int m_iSize;
  /* 0x0028 */ struct tagSTATDATA* m_pSD;
}; /* size: 0x0030 */

class CDDEServer
{
  /* 0x0000 */ struct _GUID m_clsid;
  /* 0x0010 */ unsigned long m_dwClassFactoryKey;
  /* 0x0018 */ struct IClassFactory* m_pClassFactory;
  /* 0x0020 */ class CDdeServerCallMgr m_pCallMgr;
  /* 0x0048 */ int m_bTerminate;
  /* 0x0050 */ struct HWND__* m_hwnd;
  /* 0x0058 */ void* m_hcli;
  /* 0x0060 */ int m_termNo;
  /* 0x0064 */ int m_cSrvrClients;
  /* 0x0068 */ unsigned long m_fcfFlags;
  /* 0x006c */ enum CNVTYP m_cnvtyp;
  /* 0x0070 */ enum CHK m_chk;
  /* 0x0074 */ unsigned short m_aClass;
  /* 0x0076 */ unsigned short m_aOriginalClass;
  /* 0x0078 */ unsigned short m_aExe;
  /* 0x007c */ int m_fDoNotDestroyWindow;
}; /* size: 0x0080 */

enum CDFB_CLASSTYPE
{
  CDFB_DIRECTDOCFILE = 0,
  CDFB_DIRECTSTREAM = 1,
  CDFB_WRAPPEDDOCFILE = 2,
  CDFB_TRANSACTEDSTREAM = 3,
};

class CDFBasis
{
  union
  {
    struct
    {
      /* 0x0000 */ class CBasedMStreamPtr _pms;
      /* 0x0008 */ class CBasedMStreamPtr _pmsScratch;
      /* 0x0010 */ struct ILockBytes* _plkbBase;
      /* 0x0018 */ struct CFileStream* _pfstDirty;
      /* 0x0020 */ struct ILockBytes* _plkbOriginal;
      /* 0x0028 */ const unsigned long _dfOpen;
      /* 0x002c */ long _cReferences;
      /* 0x0030 */ class CBasedPubDocFilePtr _pdfCopyBase;
      /* 0x0038 */ class CBasedGlobalContextPtr _pgcGlobalContext;
      /* 0x0040 */ unsigned long _dwOrigLocks;
      /* 0x0048 */ class CFreeList _afrl[4];
    }; /* size: 0x0064 */
    /* 0x0000 */ unsigned __int64 _aReserveSize[4];
  }; /* size: 0x0064 */
  /* 0x0068 */ int _fDirectWriterMode;
  /* 0x006c */ int _fWriteLocked;
  /* 0x0070 */ struct IMalloc* const _pMalloc;
}; /* size: 0x0078 */

class CDIFat
{
  /* 0x0000 */ class CFatVector _fv;
  /* 0x0038 */ class CBasedMStreamPtr _pmsParent;
  /* 0x0040 */ unsigned long _cfsTable;
  /* 0x0044 */ int _fDoingFixup;
  /* 0x0048 */ unsigned long _cUnmarked;
  /* 0x004c */ unsigned long _sectUnmarked[8];
  /* 0x006c */ unsigned long _sectMarkTo[8];
  /* 0x008c */ unsigned long _sectFree[8];
}; /* size: 0x00b0 */

class CDWORDHashTable
{
}; /* size: 0x0028 */

class CData
{
  /* 0x0000 */ unsigned long m_cbSize;
  /* 0x0008 */ void* m_pv;
  /* 0x0010 */ void* m_h;
  /* 0x0018 */ int m_fNoFree;
}; /* size: 0x0020 */

class CDataAdviseCache
{
  /* 0x0000 */ struct IDataAdviseHolder* m_pDAH;
  /* 0x0008 */ class CMapDwordDword m_mapClientToDelegate;
}; /* size: 0x0050 */

class CDbgGuidStr
{
}; /* size: 0x0001 */

class CDdeConnectionTable
{
  /* 0x0000 */ void* m_h;
  /* 0x0008 */ unsigned long m_cinfo;
}; /* size: 0x0010 */

class CDdeObject
{
  /* 0x0000 */ int m_fDoingSendOnDataChange;
  /* 0x0004 */ unsigned long m_cRefCount;
  /* 0x0008 */ struct CDdeObject::CUnknownImpl m_Unknown;
  /* 0x0018 */ struct CDdeObject::COleObjectImpl m_Ole;
  /* 0x0028 */ struct CDdeObject::CDataObjectImpl m_Data;
  /* 0x0038 */ struct CDdeObject::CPersistStgImpl m_PersistStg;
  /* 0x0048 */ struct CDdeObject::CProxyManagerImpl m_ProxyMgr;
  /* 0x0058 */ struct CDdeObject::COleItemContainerImpl m_OleItemContainer;
  /* 0x0068 */ struct CDdeObject::CRpcStubBufferImpl m_RpcStubBuffer;
  /* 0x0078 */ unsigned long m_refs;
  /* 0x007c */ unsigned long m_ulObjType;
  /* 0x0080 */ struct _GUID m_clsid;
  /* 0x0090 */ unsigned short m_aClass;
  /* 0x0092 */ unsigned short m_aExeName;
  /* 0x0094 */ unsigned short m_aTopic;
  /* 0x0096 */ unsigned short m_aItem;
  /* 0x0098 */ int m_bRunning;
  /* 0x00a0 */ struct IUnknown* m_pUnkOuter;
  /* 0x00a8 */ struct IOleClientSite* m_pOleClientSite;
  /* 0x00b0 */ struct IStorage* m_pstg;
  /* 0x00b8 */ int m_bInitNew;
  /* 0x00bc */ int m_bOldSvr;
  /* 0x00c0 */ void* m_hNative;
  /* 0x00c8 */ void* m_hPict;
  /* 0x00d0 */ void* m_hExtra;
  /* 0x00d8 */ unsigned short m_cfPict;
  /* 0x00da */ unsigned short m_cfExtra;
  /* 0x00dc */ int m_fDidSendOnClose;
  /* 0x00e0 */ int m_fNoStdCloseDoc;
  /* 0x00e4 */ int m_fDidStdCloseDoc;
  /* 0x00e8 */ int m_fDidStdOpenDoc;
  /* 0x00ec */ int m_fDidGetObject;
  /* 0x00f0 */ int m_fDidLaunchApp;
  /* 0x00f4 */ int m_fUpdateOnSave;
  /* 0x00f8 */ int m_fGotCloseData;
  /* 0x00fc */ unsigned long m_cLocks;
  /* 0x0100 */ int m_fVisible;
  /* 0x0104 */ int m_fWasEverVisible;
  /* 0x0108 */ int m_fCalledOnShow;
  /* 0x010c */ unsigned long m_chk;
  /* 0x0110 */ struct tagDVTARGETDEVICE* m_ptd;
  /* 0x0118 */ int m_iAdvClose;
  /* 0x011c */ int m_iAdvSave;
  /* 0x0120 */ int m_iAdvChange;
  /* 0x0124 */ int m_fDidAdvNative;
  /* 0x0128 */ unsigned short m_wTerminate;
  /* 0x0130 */ struct IDataAdviseHolder* m_pDataAdvHolder;
  /* 0x0138 */ struct IOleAdviseHolder* m_pOleAdvHolder;
  /* 0x0140 */ class CDdeConnectionTable m_ConnectionTable;
  /* 0x0150 */ class DDE_CHANNEL* m_pSysChannel;
  /* 0x0158 */ class DDE_CHANNEL* m_pDocChannel;
}; /* size: 0x0160 */

struct CDdeObject::CDataObjectImpl
{
  /* 0x0008 */ class CDdeObject* m_pDdeObject;
}; /* size: 0x0010 */

struct CDdeObject::COleItemContainerImpl
{
  /* 0x0008 */ class CDdeObject* m_pDdeObject;
}; /* size: 0x0010 */

struct CDdeObject::COleObjectImpl
{
  /* 0x0008 */ class CDdeObject* m_pDdeObject;
}; /* size: 0x0010 */

struct CDdeObject::CPersistStgImpl
{
  /* 0x0008 */ class CDdeObject* m_pDdeObject;
}; /* size: 0x0010 */

struct CDdeObject::CProxyManagerImpl
{
  /* 0x0008 */ class CDdeObject* m_pDdeObject;
}; /* size: 0x0010 */

struct CDdeObject::CRpcStubBufferImpl
{
  /* 0x0008 */ class CDdeObject* m_pDdeObject;
}; /* size: 0x0010 */

struct CDdeObject::CUnknownImpl
{
  /* 0x0008 */ class CDdeObject* m_pDdeObject;
}; /* size: 0x0010 */

class CDdeServerCallMgr
{
  /* 0x0018 */ class CDefClient* m_pDefClient;
  /* 0x0020 */ class CDDEServer* m_pDDEServer;
}; /* size: 0x0028 */

class CDebugChannelHook
{
}; /* size: 0x0008 */

class CDebugEventFire
{
  /* 0x0008 */ unsigned long _cRef;
  /* 0x0010 */ struct _RTL_CRITICAL_SECTION _csEventFire;
  /* 0x0038 */ int _fLogDisabled;
  /* 0x003c */ struct _GUID _guidSession;
  /* 0x0050 */ wchar_t* _strSessionName;
  /* 0x0058 */ struct ISystemDebugEventFire* _pEventFire;
  /* 0x0060 */ struct IUnknown* _punkFTM;
}; /* size: 0x0068 */

class CDebugEventFireCF
{
}; /* size: 0x0008 */

class CDefClassFactory
{
  /* 0x0010 */ struct _GUID m_clsid;
}; /* size: 0x0020 */

class CDefClient
{
  /* 0x0000 */ enum CHK m_chk;
  /* 0x0008 */ class CDdeServerCallMgr m_pCallMgr;
  /* 0x0030 */ enum tagSERVERCALLEX m_CallState;
  /* 0x0038 */ struct IUnknown* m_pUnkOuter;
  /* 0x0040 */ struct IOleObject* m_lpoleObj;
  /* 0x0048 */ struct IDataObject* m_lpdataObj;
  /* 0x0050 */ int m_bCreateInst;
  /* 0x0054 */ int m_bTerminate;
  /* 0x0058 */ int m_termNo;
  /* 0x005c */ unsigned short m_aItem;
  /* 0x0060 */ void* m_hcli;
  /* 0x0068 */ class CDefClient* m_lpNextItem;
  /* 0x0070 */ int m_bContainer;
  /* 0x0074 */ int m_cRef;
  /* 0x0078 */ struct HWND__* m_hwnd;
  /* 0x0080 */ void* m_hdevInfo;
  /* 0x0088 */ void* m_hcliInfo;
  /* 0x0090 */ int m_fDidRealSetHostNames;
  /* 0x0094 */ int m_fDidSetClientSite;
  /* 0x0098 */ int m_fGotDdeAdvise;
  /* 0x009c */ int m_fCreatedNotConnected;
  /* 0x00a0 */ int m_fInOnClose;
  /* 0x00a4 */ int m_fInOleSave;
  /* 0x00a8 */ struct EXECUTEACK m_ExecuteAck;
  /* 0x00c8 */ unsigned long m_dwConnectionOleObj;
  /* 0x00cc */ unsigned long m_dwConnectionDataObj;
  /* 0x00d0 */ struct ILockBytes* m_plkbytNative;
  /* 0x00d8 */ struct IStorage* m_pstgNative;
  /* 0x00e0 */ int m_fRunningInSDI;
  /* 0x00e8 */ class CDDEServer* m_psrvrParent;
  /* 0x00f0 */ struct tagDVTARGETDEVICE* m_ptd;
  /* 0x00f8 */ int m_fGotStdCloseDoc;
  /* 0x00fc */ int m_fGotEditNoPokeNativeYet;
  /* 0x0100 */ int m_fLocked;
  /* 0x0104 */ int m_fCallData;
  /* 0x0108 */ int m_fEmbed;
  /* 0x010c */ int m_cClients;
  /* 0x0110 */ class CDefClient* m_pdoc;
  /* 0x0118 */ struct CDefClient::CUnknownImpl m_Unknown;
  /* 0x0128 */ struct CDefClient::COleClientSiteImpl m_OleClientSite;
  /* 0x0138 */ struct CDefClient::CAdviseSinkImpl m_AdviseSink;
}; /* size: 0x0148 */

struct CDefClient::CAdviseSinkImpl
{
  /* 0x0008 */ class CDefClient* m_pDefClient;
}; /* size: 0x0010 */

struct CDefClient::COleClientSiteImpl
{
  /* 0x0008 */ class CDefClient* m_pDefClient;
}; /* size: 0x0010 */

struct CDefClient::CUnknownImpl
{
  /* 0x0008 */ class CDefClient* m_pDefClient;
}; /* size: 0x0010 */

class CDefLink
{
  /* 0x0050 */ class CDefLink::CPrivUnknown m_Unknown;
  /* 0x0058 */ class CDefLink::CAdvSinkImpl m_AdviseSink;
  /* 0x0060 */ unsigned long m_flags;
  /* 0x0064 */ unsigned long m_dwObjFlags;
  /* 0x0068 */ struct IDataObject* m_pDataDelegate;
  /* 0x0070 */ struct IOleObject* m_pOleDelegate;
  /* 0x0078 */ struct IRunnableObject* m_pRODelegate;
  /* 0x0080 */ struct IOleItemContainer* m_pOleItemContainerDelegate;
  /* 0x0088 */ HRESULT m_ContentSRVMSHResult;
  /* 0x008c */ unsigned long m_ContentSRVMSBits;
  /* 0x0090 */ HRESULT m_ContentREGMSHResult;
  /* 0x0094 */ unsigned long m_ContentREGMSBits;
  /* 0x0098 */ unsigned long m_cRefsOnLink;
  /* 0x00a0 */ struct IUnknown* m_pUnkOuter;
  /* 0x00a8 */ struct IMoniker* m_pMonikerAbs;
  /* 0x00b0 */ struct IMoniker* m_pMonikerRel;
  /* 0x00b8 */ struct IUnknown* m_pUnkDelegate;
  /* 0x00c0 */ unsigned long m_dwUpdateOpt;
  /* 0x00c4 */ struct _GUID m_clsid;
  /* 0x00d8 */ struct IStorage* m_pStg;
  /* 0x00e0 */ class COleCache* m_pCOleCache;
  /* 0x00e8 */ class COAHolder* m_pCOAHolder;
  /* 0x00f0 */ unsigned long m_dwConnOle;
  /* 0x00f8 */ class CDataAdviseCache* m_pDataAdvCache;
  /* 0x0100 */ struct IOleClientSite* m_pAppClientSite;
  /* 0x0108 */ unsigned long m_dwConnTime;
  /* 0x010c */ struct _FILETIME m_ltChangeOfUpdate;
  /* 0x0114 */ struct _FILETIME m_ltKnownUpToDate;
  /* 0x011c */ struct _FILETIME m_rtUpdate;
}; /* size: 0x0128 */

typedef enum _TAG_UNNAMED_13
{
  None = 0,
  Relative = 1,
  Ids = 2,
  Absolute = 3,
} TAG_UNNAMED_13, *PTAG_UNNAMED_13;

class CDefLink::CAdvSinkImpl
{
}; /* size: 0x0008 */

class CDefLink::CPrivUnknown
{
}; /* size: 0x0008 */

class CDefObject
{
  /* 0x0050 */ class CDefObject::CPrivUnknown m_Unknown;
  /* 0x0058 */ class CDefObject::CAdvSinkImpl m_AdviseSink;
  /* 0x0060 */ HRESULT m_ContentSRVMSHResult;
  /* 0x0064 */ unsigned long m_ContentSRVMSBits;
  /* 0x0068 */ HRESULT m_ContentREGMSHResult;
  /* 0x006c */ unsigned long m_ContentREGMSBits;
  /* 0x0070 */ struct IOleObject* m_pOleDelegate;
  /* 0x0078 */ struct IDataObject* m_pDataDelegate;
  /* 0x0080 */ struct IPersistStorage* m_pPSDelegate;
  /* 0x0088 */ unsigned long m_cConnections;
  /* 0x0090 */ struct IUnknown* m_pUnkOuter;
  /* 0x0098 */ struct _GUID m_clsidServer;
  /* 0x00a8 */ struct _GUID m_clsidBits;
  /* 0x00b8 */ unsigned long m_flags;
  /* 0x00bc */ unsigned long m_dwObjFlags;
  /* 0x00c0 */ struct IClassFactory* m_pCFDelegate;
  /* 0x00c8 */ struct IUnknown* m_pUnkDelegate;
  /* 0x00d0 */ struct IProxyManager* m_pProxyMgr;
  /* 0x00d8 */ class COleCache* m_pCOleCache;
  /* 0x00e0 */ class COAHolder* m_pOAHolder;
  /* 0x00e8 */ unsigned long m_dwConnOle;
  /* 0x00f0 */ struct IOleClientSite* m_pAppClientSite;
  /* 0x00f8 */ struct IStorage* m_pStg;
  /* 0x0100 */ char* m_pHostNames;
  /* 0x0108 */ unsigned long m_ibCntrObj;
  /* 0x0110 */ class CDataAdviseCache* m_pDataAdvCache;
}; /* size: 0x0118 */

class CDefObject::CAdvSinkImpl
{
}; /* size: 0x0008 */

class CDefObject::CPrivUnknown
{
}; /* size: 0x0008 */

class CDelayUnlockContainer
{
  /* 0x0008 */ unsigned long m_refs;
  /* 0x0010 */ struct IOleItemContainer* m_pOleCont;
}; /* size: 0x0018 */

class CDeltaList
{
  /* 0x0000 */ class CBasedDeltaBlockPtrPtr _apdb;
  /* 0x0008 */ unsigned long _ulSize;
  /* 0x0010 */ class CBasedMStreamPtr _pmsScratch;
  /* 0x0018 */ class CBasedMStreamPtr _pms;
  /* 0x0020 */ class CBasedTransactedStreamPtr _ptsParent;
  /* 0x0028 */ unsigned long _sectStart;
}; /* size: 0x0030 */

class CDestObject
{
  /* 0x0008 */ struct tagCOMVERSION _comversion;
  /* 0x000c */ unsigned long _dwDestCtx;
}; /* size: 0x0010 */

class CDestObjectWrapper
{
  /* 0x0010 */ long m_cRef;
  /* 0x0018 */ struct IDestInfo* m_pIDI;
}; /* size: 0x0020 */

class CDfMutex
{
  /* 0x0000 */ struct _GLOBAL_SHARED_CRITICAL_SECTION* _pGlobalPortion;
  /* 0x0008 */ void* _hLockEvent;
}; /* size: 0x0010 */

class CDfName
{
  /* 0x0000 */ unsigned char _ab[64];
  /* 0x0040 */ unsigned short _cb;
}; /* size: 0x0042 */

class CDfNameList
{
  /* 0x0000 */ class CDfName _df;
  /* 0x0044 */ unsigned long _sectStart;
  /* 0x0048 */ unsigned long _ulSize;
  /* 0x0050 */ class CDfNameList* _pdflNext;
}; /* size: 0x0058 */

class CDirEntry
{
}; /* size: 0x0080 */

class CDirSect
{
  /* 0x0000 */ class CDirEntry* _adeEntry /* zero-length array */;
}; /* size: 0x0001 */

class CDirVector
{
  /* 0x0030 */ unsigned short _cbSector;
}; /* size: 0x0038 */

class CDirectStream
{
  /* 0x0010 */ class CStmHandle _stmh;
  /* 0x0020 */ class CStreamCache _stmc;
  /* 0x00b0 */ unsigned __int64 _ulSize;
  /* 0x00b8 */ unsigned __int64 _ulOldSize;
  /* 0x00c0 */ class CBasedDeltaListPtr _pdlHolder;
}; /* size: 0x00c8 */

class CDirectory
{
  /* 0x0000 */ class CDirVector _dv;
  /* 0x0038 */ unsigned long _cdsTable;
  /* 0x0040 */ class CBasedMStreamPtr _pmsParent;
  /* 0x0048 */ unsigned short _cdeEntries;
  /* 0x004c */ unsigned long _sidFirstFree;
}; /* size: 0x0050 */

class CDlElement
{
  /* 0x0000 */ class CBasedDlElementPtr _pdlePrev;
  /* 0x0008 */ class CBasedDlElementPtr _pdleNext;
}; /* size: 0x0010 */

class CDllHost
{
  /* 0x0018 */ struct IDLLHost* _pIDllProxy;
  /* 0x0020 */ class CStdIdentity* _pStdId;
  /* 0x0028 */ unsigned long _dwType;
  /* 0x002c */ unsigned long _dwHostAptId;
  /* 0x0030 */ unsigned long _hActivator;
  /* 0x0034 */ unsigned long _dwTid;
  /* 0x0038 */ HRESULT _hrMarshal;
  /* 0x0040 */ void* _hEvent;
  /* 0x0048 */ void* _hEventWakeUp;
  /* 0x0050 */ HRESULT _hr;
  /* 0x0058 */ struct tagOBJREF _objref;
  /* 0x00b0 */ class COleStaticMutexSem _mxs;
}; /* size: 0x0100 */

class CDocFile
{
  /* 0x0010 */ class CUpdateList _ulChangedHolder;
  /* 0x0020 */ class CStgHandle _stgh;
  /* 0x0030 */ const class CBasedDFBasisPtr _pdfb;
}; /* size: 0x0038 */

class CDocfileStreamName
{
  /* 0x0000 */ wchar_t _wszName[37];
}; /* size: 0x004a */

class CDocfileUnmarshalFactory
{
  /* 0x0010 */ unsigned long _sig;
}; /* size: 0x0018 */

class CDragDataObject
{
  /* 0x0008 */ unsigned long _cRefs;
  /* 0x0010 */ void* _pvMarshaledDataObject;
  /* 0x0018 */ struct IDataObject* _pIDataObject;
  /* 0x0020 */ struct FORMATETCDATAARRAY* m_pFormatEtcDataArray;
  /* 0x0028 */ unsigned long _dwSmId;
}; /* size: 0x0030 */

class CDragDefaultCursors
{
  /* 0x0000 */ struct HICON__* ahcursorDefaults[4][2];
}; /* size: 0x0040 */

enum CDragDefaultCursors::CURSOR_ID
{
  NO_DROP = 0,
  MOVE_DROP = 1,
  COPY_DROP = 2,
  LINK_DROP = 3,
};

enum CDragDefaultCursors::SCROLL_TYPE
{
  NO_SCROLL = 0,
  SCROLL = 1,
};

class CDragOperation
{
  union
  {
    struct
    {
      /* 0x0000 */ struct IDataObject* _pDataObject;
      /* 0x0008 */ void* _DOBuffer;
      /* 0x0010 */ struct IDropSource* _pDropSource;
      /* 0x0018 */ struct IDropSourceQueryEx* _pDSQueryEx;
      /* 0x0020 */ struct IDropSourceNotify* _pDSNotify;
      /* 0x0028 */ struct IDropTarget* _pDropTarget;
      /* 0x0030 */ struct IDropTarget* _pRealDropTarget;
      /* 0x0038 */ void* _hFormats;
      /* 0x0040 */ class CPoint _cpt;
      /* 0x0048 */ unsigned long _dwOKEffects;
      /* 0x0050 */ unsigned long* _pdwEffect;
      /* 0x0058 */ int _fEscapePressed;
      /* 0x0060 */ struct HICON__* _curOld;
      /* 0x0068 */ struct HWND__* _hwndLast;
      /* 0x0070 */ unsigned long _grfKeyState;
      /* 0x0074 */ HRESULT _hrDragResult;
      /* 0x0078 */ int _fReleasedCapture;
      /* 0x0080 */ class CDragDefaultCursors* _pcddcDefault;
      /* 0x0088 */ int _fUseWin31;
      /* 0x008c */ unsigned long _dwFinalKeyState;
      /* 0x0090 */ class CPoint _cptFinalCursorPos;
    }; /* size: 0x008c */
    /* 0x0000 */ long s_wScrollInt;
  }; /* size: 0x008c */
}; /* size: 0x0098 */

class CDropTarget
{
  /* 0x0008 */ struct HWND__* _hwndOLE;
  /* 0x0010 */ struct HWND__* _hwnd31;
  /* 0x0018 */ unsigned long _dwEffectLast;
  /* 0x001c */ unsigned long _crefs;
  /* 0x0020 */ class CDragOperation* _pdo;
  /* 0x0028 */ void* _hDDInfo;
}; /* size: 0x0030 */

class CDualStringArray
{
  /* 0x0000 */ struct tagDUALSTRINGARRAY* _pdsa;
  /* 0x0008 */ long _cRef;
}; /* size: 0x0010 */

class CDwordBag
{
  /* 0x0018 */ unsigned long _dwSlotsUsed;
}; /* size: 0x0020 */

class CEMfObject
{
  /* 0x0008 */ unsigned long m_ulRefs;
  /* 0x0010 */ struct HENHMETAFILE__* m_hPres;
  /* 0x0018 */ int m_fMetaDC;
  /* 0x001c */ int m_nRecord;
  /* 0x0020 */ HRESULT m_error;
  /* 0x0028 */ struct tagLOGPALETTE* m_pColorSet;
  /* 0x0030 */ void* m_pfnContinue /* function */;
  /* 0x0038 */ unsigned __int64 m_dwContinue;
  /* 0x0040 */ unsigned long m_dwAspect;
  /* 0x0044 */ unsigned long m_dwSize;
  /* 0x0048 */ long m_lWidth;
  /* 0x004c */ long m_lHeight;
  /* 0x0050 */ class CCacheNode* m_pCacheNode;
}; /* size: 0x0058 */

class CEffPermsCacheLUID
{
  /* 0x0000 */ struct CEffPermsCacheLUID::tagCACHE_ENTRY m_cache[23];
  /* 0x0118 */ struct _RTL_CRITICAL_SECTION m_CacheLock;
  /* 0x0140 */ int m_bLockValid;
}; /* size: 0x0148 */

struct CEffPermsCacheLUID::tagCACHE_ENTRY
{
  /* 0x0000 */ struct _LUID lClient;
  /* 0x0008 */ unsigned long dwEffectivePermissions;
}; /* size: 0x000c */

class CEndPointAtom
{
  /* 0x0000 */ unsigned short s_AtomProp;
}; /* size: 0x0001 */

class CEndpointEntry
{
  /* 0x0000 */ class CEndpointEntry* m_pNext;
  /* 0x0008 */ unsigned short m_wTowerId;
  /* 0x0010 */ wchar_t* m_pszEndpoint;
  /* 0x0018 */ wchar_t* m_pszProtSeq;
  /* 0x0020 */ unsigned long m_dwFlags;
  /* 0x0024 */ int m_fProcessed;
}; /* size: 0x0028 */

class CEndpointsTable
{
  union
  {
    struct
    {
      /* 0x0000 */ class CEndpointEntry* m_pHead;
      /* 0x0008 */ int m_nCount;
    }; /* size: 0x000c */
    /* 0x0000 */ class CPageAllocator _palloc;
  }; /* size: 0x0068 */
}; /* size: 0x0010 */

class CEnumCategories
{
  /* 0x0008 */ struct HKEY__* m_hKey;
  /* 0x0010 */ unsigned long m_dwIndex;
  /* 0x0014 */ unsigned long m_lcid;
  /* 0x0018 */ struct IEnumCATEGORYINFO* m_pcsIEnumCat;
  /* 0x0020 */ int m_fromcs;
  /* 0x0024 */ unsigned long m_dwRefCount;
}; /* size: 0x0028 */

class CEnumCategoriesOfClass
{
  /* 0x0008 */ unsigned long m_dwRefCount;
  /* 0x000c */ int m_bMapOldKeys;
  /* 0x0010 */ struct HKEY__* m_hKey;
  /* 0x0018 */ unsigned long m_dwIndex;
  /* 0x0020 */ struct HKEY__* m_hKeyCats;
  /* 0x0028 */ unsigned long m_dwOldKeyIndex;
  /* 0x0030 */ struct IUnknown* m_pCloned;
}; /* size: 0x0038 */

class CEnumClassesOfCategories
{
  /* 0x0008 */ unsigned long m_dwRefCount;
  /* 0x0010 */ struct HKEY__* m_hClassKey;
  /* 0x0018 */ unsigned long m_dwIndex;
  /* 0x001c */ unsigned long m_cImplemented;
  /* 0x0020 */ struct _GUID* m_rgcatidImpl;
  /* 0x0028 */ unsigned long m_cRequired;
  /* 0x0030 */ struct _GUID* m_rgcatidReq;
  /* 0x0038 */ struct IEnumGUID* m_pcsIEnumClsid;
  /* 0x0040 */ int m_fromcs;
  /* 0x0048 */ struct IUnknown* m_pCloned;
}; /* size: 0x0050 */

class CEnumContextProps
{
  /* 0x0008 */ long _cRefs;
  /* 0x0010 */ struct tagContextProperty* _pList;
  /* 0x0018 */ unsigned long* _pcListRefs;
  /* 0x0020 */ unsigned long _cItems;
  /* 0x0024 */ unsigned long _CurrentPosition;
}; /* size: 0x0028 */

class CEnumFmt
{
  /* 0x0008 */ unsigned long m_cRef;
  /* 0x0010 */ wchar_t* m_szClsid;
  /* 0x0018 */ unsigned long m_dwDirection;
  /* 0x001c */ unsigned long m_iKey;
  /* 0x0020 */ struct FMTCACHE m_cache;
}; /* size: 0x0048 */

class CEnumFmt10
{
  /* 0x0048 */ struct FMT* m_rgFmt;
  /* 0x0050 */ unsigned __int64 m_cFmt;
}; /* size: 0x0058 */

class CEnumFormatEtc
{
  /* 0x000c */ unsigned long m_ulFlags;
  /* 0x0010 */ unsigned long m_refs;
  /* 0x0014 */ unsigned long m_index;
  /* 0x0018 */ class CArray<CFormatEtc>* m_pFEArray;
}; /* size: 0x0020 */

class CEnumFormatEtcDataArray
{
  /* 0x000c */ unsigned long m_refs;
  /* 0x0010 */ unsigned long m_cOffset;
  /* 0x0018 */ struct FORMATETCDATAARRAY* m_pFormatEtcDataArray;
}; /* size: 0x0020 */

class CEnumGeneric
{
  /* 0x0008 */ struct _GUID m_iid;
  /* 0x0018 */ unsigned long m_refs;
  /* 0x001c */ unsigned long m_dwCurrent;
  /* 0x0020 */ unsigned long m_dwDirection;
  /* 0x0028 */ struct IEnumCallback* m_pEnumCallback;
  /* 0x0030 */ struct IEnumHolder* m_pParent;
  /* 0x0038 */ struct IEnumGeneric* m_pNext;
  /* 0x0040 */ struct IEnumGeneric* m_pPrev;
}; /* size: 0x0048 */

class CEnumHolder
{
  /* 0x0008 */ unsigned long m_refs;
  /* 0x000c */ unsigned short m_nCount;
  /* 0x0010 */ struct IEnumGeneric* m_pFirst;
  /* 0x0018 */ struct IEnumGeneric* m_pLast;
}; /* size: 0x0020 */

class CEnumSTATDATA
{
  /* 0x0008 */ unsigned long m_refs;
  /* 0x000c */ int m_iDataEnum;
  /* 0x0010 */ class CDAHolder* m_pHolder;
}; /* size: 0x0018 */

class CEnumSTATPROPBAG
{
  /* 0x0008 */ long _cRefs;
  /* 0x0010 */ struct IBlockingLock* _pBlockingLock;
  /* 0x0018 */ class CSTATPROPBAGArray* _parray;
  /* 0x0020 */ unsigned long _iarray;
}; /* size: 0x0028 */

class CEnumSTATPROPSETSTG
{
  /* 0x0008 */ unsigned long _ulSig;
  /* 0x000c */ long _cRefs;
  /* 0x0010 */ struct IEnumSTATSTG* _penumSTATSTG;
  /* 0x0018 */ struct tagSTATSTG _statarray[1];
  /* 0x0068 */ unsigned long _cstatTotalInArray;
  /* 0x006c */ unsigned long _istatNextToRead;
}; /* size: 0x0070 */

class CEnumSTATPROPSTG
{
  /* 0x0008 */ unsigned long _ulSig;
  /* 0x000c */ long _cRefs;
  /* 0x0010 */ class CStatArray* _psa;
  /* 0x0018 */ unsigned long _ipropNext;
}; /* size: 0x0020 */

class CEnumStatData
{
  /* 0x000c */ unsigned long m_ulFlags;
  /* 0x0010 */ unsigned long m_refs;
  /* 0x0014 */ unsigned long m_index;
  /* 0x0018 */ class CArray<CStatData>* m_pSDArray;
}; /* size: 0x0020 */

class CEnumVerb
{
  /* 0x0008 */ unsigned long m_cRef;
  /* 0x000c */ long m_iVerb;
  /* 0x0010 */ struct VerbList* m_VerbList;
}; /* size: 0x0018 */

class CErrorChannelHook
{
}; /* size: 0x0008 */

class CErrorObject
{
  /* 0x0018 */ long _refCount;
  /* 0x001c */ struct ErrorObjectData _data;
  /* 0x0038 */ wchar_t* _pszSource;
  /* 0x0040 */ wchar_t* _pszDescription;
  /* 0x0048 */ wchar_t* _pszHelpFile;
}; /* size: 0x0050 */

class CErrorSmAllocator
{
}; /* size: 0x0030 */

class CEventCache
{
  union
  {
    /* 0x0000 */ void* _list[20];
    /* 0x0000 */ unsigned long _ifree;
    /* 0x0000 */ class COleStaticMutexSem _mxsEventCache;
  }; /* size: 0x00a0 */
}; /* size: 0x0001 */

class CEventSem
{
  /* 0x0000 */ void* _hEvent;
}; /* size: 0x0008 */

class CException
{
  /* 0x0008 */ long _lError;
}; /* size: 0x0010 */

class CExceptionContext
{
  /* 0x0000 */ class CTry* _pTopTry;
  /* 0x0008 */ unsigned char* _pLastNew;
  /* 0x0010 */ int _cbLastNew;
  /* 0x0014 */ int _fNewReadyForUnwind;
  /* 0x0018 */ class CException _exception;
  /* 0x0028 */ char buffer[256];
  /* 0x0128 */ class CExceptionContext::StackElement* _aStack;
  /* 0x0130 */ int _StackTop;
  /* 0x0134 */ int _StackSize;
}; /* size: 0x0138 */

class CExceptionContext::StackElement
{
  /* 0x0000 */ void* _pthis;
  /* 0x0008 */ void* _pfn /* function */;
  /* 0x0010 */ unsigned long _cbElement;
}; /* size: 0x0018 */

class CExpParameterValidate
{
}; /* size: 0x0001 */

class CExposedDocFile
{
  /* 0x0090 */ class CPubDocFile* _pdf;
  /* 0x0098 */ class CDFBasis* _pdfb;
  /* 0x00a0 */ class CPerContext* _ppc;
  /* 0x00a8 */ unsigned long _sig;
  /* 0x00ac */ long _cReferences;
  /* 0x00b0 */ class CPropertyBagEx _PropertyBagEx;
}; /* size: 0x00e8 */

struct CExposedIterator
{
  /* 0x0030 */ class CPubDocFile* _ppdf;
  /* 0x0038 */ class CDFBasis* _pdfb;
  /* 0x0040 */ class CPerContext* _ppc;
  /* 0x0048 */ long _cReferences;
  /* 0x004c */ unsigned long _sig;
  /* 0x0050 */ class CDfName _dfnKey;
  /* 0x0092 */ char __PADDING__[6];
}; /* size: 0x0098 */

class CExposedStream
{
  /* 0x0058 */ class CPubStream* _pst;
  /* 0x0060 */ class CDFBasis* _pdfb;
  /* 0x0068 */ class CPerContext* _ppc;
  /* 0x0070 */ unsigned long _sig;
  /* 0x0074 */ long _cReferences;
  /* 0x0078 */ class CSeekPointer* _psp;
}; /* size: 0x0080 */

class CExtHashTable
{
}; /* size: 0x0028 */

class CExtentList
{
  /* 0x0000 */ unsigned long m_cbMonikerExtents;
  /* 0x0008 */ unsigned char* m_pchMonikerExtents;
}; /* size: 0x0010 */

class CFAccessControl
{
  /* 0x0008 */ long m_cRefs;
}; /* size: 0x0010 */

class CFILETIME
{
  union
  {
    /* 0x0000 */ struct _FILETIME _filetime;
    /* 0x0000 */ __int64 _ll;
    /* 0x0000 */ union _LARGE_INTEGER _li;
    /* 0x0000 */ union _ULARGE_INTEGER _uli;
  }; /* size: 0x0008 */
}; /* size: 0x0008 */

class CFastBH
{
  /* 0x0000 */ void* m_hRpc;
  /* 0x0008 */ void* m_ifHandle;
}; /* size: 0x0010 */

class CFat
{
  /* 0x0000 */ class CFatVector _fv;
  /* 0x0038 */ class CBasedMStreamPtr _pmsParent;
  /* 0x0040 */ const unsigned long _sid;
  /* 0x0048 */ class CBasedFatPtr _pfatReal;
  /* 0x0050 */ class CBasedFatPtr _pfatNoScratch;
  /* 0x0058 */ unsigned long _sectNoSnapshot;
  /* 0x005c */ unsigned long _sectNoSnapshotFree;
  /* 0x0060 */ unsigned short _uFatShift;
  /* 0x0062 */ unsigned short _uFatMask;
  /* 0x0064 */ unsigned long _cfsTable;
  /* 0x0068 */ unsigned long _ulFreeSects;
  /* 0x006c */ unsigned long _cUnmarkedSects;
  /* 0x0070 */ unsigned long _sectFirstFree;
  /* 0x0074 */ unsigned long _sectLastUsed;
  /* 0x0078 */ unsigned long _sectMax;
  /* 0x007c */ unsigned long _ipfsRangeLocks;
  /* 0x0080 */ unsigned short _isectRangeLocks;
}; /* size: 0x0088 */

class CFatSect
{
  /* 0x0000 */ unsigned long* _asectEntry /* zero-length array */;
}; /* size: 0x0004 */

class CFatVector
{
  /* 0x0030 */ unsigned short _csectTable;
  /* 0x0032 */ unsigned short _csectBlock;
}; /* size: 0x0038 */

class CFileMoniker
{
  /* 0x0028 */ struct _GUID m_clsid;
  /* 0x0038 */ class CExtentList m_ExtentList;
  /* 0x0048 */ wchar_t* m_szPath;
  /* 0x0050 */ char* m_pszAnsiPath;
  /* 0x0058 */ unsigned short m_ccPath;
  /* 0x005a */ unsigned short m_cbAnsiPath;
  /* 0x005c */ unsigned long m_dwHashValue;
  struct /* bitfield */
  {
    /* 0x0060 */ unsigned long m_fUnicodeExtent : 1; /* bit position: 0 */
    /* 0x0060 */ unsigned long m_fClassVerified : 1; /* bit position: 1 */
    /* 0x0060 */ unsigned long m_fHashValueValid : 1; /* bit position: 2 */
  }; /* bitfield */
  /* 0x0064 */ unsigned char m_fShellLinkInitialized;
  struct /* bitfield */
  {
    /* 0x0068 */ unsigned long m_fTrackingEnabled : 1; /* bit position: 0 */
    /* 0x0068 */ unsigned long m_fSaveShellLink : 1; /* bit position: 1 */
    /* 0x0068 */ unsigned long m_fDirty : 1; /* bit position: 2 */
    /* 0x0068 */ unsigned long m_fReduceEnabled : 1; /* bit position: 3 */
  }; /* bitfield */
  /* 0x006c */ unsigned short m_cAnti;
  /* 0x006e */ unsigned short m_endServer;
  /* 0x0070 */ enum CFileMoniker::olever m_ole1;
  /* 0x0078 */ struct IShellLinkW* m_pShellLink;
  /* 0x0080 */ class CTrackingFileMoniker _tfm;
  /* 0x0090 */ class CMutexSem2 m_mxs;
}; /* size: 0x00c0 */

enum CFileMoniker::olever
{
  undetermined = 0,
  ole1 = 1,
  ole2 = 2,
};

class CFileMonikerFactory
{
}; /* size: 0x0010 */

struct CFileStream
{
  /* 0x0030 */ class CGlobalFileStream* _pgfst;
  /* 0x0038 */ class CPerContext* _ppc;
  /* 0x0040 */ void* _hFile;
  /* 0x0048 */ void* _hPreDuped;
  /* 0x0050 */ unsigned long _sig;
  /* 0x0054 */ long _cReferences;
  /* 0x0058 */ struct IMalloc* const _pMalloc;
  /* 0x0060 */ void* _hMapObject;
  /* 0x0068 */ unsigned char* _pbBaseAddr;
  /* 0x0070 */ unsigned long _cbViewSize;
  /* 0x0074 */ long __PADDING__[1];
}; /* size: 0x0078 */

class CFillLockBytes
{
  /* 0x0018 */ struct ILockBytes* _pilb;
  /* 0x0020 */ long _cRefs;
  /* 0x0024 */ unsigned long _ulHighWater;
  /* 0x0028 */ unsigned long _dwTerminate;
  /* 0x002c */ unsigned long _ulFailurePoint;
  /* 0x0030 */ class CPerContext* _ppc;
  /* 0x0038 */ int _fCSInitialized;
  /* 0x0040 */ struct _RTL_CRITICAL_SECTION _csThreadProtect;
}; /* size: 0x0068 */

class CFmCtrlUnknown
{
  /* 0x0008 */ class CFreeMarshaler* _pfm;
  /* 0x0010 */ unsigned long _cRefs;
}; /* size: 0x0018 */

class CForcedDropTarget
{
  /* 0x0000 */ struct HWND__* _hwndFDTCurrent;
  /* 0x0008 */ int _fDragDropActive;
}; /* size: 0x0010 */

class CFormat
{
  /* 0x0000 */ enum FORMATTAG m_ftag;
  /* 0x0008 */ unsigned short m_cf;
  /* 0x0010 */ class CData m_dataFormatString;
}; /* size: 0x0030 */

class CFormatEtc
{
  /* 0x0000 */ unsigned long m_ulFlags;
  /* 0x0008 */ struct tagFORMATETC m_foretc;
}; /* size: 0x0028 */

class CFrameFilter
{
  /* 0x0018 */ struct HWND__* m_hwndObject;
  /* 0x0020 */ struct HWND__* m_hwndFrame;
  /* 0x0028 */ struct IOleInPlaceFrame* m_lpFrame;
  /* 0x0030 */ struct IOleInPlaceActiveObject* m_lpObject;
  /* 0x0038 */ void* m_lpfnPrevWndProc /* function */;
  /* 0x0040 */ int m_fObjectMenu;
  /* 0x0044 */ int m_fCurItemPopup;
  /* 0x0048 */ int m_fInMenuMode;
  /* 0x004c */ int m_fDiscardWmCommand;
  /* 0x0050 */ int m_fGotMenuCloseEvent;
  /* 0x0054 */ int m_fRemovedWndProc;
  /* 0x0058 */ unsigned int m_cmdId;
  /* 0x0060 */ unsigned __int64 m_uCurItemID;
  /* 0x0068 */ struct tagOLEMENU* m_lpOleMenu;
  /* 0x0070 */ struct HMENU__* m_hmenuCombined;
  /* 0x0078 */ struct HWND__* m_hwndFocusOnEnter;
  /* 0x0080 */ int m_cAltTab;
}; /* size: 0x0088 */

class CFreeList
{
  /* 0x0000 */ class CBasedFreeBlockPtr _pfbHead;
}; /* size: 0x0008 */

class CFreeMarshaler
{
  /* 0x0008 */ struct IUnknown* _punkCtrl;
  union
  {
    /* 0x0000 */ unsigned char _SecretBlock[16];
    /* 0x0000 */ int _fSecretInit;
    /* 0x0000 */ class COleStaticMutexSem _SecretLock;
  }; /* size: 0x0050 */
}; /* size: 0x0010 */

class CFunctionDiscoveryNotificationWrapper
{
}; /* size: 0x0008 */

class CGIPMessageParam
{
  /* 0x0010 */ long m_cRefs;
  /* 0x0014 */ unsigned long m_dwCookie;
  /* 0x0018 */ struct _GUID m_causalityId;
}; /* size: 0x0028 */

class CGIPTable
{
  union
  {
    /* 0x0000 */ unsigned long _dwCurrSeqNo;
    /* 0x0000 */ int _fInRevokeAll;
    /* 0x0000 */ int _fInNAUninit;
    /* 0x0000 */ struct tagGIPEntry _InUseHead;
    /* 0x0000 */ class CPageAllocator _palloc;
    /* 0x0000 */ class COleStaticMutexSem _mxs;
  }; /* size: 0x0068 */
}; /* size: 0x0008 */

class CGenObject
{
  /* 0x0008 */ unsigned long m_ulRefs;
  /* 0x000c */ unsigned long m_dwAspect;
  /* 0x0010 */ unsigned long m_dwSize;
  /* 0x0014 */ long m_lWidth;
  /* 0x0018 */ long m_lHeight;
  /* 0x0020 */ void* m_hPres;
  /* 0x0028 */ unsigned short m_cfFormat;
  /* 0x0030 */ class CCacheNode* m_pCacheNode;
}; /* size: 0x0038 */

class CGenericObject
{
  /* 0x0000 */ class CClass m_class;
  /* 0x0018 */ class CClass m_classLast;
  /* 0x0030 */ class CPres* m_ppres;
  /* 0x0038 */ class CData m_dataNative;
  /* 0x0058 */ int m_fLink;
  /* 0x005c */ int m_fStatic;
  /* 0x0060 */ int m_fNoBlankPres;
  /* 0x0068 */ wchar_t* m_szTopic;
  /* 0x0070 */ wchar_t* m_szItem;
  /* 0x0078 */ unsigned long m_lnkupdopt;
}; /* size: 0x0080 */

class CGlobalContext
{
  /* 0x0010 */ int _fTakeLock;
  /* 0x0014 */ unsigned long _dfOpenLock;
  /* 0x0018 */ struct IMalloc* const _pMalloc;
  /* 0x0020 */ const int _fCreated;
  /* 0x0028 */ union _LARGE_INTEGER _luidMutexName;
  /* 0x0030 */ struct _GLOBAL_SHARED_CRITICAL_SECTION _GlobalPortion;
}; /* size: 0x0040 */

class CGlobalFileStream
{
  /* 0x0010 */ unsigned long _df;
  /* 0x0014 */ unsigned long _dwStartFlags;
  /* 0x0018 */ struct IMalloc* const _pMalloc;
  /* 0x0020 */ unsigned __int64 _ulPos;
  /* 0x0028 */ unsigned long _cbSector;
  /* 0x002c */ unsigned long _cbMappedFileSize;
  /* 0x0030 */ unsigned long _cbMappedCommitSize;
  /* 0x0034 */ unsigned long _dwMapFlags;
  /* 0x0038 */ wchar_t _awcPath[261];
  /* 0x0244 */ unsigned long _dwTerminate;
  /* 0x0248 */ unsigned __int64 _ulHighWater;
  /* 0x0250 */ unsigned __int64 _ulFailurePoint;
}; /* size: 0x0258 */

class CGlobalOptions
{
  /* 0x0010 */ unsigned long _lRefs;
}; /* size: 0x0018 */

class CGlobalSecurity
{
  /* 0x0000 */ unsigned char _acl[64];
  /* 0x0040 */ struct _SECURITY_DESCRIPTOR _sd;
  /* 0x0068 */ unsigned char _sdExt[152];
  /* 0x0100 */ struct _SECURITY_ATTRIBUTES _sa;
}; /* size: 0x0118 */

enum CHK
{
  chkDdeSrvr = 4660,
  chkDefClient = 22136,
};

class CHandle
{
  /* 0x0000 */ class CBasedMStreamPtr _pms;
  /* 0x0008 */ unsigned long _sid;
}; /* size: 0x0010 */

class CHashTable
{
  /* 0x0008 */ class COleStaticMutexSem* _pExLock;
  /* 0x0010 */ class CRWLock* _pRWLock;
  /* 0x0018 */ struct SHashChain* _buckets;
  /* 0x0020 */ unsigned long _cCurEntries;
  /* 0x0024 */ unsigned long _cMaxEntries;
}; /* size: 0x0028 */

class CHeapHeader
{
  /* 0x0000 */ unsigned __int64 _ulFirstFree;
  /* 0x0008 */ unsigned __int64 _ulAllocedBlocks;
  /* 0x0010 */ int _fIsCompacted;
  /* 0x0014 */ unsigned long _dfLuid;
}; /* size: 0x0018 */

class CHlprDialog
{
  /* 0x0008 */ struct HINSTANCE__* m_hInstance;
}; /* size: 0x0010 */

class CHwnd
{
  /* 0x0000 */ struct HWND__* m_hwnd;
}; /* size: 0x0008 */

class CIDObject
{
  /* 0x0008 */ struct SHashChain _pidChain;
  /* 0x0018 */ struct SHashChain _oidChain;
  /* 0x0028 */ unsigned long _dwState;
  /* 0x002c */ unsigned long _cRefs;
  /* 0x0030 */ struct IUnknown* _pServer;
  /* 0x0038 */ class CObjectContext* _pServerCtx;
  /* 0x0040 */ struct _GUID _oid;
  /* 0x0050 */ unsigned long _aptID;
  /* 0x0058 */ class CStdWrapper* _pStdWrapper;
  /* 0x0060 */ class CStdIdentity* _pStdID;
  /* 0x0068 */ unsigned long _cCalls;
  /* 0x006c */ unsigned long _cLocks;
  /* 0x0070 */ struct SHashChain _oidUnpinReqChain;
  /* 0x0080 */ unsigned long _dwOidUnpinReqState;
  /* 0x0088 */ void* _pvObjectTrackCookie;
  union
  {
    /* 0x0000 */ class CPageAllocator s_allocator;
    /* 0x0000 */ int s_fInitialized;
    /* 0x0000 */ unsigned long s_cIDs;
  }; /* size: 0x0068 */
}; /* size: 0x0090 */

class CIPIDTable
{
  union
  {
    /* 0x0000 */ class CPageAllocator _palloc;
    /* 0x0000 */ struct tagIPIDEntry _oidListHead;
  }; /* size: 0x0070 */
}; /* size: 0x0001 */

class CInprocSystemActivator
{
}; /* size: 0x0008 */

class CInterfaceFromWindowProp
{
  /* 0x0008 */ unsigned long _ulRefCnt;
}; /* size: 0x0010 */

class CInternalPageAllocator
{
  /* 0x0000 */ long _cPages;
  /* 0x0008 */ struct tagPageEntry** _pPageListStart;
  /* 0x0010 */ struct tagPageEntry** _pPageListEnd;
  /* 0x0018 */ unsigned long _dwFlags;
  /* 0x0020 */ struct tagPageEntry _ListHead;
  /* 0x0030 */ long _cEntries;
  /* 0x0038 */ unsigned __int64 _cbPerEntry;
  /* 0x0040 */ unsigned short _cEntriesPerPage;
  /* 0x0048 */ class COleStaticMutexSem* _pLock;
}; /* size: 0x0050 */

class CItemMoniker
{
  /* 0x0028 */ wchar_t* m_lpszItem;
  /* 0x0030 */ char* m_pszAnsiItem;
  /* 0x0038 */ unsigned short m_ccItem;
  /* 0x003a */ unsigned short m_cbAnsiItem;
  /* 0x0040 */ wchar_t* m_lpszDelimiter;
  /* 0x0048 */ char* m_pszAnsiDelimiter;
  /* 0x0050 */ unsigned short m_ccDelimiter;
  /* 0x0052 */ unsigned short m_cbAnsiDelimiter;
  /* 0x0054 */ unsigned long m_fHashValueValid : 1; /* bit position: 0 */
  /* 0x0058 */ unsigned long m_dwHashValue;
  /* 0x0060 */ class CMutexSem2 m_mxs;
}; /* size: 0x0090 */

class CLUAMoniker
{
  /* 0x0038 */ unsigned long m_runLevel;
  /* 0x003c */ int m_bHaveBindOpts;
  /* 0x0040 */ struct tagBIND_OPTS3 m_bindopts3;
}; /* size: 0x0070 */

class CLinkable
{
  /* 0x0000 */ class CLinkable* m_pNext;
  /* 0x0008 */ class CLinkable* m_pPrev;
}; /* size: 0x0010 */

class CListHeader
{
}; /* size: 0x0010 */

class CLocalAlloc
{
}; /* size: 0x0001 */

class CLocalMachineNames
{
  /* 0x0008 */ unsigned long _lRefs;
  /* 0x000c */ unsigned long _dwCursor;
  /* 0x0010 */ class CMachineNamesHelper* _pMNHelper;
  /* 0x0018 */ int _fNeedNewData;
}; /* size: 0x0020 */

class CLock
{
  /* 0x0000 */ class CMutexSem& _mxs;
}; /* size: 0x0008 */

class CLock2
{
  /* 0x0000 */ class CMutexSem2& m_mxs;
}; /* size: 0x0008 */

class CMIDTable
{
  union
  {
    /* 0x0000 */ class MIDEntry* _pLocalMIDEntry;
    /* 0x0000 */ class CStringHashTable _HashTbl;
    /* 0x0000 */ class CPageAllocator _palloc;
  }; /* size: 0x0068 */
}; /* size: 0x0001 */

class CMIPIDHashTable
{
}; /* size: 0x0028 */

class CMREInnerUnknown
{
  /* 0x0008 */ unsigned long _iRefCount;
  /* 0x0010 */ class CManualResetEvent* _pParent;
}; /* size: 0x0018 */

class CMSFHeader
{
  /* 0x0000 */ class CMSFHeaderData _hdr;
  /* 0x0200 */ int _fDirty;
}; /* size: 0x0204 */

class CMSFHeaderData
{
  /* 0x004c */ unsigned long _sectFat[109];
}; /* size: 0x0200 */

class CMSFPage
{
  /* 0x0000 */ class CBasedMSFPagePtr _pmpNext;
  /* 0x0008 */ class CBasedMSFPagePtr _pmpPrev;
  /* 0x0010 */ unsigned long _sid;
  /* 0x0014 */ unsigned long _ulOffset;
  /* 0x0018 */ class CBasedPagedVectorPtr _ppv;
  /* 0x0020 */ unsigned long _sect;
  /* 0x0024 */ unsigned long _dwFlags;
  /* 0x0028 */ long _cReferences;
  /* 0x0030 */ unsigned __int64 ulPadding;
  /* 0x0038 */ unsigned char* _ab /* zero-length array */;
}; /* size: 0x0038 */

class CMSFPageTable
{
  /* 0x0000 */ class CBasedMStreamPtr _pmsParent;
  /* 0x0008 */ const unsigned long _cbSector;
  /* 0x000c */ const unsigned long _cMinPages;
  /* 0x0010 */ const unsigned long _cMaxPages;
  /* 0x0014 */ unsigned long _cActivePages;
  /* 0x0018 */ unsigned long _cPages;
  /* 0x0020 */ class CBasedMSFPagePtr _pmpCurrent;
  /* 0x0028 */ class CBasedMSFPagePtr _pmpStart;
  /* 0x0030 */ long _cReferences;
}; /* size: 0x0038 */

class CMStream
{
  /* 0x0000 */ class CBasedILockBytesPtrPtr _pplstParent;
  /* 0x0008 */ class CBasedMSFPageTablePtr _pmpt;
  /* 0x0010 */ class CMSFHeader _hdr;
  /* 0x0218 */ class CDirectory _dir;
  /* 0x0268 */ class CFat _fat;
  /* 0x02f0 */ class CDIFat _fatDif;
  /* 0x03a0 */ class CFat _fatMini;
  /* 0x0428 */ class CStreamCache _stmcDir;
  /* 0x04b8 */ class CStreamCache _stmcMiniFat;
  /* 0x0548 */ class CBasedDirectStreamPtr _pdsministream;
  /* 0x0550 */ class CBasedMStreamPtr _pmsShadow;
  /* 0x0558 */ class CBasedBytePtr _pCopySectBuf;
  /* 0x0560 */ const int _fIsScratch;
  /* 0x0564 */ int _fIsNoScratch;
  /* 0x0568 */ class CBasedMStreamPtr _pmsScratch;
  /* 0x0570 */ int _fIsNoSnapshot;
  /* 0x0574 */ int _fBlockWrite;
  /* 0x0578 */ int _fTruncate;
  /* 0x057c */ int _fBlockHeader;
  /* 0x0580 */ int _fNewConvert;
  /* 0x0584 */ int _fIsShadow;
  /* 0x0588 */ unsigned __int64 _ulParentSize;
  /* 0x0590 */ unsigned short _uSectorSize;
  /* 0x0592 */ unsigned short _uSectorShift;
  /* 0x0594 */ unsigned short _uSectorMask;
  /* 0x0598 */ struct IMalloc* const _pMalloc;
  /* 0x05a0 */ union _ULARGE_INTEGER _uliLastKnownSizeForConsolidate;
}; /* size: 0x05a8 */

struct CM_Power_Data_s
{
  /* 0x0000 */ unsigned long PD_Size;
  /* 0x0004 */ enum _DEVICE_POWER_STATE PD_MostRecentPowerState;
  /* 0x0008 */ unsigned long PD_Capabilities;
  /* 0x000c */ unsigned long PD_D1Latency;
  /* 0x0010 */ unsigned long PD_D2Latency;
  /* 0x0014 */ unsigned long PD_D3Latency;
  /* 0x0018 */ enum _DEVICE_POWER_STATE PD_PowerStateMapping[7];
  /* 0x0034 */ enum _SYSTEM_POWER_STATE PD_DeepestSystemWake;
}; /* size: 0x0038 */

class CMachineNamesHelper
{
  /* 0x0000 */ unsigned long _lRefs;
  /* 0x0004 */ unsigned long _dwNumStrings;
  /* 0x0008 */ wchar_t** _ppszStrings;
}; /* size: 0x0010 */

struct CMachineNamesHelper::_SBTOTAL
{
  /* 0x0000 */ unsigned long dwcTotalAddrs;
  /* 0x0008 */ wchar_t** ppszAddresses;
}; /* size: 0x0010 */

struct CMachineNamesHelper::_UNIQUEADDRS
{
  /* 0x0000 */ unsigned long dwcTotalUniqueAddrs;
  /* 0x0004 */ unsigned long dwStringSpaceNeeded;
  /* 0x0008 */ unsigned long dwCurrentAddr;
  /* 0x0010 */ wchar_t* pszNextAddrToUse;
  /* 0x0018 */ wchar_t** ppszAddrs;
  /* 0x0020 */ unsigned __int64 cchLeft;
}; /* size: 0x0028 */

struct CMalloc
{
  /* 0x0000 */ struct IMallocVtbl* lpVtbl;
}; /* size: 0x0008 */

class CMallocBased
{
}; /* size: 0x0001 */

class CManualResetEvent
{
  /* 0x0010 */ class CMREInnerUnknown _cInner;
  /* 0x0028 */ struct IUnknown* _pControl;
  /* 0x0030 */ class CStdEvent* m_cStdEvent;
}; /* size: 0x0038 */

class CMapDwordDword
{
  /* 0x0000 */ class CMapKeyToValue m_mkv;
}; /* size: 0x0048 */

class CMapDwordPtr
{
  /* 0x0000 */ class CMapKeyToValue m_mkv;
}; /* size: 0x0048 */

class CMapKeyToValue
{
  /* 0x0000 */ unsigned int m_cbValue;
  /* 0x0004 */ unsigned int m_cbKey;
  /* 0x0008 */ unsigned int m_cbKeyInAssoc;
  /* 0x0010 */ struct CMapKeyToValue::CAssoc** m_pHashTable;
  /* 0x0018 */ unsigned int m_nHashTableSize;
  /* 0x0020 */ void* m_lpfnHashKey /* function */;
  /* 0x0028 */ int m_nCount;
  /* 0x0030 */ struct CMapKeyToValue::CAssoc* m_pFreeList;
  /* 0x0038 */ struct CPlex* m_pBlocks;
  /* 0x0040 */ int m_nBlockSize;
}; /* size: 0x0048 */

struct CMapKeyToValue::CAssoc
{
  /* 0x0000 */ struct CMapKeyToValue::CAssoc* pNext;
  /* 0x0008 */ unsigned int nHashValue;
  /* 0x0010 */ union CMapKeyToValue::CKeyWrap key;
}; /* size: 0x0020 */

union CMapKeyToValue::CKeyWrap
{
  union
  {
    /* 0x0000 */ unsigned char rgbKey[12];
    struct
    {
      /* 0x0000 */ void* pKey;
      /* 0x0008 */ unsigned int cbKey;
    }; /* size: 0x000c */
  }; /* size: 0x000c */
}; /* size: 0x0010 */

class CMapStringToPtr
{
  /* 0x0000 */ class CMapKeyToValue m_mkv;
}; /* size: 0x0048 */

class CMapUintPtr
{
  /* 0x0000 */ class CMapKeyToValue m_mkv;
}; /* size: 0x0048 */

class CMarshalImplPStream
{
  /* 0x0008 */ struct IPersistStream* m_pPS;
}; /* size: 0x0010 */

class CMarshalList
{
  /* 0x0000 */ class CBasedMarshalListPtr _pmlNext;
  /* 0x0008 */ void* _pvBase;
  /* 0x0010 */ unsigned long _cntxid;
}; /* size: 0x0018 */

class CMemBytes
{
  /* 0x0008 */ unsigned long m_dwSig;
  /* 0x000c */ unsigned long m_refs;
  /* 0x0010 */ void* m_hMem;
  /* 0x0018 */ struct MEMSTM* m_pData;
}; /* size: 0x0020 */

class CMemStm
{
  /* 0x0008 */ unsigned long m_dwSig;
  /* 0x000c */ unsigned long m_refs;
  /* 0x0010 */ unsigned long m_pos;
  /* 0x0018 */ void* m_hMem;
  /* 0x0020 */ struct MEMSTM* m_pData;
  /* 0x0028 */ class CRefMutexSem* m_pmxs;
}; /* size: 0x0030 */

class CMessageCall
{
  /* 0x0018 */ enum tagCALLCATEGORY _callcat;
  /* 0x001c */ unsigned long _iFlags;
  /* 0x0020 */ long _hResult;
  /* 0x0028 */ void* _hEvent;
  /* 0x0030 */ struct HWND__* _hWndCaller;
  /* 0x0038 */ struct _GUID _ipid;
  /* 0x0048 */ void* _hSxsActCtx;
  /* 0x0050 */ unsigned long _server_fault;
  /* 0x0058 */ class CDestObject _destObj;
  /* 0x0068 */ void* _pHeader;
  /* 0x0070 */ class CChannelHandle* _pHandle;
  /* 0x0078 */ void* _hRpc;
  /* 0x0080 */ struct IUnknown* _pContext;
  /* 0x0088 */ unsigned long _dwCOMHeaderSize;
  /* 0x0090 */ struct tagRPCOLEMESSAGE message;
  /* 0x00e0 */ struct SChannelHookCallInfo hook;
  /* 0x0118 */ unsigned long _dwErrorBufSize;
  /* 0x011c */ unsigned long m_ulCancelTimeout;
  /* 0x0120 */ unsigned long m_dwStartCount;
  /* 0x0128 */ class CCtxCall* m_pClientCtxCall;
  /* 0x0130 */ class CCtxCall* m_pServerCtxCall;
}; /* size: 0x0138 */

class CMfObject
{
  /* 0x0008 */ unsigned long m_ulRefs;
  /* 0x0010 */ struct HMETAFILE__* m_hPres;
  /* 0x0018 */ struct _METAINFO* m_pMetaInfo;
  /* 0x0020 */ struct _METADC* m_pCurMdc;
  /* 0x0028 */ int m_fMetaDC;
  /* 0x002c */ int m_nRecord;
  /* 0x0030 */ HRESULT m_error;
  /* 0x0038 */ struct tagLOGPALETTE* m_pColorSet;
  /* 0x0040 */ int m_fConvert;
  /* 0x0048 */ void* m_pfnContinue /* function */;
  /* 0x0050 */ unsigned __int64 m_dwContinue;
  /* 0x0058 */ unsigned long m_dwAspect;
  /* 0x005c */ unsigned long m_dwSize;
  /* 0x0060 */ long m_lWidth;
  /* 0x0064 */ long m_lHeight;
  /* 0x0068 */ class CCacheNode* m_pCacheNode;
  /* 0x0070 */ struct HPALETTE__* m_hPalDCOriginal;
  /* 0x0078 */ struct HPALETTE__* m_hPalLast;
}; /* size: 0x0080 */

class CMonikerBag
{
}; /* size: 0x0020 */

class CMonikerFactory
{
}; /* size: 0x0010 */

class CMonikerPtrBuf
{
}; /* size: 0x0020 */

class CMultiGUIDHashTable
{
}; /* size: 0x0028 */

class CMutexSem
{
  /* 0x0000 */ struct _RTL_CRITICAL_SECTION _cs;
}; /* size: 0x0028 */

class CMutexSem2
{
  /* 0x0000 */ struct _RTL_CRITICAL_SECTION m_cs;
  /* 0x0028 */ int m_fCsInitialized;
}; /* size: 0x0030 */

class CNFFMappedStream
{
  /* 0x0008 */ class CNtfsStream* _pnffstm;
  struct /* bitfield */
  {
    /* 0x0010 */ int _fReserved : 1; /* bit position: 0 */
    /* 0x0010 */ int _fMappedStreamDirty : 1; /* bit position: 1 */
    /* 0x0010 */ int _fUpdateStreamHasLatest : 1; /* bit position: 2 */
    /* 0x0010 */ int _fCheckedForRollForward : 1; /* bit position: 3 */
    /* 0x0010 */ int _fStreamRenameSupported : 1; /* bit position: 4 */
  }; /* bitfield */
  /* 0x0018 */ unsigned char* _pbMappedStream;
  /* 0x0020 */ unsigned long _cbMappedStream;
  /* 0x0024 */ unsigned long _cbMappedStreamActual;
  /* 0x0028 */ void* _pMappedStreamOwner;
  /* 0x0030 */ unsigned short _cUpdateStreamInUse;
  /* 0x0032 */ unsigned short _cLatestStreamInUse;
  /* 0x0038 */ class CNtfsUpdateStreamForPropStg* _pstmUpdate;
}; /* size: 0x0040 */

enum CNFFMappedStream::enumCREATE_NEW_UPDATE_STREAM
{
  CREATE_NEW_UPDATE_STREAM = 1,
  DONT_CREATE_NEW_UPDATE_STREAM = 2,
};

class CNFFTreeMutex
{
  /* 0x0008 */ long _cRefs;
  /* 0x000c */ int _fInitialized;
  /* 0x0010 */ struct _RTL_CRITICAL_SECTION _cs;
}; /* size: 0x0038 */

enum CNVTYP
{
  cnvtypNone = 0,
  cnvtypConvertTo = 1,
  cnvtypTreatAs = 2,
};

class CNameHashTable
{
}; /* size: 0x0028 */

class CNdrStream
{
  /* 0x0008 */ long RefCount;
  /* 0x0010 */ unsigned char* pBuffer;
  /* 0x0018 */ unsigned long cbBufferLength;
  /* 0x001c */ unsigned long position;
}; /* size: 0x0020 */

class CNoEnum
{
  /* 0x0008 */ long m_cRef;
}; /* size: 0x0010 */

class CNtfsEnumSTATSTG
{
  /* 0x0008 */ unsigned long _ulSig;
  /* 0x000c */ long _cRefs;
  /* 0x0010 */ unsigned long _istatNextToRead;
  /* 0x0018 */ struct IBlockingLock* _pBlockingLock;
  /* 0x0020 */ class CNtfsSTATSTGArray* _pstatstgarray;
}; /* size: 0x0028 */

class CNtfsSTATSTGArray
{
  /* 0x0000 */ long _cRefs;
  /* 0x0008 */ struct IBlockingLock* _pBlockingLock;
  /* 0x0010 */ struct _FILE_STREAM_INFORMATION* _pFileStreamInformation;
  /* 0x0018 */ unsigned long _cFileStreamInformation;
}; /* size: 0x0020 */

class CNtfsStorage
{
  /* 0x0038 */ unsigned long _sig;
  /* 0x0040 */ class CNFFTreeMutex* _pTreeMutex;
  /* 0x0048 */ unsigned long _grfMode;
  /* 0x004c */ wchar_t _wcDriveLetter;
  /* 0x0050 */ class CNtfsStorageForPropSetStg _NtfsStorageForPropSetStg;
  /* 0x0060 */ class CNtfsStream* _pstmOpenList;
  /* 0x0068 */ void* _hFileMainStream;
  /* 0x0070 */ void* _hFileControlStream;
  /* 0x0078 */ unsigned short _hsmStatus;
  /* 0x007c */ unsigned long _dwStgStateBits;
  /* 0x0080 */ struct _GUID _clsidStgClass;
  /* 0x0090 */ class CPropertyBagEx _PropertyBagEx;
  /* 0x00c8 */ unsigned long _dwState;
  /* 0x00cc */ struct _FILETIME _filetime;
}; /* size: 0x00d8 */

class CNtfsStorageForPropSetStg
{
  /* 0x0008 */ class CNtfsStorage* _pNtfsStorage;
}; /* size: 0x0010 */

class CNtfsStream
{
  /* 0x0010 */ wchar_t* _pwcsName;
  /* 0x0018 */ class CNFFMappedStream _nffMappedStream;
  /* 0x0058 */ unsigned long _grfMode;
  /* 0x0060 */ void* _hFile;
  /* 0x0068 */ struct IBlockingLock* _pBlockingLock;
  /* 0x0070 */ unsigned long _sig;
  /* 0x0074 */ long _cRefs;
  /* 0x0078 */ class CNtfsStorage* _pnffstg;
  /* 0x0080 */ class TXLargeIntegerWrapper<_LARGE_INTEGER,long,__int64> _liCurrentSeekPosition;
  /* 0x0088 */ class CNtfsStream* _pnffstmPrev;
  /* 0x0090 */ class CNtfsStream* _pnffstmNext;
  /* 0x0098 */ struct _OVERLAPPED _ovlp;
}; /* size: 0x00b8 */

class CNtfsStreamName
{
  /* 0x0000 */ unsigned __int64 _count;
  /* 0x0008 */ wchar_t _wsz[256];
}; /* size: 0x0208 */

class CNtfsUpdateStreamForPropStg
{
}; /* size: 0x00b8 */

class CNtfsUpdateStreamName
{
  /* 0x0000 */ wchar_t _wszName[37];
}; /* size: 0x004a */

class CNullWalker
{
}; /* size: 0x0008 */

class COAHolder
{
  /* 0x0020 */ struct IAdviseSink** m_ppIAS;
  /* 0x0028 */ int m_iSize;
}; /* size: 0x0030 */

class COAccessControl
{
  /* 0x0008 */ long m_cRefs;
  /* 0x0010 */ class COAccessControl::CImpAccessControl* m_ImpObj;
}; /* size: 0x0018 */

class COAccessControl::CImpAccessControl
{
  /* 0x0010 */ int m_bInitialized;
  /* 0x0014 */ int m_bDirty;
  /* 0x0018 */ int m_bLockValid;
  /* 0x0020 */ struct IUnknown* m_pUnkOuter;
  /* 0x0028 */ struct _RTL_CRITICAL_SECTION m_ACLLock;
  /* 0x0050 */ class CEffPermsCacheLUID m_Cache;
  /* 0x0198 */ struct tagACL_DESCRIPTOR m_ACLDesc;
  /* 0x01d8 */ struct tagPCB m_pcb;
}; /* size: 0x0218 */

class COIDHashTable
{
}; /* size: 0x0028 */

class COIDTable
{
  union
  {
    /* 0x0000 */ int s_fInitialized;
    /* 0x0000 */ class COIDHashTable s_OIDHashTbl;
    /* 0x0000 */ struct SHashChain s_OIDBuckets[23];
    /* 0x0000 */ unsigned long s_UnpinReqsPending;
    /* 0x0000 */ struct SHashChain s_OIDUnpinRequests;
  }; /* size: 0x0170 */
}; /* size: 0x0001 */

class COLEDragDropHelper
{
  /* 0x0008 */ unsigned long _lRefs;
}; /* size: 0x0010 */

enum COLUMN_VISIBILITY
{
  CV_INVALID = 0,
  CV_VISIBLE = 1,
  CV_PRIMARYOVERFLOW = 2,
  CV_SECONDARYOVERFLOW = 3,
  CV_HIDDEN = 4,
};

enum COMPARTMENT_ID
{
  UNSPECIFIED_COMPARTMENT_ID = 0,
  DEFAULT_COMPARTMENT_ID = 1,
};

struct COM_CATALOG_CACHE_SECTION
{
  /* 0x0000 */ volatile __int64 CacheTicks;
  /* 0x0008 */ volatile __int64 ComPlusCatalogVer;
}; /* size: 0x0010 */

enum CONFIRMATIONRESPONSE
{
  CONFRES_CONTINUE = 0,
  CONFRES_SKIP = 1,
  CONFRES_RETRY = 2,
  CONFRES_RENAME = 3,
  CONFRES_CANCEL = 4,
  CONFRES_UNDO = 5,
  CONFRES_RENAME_LEFT = 3,
  CONFRES_RENAME_RIGHT = 6,
  CONFRES_ELEVATE = 7,
  CONFRES_CLOSE = 8,
};

struct CONFIRMSAFETY
{
  /* 0x0000 */ struct _GUID clsid;
  /* 0x0010 */ struct IUnknown* pUnk;
  /* 0x0018 */ unsigned long dwFlags;
  /* 0x001c */ long __PADDING__[1];
}; /* size: 0x0020 */

struct CONFIRM_CONFLICT_ITEM
{
  /* 0x0000 */ struct IShellItem2* pShellItem;
  /* 0x0008 */ wchar_t* pszOriginalName;
  /* 0x0010 */ wchar_t* pszAlternateName;
  /* 0x0018 */ wchar_t* pszLocationShort;
  /* 0x0020 */ wchar_t* pszLocationFull;
  /* 0x0028 */ enum SYNCMGR_CONFLICT_ITEM_TYPE nType;
  /* 0x002c */ long __PADDING__[1];
}; /* size: 0x0030 */

class CORRELATION_CONTEXT
{
  /* 0x0000 */ struct _MIDL_STUB_MESSAGE* const pStubMsg;
  /* 0x0008 */ unsigned char* const pCorrMemorySave;
}; /* size: 0x0010 */

class COXIDTable
{
  union
  {
    /* 0x0000 */ unsigned long _cExpired;
    /* 0x0000 */ class OXIDEntry _InUseHead;
    /* 0x0000 */ class OXIDEntry _ExpireHead;
    /* 0x0000 */ class OXIDEntry _CleanupHead;
  }; /* size: 0x00b8 */
}; /* size: 0x0001 */

class CObjServer
{
  /* 0x0008 */ class CStdIdentity* _pStdID;
  /* 0x0010 */ struct _GUID _ipid;
  /* 0x0020 */ unsigned __int64 _oxid;
  /* 0x0028 */ long _cRefs;
}; /* size: 0x0030 */

class CObjectContext
{
  /* 0x0038 */ unsigned long _cRefs;
  /* 0x003c */ long _cUserRefs;
  /* 0x0040 */ long _cInternalRefs;
  /* 0x0044 */ unsigned long _dwFlags;
  /* 0x0048 */ struct SHashChain _propChain;
  /* 0x0058 */ struct SHashChain _uuidChain;
  /* 0x0068 */ struct tagInterfaceData* _pifData;
  /* 0x0070 */ unsigned long _MarshalSizeMax;
  /* 0x0078 */ class CComApartment* _pApartment;
  /* 0x0080 */ unsigned long _dwHashOfId;
  /* 0x0084 */ struct _GUID _contextId;
  /* 0x0098 */ unsigned __int64 _urtCtxId;
  /* 0x00a0 */ struct tagSPSCache _PSCache;
  /* 0x00c0 */ struct IMarshal* _pMarshalProp;
  /* 0x00c8 */ long _cReleaseThreads;
  /* 0x00d0 */ class CContextPropList _properties;
  /* 0x0110 */ struct IUnknown* _pMtsContext;
  /* 0x0118 */ class CContextLife* volatile _pContextLife;
  /* 0x0120 */ class CCtxConnectionManager* _pConnectionMgr;
  union
  {
    /* 0x0000 */ class CPageAllocator s_CXAllocator;
    /* 0x0000 */ int s_fInitialized;
    /* 0x0000 */ unsigned long s_cInstances;
  }; /* size: 0x0068 */
}; /* size: 0x0128 */

class CObjrefMoniker
{
  /* 0x0038 */ wchar_t* m_lpszDisplayName;
}; /* size: 0x0040 */

class CObjrefMonikerFactory
{
}; /* size: 0x0010 */

class COle32DebugEventFire
{
}; /* size: 0x0068 */

class COleCache
{
  /* 0x0040 */ class COleCache::CCacheUnkImpl m_UnkPrivate;
  /* 0x0048 */ class COleCache::CCacheDataImpl m_Data;
  /* 0x0050 */ class COleCache::CCacheViewImpl m_ViewObject;
  /* 0x0058 */ class COleCache::CAdviseSinkImpl m_AdviseSink;
  /* 0x0060 */ struct IUnknown* m_pUnkOuter;
  /* 0x0068 */ struct IStorage* m_pStg;
  /* 0x0070 */ struct _GUID m_clsid;
  /* 0x0080 */ unsigned short m_cfFormat;
  /* 0x0084 */ unsigned long m_ulFlags;
  /* 0x0088 */ class CArray<CCacheNode>* m_pCacheArray;
  /* 0x0090 */ struct IAdviseSink* m_pViewAdvSink;
  /* 0x0098 */ unsigned long m_advfView;
  /* 0x009c */ unsigned long m_aspectsView;
  /* 0x00a0 */ unsigned long m_dwFrozenAspects;
  /* 0x00a8 */ struct IDataObject* m_pDataObject;
}; /* size: 0x00b0 */

class COleCache::CAdviseSinkImpl
{
}; /* size: 0x0008 */

class COleCache::CCacheDataImpl
{
}; /* size: 0x0008 */

class COleCache::CCacheUnkImpl
{
}; /* size: 0x0008 */

class COleCache::CCacheViewImpl
{
}; /* size: 0x0008 */

enum COleCache::GetExtent::__l2::tagCacheType
{
  CACHETYPE_NONE = 0,
  CACHETYPE_NODATA = 1,
  CACHETYPE_ONSTOP = 2,
  CACHETYPE_ONSAVE = 3,
  CACHETYPE_NORMAL = 4,
};

enum COleCache::Locate::__l2::tagFormatType
{
  FORMATTYPE_NONE = 0,
  FORMATTYPE_DIB = 1,
  FORMATTYPE_MFPICT = 2,
  FORMATTYPE_ENHMF = 3,
};

class COleConditionVariable
{
  /* 0x0000 */ struct _RTL_CONDITION_VARIABLE _cv;
}; /* size: 0x0008 */

class COleStaticLock
{
  /* 0x0000 */ class COleStaticMutexSem& _mxs;
}; /* size: 0x0008 */

class COleStaticMutexSem
{
  /* 0x0000 */ class COleStaticMutexSem* pNextMutex;
  /* 0x0008 */ unsigned char _fInitialized;
  /* 0x0009 */ unsigned char _fAutoDestruct;
  /* 0x000a */ unsigned char _fUseSpincount;
  /* 0x000c */ unsigned long _cLocks;
  /* 0x0010 */ unsigned long _dwLine;
  /* 0x0018 */ const char* _pszFile;
  /* 0x0020 */ const char* _pszLockName;
  /* 0x0028 */ struct _RTL_CRITICAL_SECTION _cs;
}; /* size: 0x0050 */

class COleTls
{
  /* 0x0000 */ struct tagSOleTlsData* _pData;
}; /* size: 0x0008 */

class CPIDHashTable
{
}; /* size: 0x0028 */

class CPIDTable
{
  union
  {
    /* 0x0000 */ int s_fInitialized;
    /* 0x0000 */ class CPIDHashTable s_PIDHashTbl;
    /* 0x0000 */ struct SHashChain s_PIDBuckets[23];
  }; /* size: 0x0170 */
}; /* size: 0x0001 */

class CPSHashTable
{
}; /* size: 0x0028 */

class CPSTable
{
  union
  {
    /* 0x0000 */ int s_fInitialized;
    /* 0x0000 */ class CPSHashTable s_PSHashTbl;
    /* 0x0000 */ struct SHashChain s_PSBuckets[23];
  }; /* size: 0x0170 */
}; /* size: 0x0001 */

enum CPVIEW
{
  CPVIEW_CLASSIC = 0,
  CPVIEW_ALLITEMS = 0,
  CPVIEW_CATEGORY = 1,
  CPVIEW_HOME = 1,
};

class CPaccelEnum
{
  /* 0x0000 */ struct tagACCEL* _lpaccel;
  /* 0x0008 */ struct tagACCEL* _lpaccelBase;
}; /* size: 0x0010 */

class CPackagerMoniker
{
  /* 0x0008 */ unsigned long m_refs;
  /* 0x0010 */ wchar_t* m_szFile;
  /* 0x0018 */ struct IMoniker* m_pmk;
  /* 0x0020 */ int m_fLink;
}; /* size: 0x0028 */

class CPageAllocator
{
  /* 0x0000 */ class CInternalPageAllocator _pgalloc;
  /* 0x0050 */ void* _hHeap;
  /* 0x0058 */ unsigned __int64 _cbPerEntry;
  /* 0x0060 */ long _lNumEntries;
}; /* size: 0x0068 */

class CPagedVector
{
  /* 0x0000 */ class CBasedMSFPageTablePtr _pmpt;
  /* 0x0008 */ class CBasedMStreamPtr _pmsParent;
  /* 0x0010 */ class CBasedMSFPagePtrPtr _amp;
  /* 0x0018 */ class CBasedVectBitsPtr _avb;
  /* 0x0020 */ const unsigned long _sid;
  /* 0x0024 */ unsigned long _ulSize;
  /* 0x0028 */ unsigned long _ulAllocSize;
}; /* size: 0x0030 */

class CPatternTbl
{
  /* 0x0000 */ struct STblHdr* _pTblHdr;
  /* 0x0008 */ unsigned char* _pStart;
}; /* size: 0x0010 */

class CPerContext
{
  /* 0x0010 */ struct ILockBytes* _plkbBase;
  /* 0x0018 */ struct CFileStream* _pfstDirty;
  /* 0x0020 */ struct ILockBytes* _plkbOriginal;
  /* 0x0028 */ unsigned long _ulOpenLock;
  /* 0x0030 */ class CGlobalContext* _pgc;
  /* 0x0038 */ long _cReferences;
  /* 0x0040 */ struct IMalloc* const _pMalloc;
  /* 0x0048 */ struct IFillInfo* _pfi;
  /* 0x0050 */ void* _hNotificationEvent;
  /* 0x0058 */ class CSharedMemoryBlock* _psmb;
  /* 0x0060 */ unsigned char* _pbBase;
  /* 0x0068 */ unsigned long _ulHeapName;
  /* 0x0070 */ class CDfMutex _dmtx;
  /* 0x0080 */ unsigned long _cRecursion;
}; /* size: 0x0088 */

class CPipePSFactory
{
  /* 0x0008 */ long m_cRef;
}; /* size: 0x0010 */

class CPipeProxy<double,&IID_IPipeDouble,&IID_AsyncIPipeDouble,IPipeDouble,AsyncIPipeDouble>
{
  /* 0x0008 */ struct IUnknown* m_pUnkOuter;
  /* 0x0010 */ long m_cRef;
  /* 0x0018 */ struct IPipeDouble* m_pRealProxy;
  /* 0x0020 */ struct IUnknown* m_pPullCallObj;
  /* 0x0028 */ struct AsyncIPipeDouble* m_pAsyncPullPipe;
  /* 0x0030 */ struct ISynchronize* m_pISyncPull;
  /* 0x0038 */ enum PULLSTATE m_PullState;
  /* 0x003c */ unsigned long m_cReadAhead;
  /* 0x0040 */ unsigned long m_cLastRead;
  /* 0x0044 */ unsigned long m_cKeepBufferSize;
  /* 0x0048 */ double* m_pKeepBuffer;
  /* 0x0050 */ unsigned long m_cKeepDataSize;
  /* 0x0058 */ double* m_pKeepData;
  /* 0x0060 */ struct IUnknown* m_pPushCallObj;
  /* 0x0068 */ struct AsyncIPipeDouble* m_pAsyncPushPipe;
  /* 0x0070 */ struct ISynchronize* m_pISyncPush;
  /* 0x0078 */ enum PUSHSTATE m_PushState;
  /* 0x007c */ unsigned long m_cPushBufferSize;
  /* 0x0080 */ double* m_pPushBuffer;
  /* 0x0088 */ unsigned long m_cFreeSpace;
  /* 0x0090 */ double* m_pFreeSpace;
  /* 0x0098 */ void* PullStateFunc[7] /* function */;
  /* 0x0108 */ void* PushStateFunc[6] /* function */;
}; /* size: 0x0168 */

class CPipeProxy<long,&IID_IPipeLong,&IID_AsyncIPipeLong,IPipeLong,AsyncIPipeLong>
{
  /* 0x0008 */ struct IUnknown* m_pUnkOuter;
  /* 0x0010 */ long m_cRef;
  /* 0x0018 */ struct IPipeLong* m_pRealProxy;
  /* 0x0020 */ struct IUnknown* m_pPullCallObj;
  /* 0x0028 */ struct AsyncIPipeLong* m_pAsyncPullPipe;
  /* 0x0030 */ struct ISynchronize* m_pISyncPull;
  /* 0x0038 */ enum PULLSTATE m_PullState;
  /* 0x003c */ unsigned long m_cReadAhead;
  /* 0x0040 */ unsigned long m_cLastRead;
  /* 0x0044 */ unsigned long m_cKeepBufferSize;
  /* 0x0048 */ long* m_pKeepBuffer;
  /* 0x0050 */ unsigned long m_cKeepDataSize;
  /* 0x0058 */ long* m_pKeepData;
  /* 0x0060 */ struct IUnknown* m_pPushCallObj;
  /* 0x0068 */ struct AsyncIPipeLong* m_pAsyncPushPipe;
  /* 0x0070 */ struct ISynchronize* m_pISyncPush;
  /* 0x0078 */ enum PUSHSTATE m_PushState;
  /* 0x007c */ unsigned long m_cPushBufferSize;
  /* 0x0080 */ long* m_pPushBuffer;
  /* 0x0088 */ unsigned long m_cFreeSpace;
  /* 0x0090 */ long* m_pFreeSpace;
  /* 0x0098 */ void* PullStateFunc[7] /* function */;
  /* 0x0108 */ void* PushStateFunc[6] /* function */;
}; /* size: 0x0168 */

class CPipeProxy<unsigned char,&IID_IPipeByte,&IID_AsyncIPipeByte,IPipeByte,AsyncIPipeByte>
{
  /* 0x0008 */ struct IUnknown* m_pUnkOuter;
  /* 0x0010 */ long m_cRef;
  /* 0x0018 */ struct IPipeByte* m_pRealProxy;
  /* 0x0020 */ struct IUnknown* m_pPullCallObj;
  /* 0x0028 */ struct AsyncIPipeByte* m_pAsyncPullPipe;
  /* 0x0030 */ struct ISynchronize* m_pISyncPull;
  /* 0x0038 */ enum PULLSTATE m_PullState;
  /* 0x003c */ unsigned long m_cReadAhead;
  /* 0x0040 */ unsigned long m_cLastRead;
  /* 0x0044 */ unsigned long m_cKeepBufferSize;
  /* 0x0048 */ unsigned char* m_pKeepBuffer;
  /* 0x0050 */ unsigned long m_cKeepDataSize;
  /* 0x0058 */ unsigned char* m_pKeepData;
  /* 0x0060 */ struct IUnknown* m_pPushCallObj;
  /* 0x0068 */ struct AsyncIPipeByte* m_pAsyncPushPipe;
  /* 0x0070 */ struct ISynchronize* m_pISyncPush;
  /* 0x0078 */ enum PUSHSTATE m_PushState;
  /* 0x007c */ unsigned long m_cPushBufferSize;
  /* 0x0080 */ unsigned char* m_pPushBuffer;
  /* 0x0088 */ unsigned long m_cFreeSpace;
  /* 0x0090 */ unsigned char* m_pFreeSpace;
  /* 0x0098 */ void* PullStateFunc[7] /* function */;
  /* 0x0108 */ void* PushStateFunc[6] /* function */;
}; /* size: 0x0168 */

class CPipeProxyImp
{
  /* 0x0008 */ long m_cRef;
  /* 0x0010 */ struct IUnknown* m_pUnkOuter;
  /* 0x0018 */ struct IUnknown* m_pRealPipeProxy;
  /* 0x0020 */ struct IUnknown* m_pInternalPipeProxy;
  /* 0x0028 */ struct IRpcProxyBuffer* m_pInternalPB;
  /* 0x0030 */ struct _GUID m_IidOfPipe;
}; /* size: 0x0040 */

struct CPlex
{
  /* 0x0000 */ struct CPlex* pNext;
  /* 0x0008 */ unsigned int nMax;
  /* 0x000c */ unsigned int nCur;
}; /* size: 0x0010 */

class CPoint
{
  /* 0x0000 */ struct tagPOINT _pt;
}; /* size: 0x0008 */

class CPointerHashTable
{
}; /* size: 0x0028 */

class CPointerMoniker
{
  /* 0x0030 */ struct IUnknown* m_pUnk;
}; /* size: 0x0038 */

class CPolicySet
{
  /* 0x0008 */ struct SHashChain _chain;
  /* 0x0018 */ unsigned long _dwFlags;
  /* 0x001c */ unsigned long _cRefs;
  /* 0x0020 */ unsigned long _cPolicies;
  /* 0x0024 */ unsigned long _dwAptID;
  /* 0x0028 */ class CObjectContext* _pClientCtx;
  /* 0x0030 */ class CObjectContext* _pServerCtx;
  /* 0x0038 */ struct tagPolicyEntry* _pFirstEntry;
  /* 0x0040 */ struct tagPolicyEntry* _pLastEntry;
  /* 0x0048 */ struct tagSPSCache _PSCache;
  union
  {
    /* 0x0000 */ class CPageAllocator s_PSallocator;
    /* 0x0000 */ class CPageAllocator s_PEallocator;
    /* 0x0000 */ int s_fInitialized;
    /* 0x0000 */ unsigned long s_cObjects;
  }; /* size: 0x0068 */
}; /* size: 0x0068 */

class CPres
{
  /* 0x0000 */ class CFormat m_format;
  /* 0x0030 */ unsigned long m_ulHeight;
  /* 0x0034 */ unsigned long m_ulWidth;
  /* 0x0038 */ class CData m_data;
}; /* size: 0x0058 */

class CPrivAlloc
{
}; /* size: 0x0001 */

class CPrivDragDrop
{
  /* 0x0008 */ unsigned long _ulRefCnt;
}; /* size: 0x0010 */

class CProcGen
{
  /* 0x0000 */ const unsigned char* _pProcFormatString;
  /* 0x0008 */ unsigned short _offset;
  /* 0x000a */ unsigned short _stackSize;
  /* 0x000c */ unsigned long _clientBufferSize;
  /* 0x0010 */ unsigned long _serverBufferSize;
  /* 0x0014 */ int _fClientMustSize;
  /* 0x0018 */ int _fServerMustSize;
  /* 0x001c */ int _fClientCorrCheck;
  /* 0x0020 */ int _fServerCorrCheck;
  /* 0x0024 */ unsigned short _usFloatArgMask;
  /* 0x0026 */ unsigned short _usFloatSlots;
  /* 0x0028 */ class CTypeGen* _pTypeGen;
}; /* size: 0x0030 */

enum CProcGen::AnalyzeFloatTypes::__l2::FloatType
{
  NonFloat = 0,
  Single = 1,
  Double = 2,
  DualSingle = 3,
};

class CProcessActivator
{
}; /* size: 0x0008 */

class CProcessExtensionTbl
{
  /* 0x0000 */ class CExtHashTable _HashTbl;
  /* 0x0028 */ class CPageAllocator _palloc;
}; /* size: 0x0090 */

class CProcessPatternTbl
{
  /* 0x0000 */ class CPatternTbl* m_pPatTbl;
  /* 0x0008 */ class CScmPatternTbl* m_pScmPatTbl;
}; /* size: 0x0010 */

class CProcessSecret
{
  union
  {
    /* 0x0000 */ struct _GUID s_guidOle32Secret;
    /* 0x0000 */ int s_fSecretInit;
    /* 0x0000 */ class COleStaticMutexSem s_SecretLock;
  }; /* size: 0x0050 */
}; /* size: 0x0001 */

class CPropSetName
{
  /* 0x0000 */ wchar_t _oszName[32];
}; /* size: 0x0040 */

class CPropertyBagEx
{
  /* 0x0010 */ int _fLcidInitialized : 1; /* bit position: 0 */
  /* 0x0014 */ unsigned long _lcid;
  /* 0x0018 */ struct IPropertySetStorage* _ppropsetstgContainer;
  /* 0x0020 */ struct IPropertyStorage* _ppropstg;
  /* 0x0028 */ struct IBlockingLock* _pBlockingLock;
  /* 0x0030 */ unsigned long _grfMode;
  /* 0x0034 */ long _cRefs;
}; /* size: 0x0038 */

class CPropertySetStorage
{
  /* 0x0008 */ struct IStorage* _pstg;
  /* 0x0010 */ struct IBlockingLock* _pBlockingLock;
  /* 0x0018 */ unsigned long _ulSig;
  /* 0x001c */ int _fContainingStgIsRefed : 1; /* bit position: 0 */
  /* 0x0020 */ enum MAPPED_STREAM_OPTS _MSOpts;
  /* 0x0024 */ long _cReferences;
}; /* size: 0x0028 */

class CPropertySetStream
{
  /* 0x0000 */ struct tagPROPERTYSETHEADER* _pph;
  /* 0x0008 */ unsigned long _oSection;
  /* 0x000c */ unsigned long _cSection;
  /* 0x0010 */ unsigned short _CodePage;
  /* 0x0012 */ unsigned char _Flags;
  /* 0x0013 */ unsigned char _State;
  /* 0x0014 */ unsigned long _Locale;
  /* 0x0018 */ unsigned long _grfBehavior;
  /* 0x001c */ unsigned long _cbTail;
  /* 0x0020 */ class PMemoryAllocator* _pma;
  /* 0x0028 */ class IMappedStream* _pmstm;
}; /* size: 0x0030 */

class CPropertyStorage
{
  /* 0x0008 */ unsigned long _ulSig;
  /* 0x000c */ long _cRefs;
  /* 0x0010 */ struct IStorage* _pstgPropSet;
  /* 0x0018 */ struct IStream* _pstmPropSet;
  /* 0x0020 */ class CPropertySetStream* _np;
  /* 0x0028 */ class IMappedStream* _ms;
  /* 0x0030 */ enum MAPPED_STREAM_OPTS _fMSOpts;
  /* 0x0034 */ int _fInitCriticalSection;
  /* 0x0038 */ struct _RTL_CRITICAL_SECTION _CriticalSection;
  struct /* bitfield */
  {
    /* 0x0060 */ int _fUserDefinedProperties : 1; /* bit position: 0 */
    /* 0x0060 */ int _fExplicitelyProbedForWriteAccess : 1; /* bit position: 1 */
  }; /* bitfield */
  /* 0x0064 */ unsigned short _usCodePage;
  /* 0x0068 */ unsigned long _dwOSVersion;
  /* 0x006c */ unsigned long _grfFlags;
  /* 0x0070 */ unsigned long _grfMode;
  /* 0x0078 */ class CCoTaskAllocator _cCoTaskAllocator;
}; /* size: 0x0080 */

enum CPropertyStorage::EInitializePropertyStream
{
  OPEN_PROPSTREAM = 0,
  CREATE_PROPSTREAM = 1,
  DELETE_PROPSTREAM = 2,
};

enum CPropertyStorage::EIsWriteable
{
  PROBE_IF_NECESSARY = 0,
  DO_NOT_PROBE = 1,
};

class CPtrBlock
{
  /* 0x0000 */ int _cPtrs;
  /* 0x0008 */ class CPtrBlock* _pbNext;
  /* 0x0010 */ void* _apv[50];
}; /* size: 0x01a0 */

class CPtrCache
{
  /* 0x0000 */ class CPtrBlock _pbFirst;
  /* 0x01a0 */ class CPtrBlock* _pbHead;
  /* 0x01a8 */ class CPtrBlock* _pbEnum;
  /* 0x01b0 */ int _iEnum;
}; /* size: 0x01b8 */

class CPubDocFile
{
  /* 0x0058 */ class CTSSet _tss;
  /* 0x0060 */ class CBasedPubDocFilePtr _pdfParent;
  /* 0x0068 */ class CBasedDocFilePtr _pdf;
  /* 0x0070 */ class CChildInstanceList _cilChildren;
  /* 0x0078 */ unsigned short _cTransactedDepth;
  /* 0x007a */ unsigned short _wFlags;
  /* 0x0080 */ class CBasedMStreamPtr _pmsBase;
  /* 0x0088 */ unsigned long _sigMSF;
  /* 0x008c */ long _cReferences;
  /* 0x0090 */ class CBasedDFBasisPtr _pdfb;
}; /* size: 0x0098 */

class CPubMappedStream
{
  /* 0x0000 */ class CBasedPubStreamPtr _pst;
  /* 0x0008 */ class CBasedBytePtr _pb;
  /* 0x0010 */ class CBasedBytePtr _powner;
  /* 0x0018 */ unsigned long _cbUsed;
  /* 0x001c */ unsigned long _cbOriginalStreamSize;
  /* 0x0020 */ unsigned char _fDirty;
}; /* size: 0x0028 */

class CPubStream
{
  /* 0x0058 */ class CBasedSStreamPtr _psParent;
  /* 0x0060 */ class CBasedPubDocFilePtr _ppdfParent;
  /* 0x0068 */ int _fDirty;
  /* 0x006c */ long _cReferences;
  /* 0x0070 */ class CPubMappedStream _PubMappedStream;
}; /* size: 0x0098 */

class CPunkForRelease
{
  /* 0x0008 */ unsigned long _cRefs;
  /* 0x000c */ unsigned long _fTopLayerMFP : 1; /* bit position: 0 */
  /* 0x0010 */ struct tagSTGMEDIUM _stgmed;
  /* 0x0028 */ struct IUnknown* _pUnkForRelease;
}; /* size: 0x0030 */

struct CREATE_USN_JOURNAL_DATA
{
  /* 0x0000 */ unsigned __int64 MaximumSize;
  /* 0x0008 */ unsigned __int64 AllocationDelta;
}; /* size: 0x0010 */

class CRGTypeSizes
{
  union
  {
    /* 0x0000 */ const unsigned char* m_ucTypeSizesA /* zero-length array */;
    /* 0x0000 */ const unsigned char* m_ucTypeSizesB /* zero-length array */;
  }; /* size: 0x0001 */
}; /* size: 0x0001 */

class CRIFTable
{
  union
  {
    /* 0x0000 */ int _fPreFilled;
    /* 0x0000 */ class CUUIDHashTable _HashTbl;
    /* 0x0000 */ class CPageAllocator _palloc;
    /* 0x0000 */ class COleStaticMutexSem _mxs;
  }; /* size: 0x0068 */
}; /* size: 0x0001 */

class CROIDTable
{
  union
  {
    /* 0x0000 */ unsigned long _cOidsToAdd;
    /* 0x0000 */ unsigned long _cOidsToRemove;
    /* 0x0000 */ struct SOIDRegistration _ClientOIDRegList;
    /* 0x0000 */ int _fWorker;
    /* 0x0000 */ unsigned long _dwSleepPeriod;
    /* 0x0000 */ class CUUIDHashTable _ClientRegisteredOIDs;
  }; /* size: 0x0050 */
}; /* size: 0x0001 */

class CROTItem
{
  /* 0x0000 */ unsigned short _wItemSig;
  /* 0x0004 */ int _fDontCallApp;
  /* 0x0008 */ struct _SCMREGKEY _scmregkey;
  /* 0x0018 */ unsigned long _hApt;
  /* 0x0020 */ void* _pvStubRegistration;
}; /* size: 0x0028 */

class CRWLock
{
  union
  {
    /* 0x0000 */ struct CRWLock::LockState _lockState;
    struct
    {
      /* 0x0000 */ volatile unsigned __int64 _ulLockState;
      /* 0x0008 */ volatile unsigned long _dwWriterSeqNum;
      /* 0x000c */ volatile unsigned long _dwWriterID;
      /* 0x0010 */ unsigned short _wFlags;
      /* 0x0012 */ unsigned short _wWriterLevel;
      union
      {
        /* 0x0018 */ struct CRWLock::EventState _eventState;
        struct
        {
          /* 0x0018 */ volatile unsigned long _dwEventState;
          /* 0x001c */ volatile unsigned long _dwHighPart;
        }; /* size: 0x0008 */
        /* 0x0018 */ class EventPoolEntry* volatile _pPoolEntry;
      }; /* size: 0x0008 */
    }; /* size: 0x001c */
    /* 0x0000 */ unsigned long s_dwDefaultTimeout;
    /* 0x0000 */ unsigned long s_dwDefaultSpinCount;
    /* 0x0000 */ unsigned long s_dwNumberOfProcessors;
  }; /* size: 0x001c */
}; /* size: 0x0020 */

struct CRWLock::EventState
{
  struct /* bitfield */
  {
    /* 0x0000 */ volatile unsigned long _entryIsEventMask : 1; /* bit position: 0 */
    /* 0x0000 */ volatile unsigned long _entryIsMarkedForPooling : 1; /* bit position: 1 */
    /* 0x0000 */ volatile unsigned long _entryIsBeingPooled : 1; /* bit position: 2 */
    /* 0x0000 */ volatile unsigned long _readerEventBeingSignaled : 1; /* bit position: 3 */
    /* 0x0000 */ volatile unsigned long _readerEventBeingReset : 1; /* bit position: 4 */
    /* 0x0000 */ volatile unsigned long _readerCountIsSignalCount : 1; /* bit position: 5 */
    /* 0x0000 */ volatile unsigned long _readerCount : 25; /* bit position: 6 */
    /* 0x0000 */ volatile unsigned long _writerEventSignaled : 1; /* bit position: 31 */
  }; /* bitfield */
}; /* size: 0x0004 */

union CRWLock::GetPoolEntry::__l2::EventStatePoolEntry
{
  union
  {
    struct
    {
      /* 0x0000 */ volatile unsigned long dwEventState;
      /* 0x0004 */ volatile unsigned long dwHighPart;
    }; /* size: 0x0008 */
    /* 0x0000 */ class EventPoolEntry* volatile pPoolEntry;
  }; /* size: 0x0008 */
}; /* size: 0x0008 */

struct CRWLock::LockState
{
  struct /* bitfield */
  {
    /* 0x0000 */ volatile unsigned __int64 _numReaders : 20; /* bit position: 0 */
    /* 0x0000 */ volatile unsigned __int64 _writerPresent : 1; /* bit position: 20 */
    /* 0x0000 */ volatile unsigned __int64 _writerSignaled : 1; /* bit position: 21 */
    /* 0x0000 */ volatile unsigned __int64 _readerSignaled : 1; /* bit position: 22 */
    /* 0x0000 */ volatile unsigned __int64 _resetInProgress : 1; /* bit position: 23 */
    /* 0x0000 */ volatile unsigned __int64 _waitingReaders : 20; /* bit position: 24 */
    /* 0x0000 */ volatile unsigned __int64 _waitingWriters : 20; /* bit position: 44 */
  }; /* bitfield */
}; /* size: 0x0008 */

union CRWLock::ReleasePoolEntry::__l2::LockStatePoolEntry
{
  /* 0x0000 */ volatile unsigned __int64 ulLockState;
  union
  {
    struct
    {
      /* 0x0008 */ volatile unsigned long dwEventState;
      /* 0x000c */ volatile unsigned long dwHighPart;
    }; /* size: 0x0008 */
    /* 0x0008 */ class EventPoolEntry* volatile pPoolEntry;
  }; /* size: 0x0008 */
}; /* size: 0x0010 */

class CRandomNumberGenerator
{
  /* 0x0000 */ unsigned __int64 _hRngProv;
}; /* size: 0x0008 */

class CRefCache
{
  /* 0x0000 */ unsigned long _cRefs;
  /* 0x0004 */ unsigned long _cStrongItfs;
  /* 0x0008 */ unsigned long _cWeakItfs;
  /* 0x000c */ unsigned long _cTableStrong;
  /* 0x0010 */ unsigned long _cIRCs;
  /* 0x0018 */ struct IRCEntry* _pIRCList;
  /* 0x0020 */ struct SOIDRegistration _soidReg;
}; /* size: 0x0070 */

class CRefExportCount
{
  /* 0x0008 */ unsigned long m_cRefs;
  /* 0x000c */ unsigned long m_cExportCount;
  /* 0x0010 */ unsigned long m_IsZombie;
  /* 0x0014 */ unsigned long m_Status;
  /* 0x0018 */ struct IUnknown* m_pUnkOuter;
}; /* size: 0x0020 */

enum CRefExportCount::tagTokens
{
  ALIVE = 0,
  KILL = 1,
  DEAD = 2,
};

class CRefMutexAutoLock
{
  /* 0x0000 */ class CRefMutexSem* m_pmxs;
}; /* size: 0x0008 */

class CRefMutexSem
{
  /* 0x0000 */ long m_lRefs;
  /* 0x0008 */ class CMutexSem2 m_mxs;
}; /* size: 0x0038 */

class CRefStabilize
{
  /* 0x0000 */ class CRefExportCount* m_pRefExportCount;
}; /* size: 0x0008 */

class CRefcountedObject
{
  /* 0x0000 */ unsigned long _cReferences;
}; /* size: 0x0004 */

class CRemoteUnknown
{
  /* 0x0008 */ class CStdIdentity* _pStdId;
}; /* size: 0x0010 */

class CRootPubDocFile
{
  /* 0x0098 */ unsigned long _ulPriLock;
  /* 0x00a0 */ struct IMalloc* const _pMalloc;
  /* 0x00a8 */ struct _FILETIME _timeModifyAtCommit;
}; /* size: 0x00b0 */

class CRotHintTable
{
  /* 0x0000 */ unsigned char* _pbHintArray;
}; /* size: 0x0008 */

class CRotMonikerEnum
{
  /* 0x0008 */ unsigned long _cRefs;
  /* 0x000c */ unsigned long _dwOffset;
  /* 0x0010 */ class CMonikerPtrBuf _mkptrbuf;
}; /* size: 0x0030 */

class CRpcCall
{
  /* 0x0018 */ unsigned long _cRefs;
  /* 0x0020 */ struct IUnknown*& _pIdentity;
  /* 0x0028 */ struct tagRPCOLEMESSAGE* _pMessage;
  /* 0x0030 */ const struct _GUID& _riid;
  /* 0x0038 */ HRESULT& _hrRet;
  /* 0x0040 */ enum _CALLSOURCE _callSource;
  /* 0x0044 */ HRESULT _ServerHR;
}; /* size: 0x0048 */

class CRpcChannelBuffer
{
  /* 0x0018 */ unsigned long _cRefs;
  /* 0x001c */ unsigned long state;
  /* 0x0020 */ class CChannelHandle* volatile _pRpcDefault;
  /* 0x0028 */ class CChannelHandle* _pRpcCustom;
  /* 0x0030 */ class OXIDEntry* _pOXIDEntry;
  /* 0x0038 */ struct tagIPIDEntry* _pIPIDEntry;
  /* 0x0040 */ void* _pInterfaceInfo;
  /* 0x0048 */ class CStdIdentity* _pStdId;
  /* 0x0050 */ class CDestObject _destObj;
}; /* size: 0x0060 */

class CRpcChannelBuffer::CServerCallMgr
{
  /* 0x0020 */ unsigned long _cRefs;
  /* 0x0024 */ unsigned long _dwState;
  /* 0x0028 */ struct _GUID _iid;
  /* 0x0038 */ struct _GUID _iidAsync;
  /* 0x0048 */ struct IUnknown* _pUnkStubCallMgr;
  /* 0x0050 */ struct IUnknown* _pUnkServerCallMgr;
  /* 0x0058 */ struct ISynchronize* _pSync;
  /* 0x0060 */ struct IRpcStubBuffer* _pSB;
  /* 0x0068 */ class CMessageCall* _pCall;
  /* 0x0070 */ class CStdIdentity* _pStdID;
}; /* size: 0x0078 */

typedef enum _TAG_UNNAMED_14
{
  STATE_WAITINGFORSIGNAL = 0,
  STATE_SIGNALED = 1,
  STATE_ERROR = 2,
} TAG_UNNAMED_14, *PTAG_UNNAMED_14;

class CRpcHelper
{
  /* 0x0008 */ unsigned long _cRefs;
}; /* size: 0x0010 */

class CRpcOptions
{
  /* 0x0008 */ class CStdIdentity* _pStdId;
  /* 0x0010 */ struct IUnknown* _pUnkOuter;
}; /* size: 0x0018 */

class CRpcResolver
{
  union
  {
    struct
    {
      /* 0x0000 */ class CFastBH* _fbhILocalObjectExporter;
      /* 0x0008 */ class CFastBH* _fbhIROT;
      /* 0x0010 */ class CFastBH* _fbhISCM;
      /* 0x0018 */ class CFastBH* _fbhIMachineActivatorControl;
    }; /* size: 0x0020 */
    /* 0x0000 */ void* _ph;
    /* 0x0000 */ unsigned long _dwFlags;
    /* 0x0000 */ class CDualStringArray* _pdsaLocalResolver;
    /* 0x0000 */ unsigned __int64 _dwCurrentBindingsID;
    /* 0x0000 */ struct _GUID _GuidRPCSSProcessIdentifier;
    /* 0x0000 */ class CMachineNamesHelper* _pMNHelper;
    /* 0x0000 */ unsigned long _cReservedOidsAvail;
    /* 0x0000 */ unsigned __int64 _OidsReserved[10];
    /* 0x0000 */ struct ISCMLocalActivator* _pSCMProxy;
    /* 0x0000 */ struct ISCMLocalActivator* _pCloakedSCMProxy;
    /* 0x0000 */ wchar_t* _pwszWinstaDesktop;
    /* 0x0000 */ wchar_t* _pwszFQDN;
    /* 0x0000 */ unsigned __int64 _ProcessSignature;
    /* 0x0000 */ void* _pNoRegLaunchPermissionsSD;
    /* 0x0000 */ void* _pNoRegAccessPermissionsSD;
    /* 0x0000 */ void* _pNoRegLaunchRestrictionsSD;
    /* 0x0000 */ void* _pNoRegAccessRestrictionsSD;
    /* 0x0000 */ void* _pDefaultAccessRestrictionsSD;
    /* 0x0000 */ void* _pSelfSid;
    /* 0x0000 */ class COleStaticMutexSem _mxsResolver;
    /* 0x0000 */ void* _hResolverWaitEvent;
  }; /* size: 0x0050 */
}; /* size: 0x0020 */

class CRpcThread
{
  /* 0x0000 */ void* _hWakeup;
  /* 0x0008 */ int _fDone;
  /* 0x0010 */ void* _fn /* function */;
  /* 0x0018 */ void* _param;
  /* 0x0020 */ class CRpcThread* _pNext;
  /* 0x0028 */ unsigned long _dwThreadID;
  /* 0x0030 */ struct HINSTANCE__* _hInstOle32;
}; /* size: 0x0038 */

class CRpcThreadCache
{
  union
  {
    /* 0x0000 */ class CRpcThread* _pFreeList;
    /* 0x0000 */ class COleStaticMutexSem _mxs;
  }; /* size: 0x0050 */
}; /* size: 0x0001 */

class CRtlSmartUcsEncoderTraits<_LUNICODE_STRING>
{
}; /* size: 0x0001 */

class CRtlSmartUcsEncoderTraits<_LUTF8_STRING>
{
}; /* size: 0x0001 */

class CRtlSmartUcsEncoderTraitsBase<CRtlSmartUcsEncoderTraits<_LUNICODE_STRING> >
{
}; /* size: 0x0001 */

class CRtlSmartUcsEncoderTraitsBase<CRtlSmartUcsEncoderTraits<_LUTF8_STRING> >
{
}; /* size: 0x0001 */

class CRunningObjectTable
{
  /* 0x0010 */ class CArrayFValue _afvRotList;
  /* 0x0028 */ class CCliRotHintTable _crht;
  /* 0x0038 */ unsigned short _wSigRotItem;
}; /* size: 0x0040 */

class CSCInnerUnknown
{
  /* 0x0008 */ unsigned long _iRefCount;
  /* 0x0010 */ class CSynchronizeContainer* _pParent;
}; /* size: 0x0018 */

class CSCMergedEnum<IEnumCATEGORYINFO,tagCATEGORYINFO>
{
  /* 0x0008 */ struct IEnumCATEGORYINFO** m_pcsEnum;
  /* 0x0010 */ unsigned long m_cTotalEnum;
  /* 0x0014 */ unsigned long m_dwRefCount;
  /* 0x0018 */ unsigned long m_CurrentEnum;
  /* 0x001c */ struct _GUID m_myiid;
}; /* size: 0x0030 */

class CSCMergedEnum<IEnumGUID,_GUID>
{
  /* 0x0008 */ struct IEnumGUID** m_pcsEnum;
  /* 0x0010 */ unsigned long m_cTotalEnum;
  /* 0x0014 */ unsigned long m_dwRefCount;
  /* 0x0018 */ unsigned long m_CurrentEnum;
  /* 0x001c */ struct _GUID m_myiid;
}; /* size: 0x0030 */

class CSSL
{
  union
  {
    /* 0x0000 */ unsigned __int64 _hProvider;
    /* 0x0000 */ void* _hMyStore;
    /* 0x0000 */ void* _hRootStore;
    /* 0x0000 */ const struct _CERT_CONTEXT* _pCert;
    /* 0x0000 */ HRESULT _hr;
  }; /* size: 0x0008 */
}; /* size: 0x0001 */

class CSSMappedStream
{
  /* 0x0008 */ long _cRefs;
  /* 0x0010 */ struct IStream* _pstm;
  /* 0x0018 */ unsigned char* _pbMappedStream;
  /* 0x0020 */ unsigned long _cbMappedStream;
  /* 0x0024 */ unsigned long _cbActualStreamSize;
  /* 0x0028 */ void* _powner;
  /* 0x0030 */ int _fDirty;
}; /* size: 0x0038 */

class CSTATPROPBAGArray
{
  /* 0x0000 */ long _cReferences;
  /* 0x0008 */ struct IEnumSTATPROPSTG* _penum;
  /* 0x0010 */ struct IBlockingLock* _pBlockingLock;
  /* 0x0018 */ wchar_t* _poszPrefix;
  /* 0x0020 */ unsigned long _dwFlags;
}; /* size: 0x0028 */

class CSTInnerUnknown
{
  /* 0x0008 */ unsigned long _iRefCount;
  /* 0x0010 */ class CStdEvent* _pParent;
}; /* size: 0x0018 */

class CSafeAccess
{
  /* 0x0000 */ class CDFBasis* _pdfb;
  /* 0x0008 */ class CPerContext* _ppc;
  /* 0x0010 */ int _fAccess;
}; /* size: 0x0018 */

class CSafeBYTEArray
{
  /* 0x0000 */ unsigned char* _p;
}; /* size: 0x0008 */

class CSafeBindCtx
{
  /* 0x0000 */ struct IBindCtx* _p;
}; /* size: 0x0008 */

class CSafeMarshaledStg
{
  /* 0x0000 */ struct IStorage* _pstg;
}; /* size: 0x0008 */

class CSafeMoniker
{
  /* 0x0000 */ struct IMoniker* _p;
}; /* size: 0x0008 */

class CSafeMultiHeap
{
  /* 0x0000 */ class CSmAllocator* _pSmAllocator;
  /* 0x0008 */ class CPerContext* _ppcPrev;
}; /* size: 0x0010 */

class CSafeRefCount
{
  /* 0x0008 */ unsigned long m_cRefs;
  /* 0x000c */ int m_fInDelete;
  /* 0x0010 */ struct IUnknown* m_pUnkOuter;
}; /* size: 0x0018 */

class CSafeSem
{
  /* 0x0000 */ long _sc;
  /* 0x0008 */ class CPerContext* _ppc;
  /* 0x0010 */ class CPerContext* _ppcPrev;
  /* 0x0018 */ class CSmAllocator* _pSmAllocator;
}; /* size: 0x0020 */

class CSafeStgMarshaled
{
  /* 0x0000 */ struct tagInterfaceData* _pIFD;
}; /* size: 0x0008 */

class CScmPatternTbl
{
  /* 0x0000 */ unsigned char* _pLocTbl;
}; /* size: 0x0008 */

class CSecurityDescriptor
{
  /* 0x0000 */ struct _SECURITY_DESCRIPTOR _sd;
}; /* size: 0x0028 */

class CSeekPointer
{
  /* 0x0000 */ unsigned __int64 _ulPos;
  /* 0x0008 */ long _cReferences;
}; /* size: 0x0010 */

class CServerContextActivator
{
}; /* size: 0x0008 */

class CServerSecurity
{
  union
  {
    /* 0x0000 */ class CPageAllocator _palloc;
    struct
    {
      /* 0x0000 */ class COleStaticMutexSem _mxs;
      /* 0x0018 */ unsigned long _iRefCount;
      /* 0x001c */ unsigned long _iFlags;
      /* 0x0020 */ class CChannelHandle* _pHandle;
      /* 0x0028 */ void* _hRpc;
      /* 0x0030 */ class CMessageCall* _pClientCall;
      /* 0x0038 */ void* _hSaved;
    }; /* size: 0x0078 */
  }; /* size: 0x0078 */
}; /* size: 0x0040 */

class CSessionMoniker
{
  /* 0x0030 */ unsigned long m_sessionid;
  /* 0x0034 */ int m_bUseConsoleSession;
  /* 0x0038 */ int m_bHaveBindOpts;
  /* 0x0040 */ struct tagBIND_OPTS2 m_bindopts2;
}; /* size: 0x0068 */

class CSharedMemHeader
{
  /* 0x0000 */ unsigned long _ulSize;
  /* 0x0004 */ unsigned long ulPad;
}; /* size: 0x0008 */

class CSharedMemoryBlock
{
  /* 0x0000 */ void* _hMem;
  /* 0x0008 */ unsigned char* _pbBase;
  /* 0x0010 */ unsigned long _culCommitSize;
  /* 0x0014 */ unsigned long _culInitCommitSize;
  /* 0x0018 */ int _fCreated;
  /* 0x001c */ int _fReadWrite;
}; /* size: 0x0020 */

class CSimpEnumSTATSTG
{
  /* 0x0008 */ unsigned long _cReferences;
  /* 0x0010 */ class CDfNameList* _pdfl;
  /* 0x0018 */ class CDfNameList* _pdflCurrent;
}; /* size: 0x0020 */

struct CSimpStorage
{
  /* 0x0038 */ long _cReferences;
  /* 0x0040 */ void* _hFile;
  /* 0x0048 */ int _fDirty;
  /* 0x004c */ class CMSFHeader _hdr;
  /* 0x0250 */ unsigned char* _pbBuf;
  /* 0x0258 */ unsigned long _sectMax;
  /* 0x025c */ struct _GUID _clsid;
  /* 0x0270 */ class CDfNameList* _pdfl;
  /* 0x0278 */ class CDfNameList* _pdflCurrent;
  /* 0x0280 */ unsigned long _cStreams;
  /* 0x0284 */ long __PADDING__[1];
}; /* size: 0x0288 */

class CSimpStorageOpen
{
  /* 0x0288 */ unsigned long _grfMode;
  /* 0x028c */ unsigned long _grfStateBits;
  /* 0x0290 */ wchar_t _awcsName[260];
}; /* size: 0x0498 */

struct CSimpStream
{
  /* 0x0010 */ long _cReferences;
  /* 0x0014 */ long _ulSeekStart;
  /* 0x0018 */ unsigned long _ulSeekPos;
  /* 0x0020 */ struct CSimpStorage* _pstgParent;
  /* 0x0028 */ void* _hFile;
}; /* size: 0x0030 */

class CSimpStreamOpen
{
  /* 0x0030 */ class CDfNameList* _pdfl;
  /* 0x0038 */ unsigned long _grfMode;
}; /* size: 0x0040 */

class CSinkList
{
  /* 0x0000 */ struct IProgressNotify* _ppn;
  /* 0x0008 */ unsigned long _dwCookie;
  /* 0x0010 */ class CSinkList* _pslNext;
}; /* size: 0x0018 */

class CSmAllocator
{
  /* 0x0008 */ class CSharedMemoryBlock* _psmb;
  /* 0x0010 */ unsigned char* _pbBase;
  /* 0x0018 */ class CPerContext* _ppcOwner;
  /* 0x0020 */ unsigned long _cbSize;
  /* 0x0024 */ unsigned long _ulHeapName;
  /* 0x0028 */ unsigned long _cRefs;
}; /* size: 0x0030 */

class CSplit_QI
{
  /* 0x0000 */ struct tagMInterfacePointer* SomePMItfPtrs[2];
  /* 0x0010 */ HRESULT SomeHRs[2];
  /* 0x0018 */ struct _GUID SomeIIDs[2];
  /* 0x0038 */ unsigned long _dwCount;
  /* 0x0040 */ char* _pAllocBlock;
  /* 0x0048 */ struct tagMInterfacePointer** _pItfArray;
  /* 0x0050 */ HRESULT* _pHrArray;
  /* 0x0058 */ struct _GUID* _pIIDArray;
}; /* size: 0x0060 */

class CSpyTable
{
  /* 0x0000 */ unsigned long m_cAllocations;
  /* 0x0008 */ struct AENTRY* m_table;
  /* 0x0010 */ unsigned long m_cEntries;
}; /* size: 0x0018 */

class CSrvCallState
{
  /* 0x0000 */ unsigned long _dwCallCatIn;
  /* 0x0008 */ class CSrvCallState* _pPrev;
}; /* size: 0x0010 */

class CStabilize
{
  /* 0x0000 */ class CSafeRefCount* m_pSafeRefCount;
}; /* size: 0x0008 */

class CStackBuffer
{
  /* 0x0000 */ unsigned char* _pbHeapBuf;
  /* 0x0008 */ unsigned long _cElements;
  /* 0x0010 */ unsigned char* _pbStackBuf;
  /* 0x0018 */ unsigned long _cbElement;
}; /* size: 0x0020 */

class CStackWalker
{
  /* 0x0008 */ long m_cRef;
  /* 0x0010 */ void* m_hProcess;
}; /* size: 0x0018 */

class CStackWalkerStack
{
  /* 0x0008 */ long m_cRef;
  /* 0x000c */ unsigned long m_dwFlags;
  /* 0x0010 */ class CStackWalkerSymbol* m_pTopSymbol;
}; /* size: 0x0018 */

class CStackWalkerSymbol
{
  /* 0x0008 */ long m_cRef;
  /* 0x0010 */ wchar_t* m_pwszModuleName;
  /* 0x0018 */ wchar_t* m_pwszSymbolName;
  /* 0x0020 */ unsigned __int64 m_dw64Displacement;
  /* 0x0028 */ unsigned __int64 m_dw64Address;
  /* 0x0030 */ class CStackWalkerSymbol* m_pNext;
}; /* size: 0x0038 */

class CStatArray
{
  /* 0x0000 */ long _cRefs;
  /* 0x0008 */ struct tagSTATPROPSTG* _psps;
  /* 0x0010 */ unsigned long _cpropActual;
}; /* size: 0x0018 */

class CStatData
{
  /* 0x0000 */ unsigned long m_ulFlags;
  /* 0x0008 */ struct tagFORMATETC m_foretc;
  /* 0x0028 */ unsigned long m_dwAdvf;
  /* 0x0030 */ struct IAdviseSink* m_pAdvSink;
  /* 0x0038 */ unsigned long m_dwConnID;
}; /* size: 0x0040 */

class CStaticWrapper
{
}; /* size: 0x0008 */

class CStaticWriteLock
{
  /* 0x0000 */ class CRWLock& _rwLock;
}; /* size: 0x0008 */

class CStdClassFactory
{
  /* 0x0008 */ unsigned long _cRefs;
  /* 0x000c */ unsigned long _dwIndex;
}; /* size: 0x0010 */

class CStdEvent
{
  /* 0x0010 */ class CSTInnerUnknown _cInner;
  /* 0x0028 */ struct IUnknown* _pControl;
  /* 0x0030 */ void* m_hEvent;
}; /* size: 0x0038 */

class CStdIdentity
{
  /* 0x0118 */ class CStdIdentity::CInternalUnk m_InternalUnk;
  /* 0x0128 */ unsigned long m_refs;
  /* 0x012c */ unsigned long m_flags;
  /* 0x0130 */ struct IUnknown* m_pUnkOuter;
  /* 0x0138 */ struct IUnknown* m_pUnkControl;
  /* 0x0140 */ void* m_pVtableAddress;
  /* 0x0148 */ struct IExternalConnection* m_pIEC;
  /* 0x0150 */ struct _GUID m_moid;
  /* 0x0160 */ unsigned long m_dwAptId;
  /* 0x0164 */ long m_cStrongRefs;
  /* 0x0168 */ long m_cWeakRefs;
  /* 0x016c */ HRESULT m_ConnStatus;
  /* 0x0170 */ void* m_pVoid;
}; /* size: 0x0178 */

class CStdIdentity::CInternalUnk
{
}; /* size: 0x0010 */

class CStdMarshal
{
  /* 0x0008 */ unsigned long _dwFlags;
  /* 0x000c */ long _cIPIDs;
  /* 0x0010 */ struct tagIPIDEntry* _pFirstIPID;
  /* 0x0018 */ class CStdIdentity* _pStdId;
  /* 0x0020 */ class CCtxComChnl* _pChnl;
  /* 0x0028 */ struct _GUID _clsidHandler;
  /* 0x0038 */ long _cNestedCalls;
  /* 0x003c */ long _cTableRefs;
  /* 0x0040 */ unsigned long _dwMarshalTime;
  /* 0x0048 */ struct IRemUnknown* _pSecureRemUnk;
  /* 0x0050 */ struct IUnknown* _pAsyncRelease;
  /* 0x0058 */ class CtxEntry* _pCtxEntryHead;
  /* 0x0060 */ class CtxEntry* _pCtxFreeList;
  /* 0x0068 */ struct _RTL_CRITICAL_SECTION _csCtxEntry;
  /* 0x0090 */ int _fCsInitialized;
  /* 0x0098 */ class CPolicySet* _pPS;
  /* 0x00a0 */ class CIDObject* _pID;
  /* 0x00a8 */ class CRefCache* _pRefCache;
  /* 0x00b0 */ struct CStdMarshal::DiscSinkNode _discHead;
  /* 0x00d0 */ unsigned long _dwLastCallTime;
}; /* size: 0x00d8 */

struct CStdMarshal::Deactivate::__l3::tagServerRefs
{
  /* 0x0000 */ struct IRpcStubBuffer* pRpcStub;
  /* 0x0008 */ void* pServer;
}; /* size: 0x0010 */

struct CStdMarshal::DiscSinkNode
{
  /* 0x0000 */ struct CStdMarshal::DiscSinkNode* pNext;
  /* 0x0008 */ struct CStdMarshal::DiscSinkNode* pPrev;
  /* 0x0010 */ struct IDisconnectSink* pSink;
  /* 0x0018 */ void* pvCookie;
}; /* size: 0x0020 */

struct CStdMarshal::DisconnectCliIPIDs::__l6::_IPIDReleaseSet;

struct CStdMarshal::Reactivate::__l3::tagServerRefs
{
  /* 0x0000 */ struct IRpcStubBuffer* pRpcStub;
  /* 0x0008 */ void** ppServer;
  /* 0x0010 */ struct _GUID* pIID;
}; /* size: 0x0018 */

class CStdWrapper
{
  /* 0x0008 */ unsigned long _dwState;
  /* 0x000c */ unsigned long _cRefs;
  /* 0x0010 */ unsigned long _cCalls;
  /* 0x0014 */ unsigned long _cIFaces;
  /* 0x0018 */ class IFaceEntry* _pIFaceHead;
  /* 0x0020 */ class CtxEntry* _pCtxEntryHead;
  /* 0x0028 */ class CtxEntry* _pCtxFreeList;
  /* 0x0030 */ struct IUnknown* _pServer;
  /* 0x0038 */ class CIDObject* _pID;
  /* 0x0040 */ void* _pVtableAddress;
  union
  {
    /* 0x0000 */ class CPageAllocator s_allocator;
    /* 0x0000 */ unsigned long s_cObjects;
    /* 0x0000 */ int s_fInitialized;
  }; /* size: 0x0068 */
}; /* size: 0x0048 */

struct CStdWrapper::Deactivate::__l3::tagServerRefs
{
  /* 0x0000 */ struct IRpcStubBuffer* pRpcStub;
  /* 0x0008 */ void* pServer;
}; /* size: 0x0010 */

struct CStdWrapper::Reactivate::__l3::tagServerRefs
{
  /* 0x0000 */ struct IRpcStubBuffer* pRpcStub;
  /* 0x0008 */ void** ppServer;
  /* 0x0010 */ struct _GUID* pIID;
}; /* size: 0x0018 */

class CStgHandle
{
}; /* size: 0x0010 */

class CStmBuf
{
  /* 0x0000 */ struct IStream* m_pStm;
  /* 0x0008 */ unsigned char m_aBuffer[256];
  /* 0x0108 */ unsigned char* m_pBuffer;
  /* 0x0110 */ unsigned long m_cBuffer;
}; /* size: 0x0118 */

class CStmBufRead
{
}; /* size: 0x0118 */

class CStmBufWrite
{
}; /* size: 0x0118 */

class CStmHandle
{
}; /* size: 0x0010 */

class CStreamCache
{
  /* 0x0000 */ struct SCacheEntry _ase[9];
  /* 0x0070 */ class CBasedDirectStreamPtr _pds;
  /* 0x0078 */ class CBasedMStreamPtr _pmsParent;
  /* 0x0080 */ unsigned long _sid;
  /* 0x0084 */ unsigned short _uHighCacheIndex;
  /* 0x0086 */ unsigned short _uNextCacheIndex;
  /* 0x0088 */ unsigned short _uCacheState;
}; /* size: 0x0090 */

struct CStreamChunk
{
  /* 0x0000 */ unsigned long oOld;
  /* 0x0004 */ long cbChange;
}; /* size: 0x0008 */

class CStreamChunkList
{
  /* 0x0000 */ unsigned long _cMaxChunks;
  /* 0x0004 */ unsigned long _cChunks;
  /* 0x0008 */ struct CStreamChunk* _ascnk;
  /* 0x0010 */ unsigned char _fDelete;
}; /* size: 0x0018 */

class CStreamOnMessage
{
  /* 0x0008 */ unsigned char* _pStartOfStream;
  /* 0x0010 */ unsigned char** _ppBuffer;
  /* 0x0018 */ unsigned long _cbMaxStreamLength;
  /* 0x001c */ unsigned long _ref_count;
}; /* size: 0x0020 */

class CStringHashTable
{
}; /* size: 0x0028 */

class CSurrogateActivator
{
  /* 0x0008 */ struct _GUID m_processGuid;
  /* 0x0018 */ int m_fServicesConfigured;
  /* 0x001c */ unsigned long m_dwObjectCountAtIdleTime;
  /* 0x0000 */ class CSurrogateActivator* s_pCSA;
}; /* size: 0x0020 */

class CSurrogateProcessActivator
{
  /* 0x0038 */ long m_lRC;
  /* 0x0040 */ void* m_hInitThread;
  /* 0x0048 */ void* m_hStopPingingSCM;
  union
  {
    struct
    {
      /* 0x0000 */ const int PING_INTERVAL;
      /* 0x0050 */ struct IComProcessInfo* m_pIComProcessInfo;
      /* 0x0058 */ struct IProcessServerInfo* m_pIProcessServerInfo;
      /* 0x0060 */ class CStdIdentity* m_pStdID;
      /* 0x0068 */ struct ISurrogate* m_pISurrogate;
      /* 0x0070 */ struct HINSTANCE__* m_hCOMSVCS;
      /* 0x0078 */ struct IServicesSink* m_pServices;
      /* 0x0080 */ void* m_hInitCompleted;
      /* 0x0088 */ void* m_hFusionContext;
      /* 0x0090 */ unsigned long m_ulServicesPing;
      /* 0x0094 */ unsigned long m_ulInitTimeout;
    }; /* size: 0x004c */
    struct
    {
      /* 0x0000 */ const int TIMEOUT_SERVICES;
      /* 0x0098 */ long m_lProcessRefCount;
      /* 0x00a0 */ struct _RTL_CRITICAL_SECTION m_timeoutLock;
      /* 0x00c8 */ int m_bLockValid;
      /* 0x00d0 */ void* m_hTimeoutEvent;
      /* 0x00d8 */ enum _TAG_UNNAMED_15 m_timeoutState;
      /* 0x00dc */ unsigned long m_cActivations;
      /* 0x00e0 */ unsigned long m_cMillisecondsTilDeath;
      /* 0x00e4 */ unsigned long m_cTimeoutPeriod;
      /* 0x00e8 */ int m_bPaused;
    }; /* size: 0x0050 */
    struct
    {
      /* 0x0000 */ const int TIMEOUT_SPINLOCK;
      /* 0x00ec */ int m_bInitNotified;
    }; /* size: 0x0008 */
    /* 0x0000 */ const int MAX_SRV_NAME_LEN;
  }; /* size: 0x0050 */
  /* 0x00f0 */ void* m_hNTServiceThread;
  /* 0x00f8 */ void* m_hServiceStarted;
  /* 0x0100 */ struct SERVICE_STATUS_HANDLE__* m_hNTServiceHandle;
  /* 0x0108 */ struct _SERVICE_STATUS m_NTServiceStatus;
  /* 0x0128 */ struct _RTL_CRITICAL_SECTION m_serviceStatusLock;
  /* 0x0150 */ int m_fServiceStatusLockValid;
  /* 0x0154 */ wchar_t m_NTServiceName[256];
}; /* size: 0x0358 */

typedef enum _TAG_UNNAMED_15
{
  TIMEOUT_INACTIVE = 0,
  TIMEOUT_PENDING = 1,
  TIMEOUT_SUSPENDED = 2,
  TIMEOUT_HAPPENING = 3,
  TIMEOUT_FORCED_SHUTDOWN = 4,
} TAG_UNNAMED_15, *PTAG_UNNAMED_15;

class CSurrogatedObjectList
{
  /* 0x0000 */ struct IOleInPlaceActiveObject* _pInplaceObject;
  /* 0x0008 */ struct HWND__* _hWnd;
  /* 0x0010 */ class CSurrogatedObjectList* _pNext;
}; /* size: 0x0018 */

class CSynchronizeContainer
{
  /* 0x0008 */ class CSCInnerUnknown _cInner;
  /* 0x0020 */ struct IUnknown* _pControl;
  /* 0x0028 */ unsigned long _lLast;
  /* 0x0030 */ void* _aEvent[63];
  /* 0x0228 */ struct ISynchronize* _aSync[63];
}; /* size: 0x0420 */

class CSystemException
{
  /* 0x0010 */ unsigned long _ulExcept;
}; /* size: 0x0018 */

class CTSSet
{
  /* 0x0000 */ class CBasedTSetMemberPtr _ptsmHead;
}; /* size: 0x0008 */

class CThreadCheck
{
  /* 0x0000 */ unsigned long m_tid;
}; /* size: 0x0004 */

class CThreadStack
{
  /* 0x0000 */ unsigned long m_dwCurrentPageSize;
  /* 0x0008 */ unsigned __int64 m_CurrentProcessDefaultStackCommit;
}; /* size: 0x0010 */

class CTmpMkEqBuf
{
  /* 0x0000 */ struct _MnkEqBuf _mkeqbuf;
  /* 0x0008 */ unsigned char _abData[2047];
}; /* size: 0x0808 */

class CTrackingCompositeMoniker
{
  /* 0x0008 */ class CCompositeMoniker* _pCCM;
}; /* size: 0x0010 */

class CTrackingFileMoniker
{
  /* 0x0008 */ class CFileMoniker* _pCFM;
}; /* size: 0x0010 */

class CTransactedStream
{
  /* 0x0070 */ unsigned __int64 _ulSize;
  /* 0x0078 */ class CBasedSStreamPtr _pssBase;
  /* 0x0080 */ unsigned long _sectLastUsed;
  /* 0x0088 */ class CDeltaList _dl;
  /* 0x00b8 */ unsigned long _df;
  /* 0x00bc */ int _fBeginCommit;
  /* 0x00c0 */ class CBasedDeltaListPtr _pdlOld;
  /* 0x00c8 */ unsigned __int64 _ulOldSize;
}; /* size: 0x00d0 */

class CTransactedTimeEntry
{
  /* 0x0000 */ struct _FILETIME _tt[3];
}; /* size: 0x0018 */

class CTry
{
  /* 0x0000 */ class CTry* _pPrevTry;
  /* 0x0008 */ int _StackTop;
}; /* size: 0x0010 */

class CTypeFactory
{
  /* 0x0010 */ long _cRefs;
}; /* size: 0x0018 */

class CTypeGen
{
  /* 0x0000 */ const unsigned char* _pTypeFormat;
  /* 0x0008 */ unsigned short _cbTypeFormat;
  /* 0x000a */ unsigned short _offset;
  /* 0x000c */ unsigned long _uStructSize;
}; /* size: 0x0010 */

class CTypeMarshal
{
  /* 0x0010 */ long _cRefs;
  /* 0x0014 */ unsigned long _offset;
  /* 0x0018 */ unsigned long _length;
  /* 0x0020 */ const unsigned char* _pFormatString;
  /* 0x0028 */ struct _MIDL_STUB_DESC _StubDesc;
}; /* size: 0x00c0 */

class CUUIDHashTable
{
}; /* size: 0x0028 */

class CUnwindable
{
}; /* size: 0x0001 */

class CUpdate
{
  /* 0x0000 */ class CDfName _dfnCurrent;
  /* 0x0042 */ class CDfName _dfnOriginal;
  /* 0x0084 */ unsigned long _dl;
  /* 0x0088 */ unsigned long _dwFlags;
  /* 0x0090 */ class CBasedTSetMemberPtr _ptsm;
  /* 0x0098 */ class CBasedUpdatePtr _pudNext;
  /* 0x00a0 */ class CBasedUpdatePtr _pudPrev;
}; /* size: 0x00a8 */

class CUpdateList
{
  /* 0x0000 */ class CBasedUpdatePtr _pudHead;
  /* 0x0008 */ class CBasedUpdatePtr _pudTail;
}; /* size: 0x0010 */

class CUrlMonWrapper
{
  /* 0x0008 */ long _cRef;
}; /* size: 0x0010 */

class CUserMarshalInfo
{
  /* 0x0000 */ long _RpcStatus;
  /* 0x0008 */ unsigned char* _pSuppliedBuffer;
  /* 0x0010 */ struct _NDR_USER_MARSHAL_INFO _MarshalInfo;
}; /* size: 0x0068 */

struct CVectBits
{
  /* 0x0000 */ unsigned short full : 1; /* bit position: 0 */
  /* 0x0002 */ unsigned short firstfree;
}; /* size: 0x0004 */

class CVerifierStackData
{
  union
  {
    /* 0x0000 */ unsigned long s_cProcessCapturedStacks;
    /* 0x0000 */ struct _LIST_ENTRY m_listHead;
  }; /* size: 0x0010 */
  /* 0x0010 */ unsigned long m_dwCount;
  /* 0x0014 */ unsigned long m_dwMissing;
}; /* size: 0x0018 */

struct CVerifierStackData::tagNode
{
  /* 0x0000 */ void** lpvStack;
  /* 0x0008 */ struct _LIST_ENTRY listEntry;
}; /* size: 0x0018 */

class CVerifierTlsData
{
  /* 0x0000 */ class CVerifierStackData stackComInit;
  /* 0x0018 */ class CVerifierStackData stackComUninit;
  /* 0x0030 */ class CVerifierStackData stackOLEInit;
  /* 0x0048 */ class CVerifierStackData stackOLEUninit;
  /* 0x0060 */ class CVerifierStackData stackEnterSWC;
  /* 0x0078 */ class CVerifierStackData stackLeaveSWC;
}; /* size: 0x0090 */

class CVirtualUnwindable
{
}; /* size: 0x0008 */

class CWorldSecurityDescriptor
{
  /* 0x0000 */ struct _SECURITY_DESCRIPTOR _sd;
  /* 0x0028 */ unsigned __int64 _acl[8];
}; /* size: 0x0068 */

class CWrappedDocFile
{
  /* 0x0070 */ unsigned long _df;
  /* 0x0078 */ class CBasedDocFilePtr _pdfBase;
  /* 0x0080 */ class CUpdateList _ulChanged;
  /* 0x0090 */ class CUpdateList _ulChangedHolder;
  /* 0x00a0 */ class CUpdateList _ulChangedOld;
  /* 0x00b0 */ class CTSSet _tssDeletedHolder;
  /* 0x00b8 */ class CTransactedTimeEntry _tten;
  /* 0x00d0 */ class CBasedPubDocFilePtr _ppubdf;
  /* 0x00d8 */ struct _GUID _clsid;
  /* 0x00e8 */ unsigned long _grfStateBits;
  /* 0x00f0 */ const class CBasedDFBasisPtr _pdfb;
  /* 0x00f8 */ unsigned short _fDirty;
  /* 0x00fa */ unsigned char _fBeginCommit;
}; /* size: 0x0100 */

class CallFrame
{
  /* 0x0010 */ struct MD_METHOD* m_pmd;
  /* 0x0018 */ void* m_pvArgs;
  /* 0x0020 */ int m_fIsCopy;
  /* 0x0024 */ int m_fIsUnmarshal;
  /* 0x0028 */ __int64 m_hrReturnValue;
  /* 0x0030 */ void* m_pvMemCur;
  /* 0x0038 */ void* m_pvArgsSrc;
  /* 0x0040 */ class Interceptor* m_pInterceptor;
  /* 0x0048 */ int m_fPropogatingOutParam;
  /* 0x004c */ int m_fWorkingOnInParam;
  /* 0x0050 */ int m_fWorkingOnOutParam;
  /* 0x0058 */ class CallFrame* m_pAllocatorFrame;
  /* 0x0060 */ struct ICallFrameWalker* m_pWalkerCopy;
  /* 0x0068 */ struct ICallFrameWalker* m_pWalkerFree;
  /* 0x0070 */ struct ICallFrameWalker* m_pWalkerWalk;
  /* 0x0078 */ unsigned char* m_StackTop;
  /* 0x0080 */ unsigned char* m_Memory;
  /* 0x0088 */ unsigned __int64 m_MaxCount;
  /* 0x0090 */ unsigned __int64 m_Offset;
  /* 0x0098 */ unsigned __int64 m_ActualCount;
  /* 0x00a0 */ struct ARRAY_INFO* m_pArrayInfo;
  /* 0x00a8 */ long m_refs;
  /* 0x00ac */ unsigned char m_pvMem[256];
  /* 0x01ac */ int m_fCanUseBuffer;
  /* 0x01b0 */ struct tagBLOB m_blobBuffer;
  /* 0x01c0 */ int m_fWeOwnBlobBuffer;
}; /* size: 0x01c8 */

typedef enum _TAG_UNNAMED_16
{
  CB_PRIVATE_BUFFER = 256,
} TAG_UNNAMED_16, *PTAG_UNNAMED_16;

class CarefulBufferReader
{
  /* 0x0000 */ unsigned char* pBuffer;
  /* 0x0008 */ unsigned __int64 cbBuffer;
}; /* size: 0x0010 */

struct CaseMapping
{
  /* 0x0000 */ unsigned short lower;
  /* 0x0002 */ unsigned short upper;
}; /* size: 0x0004 */

enum CasingBehavior
{
  CasingWin16 = 0,
  CasingNt4 = 1,
  CasingConformant = 2,
};

struct ClassMonikerData
{
  /* 0x0000 */ struct _GUID clsid;
  /* 0x0010 */ unsigned long cbExtra;
}; /* size: 0x0014 */

class ClassRegistration
{
  /* 0x0000 */ struct _GUID clsid;
  /* 0x0010 */ unsigned long serverType;
  /* 0x0018 */ struct HINSTANCE__* hModule;
  /* 0x0020 */ const wchar_t* className;
  /* 0x0028 */ const wchar_t* progID;
  /* 0x0030 */ const wchar_t* versionIndependentProgID;
  /* 0x0038 */ const wchar_t* threadingModel;
  /* 0x0040 */ struct _GUID appid;
  /* 0x0050 */ struct _GUID moduleid;
  /* 0x0060 */ int fCreateService;
}; /* size: 0x0068 */

enum ClassRegistration::SERVER_TYPE
{
  INPROC_SERVER = 1,
  LOCAL_SERVER = 4,
  INPROC_HANDLER = 2,
  SERVER_TYPE_NONE = 0,
};

struct CleanupStack
{
  /* 0x0000 */ struct CleanupStack::Block m_first;
  /* 0x0158 */ struct CleanupStack::Block* m_last;
}; /* size: 0x0160 */

struct CleanupStack::Block
{
  /* 0x0000 */ struct CleanupStack::memory_to_free mem[20];
  /* 0x0140 */ unsigned long count;
  /* 0x0148 */ struct CleanupStack::Block* prev;
  /* 0x0150 */ struct CleanupStack::Block* next;
}; /* size: 0x0158 */

struct CleanupStack::memory_to_free
{
  /* 0x0000 */ void* pvMemory;
  /* 0x0008 */ class PMemoryAllocator* pAllocator;
}; /* size: 0x0010 */

class CoAllocator
{
}; /* size: 0x0008 */

class ComPsClassFactory
{
  /* 0x0010 */ long m_crefs;
  /* 0x0018 */ struct IPSFactoryBuffer* m_pDelegatee;
  /* 0x0020 */ const struct tagProxyFileInfo** m_pProxyFileList;
}; /* size: 0x0028 */

class ComVerifierSettings
{
  union
  {
    /* 0x0000 */ int s_fComVerifierEnabled;
    /* 0x0000 */ int s_fEnableDllMainChecks;
    /* 0x0000 */ int s_fEnableBreakOnException;
    /* 0x0000 */ int s_fEnableVerifyLocks;
    /* 0x0000 */ int s_fEnableVerifyThreadState;
    /* 0x0000 */ int s_fEnableVerifySecurity;
    /* 0x0000 */ int s_fEnableVerifyProxies;
    /* 0x0000 */ int s_fEnableVerifyClassFactory;
    /* 0x0000 */ int s_fEnableObjectTracking;
    /* 0x0000 */ int s_fEnableVTBLTracking;
    /* 0x0000 */ int s_fUseSlowStackTraces;
    /* 0x0000 */ int s_fPgAllocUseSystemHeap;
    /* 0x0000 */ int s_fPgAllocHeapIsPrivate;
    /* 0x0000 */ int s_fCheckUnrecommendedUsageFromAPC;
    /* 0x0000 */ int s_fVerifyFatalExceptionHandlingDisabled;
    /* 0x0000 */ unsigned long s_ulMaxStackTracesPerThread;
    /* 0x0000 */ unsigned long s_ulMaxStackTracesPerProcess;
    /* 0x0000 */ class ComVerifierSettings s_singleton;
  }; /* size: 0x0004 */
}; /* size: 0x0001 */

struct CompObjHdr
{
  /* 0x0000 */ unsigned long m_dwFirstDword;
  /* 0x0004 */ unsigned long m_dwOSVer;
  /* 0x0008 */ unsigned long m_unused;
  /* 0x000c */ struct _GUID m_clsClass;
}; /* size: 0x001c */

class CompObjStmData
{
  /* 0x0000 */ struct CompObjHdr m_hdr;
  /* 0x001c */ unsigned long m_cchUserType;
  /* 0x0020 */ unsigned long m_cchProgID;
  /* 0x0024 */ unsigned long m_dwFormatTag;
  /* 0x0028 */ unsigned long m_ulFormatID;
  /* 0x0030 */ wchar_t* m_pszOUserType;
  /* 0x0038 */ wchar_t* m_pszOProgID;
  /* 0x0040 */ char* m_pszAUserType;
  /* 0x0048 */ char* m_pszAProgID;
  /* 0x0050 */ enum TXTTYPE ttClipString;
}; /* size: 0x0058 */

class ContextInfo
{
  /* 0x0028 */ struct tagActivationContextInfoData _contextInfoData;
  /* 0x0048 */ struct _GUID _ctxOverride;
  /* 0x0058 */ class CObjectContext* _pClientCtx;
  /* 0x0060 */ class CObjectContext* _pPrototypeCtx;
  /* 0x0068 */ int _toReleaseIFD;
}; /* size: 0x0070 */

class CpUnkList
{
  /* 0x0000 */ struct pUnkListElement* _head;
  /* 0x0008 */ class CMutexSem2 _mutex;
}; /* size: 0x0038 */

enum CreateStackTraceFlags
{
  CREATESTACKTRACE_ONLYADDRESSES = 1,
};

class CsCatInfo
{
  /* 0x0008 */ unsigned long m_uRefs;
  /* 0x000c */ unsigned long m_cCalls;
  /* 0x0010 */ struct ICatInformation** m_pICatInfo;
  /* 0x0018 */ unsigned long m_cICatInfo;
  /* 0x0020 */ struct HINSTANCE__* m_hInstCstore;
}; /* size: 0x0028 */

struct CsFrame
{
  /* 0x0000 */ unsigned __int64 SavedR10;
  /* 0x0008 */ unsigned __int64 SavedR11;
}; /* size: 0x0010 */

class CtxEntry
{
  union
  {
    struct
    {
      /* 0x0000 */ class CtxEntry* _pNext;
      /* 0x0008 */ class CtxEntry* _pFree;
      /* 0x0010 */ unsigned long _cRefs;
      /* 0x0018 */ class CContextLife* _pLife;
      /* 0x0020 */ class CPolicySet* _pPS;
      /* 0x0028 */ class CObjectContext* _pServerCtx;
    }; /* size: 0x002c */
    /* 0x0000 */ class CPageAllocator s_allocator;
    /* 0x0000 */ class COleStaticMutexSem s_allocLock;
    /* 0x0000 */ int s_fInitialized;
    /* 0x0000 */ unsigned long s_cEntries;
  }; /* size: 0x0068 */
}; /* size: 0x0030 */

enum DBASYNCHPHASEENUM
{
  DBASYNCHPHASE_INITIALIZATION = 0,
  DBASYNCHPHASE_POPULATION = 1,
  DBASYNCHPHASE_COMPLETE = 2,
  DBASYNCHPHASE_CANCELED = 3,
};

enum DBCOMPAREENUM
{
  DBCOMPARE_LT = 0,
  DBCOMPARE_EQ = 1,
  DBCOMPARE_GT = 2,
  DBCOMPARE_NE = 3,
  DBCOMPARE_NOTCOMPARABLE = 4,
};

enum DBEVENTPHASEENUM
{
  DBEVENTPHASE_OKTODO = 0,
  DBEVENTPHASE_ABOUTTODO = 1,
  DBEVENTPHASE_SYNCHAFTER = 2,
  DBEVENTPHASE_FAILEDTODO = 3,
  DBEVENTPHASE_DIDEVENT = 4,
};

enum DBINDEX_COL_ORDERENUM
{
  DBINDEX_COL_ORDER_ASC = 0,
  DBINDEX_COL_ORDER_DESC = 1,
};

enum DBKINDENUM
{
  DBKIND_GUID_NAME = 0,
  DBKIND_GUID_PROPID = 1,
  DBKIND_NAME = 2,
  DBKIND_PGUID_NAME = 3,
  DBKIND_PGUID_PROPID = 4,
  DBKIND_PROPID = 5,
  DBKIND_GUID = 6,
};

enum DBPOSITIONFLAGSENUM
{
  DBPOSITION_OK = 0,
  DBPOSITION_NOROW = 1,
  DBPOSITION_BOF = 2,
  DBPOSITION_EOF = 3,
};

enum DBPROPENUM20
{
  DBPROP_IMultipleResults = 217,
  DBPROP_DATASOURCE_TYPE = 251,
  MDPROP_AXES = 252,
  MDPROP_FLATTENING_SUPPORT = 253,
  MDPROP_MDX_JOINCUBES = 254,
  MDPROP_NAMED_LEVELS = 255,
  MDPROP_RANGEROWSET = 256,
  MDPROP_MDX_SLICER = 218,
  MDPROP_MDX_CUBEQUALIFICATION = 219,
  MDPROP_MDX_OUTERREFERENCE = 220,
  MDPROP_MDX_QUERYBYPROPERTY = 221,
  MDPROP_MDX_CASESUPPORT = 222,
  MDPROP_MDX_STRING_COMPOP = 224,
  MDPROP_MDX_DESCFLAGS = 225,
  MDPROP_MDX_SET_FUNCTIONS = 226,
  MDPROP_MDX_MEMBER_FUNCTIONS = 227,
  MDPROP_MDX_NUMERIC_FUNCTIONS = 228,
  MDPROP_MDX_FORMULAS = 229,
  MDPROP_AGGREGATECELL_UPDATE = 230,
  MDPROP_MDX_AGGREGATECELL_UPDATE = 230,
  MDPROP_MDX_OBJQUALIFICATION = 261,
  MDPROP_MDX_NONMEASURE_EXPRESSIONS = 262,
  DBPROP_ACCESSORDER = 231,
  DBPROP_BOOKMARKINFO = 232,
  DBPROP_INIT_CATALOG = 233,
  DBPROP_ROW_BULKOPS = 234,
  DBPROP_PROVIDERFRIENDLYNAME = 235,
  DBPROP_LOCKMODE = 236,
  DBPROP_MULTIPLECONNECTIONS = 237,
  DBPROP_UNIQUEROWS = 238,
  DBPROP_SERVERDATAONINSERT = 239,
  DBPROP_STORAGEFLAGS = 240,
  DBPROP_CONNECTIONSTATUS = 244,
  DBPROP_ALTERCOLUMN = 245,
  DBPROP_COLUMNLCID = 246,
  DBPROP_RESETDATASOURCE = 247,
  DBPROP_INIT_OLEDBSERVICES = 248,
  DBPROP_IRowsetRefresh = 249,
  DBPROP_SERVERNAME = 250,
  DBPROP_IParentRowset = 257,
  DBPROP_HIDDENCOLUMNS = 258,
  DBPROP_PROVIDERMEMORY = 259,
  DBPROP_CLIENTCURSOR = 260,
};

enum DBREASONENUM
{
  DBREASON_ROWSET_FETCHPOSITIONCHANGE = 0,
  DBREASON_ROWSET_RELEASE = 1,
  DBREASON_COLUMN_SET = 2,
  DBREASON_COLUMN_RECALCULATED = 3,
  DBREASON_ROW_ACTIVATE = 4,
  DBREASON_ROW_RELEASE = 5,
  DBREASON_ROW_DELETE = 6,
  DBREASON_ROW_FIRSTCHANGE = 7,
  DBREASON_ROW_INSERT = 8,
  DBREASON_ROW_RESYNCH = 9,
  DBREASON_ROW_UNDOCHANGE = 10,
  DBREASON_ROW_UNDOINSERT = 11,
  DBREASON_ROW_UNDODELETE = 12,
  DBREASON_ROW_UPDATE = 13,
  DBREASON_ROWSET_CHANGED = 14,
};

enum DBREASONENUM15
{
  DBREASON_ROWPOSITION_CHANGED = 15,
  DBREASON_ROWPOSITION_CHAPTERCHANGED = 16,
  DBREASON_ROWPOSITION_CLEARED = 17,
  DBREASON_ROW_ASYNCHINSERT = 18,
};

enum DBSORTENUM
{
  DBSORT_ASCENDING = 0,
  DBSORT_DESCENDING = 1,
};

enum DCOM_ENDPOINT_FLAGS
{
  fUseInternetPorts = 1,
};

struct DDEADVISE
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned short reserved : 14; /* bit position: 0 */
    /* 0x0000 */ unsigned short fDeferUpd : 1; /* bit position: 14 */
    /* 0x0000 */ unsigned short fAckReq : 1; /* bit position: 15 */
  }; /* bitfield */
  /* 0x0002 */ short cfFormat;
}; /* size: 0x0004 */

struct DDEDATA
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned short unused : 12; /* bit position: 0 */
    /* 0x0000 */ unsigned short fResponse : 1; /* bit position: 12 */
    /* 0x0000 */ unsigned short fRelease : 1; /* bit position: 13 */
    /* 0x0000 */ unsigned short reserved : 1; /* bit position: 14 */
    /* 0x0000 */ unsigned short fAckReq : 1; /* bit position: 15 */
  }; /* bitfield */
  /* 0x0002 */ short cfFormat;
  /* 0x0004 */ unsigned char Value[1];
  /* 0x0005 */ char __PADDING__[1];
}; /* size: 0x0006 */

struct DDEPOKE
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned short unused : 13; /* bit position: 0 */
    /* 0x0000 */ unsigned short fRelease : 1; /* bit position: 13 */
    /* 0x0000 */ unsigned short fReserved : 2; /* bit position: 14 */
  }; /* bitfield */
  /* 0x0002 */ short cfFormat;
  /* 0x0004 */ unsigned char Value[1];
  /* 0x0005 */ char __PADDING__[1];
}; /* size: 0x0006 */

class DDE_CHANNEL
{
  /* 0x0010 */ unsigned long m_cRefs;
  /* 0x0018 */ struct HWND__* hwndCli;
  /* 0x0020 */ struct HWND__* hwndSvr;
  /* 0x0028 */ int bTerminating;
  /* 0x002c */ int iExtraTerms;
  /* 0x0030 */ unsigned short wTimer;
  /* 0x0034 */ unsigned long dwStartTickCount;
  /* 0x0038 */ unsigned short msgFirst;
  /* 0x003a */ unsigned short msgLast;
  /* 0x0040 */ struct HWND__* msghwnd;
  /* 0x0048 */ int fRejected;
  /* 0x004c */ unsigned short wMsg;
  /* 0x0050 */ __int64 lParam;
  /* 0x0058 */ int iAwaitAck;
  /* 0x005c */ HRESULT hres;
  /* 0x0060 */ void* hopt;
  /* 0x0068 */ void* hDdePoke;
  /* 0x0070 */ void* hCommands;
  /* 0x0078 */ unsigned short wChannelDeleted;
  /* 0x0080 */ struct tagDDECALLDATA* pCD;
  /* 0x0088 */ enum tagSERVERCALLEX CallState;
  /* 0x008c */ int bFreedhopt;
}; /* size: 0x0090 */

enum DDE_DISPATCH_FUNC
{
  DDE_DISP_SENDONDATACHANGE = 1,
  DDE_DISP_OLECALLBACK = 2,
  DDE_DISP_SRVRWNDPROC = 3,
  DDE_DISP_DOCWNDPROC = 4,
};

enum DECOLOR
{
  DE_RED = 0,
  DE_BLACK = 1,
};

enum DEFAULTSAVEFOLDERTYPE
{
  DSFT_DETECT = 1,
  DSFT_PRIVATE = 2,
  DSFT_PUBLIC = 3,
};

struct DELETE_USN_JOURNAL_DATA
{
  /* 0x0000 */ unsigned __int64 UsnJournalID;
  /* 0x0008 */ unsigned long DeleteFlags;
  /* 0x000c */ long __PADDING__[1];
}; /* size: 0x0010 */

enum DESTLISTTYPE
{
  DLT_PINNED = 0,
  DLT_RECENT = 1,
  DLT_FREQUENT = 2,
};

enum DIRENTRYOP
{
  DEOP_FIND = 0,
  DEOP_REMOVE = 1,
};

class DISABLED_FEATURES
{
  union
  {
    /* 0x0000 */ int s_fDisableAll;
    /* 0x0000 */ int s_fDisableTypelibs;
    /* 0x0000 */ int s_fDisableDispatch;
    /* 0x0000 */ int s_fDisableAllForOle32;
    /* 0x0000 */ int s_fDisableDispatchForOle32;
    /* 0x0000 */ union _RTL_RUN_ONCE s_InitOnce;
  }; /* size: 0x0008 */
}; /* size: 0x0001 */

struct DISPATCH_CLIENT_FRAME
{
  /* 0x0058 */ int m_fDoneProxyPrecheck;
  /* 0x005c */ int m_fIsCopy;
  /* 0x0060 */ struct FRAME_RemoteInvoke m_remoteFrame;
  /* 0x00c0 */ struct tagDISPPARAMS m_dispParams;
  /* 0x00d8 */ struct tagVARIANT m_varResult;
  /* 0x00f0 */ struct tagEXCEPINFO m_excepInfo;
  /* 0x0130 */ unsigned int m_uArgErr;
  /* 0x0134 */ unsigned int m_aVarRefIdx[16];
  /* 0x0178 */ struct tagVARIANT m_aVarRef[16];
  /* 0x02f8 */ struct tagVARIANT m_aVarArg[16];
  /* 0x0478 */ unsigned char* m_pBuffer;
}; /* size: 0x0480 */

struct DISPATCH_FRAME
{
}; /* size: 0x0058 */

struct DISPATCH_INTERCEPTOR
{
}; /* size: 0x00d0 */

struct DISPATCH_SERVER_FRAME
{
  /* 0x0058 */ struct FRAME_Invoke m_memoryFrame;
  /* 0x00a0 */ int m_fDoneStubPrecheck;
  /* 0x00a4 */ int m_fDoneStubPostcheck;
}; /* size: 0x00a8 */

struct DISPLAYCONFIG_2DREGION
{
  /* 0x0000 */ unsigned int cx;
  /* 0x0004 */ unsigned int cy;
}; /* size: 0x0008 */

struct DISPLAYCONFIG_ADAPTER_NAME
{
  /* 0x0000 */ struct DISPLAYCONFIG_DEVICE_INFO_HEADER header;
  /* 0x0014 */ wchar_t adapterDevicePath[128];
}; /* size: 0x0114 */

struct DISPLAYCONFIG_DEVICE_INFO_HEADER
{
  /* 0x0000 */ enum DISPLAYCONFIG_DEVICE_INFO_TYPE type;
  /* 0x0004 */ unsigned int size;
  /* 0x0008 */ struct _LUID adapterId;
  /* 0x0010 */ unsigned int id;
}; /* size: 0x0014 */

enum DISPLAYCONFIG_DEVICE_INFO_TYPE
{
  DISPLAYCONFIG_DEVICE_INFO_GET_SOURCE_NAME = 1,
  DISPLAYCONFIG_DEVICE_INFO_GET_TARGET_NAME = 2,
  DISPLAYCONFIG_DEVICE_INFO_GET_TARGET_PREFERRED_MODE = 3,
  DISPLAYCONFIG_DEVICE_INFO_GET_ADAPTER_NAME = 4,
  DISPLAYCONFIG_DEVICE_INFO_SET_TARGET_PERSISTENCE = 5,
  DISPLAYCONFIG_DEVICE_INFO_FORCE_UINT32 = -1,
};

struct DISPLAYCONFIG_MODE_INFO
{
  /* 0x0000 */ enum DISPLAYCONFIG_MODE_INFO_TYPE infoType;
  /* 0x0004 */ unsigned int id;
  /* 0x0008 */ struct _LUID adapterId;
  union
  {
    /* 0x0010 */ struct DISPLAYCONFIG_TARGET_MODE targetMode;
    struct
    {
      /* 0x0010 */ struct DISPLAYCONFIG_SOURCE_MODE sourceMode;
      /* 0x0024 */ long __PADDING__[7];
    }; /* size: 0x0030 */
  }; /* size: 0x0030 */
}; /* size: 0x0040 */

enum DISPLAYCONFIG_MODE_INFO_TYPE
{
  DISPLAYCONFIG_MODE_INFO_TYPE_SOURCE = 1,
  DISPLAYCONFIG_MODE_INFO_TYPE_TARGET = 2,
  DISPLAYCONFIG_MODE_INFO_TYPE_FORCE_UINT32 = -1,
};

struct DISPLAYCONFIG_PATH_INFO
{
  /* 0x0000 */ struct DISPLAYCONFIG_PATH_SOURCE_INFO sourceInfo;
  /* 0x0014 */ struct DISPLAYCONFIG_PATH_TARGET_INFO targetInfo;
  /* 0x0044 */ unsigned int flags;
}; /* size: 0x0048 */

struct DISPLAYCONFIG_PATH_SOURCE_INFO
{
  /* 0x0000 */ struct _LUID adapterId;
  /* 0x0008 */ unsigned int id;
  /* 0x000c */ unsigned int modeInfoIdx;
  /* 0x0010 */ unsigned int statusFlags;
}; /* size: 0x0014 */

struct DISPLAYCONFIG_PATH_TARGET_INFO
{
  /* 0x0000 */ struct _LUID adapterId;
  /* 0x0008 */ unsigned int id;
  /* 0x000c */ unsigned int modeInfoIdx;
  /* 0x0010 */ enum DISPLAYCONFIG_VIDEO_OUTPUT_TECHNOLOGY outputTechnology;
  /* 0x0014 */ enum DISPLAYCONFIG_ROTATION rotation;
  /* 0x0018 */ enum DISPLAYCONFIG_SCALING scaling;
  /* 0x001c */ struct DISPLAYCONFIG_RATIONAL refreshRate;
  /* 0x0024 */ enum DISPLAYCONFIG_SCANLINE_ORDERING scanLineOrdering;
  /* 0x0028 */ int targetAvailable;
  /* 0x002c */ unsigned int statusFlags;
}; /* size: 0x0030 */

enum DISPLAYCONFIG_PIXELFORMAT
{
  DISPLAYCONFIG_PIXELFORMAT_8BPP = 1,
  DISPLAYCONFIG_PIXELFORMAT_16BPP = 2,
  DISPLAYCONFIG_PIXELFORMAT_24BPP = 3,
  DISPLAYCONFIG_PIXELFORMAT_32BPP = 4,
  DISPLAYCONFIG_PIXELFORMAT_NONGDI = 5,
  DISPLAYCONFIG_PIXELFORMAT_FORCE_UINT32 = -1,
};

struct DISPLAYCONFIG_RATIONAL
{
  /* 0x0000 */ unsigned int Numerator;
  /* 0x0004 */ unsigned int Denominator;
}; /* size: 0x0008 */

enum DISPLAYCONFIG_ROTATION
{
  DISPLAYCONFIG_ROTATION_IDENTITY = 1,
  DISPLAYCONFIG_ROTATION_ROTATE90 = 2,
  DISPLAYCONFIG_ROTATION_ROTATE180 = 3,
  DISPLAYCONFIG_ROTATION_ROTATE270 = 4,
  DISPLAYCONFIG_ROTATION_FORCE_UINT32 = -1,
};

enum DISPLAYCONFIG_SCALING
{
  DISPLAYCONFIG_SCALING_IDENTITY = 1,
  DISPLAYCONFIG_SCALING_CENTERED = 2,
  DISPLAYCONFIG_SCALING_STRETCHED = 3,
  DISPLAYCONFIG_SCALING_ASPECTRATIOCENTEREDMAX = 4,
  DISPLAYCONFIG_SCALING_CUSTOM = 5,
  DISPLAYCONFIG_SCALING_PREFERRED = 128,
  DISPLAYCONFIG_SCALING_FORCE_UINT32 = -1,
};

enum DISPLAYCONFIG_SCANLINE_ORDERING
{
  DISPLAYCONFIG_SCANLINE_ORDERING_UNSPECIFIED = 0,
  DISPLAYCONFIG_SCANLINE_ORDERING_PROGRESSIVE = 1,
  DISPLAYCONFIG_SCANLINE_ORDERING_INTERLACED = 2,
  DISPLAYCONFIG_SCANLINE_ORDERING_INTERLACED_UPPERFIELDFIRST = 2,
  DISPLAYCONFIG_SCANLINE_ORDERING_INTERLACED_LOWERFIELDFIRST = 3,
  DISPLAYCONFIG_SCANLINE_ORDERING_FORCE_UINT32 = -1,
};

struct DISPLAYCONFIG_SET_TARGET_PERSISTENCE
{
  /* 0x0000 */ struct DISPLAYCONFIG_DEVICE_INFO_HEADER header;
  union
  {
    struct /* bitfield */
    {
      /* 0x0014 */ unsigned int bootPersistenceOn : 1; /* bit position: 0 */
      /* 0x0014 */ unsigned int reserved : 31; /* bit position: 1 */
    }; /* bitfield */
    /* 0x0014 */ unsigned int value;
  }; /* size: 0x0004 */
}; /* size: 0x0018 */

struct DISPLAYCONFIG_SOURCE_DEVICE_NAME
{
  /* 0x0000 */ struct DISPLAYCONFIG_DEVICE_INFO_HEADER header;
  /* 0x0014 */ wchar_t viewGdiDeviceName[32];
}; /* size: 0x0054 */

struct DISPLAYCONFIG_SOURCE_MODE
{
  /* 0x0000 */ unsigned int width;
  /* 0x0004 */ unsigned int height;
  /* 0x0008 */ enum DISPLAYCONFIG_PIXELFORMAT pixelFormat;
  /* 0x000c */ struct _POINTL position;
}; /* size: 0x0014 */

struct DISPLAYCONFIG_TARGET_DEVICE_NAME
{
  /* 0x0000 */ struct DISPLAYCONFIG_DEVICE_INFO_HEADER header;
  /* 0x0014 */ struct DISPLAYCONFIG_TARGET_DEVICE_NAME_FLAGS flags;
  /* 0x0018 */ enum DISPLAYCONFIG_VIDEO_OUTPUT_TECHNOLOGY outputTechnology;
  /* 0x001c */ unsigned short edidManufactureId;
  /* 0x001e */ unsigned short edidProductCodeId;
  /* 0x0020 */ unsigned int connectorInstance;
  /* 0x0024 */ wchar_t monitorFriendlyDeviceName[64];
  /* 0x00a4 */ wchar_t monitorDevicePath[128];
}; /* size: 0x01a4 */

struct DISPLAYCONFIG_TARGET_DEVICE_NAME_FLAGS
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned int friendlyNameFromEdid : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned int friendlyNameForced : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned int edidIdsValid : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned int reserved : 29; /* bit position: 3 */
    }; /* bitfield */
    /* 0x0000 */ unsigned int value;
  }; /* size: 0x0004 */
}; /* size: 0x0004 */

struct DISPLAYCONFIG_TARGET_MODE
{
  /* 0x0000 */ struct DISPLAYCONFIG_VIDEO_SIGNAL_INFO targetVideoSignalInfo;
}; /* size: 0x0030 */

struct DISPLAYCONFIG_TARGET_PREFERRED_MODE
{
  /* 0x0000 */ struct DISPLAYCONFIG_DEVICE_INFO_HEADER header;
  /* 0x0014 */ unsigned int width;
  /* 0x0018 */ unsigned int height;
  /* 0x0020 */ struct DISPLAYCONFIG_TARGET_MODE targetMode;
}; /* size: 0x0050 */

enum DISPLAYCONFIG_TOPOLOGY_ID
{
  DISPLAYCONFIG_TOPOLOGY_INTERNAL = 1,
  DISPLAYCONFIG_TOPOLOGY_CLONE = 2,
  DISPLAYCONFIG_TOPOLOGY_EXTEND = 4,
  DISPLAYCONFIG_TOPOLOGY_EXTERNAL = 8,
  DISPLAYCONFIG_TOPOLOGY_FORCE_UINT32 = -1,
};

enum DISPLAYCONFIG_VIDEO_OUTPUT_TECHNOLOGY
{
  DISPLAYCONFIG_OUTPUT_TECHNOLOGY_OTHER = -1,
  DISPLAYCONFIG_OUTPUT_TECHNOLOGY_HD15 = 0,
  DISPLAYCONFIG_OUTPUT_TECHNOLOGY_SVIDEO = 1,
  DISPLAYCONFIG_OUTPUT_TECHNOLOGY_COMPOSITE_VIDEO = 2,
  DISPLAYCONFIG_OUTPUT_TECHNOLOGY_COMPONENT_VIDEO = 3,
  DISPLAYCONFIG_OUTPUT_TECHNOLOGY_DVI = 4,
  DISPLAYCONFIG_OUTPUT_TECHNOLOGY_HDMI = 5,
  DISPLAYCONFIG_OUTPUT_TECHNOLOGY_LVDS = 6,
  DISPLAYCONFIG_OUTPUT_TECHNOLOGY_D_JPN = 8,
  DISPLAYCONFIG_OUTPUT_TECHNOLOGY_SDI = 9,
  DISPLAYCONFIG_OUTPUT_TECHNOLOGY_DISPLAYPORT_EXTERNAL = 10,
  DISPLAYCONFIG_OUTPUT_TECHNOLOGY_DISPLAYPORT_EMBEDDED = 11,
  DISPLAYCONFIG_OUTPUT_TECHNOLOGY_UDI_EXTERNAL = 12,
  DISPLAYCONFIG_OUTPUT_TECHNOLOGY_UDI_EMBEDDED = 13,
  DISPLAYCONFIG_OUTPUT_TECHNOLOGY_SDTVDONGLE = 14,
  DISPLAYCONFIG_OUTPUT_TECHNOLOGY_INTERNAL = -2147483648,
  DISPLAYCONFIG_OUTPUT_TECHNOLOGY_FORCE_UINT32 = -1,
};

struct DISPLAYCONFIG_VIDEO_SIGNAL_INFO
{
  /* 0x0000 */ unsigned __int64 pixelRate;
  /* 0x0008 */ struct DISPLAYCONFIG_RATIONAL hSyncFreq;
  /* 0x0010 */ struct DISPLAYCONFIG_RATIONAL vSyncFreq;
  /* 0x0018 */ struct DISPLAYCONFIG_2DREGION activeSize;
  /* 0x0020 */ struct DISPLAYCONFIG_2DREGION totalSize;
  /* 0x0028 */ unsigned int videoStandard;
  /* 0x002c */ enum DISPLAYCONFIG_SCANLINE_ORDERING scanLineOrdering;
}; /* size: 0x0030 */

enum DISPLAYSETTINGEVENTTYPE
{
  DSET_DISPLAYDATA_LOADED = 1,
  DSET_PATH_CHANGED = 2,
  DSET_VIEW_ORDER_CHANGED = 4,
  DSET_LAYOUT_DEFER_START = 8,
  DSET_LAYOUT_DEFER_END = 16,
  DSET_VIEW_POSITION_CHANGED = 256,
  DSET_VIEW_RESOLUTION_CHANGED = 512,
  DSET_VIEW_COLOR_CHANGED = 1024,
  DSET_VIEW_FREQ_CHANGED = 2048,
  DSET_VIEW_ROTATION_CHANGED = 4096,
  DSET_VIEW_PRIMARY_CHANGED = 8192,
  DSET_VIEW_OTHERPROP_CHANGED = 0xffff8000,
  DSET_VIEW_PROPERTY_CHANGED = 0xffffbf00,
};

struct DLGITEMTEMPLATE
{
  /* 0x0000 */ unsigned long style;
  /* 0x0004 */ unsigned long dwExtendedStyle;
  /* 0x0008 */ short x;
  /* 0x000a */ short y;
  /* 0x000c */ short cx;
  /* 0x000e */ short cy;
  /* 0x0010 */ unsigned short id;
}; /* size: 0x0012 */

struct DLGTEMPLATE
{
  /* 0x0000 */ unsigned long style;
  /* 0x0004 */ unsigned long dwExtendedStyle;
  /* 0x0008 */ unsigned short cdit;
  /* 0x000a */ short x;
  /* 0x000c */ short y;
  /* 0x000e */ short cx;
  /* 0x0010 */ short cy;
}; /* size: 0x0012 */

struct DLL_INSTANTIATION_PROPERTIES
{
  /* 0x0000 */ wchar_t _pzDllPath[261];
  /* 0x020c */ unsigned long _dwThreadingModel;
  /* 0x0210 */ unsigned long _dwFlags;
  /* 0x0214 */ unsigned long _dwHash;
  /* 0x0218 */ unsigned long _dwContext;
  /* 0x0220 */ class CClassCache::CDllClassEntry* _pDCE;
}; /* size: 0x0228 */

enum DLL_INSTANTIATION_PROPERTIES::eFlags
{
  fSIXTEEN_BIT = 1,
  fIS_OLE32 = 8,
  fIS_COMSVCS_CLSID = 16,
};

struct DVTDINFO
{
  /* 0x0000 */ unsigned int cbConvertSize;
  /* 0x0004 */ unsigned int cchDrvName;
  /* 0x0008 */ unsigned int cchDevName;
  /* 0x000c */ unsigned int cchPortName;
}; /* size: 0x0010 */

struct DedicatedAllocator<CallFrame>
{
  /* 0x0000 */ union _SLIST_HEADER g_listHead;
  /* 0x0010 */ char __PADDING__[4294967281];
}; /* size: 0x0001 */

struct DedicatedAllocator<DISPATCH_CLIENT_FRAME>
{
  /* 0x0000 */ union _SLIST_HEADER g_listHead;
  /* 0x0010 */ char __PADDING__[4294967281];
}; /* size: 0x0001 */

struct DedicatedAllocator<DISPATCH_SERVER_FRAME>
{
  /* 0x0000 */ union _SLIST_HEADER g_listHead;
  /* 0x0010 */ char __PADDING__[4294967281];
}; /* size: 0x0001 */

class DefaultIBindStatusCallback
{
  /* 0x0020 */ struct IBindStatusCallback* m_pibsc;
  /* 0x0028 */ long m_lRef;
  /* 0x0030 */ struct IBinding* m_pBinding;
  /* 0x0038 */ struct HWND__* m_hwndParent;
  /* 0x0040 */ struct HWND__* m_hDlg;
  /* 0x0048 */ unsigned long m_ulProgress;
  /* 0x004c */ unsigned long m_ulProgressMax;
  /* 0x0050 */ wchar_t m_szStatusText[260];
  /* 0x0258 */ int m_fShown;
}; /* size: 0x0260 */

struct DelayLoadInfo
{
  /* 0x0000 */ unsigned long cb;
  /* 0x0008 */ const struct ImgDelayDescrV2* pidd;
  /* 0x0010 */ void** ppfn /* function */;
  /* 0x0018 */ const char* szDll;
  /* 0x0020 */ struct DelayLoadProc dlp;
  /* 0x0030 */ struct HINSTANCE__* hmodCur;
  /* 0x0038 */ void* pfnCur /* function */;
  /* 0x0040 */ unsigned long dwLastError;
  /* 0x0044 */ long __PADDING__[1];
}; /* size: 0x0048 */

struct DelayLoadProc
{
  /* 0x0000 */ int fImportByName;
  union
  {
    /* 0x0008 */ const char* szProcName;
    struct
    {
      /* 0x0008 */ unsigned long dwOrdinal;
      /* 0x000c */ long __PADDING__[1];
    }; /* size: 0x0008 */
  }; /* size: 0x0008 */
}; /* size: 0x0010 */

class DeserializeHelper
{
  union
  {
    struct
    {
      /* 0x0000 */ class PMemoryAllocator* c_pMA;
      /* 0x0008 */ unsigned int m_Flags;
      /* 0x000c */ unsigned long c_cbAlloc;
      /* 0x0010 */ struct CleanupStack c_cleanupStack;
      /* 0x0170 */ int m_fIndirect;
      /* 0x0174 */ unsigned int m_CodePage;
      union
      {
        /* 0x0178 */ struct tagPROPVARIANT m_pvDummy;
        /* 0x0178 */ struct tagCLIPDATA m_clipdataDummy;
      }; /* size: 0x0018 */
    }; /* size: 0x0190 */
    /* 0x0000 */ class DeserializeHelper::SafeArrayDestroyer c_saDestroyer;
    /* 0x0000 */ class DeserializeHelper::BstrDestroyer c_bstrDestroyer;
  }; /* size: 0x0190 */
}; /* size: 0x0190 */

class DeserializeHelper::BstrDestroyer
{
}; /* size: 0x0008 */

class DeserializeHelper::SafeArrayDestroyer
{
}; /* size: 0x0008 */

enum EChannelState
{
  client_cs = 1,
  proxy_cs = 2,
  server_cs = 4,
  freethreaded_cs = 8,
  process_local_cs = 32,
  locked_cs = 64,
  neutral_cs = 256,
  fake_async_cs = 512,
  app_security_cs = 1024,
  thread_local_cs = 2048,
  syntax_negotiate_cs = 4096,
};

enum EHandleState
{
  allow_hs = 1,
  deny_hs = 2,
  static_cloaking_hs = 4,
  dynamic_cloaking_hs = 8,
  any_cloaking_hs = 12,
  process_local_hs = 16,
  machine_local_hs = 32,
  app_security_hs = 64,
};

struct ENTRY
{
  /* 0x0000 */ const wchar_t* sz;
  /* 0x0008 */ const struct _GUID* pclsid;
}; /* size: 0x0010 */

enum ENUM_FILE_INFORMATION_CLASS
{
  ENUM_FILE_ID_BOTH_DIR_INFO = 0,
  ENUM_FILE_BOTH_DIR_INFO = 1,
  ENUM_FILE_FULL_DIR_INFO = 2,
};

enum EServerSecurity
{
  SS_PROCESS_LOCAL = 1,
  SS_CALL_DONE = 2,
  SS_WAS_IMPERSONATING = 4,
};

enum ESignalState
{
  none_ss = 0,
  pending_ss = 1,
  signaled_ss = 2,
  failed_ss = 3,
};

class EVENT
{
  /* 0x0000 */ void* m_hEvent;
}; /* size: 0x0008 */

struct EVENT_INSTANCE_INFO
{
  /* 0x0000 */ void* RegHandle;
  /* 0x0008 */ unsigned long InstanceId;
  /* 0x000c */ long __PADDING__[1];
}; /* size: 0x0010 */

struct EXECUTEACK
{
  /* 0x0000 */ int f;
  /* 0x0008 */ void* hdata;
  /* 0x0010 */ struct HWND__* hwndFrom;
  /* 0x0018 */ struct HWND__* hwndTo;
}; /* size: 0x0020 */

class Enum
{
}; /* size: 0x0008 */

class EnumMap<MAP_KEY_GUID,INTERFACE_HELPER_CLSID *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>
{
  /* 0x0008 */ class Map<MAP_KEY_GUID,INTERFACE_HELPER_CLSID *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>* m_pmap;
  /* 0x0010 */ class CLinkable* m_pLinkable;
}; /* size: 0x0018 */

class EnumMap<MAP_KEY_GUID,TYPEINFOVTBL *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>
{
  /* 0x0008 */ class Map<MAP_KEY_GUID,TYPEINFOVTBL *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>* m_pmap;
  /* 0x0010 */ class CLinkable* m_pLinkable;
}; /* size: 0x0018 */

struct EnumVerbCache
{
  /* 0x0000 */ class CEnumVerb* pEnum;
}; /* size: 0x0008 */

struct ErrorObjectData
{
  /* 0x0000 */ unsigned long dwVersion;
  /* 0x0004 */ unsigned long dwHelpContext;
  /* 0x0008 */ struct _GUID iid;
}; /* size: 0x0018 */

class EventPoolEntry
{
  union
  {
    /* 0x0000 */ struct CRWLock::EventState _eventState;
    struct
    {
      /* 0x0000 */ volatile unsigned long _dwEventState;
      /* 0x0004 */ volatile int _bReaderSignaled;
      /* 0x0008 */ void* _hReaderEvent;
      /* 0x0010 */ struct _SLIST_ENTRY _listEntry;
      /* 0x0020 */ void* _hWriterEvent;
      /* 0x0028 */ volatile unsigned long _dwSpinningWriterID;
    }; /* size: 0x002c */
    /* 0x0000 */ union _SLIST_HEADER s_eventPool;
    /* 0x0000 */ union EventPoolEntry::InitState s_initState;
  }; /* size: 0x002c */
}; /* size: 0x0030 */

union EventPoolEntry::InitState
{
  union
  {
    /* 0x0000 */ volatile unsigned __int64 _ulInitState;
    struct /* bitfield */
    {
      /* 0x0000 */ volatile unsigned __int64 _ulNumInitedRWThreads : 24; /* bit position: 0 */
      /* 0x0000 */ volatile unsigned __int64 _ulNumInitedRWLocks : 40; /* bit position: 24 */
    }; /* bitfield */
  }; /* size: 0x0008 */
}; /* size: 0x0008 */

enum EventPoolEntry::WaitForWriterEvent::__l2::AnyAbsorbtionState
{
  NONE = 0,
  ABSORBED = 1,
  RELEIVED = 2,
};

enum ExtentKeys
{
  mnk_MAC = 1,
  mnk_DFS = 2,
  mnk_UNICODE = 3,
  mnk_MacPathName = 4,
  mnk_ShellLink = 5,
  mnk_TrackingInformation = 6,
};

enum FFFP_MODE
{
  FFFP_EXACTMATCH = 0,
  FFFP_NEARESTPARENTMATCH = 1,
};

struct FILE_ID_DESCRIPTOR
{
  /* 0x0000 */ unsigned long dwSize;
  /* 0x0004 */ enum _FILE_ID_TYPE Type;
  union
  {
    /* 0x0008 */ union _LARGE_INTEGER FileId;
    /* 0x0008 */ struct _GUID ObjectId;
  }; /* size: 0x0010 */
}; /* size: 0x0018 */

enum FILE_USAGE_TYPE
{
  FUT_PLAYING = 0,
  FUT_EDITING = 1,
  FUT_GENERIC = 2,
};

struct FIND_BY_SID_DATA
{
  /* 0x0000 */ unsigned long Restart;
  /* 0x0004 */ struct _SID Sid;
}; /* size: 0x0010 */

struct FIND_BY_SID_OUTPUT
{
  /* 0x0000 */ unsigned long NextEntryOffset;
  /* 0x0004 */ unsigned long FileIndex;
  /* 0x0008 */ unsigned long FileNameLength;
  /* 0x000c */ wchar_t FileName[1];
  /* 0x000e */ char __PADDING__[2];
}; /* size: 0x0010 */

struct FLASHWINFO
{
  /* 0x0000 */ unsigned int cbSize;
  /* 0x0008 */ struct HWND__* hwnd;
  /* 0x0010 */ unsigned long dwFlags;
  /* 0x0014 */ unsigned int uCount;
  /* 0x0018 */ unsigned long dwTimeout;
  /* 0x001c */ long __PADDING__[1];
}; /* size: 0x0020 */

struct FMT
{
  /* 0x0000 */ unsigned short cf;
  /* 0x0004 */ unsigned long dw;
}; /* size: 0x0008 */

struct FMTCACHE
{
  /* 0x0000 */ struct tagFORMATETC fmt;
  /* 0x0020 */ unsigned long dwAspects;
  /* 0x0024 */ int fUseMe;
}; /* size: 0x0028 */

struct FORMATETCDATA
{
  /* 0x0000 */ struct tagFORMATETC _FormatEtc;
  /* 0x0020 */ int fSaveOnFlush;
  /* 0x0024 */ unsigned long dwReserved1;
  /* 0x0028 */ unsigned long dwReserved2;
  /* 0x002c */ long __PADDING__[1];
}; /* size: 0x0030 */

struct FORMATETCDATA32
{
  /* 0x0000 */ struct tagFORMATETC32 _FormatEtc;
  /* 0x0014 */ int fSaveOnFlush;
  /* 0x0018 */ unsigned long dwReserved1;
  /* 0x001c */ unsigned long dwReserved2;
}; /* size: 0x0020 */

struct FORMATETCDATAARRAY
{
  /* 0x0000 */ unsigned long _dwSig;
  /* 0x0004 */ unsigned long _dwSize;
  /* 0x0008 */ unsigned long _cRefs;
  /* 0x000c */ unsigned long _cFormats;
  /* 0x0010 */ unsigned long _dwMiscArrayFlags;
  /* 0x0014 */ int _fIs64BitArray;
  /* 0x0018 */ struct FORMATETCDATA _FormatEtcData[1];
}; /* size: 0x0048 */

struct FORMATETCDATAARRAY32
{
  /* 0x0000 */ unsigned long _dwSig;
  /* 0x0004 */ unsigned long _dwSize;
  /* 0x0008 */ unsigned long _cRefs;
  /* 0x000c */ unsigned long _cFormats;
  /* 0x0010 */ unsigned long _dwMiscArrayFlags;
  /* 0x0014 */ int _fIs64BitArray;
  /* 0x0018 */ struct FORMATETCDATA32 _FormatEtcData[1];
}; /* size: 0x0038 */

enum FORMATTAG
{
  ftagNone = 0,
  ftagClipFormat = 1,
  ftagString = 2,
};

enum FORMAT_CHARACTER
{
  FC_ZERO = 0,
  FC_BYTE = 1,
  FC_CHAR = 2,
  FC_SMALL = 3,
  FC_USMALL = 4,
  FC_WCHAR = 5,
  FC_SHORT = 6,
  FC_USHORT = 7,
  FC_LONG = 8,
  FC_ULONG = 9,
  FC_FLOAT = 10,
  FC_HYPER = 11,
  FC_DOUBLE = 12,
  FC_ENUM16 = 13,
  FC_ENUM32 = 14,
  FC_IGNORE = 15,
  FC_ERROR_STATUS_T = 16,
  FC_RP = 17,
  FC_UP = 18,
  FC_OP = 19,
  FC_FP = 20,
  FC_STRUCT = 21,
  FC_PSTRUCT = 22,
  FC_CSTRUCT = 23,
  FC_CPSTRUCT = 24,
  FC_CVSTRUCT = 25,
  FC_BOGUS_STRUCT = 26,
  FC_CARRAY = 27,
  FC_CVARRAY = 28,
  FC_SMFARRAY = 29,
  FC_LGFARRAY = 30,
  FC_SMVARRAY = 31,
  FC_LGVARRAY = 32,
  FC_BOGUS_ARRAY = 33,
  FC_C_CSTRING = 34,
  FC_C_BSTRING = 35,
  FC_C_SSTRING = 36,
  FC_C_WSTRING = 37,
  FC_CSTRING = 38,
  FC_BSTRING = 39,
  FC_SSTRING = 40,
  FC_WSTRING = 41,
  FC_ENCAPSULATED_UNION = 42,
  FC_NON_ENCAPSULATED_UNION = 43,
  FC_BYTE_COUNT_POINTER = 44,
  FC_TRANSMIT_AS = 45,
  FC_REPRESENT_AS = 46,
  FC_IP = 47,
  FC_BIND_CONTEXT = 48,
  FC_BIND_GENERIC = 49,
  FC_BIND_PRIMITIVE = 50,
  FC_AUTO_HANDLE = 51,
  FC_CALLBACK_HANDLE = 52,
  FC_UNUSED1 = 53,
  FC_POINTER = 54,
  FC_ALIGNM2 = 55,
  FC_ALIGNM4 = 56,
  FC_ALIGNM8 = 57,
  FC_UNUSED2 = 58,
  FC_UNUSED3 = 59,
  FC_UNUSED4 = 60,
  FC_STRUCTPAD1 = 61,
  FC_STRUCTPAD2 = 62,
  FC_STRUCTPAD3 = 63,
  FC_STRUCTPAD4 = 64,
  FC_STRUCTPAD5 = 65,
  FC_STRUCTPAD6 = 66,
  FC_STRUCTPAD7 = 67,
  FC_STRING_SIZED = 68,
  FC_UNUSED5 = 69,
  FC_NO_REPEAT = 70,
  FC_FIXED_REPEAT = 71,
  FC_VARIABLE_REPEAT = 72,
  FC_FIXED_OFFSET = 73,
  FC_VARIABLE_OFFSET = 74,
  FC_PP = 75,
  FC_EMBEDDED_COMPLEX = 76,
  FC_IN_PARAM = 77,
  FC_IN_PARAM_BASETYPE = 78,
  FC_IN_PARAM_NO_FREE_INST = 79,
  FC_IN_OUT_PARAM = 80,
  FC_OUT_PARAM = 81,
  FC_RETURN_PARAM = 82,
  FC_RETURN_PARAM_BASETYPE = 83,
  FC_DEREFERENCE = 84,
  FC_DIV_2 = 85,
  FC_MULT_2 = 86,
  FC_ADD_1 = 87,
  FC_SUB_1 = 88,
  FC_CALLBACK = 89,
  FC_CONSTANT_IID = 90,
  FC_END = 91,
  FC_PAD = 92,
  FC_EXPR = 93,
  FC_PARTIAL_IGNORE_PARAM = 94,
  FC_SPLIT_DEREFERENCE = 116,
  FC_SPLIT_DIV_2 = 117,
  FC_SPLIT_MULT_2 = 118,
  FC_SPLIT_ADD_1 = 119,
  FC_SPLIT_SUB_1 = 120,
  FC_SPLIT_CALLBACK = 121,
  FC_FORCED_BOGUS_STRUCT = 177,
  FC_TRANSMIT_AS_PTR = 178,
  FC_REPRESENT_AS_PTR = 179,
  FC_USER_MARSHAL = 180,
  FC_PIPE = 181,
  FC_SUPPLEMENT = 182,
  FC_RANGE = 183,
  FC_INT3264 = 184,
  FC_UINT3264 = 185,
  FC_CSARRAY = 186,
  FC_CS_TAG = 187,
  FC_STRUCTPADN = 188,
  FC_UNUSED7 = 189,
  FC_UNUSED8 = 190,
  FC_UNUSED9 = 191,
  FC_UNUSED10 = 192,
  FC_BUFFER_ALIGN = 193,
  FC_INT128 = 194,
  FC_UINT128 = 195,
  FC_FLOAT80 = 196,
  FC_FLOAT128 = 197,
  FC_END_OF_UNIVERSE = 198,
};

struct FRAME_GetIDsOfNames
{
  /* 0x0000 */ struct IDispatch* This;
  /* 0x0008 */ const struct _GUID& riid;
  /* 0x0010 */ wchar_t** rgszNames;
  /* 0x0018 */ unsigned int cNames;
  /* 0x001c */ char __pad3[4];
  /* 0x0020 */ unsigned long lcid;
  /* 0x0024 */ char __pad4[4];
  /* 0x0028 */ long* rgDispId;
}; /* size: 0x0030 */

struct FRAME_GetTypeInfo
{
  /* 0x0000 */ struct IDispatch* This;
  /* 0x0008 */ unsigned int iTInfo;
  /* 0x000c */ char __pad1[4];
  /* 0x0010 */ unsigned long lcid;
  /* 0x0014 */ char __pad2[4];
  /* 0x0018 */ struct ITypeInfo** ppTInfo;
}; /* size: 0x0020 */

struct FRAME_GetTypeInfoCount
{
  /* 0x0000 */ struct IDispatch* This;
  /* 0x0008 */ unsigned int* pctinfo;
}; /* size: 0x0010 */

struct FRAME_Invoke
{
  /* 0x0000 */ struct IDispatch* This;
  /* 0x0008 */ long dispIdMember;
  /* 0x000c */ char __pad1[4];
  /* 0x0010 */ struct _GUID* piid;
  /* 0x0018 */ unsigned long lcid;
  /* 0x001c */ char __pad3[4];
  /* 0x0020 */ unsigned short wFlags;
  /* 0x0022 */ char __pad4[4];
  /* 0x0028 */ struct tagDISPPARAMS* pDispParams;
  /* 0x0030 */ struct tagVARIANT* pVarResult;
  /* 0x0038 */ struct tagEXCEPINFO* pExcepInfo;
  /* 0x0040 */ unsigned int* puArgErr;
}; /* size: 0x0048 */

struct FRAME_RemoteInvoke
{
  /* 0x0000 */ struct IDispatch* This;
  /* 0x0008 */ long dispIdMember;
  /* 0x000c */ char __pad1[4];
  /* 0x0010 */ struct _GUID* piid;
  /* 0x0018 */ unsigned long lcid;
  /* 0x001c */ char __pad3[4];
  /* 0x0020 */ unsigned long dwFlags;
  /* 0x0024 */ char __pad4[4];
  /* 0x0028 */ struct tagDISPPARAMS* pDispParams;
  /* 0x0030 */ struct tagVARIANT* pVarResult;
  /* 0x0038 */ struct tagEXCEPINFO* pExcepInfo;
  /* 0x0040 */ unsigned int* puArgErr;
  /* 0x0048 */ unsigned int cVarRef;
  /* 0x004c */ char __pad9[4];
  /* 0x0050 */ unsigned int* rgVarRefIdx;
  /* 0x0058 */ struct tagVARIANT* rgVarRef;
}; /* size: 0x0060 */

union FT
{
  union
  {
    /* 0x0000 */ unsigned __int64 ft_scalar;
    /* 0x0000 */ struct _FILETIME ft_struct;
  }; /* size: 0x0008 */
}; /* size: 0x0008 */

enum FormatMatchFlag
{
  FORMAT_NOTFOUND = 1,
  FORMAT_BADMATCH = 2,
  FORMAT_GOODMATCH = 4,
};

enum FreeResourcesFlags
{
  RESET_AND_FREE = 1,
  JUST_RESET = 2,
};

enum GETPROPERTYSTOREFLAGS
{
};

enum GETSORTCOLUMN
{
  GSC_ARRANGEBY = 0,
  GSC_SORTBY = 1,
};

enum GET_PROPERTY_STORE_TYPE
{
  GIPST_CACHED = 0,
  GIPST_FALLBACK = 1,
};

class GenericInstantiator<DISPATCH_INTERCEPTOR>
{
}; /* size: 0x0001 */

class GenericStream
{
  /* 0x0010 */ long _clRefs;
  /* 0x0014 */ long _lOffset;
  /* 0x0018 */ long _cbDataSize;
  /* 0x001c */ unsigned long _cbBufferSize;
  /* 0x0020 */ struct tagInterfaceData* _pifData;
  /* 0x0028 */ int _fFree;
  /* 0x002c */ unsigned long _copyAlignment;
}; /* size: 0x0030 */

struct HACCEL__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

enum HARDENING_OPTIONS
{
  NDR_MEMORYVALIDATION = 1,
  NDR_COMPLEX_EXPR = 2,
};

struct HAS_INTERFACES
{
  /* 0x0000 */ long m_cInterfaces;
}; /* size: 0x0004 */

struct HBITMAP__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HBRUSH__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HCOLORSPACE__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HCONVLIST__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HCONV__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HDC__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HDDEDATA__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HDESK__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HDROP__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HENHMETAFILE__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HFONT__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HGESTUREINFO__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HGLRC__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HHOOK__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HICON__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HIMCC__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HIMC__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HINSTANCE__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HKEY__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HKL__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HLSURF__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HMACSHA_CTX
{
  /* 0x0000 */ struct A_SHA_CTX context_ipad;
  /* 0x0060 */ struct A_SHA_CTX context_opad;
}; /* size: 0x00c0 */

struct HMAPKEY__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HMENU__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HMETAFILE__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HMONITOR__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HPALETTE__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HPEN__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HRAWINPUT__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HREG
{
  /* 0x0000 */ void* h;
}; /* size: 0x0008 */

struct HRGN__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HRSRC__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HSPRITE__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HSTR__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HSZ__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HTASK__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HTOUCHINPUT__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HUMPD__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HWINEVENTHOOK__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HWINSTA__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct HWND__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

class HashGUID
{
}; /* size: 0x0001 */

class HashInt
{
}; /* size: 0x0001 */

class HashVoidPtr
{
}; /* size: 0x0001 */

class HashWSTR
{
}; /* size: 0x0001 */

struct IAbandonmentNotification
{
}; /* size: 0x0008 */

struct IAccessControl
{
}; /* size: 0x0008 */

struct IActivationContextInfo
{
}; /* size: 0x0008 */

struct IActivationPropOutClean
{
}; /* size: 0x0008 */

struct IActivationProperties
{
}; /* size: 0x0008 */

struct IActivationPropertiesIn
{
}; /* size: 0x0008 */

struct IActivationPropertiesOut
{
}; /* size: 0x0008 */

struct IActivationSecurityInfo
{
}; /* size: 0x0008 */

struct IActivationStageInfo
{
}; /* size: 0x0008 */

struct IAddrExclusionControl
{
}; /* size: 0x0008 */

struct IAddrTrackingControl
{
}; /* size: 0x0008 */

struct IAdviseSink
{
}; /* size: 0x0008 */

struct IAdviseSink2
{
}; /* size: 0x0008 */

struct IAdviseSink2Vtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* OnDataChange /* function */;
  /* 0x0020 */ void* OnViewChange /* function */;
  /* 0x0028 */ void* OnRename /* function */;
  /* 0x0030 */ void* OnSave /* function */;
  /* 0x0038 */ void* OnClose /* function */;
  /* 0x0040 */ void* OnLinkSrcChange /* function */;
}; /* size: 0x0048 */

struct IAdviseSinkEx
{
}; /* size: 0x0008 */

struct IAdviseSinkVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* OnDataChange /* function */;
  /* 0x0020 */ void* OnViewChange /* function */;
  /* 0x0028 */ void* OnRename /* function */;
  /* 0x0030 */ void* OnSave /* function */;
  /* 0x0038 */ void* OnClose /* function */;
}; /* size: 0x0040 */

struct IAggregator
{
}; /* size: 0x0008 */

struct IAsyncManager
{
}; /* size: 0x0008 */

struct IAsyncManagerVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* CompleteCall /* function */;
  /* 0x0020 */ void* GetCallContext /* function */;
  /* 0x0028 */ void* GetState /* function */;
}; /* size: 0x0030 */

struct IAsyncRpcChannelBuffer
{
}; /* size: 0x0008 */

struct IAsyncRpcChannelBufferVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* GetBuffer /* function */;
  /* 0x0020 */ void* SendReceive /* function */;
  /* 0x0028 */ void* FreeBuffer /* function */;
  /* 0x0030 */ void* GetDestCtx /* function */;
  /* 0x0038 */ void* IsConnected /* function */;
  /* 0x0040 */ void* GetProtocolVersion /* function */;
  /* 0x0048 */ void* Send /* function */;
  /* 0x0050 */ void* Receive /* function */;
  /* 0x0058 */ void* GetDestCtxEx /* function */;
}; /* size: 0x0060 */

struct IAuthenticate
{
}; /* size: 0x0008 */

struct IAuthenticateEx
{
}; /* size: 0x0008 */

struct IBindCtx
{
}; /* size: 0x0008 */

struct IBindCtxVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* RegisterObjectBound /* function */;
  /* 0x0020 */ void* RevokeObjectBound /* function */;
  /* 0x0028 */ void* ReleaseBoundObjects /* function */;
  /* 0x0030 */ void* SetBindOptions /* function */;
  /* 0x0038 */ void* GetBindOptions /* function */;
  /* 0x0040 */ void* GetRunningObjectTable /* function */;
  /* 0x0048 */ void* RegisterObjectParam /* function */;
  /* 0x0050 */ void* GetObjectParam /* function */;
  /* 0x0058 */ void* EnumObjectParam /* function */;
  /* 0x0060 */ void* RevokeObjectParam /* function */;
}; /* size: 0x0068 */

struct IBindHost
{
}; /* size: 0x0008 */

struct IBindProtocol
{
}; /* size: 0x0008 */

struct IBindStatusCallback
{
}; /* size: 0x0008 */

struct IBindStatusCallbackEx
{
}; /* size: 0x0008 */

struct IBinding
{
}; /* size: 0x0008 */

struct IBlockingLock
{
}; /* size: 0x0008 */

struct IBuffer
{
}; /* size: 0x0008 */

struct ICacheControl
{
}; /* size: 0x0008 */

struct ICacheRefresh
{
}; /* size: 0x0008 */

struct ICall
{
}; /* size: 0x0008 */

struct ICallFactory
{
}; /* size: 0x0008 */

struct ICallFactoryVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* CreateCall /* function */;
}; /* size: 0x0020 */

struct ICallFrame
{
}; /* size: 0x0008 */

struct ICallFrameEvents
{
}; /* size: 0x0008 */

struct ICallFrameInit
{
}; /* size: 0x0008 */

struct ICallFrameWalker
{
}; /* size: 0x0008 */

struct ICallIndirect
{
}; /* size: 0x0008 */

struct ICallInfo
{
}; /* size: 0x0008 */

struct ICallInterceptor
{
}; /* size: 0x0008 */

struct ICallUnmarshal
{
}; /* size: 0x0008 */

struct ICancelMethodCalls
{
}; /* size: 0x0008 */

struct ICatInformation
{
}; /* size: 0x0008 */

struct ICatRegister
{
}; /* size: 0x0008 */

struct ICatalogFileInfo
{
}; /* size: 0x0008 */

struct IChannelHook
{
}; /* size: 0x0008 */

struct IClassActivator
{
}; /* size: 0x0008 */

struct IClassClassicInfo
{
}; /* size: 0x0008 */

struct IClassClassicInfo2
{
}; /* size: 0x0008 */

struct IClassClassicInfo3
{
}; /* size: 0x0008 */

struct IClassFactory
{
}; /* size: 0x0008 */

struct IClassFactory2
{
}; /* size: 0x0008 */

struct IClassFactoryVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* CreateInstance /* function */;
  /* 0x0020 */ void* LockServer /* function */;
}; /* size: 0x0028 */

struct IClientSecurity
{
}; /* size: 0x0008 */

struct ICodeInstall
{
}; /* size: 0x0008 */

struct IComCatalog
{
}; /* size: 0x0008 */

struct IComCatalog2
{
}; /* size: 0x0008 */

struct IComCatalog2Internal
{
}; /* size: 0x0008 */

struct IComCatalogInternal
{
}; /* size: 0x0008 */

struct IComCatalogLocation
{
}; /* size: 0x0008 */

struct IComCatalogSCM
{
}; /* size: 0x0008 */

struct IComCatalogSettings
{
}; /* size: 0x0008 */

struct IComClassInfo
{
}; /* size: 0x0008 */

struct IComClassInfo2
{
}; /* size: 0x0008 */

struct IComDispatchInfo
{
}; /* size: 0x0008 */

struct IComObjIdentity
{
}; /* size: 0x0008 */

struct IComProcessInfo
{
}; /* size: 0x0008 */

struct IComProcessInfo2
{
}; /* size: 0x0008 */

struct IComProcessInfo3
{
}; /* size: 0x0008 */

struct IComServices
{
}; /* size: 0x0008 */

struct IComServices2
{
}; /* size: 0x0008 */

struct IComSxSClassInfo
{
}; /* size: 0x0008 */

struct IComThreadingInfo
{
}; /* size: 0x0008 */

struct IConnectionPoint
{
}; /* size: 0x0008 */

struct IConnectionPointContainer
{
}; /* size: 0x0008 */

struct IConnectionPointContainerVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* EnumConnectionPoints /* function */;
  /* 0x0020 */ void* FindConnectionPoint /* function */;
}; /* size: 0x0028 */

struct IConnectionPointVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* GetConnectionInterface /* function */;
  /* 0x0020 */ void* GetConnectionPointContainer /* function */;
  /* 0x0028 */ void* Advise /* function */;
  /* 0x0030 */ void* Unadvise /* function */;
  /* 0x0038 */ void* EnumConnections /* function */;
}; /* size: 0x0040 */

struct IContext
{
}; /* size: 0x0008 */

struct IContextCallback
{
}; /* size: 0x0008 */

struct IContextMarshaler
{
}; /* size: 0x0008 */

struct IContinue
{
}; /* size: 0x0008 */

struct IContinueVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* FContinue /* function */;
}; /* size: 0x0020 */

struct ICreateErrorInfo
{
}; /* size: 0x0008 */

struct ICreateTypeInfo
{
}; /* size: 0x0008 */

struct ICreateTypeInfo2
{
}; /* size: 0x0008 */

struct ICreateTypeLib
{
}; /* size: 0x0008 */

struct ICreateTypeLib2
{
}; /* size: 0x0008 */

struct IDLLHost
{
}; /* size: 0x0008 */

struct IDataAdviseHolder
{
}; /* size: 0x0008 */

struct IDataFilter
{
}; /* size: 0x0008 */

struct IDataObject
{
}; /* size: 0x0008 */

struct IDataObjectVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* GetData /* function */;
  /* 0x0020 */ void* GetDataHere /* function */;
  /* 0x0028 */ void* QueryGetData /* function */;
  /* 0x0030 */ void* GetCanonicalFormatEtc /* function */;
  /* 0x0038 */ void* SetData /* function */;
  /* 0x0040 */ void* EnumFormatEtc /* function */;
  /* 0x0048 */ void* DAdvise /* function */;
  /* 0x0050 */ void* DUnadvise /* function */;
  /* 0x0058 */ void* EnumDAdvise /* function */;
}; /* size: 0x0060 */

struct IDebug
{
}; /* size: 0x0008 */

struct IDebugStream
{
}; /* size: 0x0008 */

struct IDestInfo
{
}; /* size: 0x0008 */

struct IDirectWriterLock
{
}; /* size: 0x0008 */

struct IDisconnectSink
{
}; /* size: 0x0008 */

struct IDispatch
{
}; /* size: 0x0008 */

struct IDispatchVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* GetTypeInfoCount /* function */;
  /* 0x0020 */ void* GetTypeInfo /* function */;
  /* 0x0028 */ void* GetIDsOfNames /* function */;
  /* 0x0030 */ void* Invoke /* function */;
}; /* size: 0x0038 */

struct IDocfileAsyncConnectionPoint
{
}; /* size: 0x0008 */

struct IDragDropHelper
{
}; /* size: 0x0008 */

struct IDropSource
{
}; /* size: 0x0008 */

struct IDropSourceNotify
{
}; /* size: 0x0008 */

struct IDropSourceQueryEx
{
}; /* size: 0x0008 */

struct IDropTarget
{
}; /* size: 0x0008 */

struct IDummyHICONIncluder
{
}; /* size: 0x0008 */

struct IEncodingFilterFactory
{
}; /* size: 0x0008 */

struct IEnumCATEGORYINFO
{
}; /* size: 0x0008 */

struct IEnumCallback
{
}; /* size: 0x0008 */

struct IEnumConnectionPoints
{
}; /* size: 0x0008 */

struct IEnumConnectionPointsVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* Next /* function */;
  /* 0x0020 */ void* Skip /* function */;
  /* 0x0028 */ void* Reset /* function */;
  /* 0x0030 */ void* Clone /* function */;
}; /* size: 0x0038 */

struct IEnumConnections
{
}; /* size: 0x0008 */

struct IEnumConnectionsVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* Next /* function */;
  /* 0x0020 */ void* Skip /* function */;
  /* 0x0028 */ void* Reset /* function */;
  /* 0x0030 */ void* Clone /* function */;
}; /* size: 0x0038 */

struct IEnumContextProps
{
}; /* size: 0x0008 */

struct IEnumFORMATETC
{
}; /* size: 0x0008 */

struct IEnumFORMATETCVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* Next /* function */;
  /* 0x0020 */ void* Skip /* function */;
  /* 0x0028 */ void* Reset /* function */;
  /* 0x0030 */ void* Clone /* function */;
}; /* size: 0x0038 */

struct IEnumGUID
{
}; /* size: 0x0008 */

struct IEnumGeneric
{
}; /* size: 0x0008 */

struct IEnumHolder
{
}; /* size: 0x0008 */

struct IEnumMoniker
{
}; /* size: 0x0008 */

struct IEnumMonikerVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* Next /* function */;
  /* 0x0020 */ void* Skip /* function */;
  /* 0x0028 */ void* Reset /* function */;
  /* 0x0030 */ void* Clone /* function */;
}; /* size: 0x0038 */

struct IEnumOLEVERB
{
}; /* size: 0x0008 */

struct IEnumOLEVERBVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* Next /* function */;
  /* 0x0020 */ void* Skip /* function */;
  /* 0x0028 */ void* Reset /* function */;
  /* 0x0030 */ void* Clone /* function */;
}; /* size: 0x0038 */

struct IEnumOleUndoUnits
{
}; /* size: 0x0008 */

struct IEnumSCMProcessInfo
{
}; /* size: 0x0008 */

struct IEnumSTATDATA
{
}; /* size: 0x0008 */

struct IEnumSTATDATAVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* Next /* function */;
  /* 0x0020 */ void* Skip /* function */;
  /* 0x0028 */ void* Reset /* function */;
  /* 0x0030 */ void* Clone /* function */;
}; /* size: 0x0038 */

struct IEnumSTATPROPBAG
{
}; /* size: 0x0008 */

struct IEnumSTATPROPSETSTG
{
  /* 0x0000 */ struct IEnumSTATPROPSETSTGVtbl* lpVtbl;
}; /* size: 0x0008 */

struct IEnumSTATPROPSETSTGVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* Next /* function */;
  /* 0x0020 */ void* Skip /* function */;
  /* 0x0028 */ void* Reset /* function */;
  /* 0x0030 */ void* Clone /* function */;
}; /* size: 0x0038 */

struct IEnumSTATPROPSTG
{
  /* 0x0000 */ struct IEnumSTATPROPSTGVtbl* lpVtbl;
}; /* size: 0x0008 */

struct IEnumSTATPROPSTGVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* Next /* function */;
  /* 0x0020 */ void* Skip /* function */;
  /* 0x0028 */ void* Reset /* function */;
  /* 0x0030 */ void* Clone /* function */;
}; /* size: 0x0038 */

struct IEnumSTATSTG
{
  /* 0x0000 */ struct IEnumSTATSTGVtbl* lpVtbl;
}; /* size: 0x0008 */

struct IEnumSTATSTGVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* Next /* function */;
  /* 0x0020 */ void* Skip /* function */;
  /* 0x0028 */ void* Reset /* function */;
  /* 0x0030 */ void* Clone /* function */;
}; /* size: 0x0038 */

struct IEnumString
{
}; /* size: 0x0008 */

struct IEnumStringVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* Next /* function */;
  /* 0x0020 */ void* Skip /* function */;
  /* 0x0028 */ void* Reset /* function */;
  /* 0x0030 */ void* Clone /* function */;
}; /* size: 0x0038 */

struct IEnumUnknown
{
}; /* size: 0x0008 */

struct IEnumUnknownVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* Next /* function */;
  /* 0x0020 */ void* Skip /* function */;
  /* 0x0028 */ void* Reset /* function */;
  /* 0x0030 */ void* Clone /* function */;
}; /* size: 0x0038 */

struct IEnumVARIANT
{
}; /* size: 0x0008 */

struct IErrorInfo
{
}; /* size: 0x0008 */

struct IErrorLog
{
}; /* size: 0x0008 */

struct IExceptionNotification
{
}; /* size: 0x0008 */

struct IExternalConnection
{
}; /* size: 0x0008 */

class IFaceEntry
{
  union
  {
    struct
    {
      /* 0x0000 */ class IFaceEntry* _pNext;
      /* 0x0008 */ void* _pProxy;
      /* 0x0010 */ struct IRpcProxyBuffer* _pRpcProxy;
      /* 0x0018 */ struct IRpcStubBuffer* _pRpcStub;
      /* 0x0020 */ void* _pServer;
      /* 0x0028 */ struct _GUID _iid;
      /* 0x0038 */ class CCtxChnl* _pCtxChnl;
      /* 0x0040 */ class CtxEntry* _pHead;
      /* 0x0048 */ class CtxEntry* _pFreeList;
      /* 0x0050 */ struct ICallInterceptor* _pInterceptor;
      /* 0x0058 */ struct IUnknown* _pUnkInner;
    }; /* size: 0x0060 */
    /* 0x0000 */ class CPageAllocator s_allocator;
  }; /* size: 0x0068 */
}; /* size: 0x0060 */

struct IFileLockBytes
{
}; /* size: 0x0008 */

struct IFillInfo
{
}; /* size: 0x0008 */

struct IFillLockBytes
{
}; /* size: 0x0008 */

struct IFillLockBytesVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* FillAppend /* function */;
  /* 0x0020 */ void* FillAt /* function */;
  /* 0x0028 */ void* SetFillSize /* function */;
  /* 0x0030 */ void* Terminate /* function */;
}; /* size: 0x0038 */

class IFinish
{
}; /* size: 0x0008 */

struct IFont
{
}; /* size: 0x0008 */

struct IFontDisp
{
}; /* size: 0x0008 */

struct IFontEventsDisp
{
}; /* size: 0x0008 */

struct IForegroundTransfer
{
}; /* size: 0x0008 */

struct IFunctionDiscoveryNotification
{
}; /* size: 0x0008 */

struct IFunctionInstance
{
}; /* size: 0x0008 */

struct IGetCatalogObject
{
}; /* size: 0x0008 */

struct IGetContextId
{
}; /* size: 0x0008 */

struct IGlobalInterfaceTable
{
}; /* size: 0x0008 */

struct IGlobalOptions
{
}; /* size: 0x0008 */

struct IHookOleObject
{
}; /* size: 0x0008 */

struct IHttpNegotiate
{
}; /* size: 0x0008 */

struct IHttpNegotiate2
{
}; /* size: 0x0008 */

struct IHttpNegotiate3
{
}; /* size: 0x0008 */

struct IHttpSecurity
{
}; /* size: 0x0008 */

struct IImageList
{
}; /* size: 0x0008 */

struct IInitActivationPropertiesIn
{
}; /* size: 0x0008 */

struct IInitializeSpy
{
}; /* size: 0x0008 */

struct IInstanceInfo
{
}; /* size: 0x0008 */

struct IInstantiationInfo
{
}; /* size: 0x0008 */

struct IInterceptorBase
{
}; /* size: 0x0008 */

struct IInterfaceFromWindowProp
{
}; /* size: 0x0008 */

struct IInterfaceInfo
{
}; /* size: 0x0008 */

struct IInterfaceRelated
{
}; /* size: 0x0008 */

class IInternalChannelBuffer
{
}; /* size: 0x0010 */

struct IInternalUnknown
{
}; /* size: 0x0008 */

struct IInternet
{
}; /* size: 0x0008 */

struct IInternetBindInfo
{
}; /* size: 0x0008 */

struct IInternetBindInfoEx
{
}; /* size: 0x0008 */

struct IInternetHostSecurityManager
{
}; /* size: 0x0008 */

struct IInternetPriority
{
}; /* size: 0x0008 */

struct IInternetProtocol
{
}; /* size: 0x0008 */

struct IInternetProtocolEx
{
}; /* size: 0x0008 */

struct IInternetProtocolInfo
{
}; /* size: 0x0008 */

struct IInternetProtocolRoot
{
}; /* size: 0x0008 */

struct IInternetProtocolSink
{
}; /* size: 0x0008 */

struct IInternetProtocolSinkStackable
{
}; /* size: 0x0008 */

struct IInternetSecurityManager
{
}; /* size: 0x0008 */

struct IInternetSecurityManagerEx
{
}; /* size: 0x0008 */

struct IInternetSecurityManagerEx2
{
}; /* size: 0x0008 */

struct IInternetSecurityMgrSite
{
}; /* size: 0x0008 */

struct IInternetSession
{
}; /* size: 0x0008 */

struct IInternetThreadSwitch
{
}; /* size: 0x0008 */

struct IInternetZoneManager
{
}; /* size: 0x0008 */

struct IInternetZoneManagerEx
{
}; /* size: 0x0008 */

struct IInternetZoneManagerEx2
{
}; /* size: 0x0008 */

struct ILayoutStorage
{
}; /* size: 0x0008 */

struct ILegacyInfo
{
}; /* size: 0x0008 */

struct ILocalMachineNames
{
}; /* size: 0x0008 */

struct ILocalSystemActivator
{
}; /* size: 0x0008 */

struct ILockBytes
{
}; /* size: 0x0008 */

struct ILockBytesVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* ReadAt /* function */;
  /* 0x0020 */ void* WriteAt /* function */;
  /* 0x0028 */ void* Flush /* function */;
  /* 0x0030 */ void* SetSize /* function */;
  /* 0x0038 */ void* LockRegion /* function */;
  /* 0x0040 */ void* UnlockRegion /* function */;
  /* 0x0048 */ void* Stat /* function */;
}; /* size: 0x0050 */

struct IMAGE_AUX_SYMBOL_TOKEN_DEF
{
  /* 0x0000 */ unsigned char bAuxType;
  /* 0x0001 */ unsigned char bReserved;
  /* 0x0002 */ unsigned long SymbolTableIndex;
  /* 0x0006 */ unsigned char rgbReserved[12];
}; /* size: 0x0012 */

enum IMAGE_AUX_SYMBOL_TYPE
{
  IMAGE_AUX_SYMBOL_TYPE_TOKEN_DEF = 1,
};

struct IMAGE_COR20_HEADER
{
  /* 0x0000 */ unsigned long cb;
  /* 0x0004 */ unsigned short MajorRuntimeVersion;
  /* 0x0006 */ unsigned short MinorRuntimeVersion;
  /* 0x0008 */ struct _IMAGE_DATA_DIRECTORY MetaData;
  /* 0x0010 */ unsigned long Flags;
  union
  {
    /* 0x0014 */ unsigned long EntryPointToken;
    /* 0x0014 */ unsigned long EntryPointRVA;
  }; /* size: 0x0004 */
  /* 0x0018 */ struct _IMAGE_DATA_DIRECTORY Resources;
  /* 0x0020 */ struct _IMAGE_DATA_DIRECTORY StrongNameSignature;
  /* 0x0028 */ struct _IMAGE_DATA_DIRECTORY CodeManagerTable;
  /* 0x0030 */ struct _IMAGE_DATA_DIRECTORY VTableFixups;
  /* 0x0038 */ struct _IMAGE_DATA_DIRECTORY ExportAddressTableJumps;
  /* 0x0040 */ struct _IMAGE_DATA_DIRECTORY ManagedNativeHeader;
}; /* size: 0x0048 */

struct IMAGE_LOAD_CONFIG_DIRECTORY32
{
  /* 0x0000 */ unsigned long Size;
  /* 0x0004 */ unsigned long TimeDateStamp;
  /* 0x0008 */ unsigned short MajorVersion;
  /* 0x000a */ unsigned short MinorVersion;
  /* 0x000c */ unsigned long GlobalFlagsClear;
  /* 0x0010 */ unsigned long GlobalFlagsSet;
  /* 0x0014 */ unsigned long CriticalSectionDefaultTimeout;
  /* 0x0018 */ unsigned long DeCommitFreeBlockThreshold;
  /* 0x001c */ unsigned long DeCommitTotalFreeThreshold;
  /* 0x0020 */ unsigned long LockPrefixTable;
  /* 0x0024 */ unsigned long MaximumAllocationSize;
  /* 0x0028 */ unsigned long VirtualMemoryThreshold;
  /* 0x002c */ unsigned long ProcessHeapFlags;
  /* 0x0030 */ unsigned long ProcessAffinityMask;
  /* 0x0034 */ unsigned short CSDVersion;
  /* 0x0036 */ unsigned short Reserved1;
  /* 0x0038 */ unsigned long EditList;
  /* 0x003c */ unsigned long SecurityCookie;
  /* 0x0040 */ unsigned long SEHandlerTable;
  /* 0x0044 */ unsigned long SEHandlerCount;
}; /* size: 0x0048 */

struct IMAGE_LOAD_CONFIG_DIRECTORY64
{
  /* 0x0000 */ unsigned long Size;
  /* 0x0004 */ unsigned long TimeDateStamp;
  /* 0x0008 */ unsigned short MajorVersion;
  /* 0x000a */ unsigned short MinorVersion;
  /* 0x000c */ unsigned long GlobalFlagsClear;
  /* 0x0010 */ unsigned long GlobalFlagsSet;
  /* 0x0014 */ unsigned long CriticalSectionDefaultTimeout;
  /* 0x0018 */ unsigned __int64 DeCommitFreeBlockThreshold;
  /* 0x0020 */ unsigned __int64 DeCommitTotalFreeThreshold;
  /* 0x0028 */ unsigned __int64 LockPrefixTable;
  /* 0x0030 */ unsigned __int64 MaximumAllocationSize;
  /* 0x0038 */ unsigned __int64 VirtualMemoryThreshold;
  /* 0x0040 */ unsigned __int64 ProcessAffinityMask;
  /* 0x0048 */ unsigned long ProcessHeapFlags;
  /* 0x004c */ unsigned short CSDVersion;
  /* 0x004e */ unsigned short Reserved1;
  /* 0x0050 */ unsigned __int64 EditList;
  /* 0x0058 */ unsigned __int64 SecurityCookie;
  /* 0x0060 */ unsigned __int64 SEHandlerTable;
  /* 0x0068 */ unsigned __int64 SEHandlerCount;
}; /* size: 0x0070 */

struct IMPORT_OBJECT_HEADER
{
  /* 0x0000 */ unsigned short Sig1;
  /* 0x0002 */ unsigned short Sig2;
  /* 0x0004 */ unsigned short Version;
  /* 0x0006 */ unsigned short Machine;
  /* 0x0008 */ unsigned long TimeDateStamp;
  /* 0x000c */ unsigned long SizeOfData;
  union
  {
    /* 0x0010 */ unsigned short Ordinal;
    /* 0x0010 */ unsigned short Hint;
  }; /* size: 0x0002 */
  struct /* bitfield */
  {
    /* 0x0012 */ unsigned short Type : 2; /* bit position: 0 */
    /* 0x0012 */ unsigned short NameType : 3; /* bit position: 2 */
    /* 0x0012 */ unsigned short Reserved : 11; /* bit position: 5 */
  }; /* bitfield */
}; /* size: 0x0014 */

enum IMPORT_OBJECT_NAME_TYPE
{
  IMPORT_OBJECT_ORDINAL = 0,
  IMPORT_OBJECT_NAME = 1,
  IMPORT_OBJECT_NAME_NO_PREFIX = 2,
  IMPORT_OBJECT_NAME_UNDECORATE = 3,
};

enum IMPORT_OBJECT_TYPE
{
  IMPORT_OBJECT_CODE = 0,
  IMPORT_OBJECT_DATA = 1,
  IMPORT_OBJECT_CONST = 2,
};

struct IMalloc
{
}; /* size: 0x0008 */

struct IMallocSpy
{
}; /* size: 0x0008 */

struct IMallocVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* Alloc /* function */;
  /* 0x0020 */ void* Realloc /* function */;
  /* 0x0028 */ void* Free /* function */;
  /* 0x0030 */ void* GetSize /* function */;
  /* 0x0038 */ void* DidAlloc /* function */;
  /* 0x0040 */ void* HeapMinimize /* function */;
}; /* size: 0x0048 */

class IMappedStream
{
}; /* size: 0x0008 */

struct IMarshal
{
}; /* size: 0x0008 */

struct IMarshal2
{
}; /* size: 0x0008 */

struct IMarshalEnvoy
{
}; /* size: 0x0008 */

struct IMarshalOptions
{
}; /* size: 0x0008 */

struct IMarshalSomeone
{
}; /* size: 0x0008 */

struct IMarshallingManager
{
}; /* size: 0x0008 */

struct IMessageFilter
{
}; /* size: 0x0008 */

class IMessageParam
{
  /* 0x0008 */ class IMessageParam* pNextMessage;
}; /* size: 0x0010 */

struct IMoniker
{
}; /* size: 0x0008 */

struct IMonikerProp
{
}; /* size: 0x0008 */

struct IMonikerVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* GetClassID /* function */;
  /* 0x0020 */ void* IsDirty /* function */;
  /* 0x0028 */ void* Load /* function */;
  /* 0x0030 */ void* Save /* function */;
  /* 0x0038 */ void* GetSizeMax /* function */;
  /* 0x0040 */ void* BindToObject /* function */;
  /* 0x0048 */ void* BindToStorage /* function */;
  /* 0x0050 */ void* Reduce /* function */;
  /* 0x0058 */ void* ComposeWith /* function */;
  /* 0x0060 */ void* Enum /* function */;
  /* 0x0068 */ void* IsEqual /* function */;
  /* 0x0070 */ void* Hash /* function */;
  /* 0x0078 */ void* IsRunning /* function */;
  /* 0x0080 */ void* GetTimeOfLastChange /* function */;
  /* 0x0088 */ void* Inverse /* function */;
  /* 0x0090 */ void* CommonPrefixWith /* function */;
  /* 0x0098 */ void* RelativePathTo /* function */;
  /* 0x00a0 */ void* GetDisplayName /* function */;
  /* 0x00a8 */ void* ParseDisplayName /* function */;
  /* 0x00b0 */ void* IsSystemMoniker /* function */;
}; /* size: 0x00b8 */

struct IMultiQI
{
}; /* size: 0x0008 */

enum INDEXER_CACHE_STATE
{
  ICS_HIT = 0,
  ICS_MISS = 1,
};

struct INFO
{
  /* 0x0000 */ int fUsed;
  /* 0x0004 */ unsigned long dwConnection;
  /* 0x0008 */ unsigned short cf;
  /* 0x000c */ unsigned long grfAdvf;
}; /* size: 0x0010 */

struct INTERFACE_HELPER_CLSID
{
  /* 0x0030 */ struct _GUID m_clsid;
  /* 0x0040 */ int m_fDisableTypeLib;
  /* 0x0044 */ int m_fDisableAll;
  /* 0x0048 */ int m_fFoundHelper;
  /* 0x004c */ long __PADDING__[1];
}; /* size: 0x0050 */

struct INTERPRETER_FLAGS
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned char FullPtrUsed : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned char RpcSsAllocUsed : 1; /* bit position: 1 */
    /* 0x0000 */ unsigned char ObjectProc : 1; /* bit position: 2 */
    /* 0x0000 */ unsigned char HasRpcFlags : 1; /* bit position: 3 */
    /* 0x0000 */ unsigned char IgnoreObjectException : 1; /* bit position: 4 */
    /* 0x0000 */ unsigned char HasCommOrFault : 1; /* bit position: 5 */
    /* 0x0000 */ unsigned char UseNewInitRoutines : 1; /* bit position: 6 */
    /* 0x0000 */ unsigned char Unused : 1; /* bit position: 7 */
  }; /* bitfield */
}; /* size: 0x0001 */

struct INTERPRETER_OPT_FLAGS
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned char ServerMustSize : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned char ClientMustSize : 1; /* bit position: 1 */
    /* 0x0000 */ unsigned char HasReturn : 1; /* bit position: 2 */
    /* 0x0000 */ unsigned char HasPipes : 1; /* bit position: 3 */
    /* 0x0000 */ unsigned char Unused : 1; /* bit position: 4 */
    /* 0x0000 */ unsigned char HasAsyncUuid : 1; /* bit position: 5 */
    /* 0x0000 */ unsigned char HasExtensions : 1; /* bit position: 6 */
    /* 0x0000 */ unsigned char HasAsyncHandle : 1; /* bit position: 7 */
  }; /* bitfield */
}; /* size: 0x0001 */

struct INTERPRETER_OPT_FLAGS2
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned char HasNewCorrDesc : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned char ClientCorrCheck : 1; /* bit position: 1 */
    /* 0x0000 */ unsigned char ServerCorrCheck : 1; /* bit position: 2 */
    /* 0x0000 */ unsigned char HasNotify : 1; /* bit position: 3 */
    /* 0x0000 */ unsigned char HasNotify2 : 1; /* bit position: 4 */
    /* 0x0000 */ unsigned char HasComplexReturn : 1; /* bit position: 5 */
    /* 0x0000 */ unsigned char HasConformanceRange : 1; /* bit position: 6 */
    /* 0x0000 */ unsigned char HasBigByValueParam : 1; /* bit position: 7 */
  }; /* bitfield */
}; /* size: 0x0001 */

struct INdrVersion
{
}; /* size: 0x0008 */

struct IObjContext
{
}; /* size: 0x0008 */

struct IObjectActivator
{
}; /* size: 0x0008 */

struct IObjectWithSite
{
}; /* size: 0x0008 */

struct IOleAdviseHolder
{
}; /* size: 0x0008 */

struct IOleCache
{
}; /* size: 0x0008 */

struct IOleCache2
{
  /* 0x0000 */ struct IOleCache2Vtbl* lpVtbl;
}; /* size: 0x0008 */

struct IOleCache2Vtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* Cache /* function */;
  /* 0x0020 */ void* Uncache /* function */;
  /* 0x0028 */ void* EnumCache /* function */;
  /* 0x0030 */ void* InitCache /* function */;
  /* 0x0038 */ void* SetData /* function */;
  /* 0x0040 */ void* UpdateCache /* function */;
  /* 0x0048 */ void* DiscardCache /* function */;
}; /* size: 0x0050 */

struct IOleCacheControl
{
}; /* size: 0x0008 */

struct IOleClientSite
{
}; /* size: 0x0008 */

struct IOleContainer
{
}; /* size: 0x0008 */

struct IOleControl
{
}; /* size: 0x0008 */

struct IOleControlSite
{
}; /* size: 0x0008 */

struct IOleInPlaceActiveObject
{
  /* 0x0000 */ struct IOleInPlaceActiveObjectVtbl* lpVtbl;
}; /* size: 0x0008 */

struct IOleInPlaceActiveObjectVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* GetWindow /* function */;
  /* 0x0020 */ void* ContextSensitiveHelp /* function */;
  /* 0x0028 */ void* TranslateAcceleratorW /* function */;
  /* 0x0030 */ void* OnFrameWindowActivate /* function */;
  /* 0x0038 */ void* OnDocWindowActivate /* function */;
  /* 0x0040 */ void* ResizeBorder /* function */;
  /* 0x0048 */ void* EnableModeless /* function */;
}; /* size: 0x0050 */

struct IOleInPlaceFrame
{
}; /* size: 0x0008 */

struct IOleInPlaceObject
{
}; /* size: 0x0008 */

struct IOleInPlaceObjectWindowless
{
}; /* size: 0x0008 */

struct IOleInPlaceSite
{
}; /* size: 0x0008 */

struct IOleInPlaceSiteEx
{
}; /* size: 0x0008 */

struct IOleInPlaceSiteWindowless
{
}; /* size: 0x0008 */

struct IOleInPlaceUIWindow
{
  /* 0x0000 */ struct IOleInPlaceUIWindowVtbl* lpVtbl;
}; /* size: 0x0008 */

struct IOleInPlaceUIWindowVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* GetWindow /* function */;
  /* 0x0020 */ void* ContextSensitiveHelp /* function */;
  /* 0x0028 */ void* GetBorder /* function */;
  /* 0x0030 */ void* RequestBorderSpace /* function */;
  /* 0x0038 */ void* SetBorderSpace /* function */;
  /* 0x0040 */ void* SetActiveObject /* function */;
}; /* size: 0x0048 */

struct IOleItemContainer
{
}; /* size: 0x0008 */

struct IOleLink
{
}; /* size: 0x0008 */

struct IOleObject
{
}; /* size: 0x0008 */

struct IOlePackagerLinkNotify
{
}; /* size: 0x0008 */

struct IOleParentUndoUnit
{
}; /* size: 0x0008 */

struct IOlePresObj
{
}; /* size: 0x0008 */

struct IOleUndoManager
{
}; /* size: 0x0008 */

struct IOleUndoUnit
{
}; /* size: 0x0008 */

struct IOleWindow
{
}; /* size: 0x0008 */

struct IOpaqueDataInfo
{
}; /* size: 0x0008 */

struct IOplockStorage
{
}; /* size: 0x0008 */

struct IOrpcDebugNotify
{
}; /* size: 0x0008 */

struct IOrpcDebugNotifyVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* ClientGetBufferSize /* function */;
  /* 0x0020 */ void* ClientFillBuffer /* function */;
  /* 0x0028 */ void* ClientNotify /* function */;
  /* 0x0030 */ void* ServerNotify /* function */;
  /* 0x0038 */ void* ServerGetBufferSize /* function */;
  /* 0x0040 */ void* ServerFillBuffer /* function */;
}; /* size: 0x0048 */

struct IOverrideTargetContext
{
}; /* size: 0x0008 */

struct IPAControl
{
}; /* size: 0x0008 */

struct IPSFactoryBuffer
{
  /* 0x0000 */ struct IPSFactoryBufferVtbl* lpVtbl;
}; /* size: 0x0008 */

struct IPSFactoryBufferVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* CreateProxy /* function */;
  /* 0x0020 */ void* CreateStub /* function */;
}; /* size: 0x0028 */

struct IPSFactoryHookVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* CreateProxy /* function */;
  /* 0x0020 */ void* CreateStub /* function */;
  /* 0x0028 */ void* HkGetProxyFileInfo /* function */;
}; /* size: 0x0030 */

struct IParseDisplayName
{
}; /* size: 0x0008 */

struct IPartitionLookup
{
}; /* size: 0x0008 */

struct IPartitionProperty
{
}; /* size: 0x0008 */

struct IPerPropertyBrowsing
{
}; /* size: 0x0008 */

struct IPersist
{
}; /* size: 0x0008 */

struct IPersistFile
{
}; /* size: 0x0008 */

struct IPersistMemory
{
}; /* size: 0x0008 */

struct IPersistMoniker
{
}; /* size: 0x0008 */

struct IPersistPropertyBag
{
}; /* size: 0x0008 */

struct IPersistPropertyBag2
{
}; /* size: 0x0008 */

struct IPersistStorage
{
}; /* size: 0x0008 */

struct IPersistStream
{
}; /* size: 0x0008 */

struct IPersistStreamInit
{
}; /* size: 0x0008 */

struct IPicture
{
}; /* size: 0x0008 */

struct IPicture2
{
}; /* size: 0x0008 */

struct IPictureDisp
{
}; /* size: 0x0008 */

struct IPipeByte
{
}; /* size: 0x0008 */

struct IPipeDouble
{
}; /* size: 0x0008 */

struct IPipeLong
{
}; /* size: 0x0008 */

struct IPointerInactive
{
}; /* size: 0x0008 */

struct IPolicy
{
}; /* size: 0x0008 */

struct IPolicyAsync
{
}; /* size: 0x0008 */

struct IPolicyMaker
{
}; /* size: 0x0008 */

struct IPolicySet
{
}; /* size: 0x0008 */

struct IPrivActivationContextInfo
{
}; /* size: 0x0008 */

struct IPrivActivationPropertiesIn
{
}; /* size: 0x0008 */

struct IPrivActivationPropertiesOut
{
}; /* size: 0x0008 */

struct IPrivDragDrop
{
}; /* size: 0x0008 */

struct IProcessInitControl
{
}; /* size: 0x0008 */

struct IProcessLock
{
}; /* size: 0x0008 */

struct IProcessServerInfo
{
}; /* size: 0x0008 */

struct IProgressNotify
{
}; /* size: 0x0008 */

struct IPropertyBag
{
}; /* size: 0x0008 */

struct IPropertyBag2
{
}; /* size: 0x0008 */

struct IPropertyBagEx
{
}; /* size: 0x0008 */

struct IPropertyNotifySink
{
}; /* size: 0x0008 */

struct IPropertyPage
{
}; /* size: 0x0008 */

struct IPropertyPage2
{
}; /* size: 0x0008 */

struct IPropertyPageSite
{
}; /* size: 0x0008 */

struct IPropertySetStorage
{
}; /* size: 0x0008 */

struct IPropertyStorage
{
}; /* size: 0x0008 */

struct IPropertyStore
{
}; /* size: 0x0008 */

struct IProvideClassInfo
{
}; /* size: 0x0008 */

struct IProvideClassInfo2
{
}; /* size: 0x0008 */

struct IProvideMultipleClassInfo
{
}; /* size: 0x0008 */

struct IProxyManager
{
}; /* size: 0x0008 */

struct IQuickActivate
{
}; /* size: 0x0008 */

struct IRCEntry
{
  /* 0x0000 */ struct IRCEntry* pNext;
  /* 0x0008 */ class CRefCache* pRefCache;
  /* 0x0010 */ unsigned long cStrongUsage;
  /* 0x0014 */ unsigned long cWeakUsage;
  /* 0x0018 */ unsigned long cStrongRefs;
  /* 0x001c */ unsigned long cPrivateRefs;
  /* 0x0020 */ unsigned long cWeakRefs;
  /* 0x0024 */ struct _GUID ipid;
  /* 0x0034 */ long __PADDING__[1];
}; /* size: 0x0038 */

struct IROTData
{
}; /* size: 0x0008 */

struct IRecordInfo
{
}; /* size: 0x0008 */

struct IRecordInfoVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* RecordInit /* function */;
  /* 0x0020 */ void* RecordClear /* function */;
  /* 0x0028 */ void* RecordCopy /* function */;
  /* 0x0030 */ void* GetGuid /* function */;
  /* 0x0038 */ void* GetName /* function */;
  /* 0x0040 */ void* GetSize /* function */;
  /* 0x0048 */ void* GetTypeInfo /* function */;
  /* 0x0050 */ void* GetField /* function */;
  /* 0x0058 */ void* GetFieldNoCopy /* function */;
  /* 0x0060 */ void* PutField /* function */;
  /* 0x0068 */ void* PutFieldNoCopy /* function */;
  /* 0x0070 */ void* GetFieldNames /* function */;
  /* 0x0078 */ void* IsMatchingType /* function */;
  /* 0x0080 */ void* RecordCreate /* function */;
  /* 0x0088 */ void* RecordCreateCopy /* function */;
  /* 0x0090 */ void* RecordDestroy /* function */;
}; /* size: 0x0098 */

struct IReleaseMarshalBuffers
{
  /* 0x0000 */ struct IReleaseMarshalBuffersVtbl* lpVtbl;
}; /* size: 0x0008 */

struct IReleaseMarshalBuffersVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* ReleaseMarshalBuffer /* function */;
}; /* size: 0x0020 */

struct IRemUnknown
{
}; /* size: 0x0008 */

struct IRemUnknown2
{
}; /* size: 0x0008 */

struct IRemUnknownN
{
}; /* size: 0x0008 */

struct IReplaceClassInfo
{
}; /* size: 0x0008 */

struct IResourceGates
{
}; /* size: 0x0008 */

struct IRootStorage
{
}; /* size: 0x0008 */

struct IRpcCall
{
}; /* size: 0x0008 */

struct IRpcChannelBuffer
{
  /* 0x0000 */ struct IRpcChannelBufferVtbl* lpVtbl;
}; /* size: 0x0008 */

struct IRpcChannelBuffer2
{
}; /* size: 0x0008 */

struct IRpcChannelBuffer2Vtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* GetBuffer /* function */;
  /* 0x0020 */ void* SendReceive /* function */;
  /* 0x0028 */ void* FreeBuffer /* function */;
  /* 0x0030 */ void* GetDestCtx /* function */;
  /* 0x0038 */ void* IsConnected /* function */;
  /* 0x0040 */ void* GetProtocolVersion /* function */;
}; /* size: 0x0048 */

struct IRpcChannelBuffer3
{
}; /* size: 0x0008 */

struct IRpcChannelBuffer3Vtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* GetBuffer /* function */;
  /* 0x0020 */ void* SendReceive /* function */;
  /* 0x0028 */ void* FreeBuffer /* function */;
  /* 0x0030 */ void* GetDestCtx /* function */;
  /* 0x0038 */ void* IsConnected /* function */;
  /* 0x0040 */ void* GetProtocolVersion /* function */;
  /* 0x0048 */ void* Send /* function */;
  /* 0x0050 */ void* Receive /* function */;
  /* 0x0058 */ void* Cancel /* function */;
  /* 0x0060 */ void* GetCallContext /* function */;
  /* 0x0068 */ void* GetDestCtxEx /* function */;
  /* 0x0070 */ void* GetState /* function */;
  /* 0x0078 */ void* RegisterAsync /* function */;
}; /* size: 0x0080 */

struct IRpcChannelBufferVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* GetBuffer /* function */;
  /* 0x0020 */ void* SendReceive /* function */;
  /* 0x0028 */ void* FreeBuffer /* function */;
  /* 0x0030 */ void* GetDestCtx /* function */;
  /* 0x0038 */ void* IsConnected /* function */;
}; /* size: 0x0040 */

struct IRpcHelper
{
}; /* size: 0x0008 */

struct IRpcOptions
{
}; /* size: 0x0008 */

struct IRpcProxyBuffer
{
}; /* size: 0x0008 */

struct IRpcProxyBufferVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* Connect /* function */;
  /* 0x0020 */ void* Disconnect /* function */;
}; /* size: 0x0028 */

struct IRpcStubBuffer
{
  /* 0x0000 */ struct IRpcStubBufferVtbl* lpVtbl;
}; /* size: 0x0008 */

struct IRpcStubBufferVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* Connect /* function */;
  /* 0x0020 */ void* Disconnect /* function */;
  /* 0x0028 */ void* Invoke /* function */;
  /* 0x0030 */ void* IsIIDSupported /* function */;
  /* 0x0038 */ void* CountRefs /* function */;
  /* 0x0040 */ void* DebugServerQueryInterface /* function */;
  /* 0x0048 */ void* DebugServerRelease /* function */;
}; /* size: 0x0050 */

struct IRpcSyntaxNegotiate
{
}; /* size: 0x0008 */

struct IRpcSyntaxNegotiateVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* NegotiateSyntax /* function */;
}; /* size: 0x0020 */

struct IRundown
{
}; /* size: 0x0008 */

struct IRunnableObject
{
  /* 0x0000 */ struct IRunnableObjectVtbl* lpVtbl;
}; /* size: 0x0008 */

struct IRunnableObjectVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* GetRunningClass /* function */;
  /* 0x0020 */ void* Run /* function */;
  /* 0x0028 */ void* IsRunning /* function */;
  /* 0x0030 */ void* LockRunning /* function */;
  /* 0x0038 */ void* SetContainedObject /* function */;
}; /* size: 0x0040 */

struct IRunningObjectTable
{
}; /* size: 0x0008 */

struct IRunningObjectTableVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* Register /* function */;
  /* 0x0020 */ void* Revoke /* function */;
  /* 0x0028 */ void* IsRunning /* function */;
  /* 0x0030 */ void* GetObjectW /* function */;
  /* 0x0038 */ void* NoteChangeTime /* function */;
  /* 0x0040 */ void* GetTimeOfLastChange /* function */;
  /* 0x0048 */ void* EnumRunning /* function */;
}; /* size: 0x0050 */

struct ISCMLocalActivator
{
}; /* size: 0x0008 */

struct ISCMProcessControl
{
}; /* size: 0x0008 */

enum ISOFLAG
{
  ISOFLAG_RETAIN_COMMIT_DC = 1,
  ISOFLAG_RETAIN_COMMIT = 2,
  ISOFLAG_RETAIN_COMMIT_NO = 3,
  ISOFLAG_RETAIN_ABORT_DC = 4,
  ISOFLAG_RETAIN_ABORT = 8,
  ISOFLAG_RETAIN_ABORT_NO = 12,
  ISOFLAG_RETAIN_DONTCARE = 5,
  ISOFLAG_RETAIN_BOTH = 10,
  ISOFLAG_RETAIN_NONE = 15,
  ISOFLAG_OPTIMISTIC = 16,
  ISOFLAG_READONLY = 32,
};

struct IScmReplyInfo
{
}; /* size: 0x0008 */

struct IScmRequestInfo
{
}; /* size: 0x0008 */

struct ISecurityOptions
{
}; /* size: 0x0008 */

struct ISequentialStream
{
}; /* size: 0x0008 */

struct ISequentialStreamVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* Read /* function */;
  /* 0x0020 */ void* Write /* function */;
}; /* size: 0x0028 */

struct ISerializable
{
}; /* size: 0x0008 */

struct ISerializableParent
{
}; /* size: 0x0008 */

struct IServerLocationInfo
{
}; /* size: 0x0008 */

struct IServerSecurity
{
}; /* size: 0x0008 */

struct IServiceProvider
{
}; /* size: 0x0008 */

struct IServicesSink
{
}; /* size: 0x0008 */

struct IServicesSink2
{
}; /* size: 0x0008 */

struct IShellItem
{
}; /* size: 0x0008 */

struct IShellItem2
{
}; /* size: 0x0008 */

struct IShellLibrary
{
}; /* size: 0x0008 */

struct IShellLinkW
{
}; /* size: 0x0008 */

struct ISimpleFrameSite
{
}; /* size: 0x0008 */

struct ISoftDistExt
{
}; /* size: 0x0008 */

struct ISpecialSystemProperties
{
}; /* size: 0x0008 */

struct ISpecifyPropertyPages
{
}; /* size: 0x0008 */

struct IStackWalker
{
}; /* size: 0x0008 */

struct IStackWalkerStack
{
}; /* size: 0x0008 */

struct IStackWalkerSymbol
{
}; /* size: 0x0008 */

struct IStandardActivator
{
}; /* size: 0x0008 */

struct IStdMarshalInfo
{
}; /* size: 0x0008 */

struct IStorage
{
}; /* size: 0x0008 */

struct IStorageReplica
{
}; /* size: 0x0008 */

struct IStorageVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* CreateStream /* function */;
  /* 0x0020 */ void* OpenStream /* function */;
  /* 0x0028 */ void* CreateStorage /* function */;
  /* 0x0030 */ void* OpenStorage /* function */;
  /* 0x0038 */ void* CopyTo /* function */;
  /* 0x0040 */ void* MoveElementTo /* function */;
  /* 0x0048 */ void* Commit /* function */;
  /* 0x0050 */ void* Revert /* function */;
  /* 0x0058 */ void* EnumElements /* function */;
  /* 0x0060 */ void* DestroyElement /* function */;
  /* 0x0068 */ void* RenameElement /* function */;
  /* 0x0070 */ void* SetElementTimes /* function */;
  /* 0x0078 */ void* SetClass /* function */;
  /* 0x0080 */ void* SetStateBits /* function */;
  /* 0x0088 */ void* Stat /* function */;
}; /* size: 0x0090 */

struct IStream
{
}; /* size: 0x0008 */

struct IStreamVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* Read /* function */;
  /* 0x0020 */ void* Write /* function */;
  /* 0x0028 */ void* Seek /* function */;
  /* 0x0030 */ void* SetSize /* function */;
  /* 0x0038 */ void* CopyTo /* function */;
  /* 0x0040 */ void* Commit /* function */;
  /* 0x0048 */ void* Revert /* function */;
  /* 0x0050 */ void* LockRegion /* function */;
  /* 0x0058 */ void* UnlockRegion /* function */;
  /* 0x0060 */ void* Stat /* function */;
  /* 0x0068 */ void* Clone /* function */;
}; /* size: 0x0070 */

struct ISupportErrorInfo
{
}; /* size: 0x0008 */

struct ISurrogate
{
}; /* size: 0x0008 */

struct ISurrogateService
{
}; /* size: 0x0008 */

struct ISynchronize
{
}; /* size: 0x0008 */

struct ISynchronizeContainer
{
}; /* size: 0x0008 */

struct ISynchronizeEvent
{
}; /* size: 0x0008 */

struct ISynchronizeHandle
{
}; /* size: 0x0008 */

struct ISynchronizeMutex
{
}; /* size: 0x0008 */

struct ISynchronizeVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* Wait /* function */;
  /* 0x0020 */ void* Signal /* function */;
  /* 0x0028 */ void* Reset /* function */;
}; /* size: 0x0030 */

struct ISystemActivator
{
}; /* size: 0x0008 */

struct ISystemDebugEventFire
{
}; /* size: 0x0008 */

struct ISystemDebugEventShutdown
{
}; /* size: 0x0008 */

struct IThumbnailExtractor
{
}; /* size: 0x0008 */

struct IThunkManager
{
}; /* size: 0x0008 */

struct ITimeAndNoticeControl
{
}; /* size: 0x0008 */

class ITrackingMoniker
{
}; /* size: 0x0008 */

struct ITypeChangeEvents
{
}; /* size: 0x0008 */

struct ITypeComp
{
  /* 0x0000 */ struct ITypeCompVtbl* lpVtbl;
}; /* size: 0x0008 */

struct ITypeCompVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* Bind /* function */;
  /* 0x0020 */ void* BindType /* function */;
}; /* size: 0x0028 */

struct ITypeFactory
{
}; /* size: 0x0008 */

struct ITypeInfo
{
}; /* size: 0x0008 */

struct ITypeInfo2
{
}; /* size: 0x0008 */

struct ITypeInfoVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* GetTypeAttr /* function */;
  /* 0x0020 */ void* GetTypeComp /* function */;
  /* 0x0028 */ void* GetFuncDesc /* function */;
  /* 0x0030 */ void* GetVarDesc /* function */;
  /* 0x0038 */ void* GetNames /* function */;
  /* 0x0040 */ void* GetRefTypeOfImplType /* function */;
  /* 0x0048 */ void* GetImplTypeFlags /* function */;
  /* 0x0050 */ void* GetIDsOfNames /* function */;
  /* 0x0058 */ void* Invoke /* function */;
  /* 0x0060 */ void* GetDocumentation /* function */;
  /* 0x0068 */ void* GetDllEntry /* function */;
  /* 0x0070 */ void* GetRefTypeInfo /* function */;
  /* 0x0078 */ void* AddressOfMember /* function */;
  /* 0x0080 */ void* CreateInstance /* function */;
  /* 0x0088 */ void* GetMops /* function */;
  /* 0x0090 */ void* GetContainingTypeLib /* function */;
  /* 0x0098 */ void* ReleaseTypeAttr /* function */;
  /* 0x00a0 */ void* ReleaseFuncDesc /* function */;
  /* 0x00a8 */ void* ReleaseVarDesc /* function */;
}; /* size: 0x00b0 */

struct ITypeLib
{
}; /* size: 0x0008 */

struct ITypeLib2
{
}; /* size: 0x0008 */

struct ITypeLibVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* GetTypeInfoCount /* function */;
  /* 0x0020 */ void* GetTypeInfo /* function */;
  /* 0x0028 */ void* GetTypeInfoType /* function */;
  /* 0x0030 */ void* GetTypeInfoOfGuid /* function */;
  /* 0x0038 */ void* GetLibAttr /* function */;
  /* 0x0040 */ void* GetTypeComp /* function */;
  /* 0x0048 */ void* GetDocumentation /* function */;
  /* 0x0050 */ void* IsName /* function */;
  /* 0x0058 */ void* FindName /* function */;
  /* 0x0060 */ void* ReleaseTLibAttr /* function */;
}; /* size: 0x0068 */

struct ITypeMarshal
{
}; /* size: 0x0008 */

struct IUnkInner
{
}; /* size: 0x0008 */

struct IUnknown
{
}; /* size: 0x0008 */

struct IUnknownVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
}; /* size: 0x0018 */

struct IUri
{
}; /* size: 0x0008 */

struct IUriBuilder
{
}; /* size: 0x0008 */

struct IUriBuilderFactory
{
}; /* size: 0x0008 */

struct IUriContainer
{
}; /* size: 0x0008 */

struct IUrlMon
{
}; /* size: 0x0008 */

struct IUserToken
{
}; /* size: 0x0008 */

struct IUserTokenWithImpersonate
{
}; /* size: 0x0008 */

struct IViewObject
{
  /* 0x0000 */ struct IViewObjectVtbl* lpVtbl;
}; /* size: 0x0008 */

struct IViewObject2
{
}; /* size: 0x0008 */

struct IViewObjectEx
{
}; /* size: 0x0008 */

struct IViewObjectVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* Draw /* function */;
  /* 0x0020 */ void* GetColorSet /* function */;
  /* 0x0028 */ void* Freeze /* function */;
  /* 0x0030 */ void* Unfreeze /* function */;
  /* 0x0038 */ void* SetAdvise /* function */;
  /* 0x0040 */ void* GetAdvise /* function */;
}; /* size: 0x0048 */

struct IWaitMultiple
{
}; /* size: 0x0008 */

struct IWinInetCacheHints
{
}; /* size: 0x0008 */

struct IWinInetCacheHints2
{
}; /* size: 0x0008 */

struct IWinInetFileStream
{
}; /* size: 0x0008 */

struct IWinInetHttpInfo
{
}; /* size: 0x0008 */

struct IWinInetInfo
{
}; /* size: 0x0008 */

struct IWindowForBindingUI
{
}; /* size: 0x0008 */

struct IWrappedProtocol
{
}; /* size: 0x0008 */

struct IWrapperInfo
{
}; /* size: 0x0008 */

struct IXMLAttribute
{
}; /* size: 0x0008 */

struct IXMLDOMAttribute
{
}; /* size: 0x0008 */

struct IXMLDOMCDATASection
{
}; /* size: 0x0008 */

struct IXMLDOMCharacterData
{
}; /* size: 0x0008 */

struct IXMLDOMComment
{
}; /* size: 0x0008 */

struct IXMLDOMDocument
{
}; /* size: 0x0008 */

struct IXMLDOMDocumentFragment
{
}; /* size: 0x0008 */

struct IXMLDOMDocumentType
{
}; /* size: 0x0008 */

struct IXMLDOMElement
{
}; /* size: 0x0008 */

struct IXMLDOMEntity
{
}; /* size: 0x0008 */

struct IXMLDOMEntityReference
{
}; /* size: 0x0008 */

struct IXMLDOMImplementation
{
}; /* size: 0x0008 */

struct IXMLDOMNamedNodeMap
{
}; /* size: 0x0008 */

struct IXMLDOMNode
{
}; /* size: 0x0008 */

struct IXMLDOMNodeList
{
}; /* size: 0x0008 */

struct IXMLDOMNotation
{
}; /* size: 0x0008 */

struct IXMLDOMParseError
{
}; /* size: 0x0008 */

struct IXMLDOMProcessingInstruction
{
}; /* size: 0x0008 */

struct IXMLDOMText
{
}; /* size: 0x0008 */

struct IXMLDSOControl
{
}; /* size: 0x0008 */

struct IXMLDocument
{
}; /* size: 0x0008 */

struct IXMLDocument2
{
}; /* size: 0x0008 */

struct IXMLElement
{
}; /* size: 0x0008 */

struct IXMLElement2
{
}; /* size: 0x0008 */

struct IXMLElementCollection
{
}; /* size: 0x0008 */

struct IXMLError
{
}; /* size: 0x0008 */

struct IXMLHttpRequest
{
}; /* size: 0x0008 */

struct IXTLRuntime
{
}; /* size: 0x0008 */

struct IZoneIdentifier
{
}; /* size: 0x0008 */

struct ImgDelayDescrV2
{
  /* 0x0000 */ unsigned long grAttrs;
  /* 0x0004 */ unsigned long rvaDLLName;
  /* 0x0008 */ unsigned long rvaHmod;
  /* 0x000c */ unsigned long rvaIAT;
  /* 0x0010 */ unsigned long rvaINT;
  /* 0x0014 */ unsigned long rvaBoundIAT;
  /* 0x0018 */ unsigned long rvaUnloadIAT;
  /* 0x001c */ unsigned long dwTimeStamp;
}; /* size: 0x0020 */

struct InFrame
{
  /* 0x0000 */ unsigned __int64 P1Home;
  /* 0x0008 */ unsigned __int64 P2Home;
  /* 0x0010 */ unsigned __int64 P3Home;
  /* 0x0018 */ unsigned __int64 P4Home;
  /* 0x0020 */ unsigned __int64 SavedRbp;
  /* 0x0028 */ unsigned __int64 SavedRsi;
  /* 0x0030 */ unsigned __int64 SavedRdi;
}; /* size: 0x0038 */

class InprocActpropsUnmarshaller
{
  /* 0x0000 */ class InprocActpropsUnmarshaller _InprocActUnmarshaller;
}; /* size: 0x0008 */

class InstanceInfo
{
  /* 0x0020 */ struct tagInstanceInfoData _instanceInfoData;
  /* 0x0040 */ struct IStorage* _pstg;
}; /* size: 0x0048 */

class InstantiationInfo
{
  /* 0x0020 */ struct tagInstantiationInfoData _instantiationInfoData;
  /* 0x0058 */ struct _GUID _pIIDs[10];
}; /* size: 0x00f8 */

class Interceptor
{
  /* 0x0030 */ struct ICallFrameEvents* m_pCallSink;
  /* 0x0038 */ void* const* m_pvtbl /* function */;
  /* 0x0040 */ struct MD_INTERFACE* m_pmdInterface;
  /* 0x0048 */ const struct tagCInterfaceStubHeader* m_pHeader;
  /* 0x0050 */ const struct tagProxyFileInfo** m_pProxyFileList;
  /* 0x0058 */ const char* m_szInterfaceName;
  /* 0x0060 */ int m_fMdOwnsHeader;
  /* 0x0064 */ int m_fUsingTypelib;
  /* 0x0068 */ struct TYPEINFOVTBL* m_ptypeinfovtbl;
  /* 0x0070 */ unsigned int m_cMethodsBase;
  /* 0x0078 */ struct ICallInterceptor* m_pBaseInterceptor;
  /* 0x0080 */ struct IUnknown* m_punkBaseInterceptor;
  /* 0x0088 */ struct MD_INTERFACE* m_pmdMostDerived;
  /* 0x0090 */ struct IUnknown* m_punkOuter;
  /* 0x0098 */ long m_refs;
}; /* size: 0x00a0 */

struct InterfaceWalkerFree
{
  /* 0x0008 */ struct ICallFrameWalker* m_pWalker;
}; /* size: 0x0010 */

struct KEY_PID_ARRAY
{
  /* 0x0000 */ void* PID;
  /* 0x0008 */ struct _UNICODE_STRING KeyName;
}; /* size: 0x0018 */

enum KF_CATEGORY
{
  KF_CATEGORY_VIRTUAL = 1,
  KF_CATEGORY_FIXED = 2,
  KF_CATEGORY_COMMON = 3,
  KF_CATEGORY_PERUSER = 4,
};

enum KNOWNDESTCATEGORY
{
  KDC_FREQUENT = 1,
  KDC_RECENT = 2,
};

struct KNOWNFOLDER_DEFINITION
{
  /* 0x0000 */ enum KF_CATEGORY category;
  /* 0x0008 */ wchar_t* pszName;
  /* 0x0010 */ wchar_t* pszDescription;
  /* 0x0018 */ struct _GUID fidParent;
  /* 0x0028 */ wchar_t* pszRelativePath;
  /* 0x0030 */ wchar_t* pszParsingName;
  /* 0x0038 */ wchar_t* pszTooltip;
  /* 0x0040 */ wchar_t* pszLocalizedName;
  /* 0x0048 */ wchar_t* pszIcon;
  /* 0x0050 */ wchar_t* pszSecurity;
  /* 0x0058 */ unsigned long dwAttributes;
  /* 0x005c */ unsigned long kfdFlags;
  /* 0x0060 */ struct _GUID ftidType;
}; /* size: 0x0070 */

enum LATENCY_TIME
{
  LT_DONT_CARE = 0,
  LT_LOWEST_LATENCY = 1,
};

struct LEGACY_FRAME
{
  /* 0x0010 */ void* m_pvArgs;
  /* 0x0018 */ const unsigned long m_iMethod;
  /* 0x0020 */ __int64 m_hrReturnValue;
  /* 0x0028 */ struct LEGACY_INTERCEPTOR* m_pInterceptor;
  /* 0x0030 */ struct ICallFrame* m_premoteFrame;
  /* 0x0038 */ struct ICallFrame* m_pmemoryFrame;
  /* 0x0040 */ int m_fAfterCall;
  /* 0x0048 */ struct IUnknown* m_punkOuter;
  /* 0x0050 */ long m_refs;
  /* 0x0054 */ long __PADDING__[1];
}; /* size: 0x0058 */

struct LEGACY_INTERCEPTOR
{
  /* 0x0040 */ struct ICallFrameEvents* m_psink;
  /* 0x0048 */ struct _GUID m_iid;
  /* 0x0058 */ unsigned long m_cMethods;
  /* 0x0060 */ struct XLOCK_LEAF m_frameLock;
  /* 0x0090 */ struct ICallFrame** m_ppframeCustomer;
  /* 0x0098 */ struct ICallInterceptor* m_premoteInterceptor;
  /* 0x00a0 */ int m_fRegdWithRemoteInterceptor;
  /* 0x00a8 */ struct ICallInterceptor* m_pmemoryInterceptor;
  /* 0x00b0 */ int m_fRegdWithMemoryInterceptor;
  /* 0x00b8 */ struct MD_INTERFACE* m_pmdMostDerived;
  /* 0x00c0 */ struct IUnknown* m_punkOuter;
  /* 0x00c8 */ long m_refs;
  /* 0x00cc */ int m_fShuttingDown;
}; /* size: 0x00d0 */

enum LIBRARYFOLDERFILTER
{
};

enum LIBRARYOPTIONFLAGS
{
};

enum LIBRARYSAVEFLAGS
{
};

struct LIST_ENTRY32
{
  /* 0x0000 */ unsigned long Flink;
  /* 0x0004 */ unsigned long Blink;
}; /* size: 0x0008 */

struct LIST_ENTRY64
{
  /* 0x0000 */ unsigned __int64 Flink;
  /* 0x0008 */ unsigned __int64 Blink;
}; /* size: 0x0010 */

enum LSA_FOREST_TRUST_RECORD_TYPE
{
  ForestTrustTopLevelName = 0,
  ForestTrustTopLevelNameEx = 1,
  ForestTrustDomainInfo = 2,
  ForestTrustRecordTypeLast = 2,
};

enum LoadOrFreeWhat
{
  LoadLibrarySucceeded = 0,
  LoadLibraryFailed = 1,
  CallingFreeLibrary = 2,
};

enum LoadOrFreeWhy
{
  LoadingInprocServer = 0,
  CoLoadLibraryCalled = 1,
  CoFreeLibraryCalled = 2,
  FailedToCreateAPathEntry = 3,
  AnotherThreadBeatUsHere = 4,
  NoValidEntryPoint = 5,
  NoLongerInUse = 6,
};

struct LocalThis
{
  /* 0x0000 */ unsigned long flags;
  /* 0x0004 */ unsigned long client_thread;
}; /* size: 0x0008 */

struct LockCookie
{
  /* 0x0000 */ unsigned long dwFlags;
  /* 0x0004 */ unsigned long dwWriterSeqNum;
  /* 0x0008 */ unsigned short wReaderLevel;
  /* 0x000a */ unsigned short wWriterLevel;
  /* 0x000c */ unsigned long dwThreadID;
}; /* size: 0x0010 */

class LockEntry
{
  /* 0x0000 */ class LockEntry* _pNext;
  /* 0x0008 */ class LockEntry* _pPrev;
  /* 0x0010 */ class CRWLock* _pRWLock;
  /* 0x0018 */ unsigned short _wReaderLevel;
}; /* size: 0x0020 */

enum MACPICTFAILUREREASONS
{
  MACPICTUNSUPPORTED = 0,
  MACPICTCONVERSIONDLLNOTFOUND = 1,
};

class MAP<XSLOCK,MAP_KEY_GUID,INTERFACE_HELPER_CLSID *>
{
  /* 0x0008 */ class XSLOCK m_lock;
  /* 0x0088 */ class Map<MAP_KEY_GUID,INTERFACE_HELPER_CLSID *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow> m_map;
  /* 0x00b0 */ int m_fCsInitialized;
}; /* size: 0x00b8 */

class MAP<XSLOCK,MAP_KEY_GUID,INTERFACE_HELPER_CLSID *>::iterator
{
  /* 0x0000 */ class EnumMap<MAP_KEY_GUID,INTERFACE_HELPER_CLSID *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow> m_enum;
  /* 0x0018 */ int m_fDone;
  /* 0x0020 */ class MAP_KEY_GUID* m_pkey;
  /* 0x0028 */ struct INTERFACE_HELPER_CLSID** m_pvalue;
  /* 0x0030 */ class Map<MAP_KEY_GUID,INTERFACE_HELPER_CLSID *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>* m_pmap;
}; /* size: 0x0038 */

class MAP<XSLOCK,MAP_KEY_GUID,MD_INTERFACE *>
{
  /* 0x0008 */ class XSLOCK m_lock;
  /* 0x0088 */ class Map<MAP_KEY_GUID,MD_INTERFACE *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow> m_map;
  /* 0x00b0 */ int m_fCsInitialized;
}; /* size: 0x00b8 */

class MAP<XSLOCK,MAP_KEY_GUID,MD_INTERFACE *>::iterator;

class MAP<XSLOCK,MAP_KEY_GUID,TYPEINFOVTBL *>
{
  /* 0x0008 */ class XSLOCK m_lock;
  /* 0x0088 */ class Map<MAP_KEY_GUID,TYPEINFOVTBL *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow> m_map;
  /* 0x00b0 */ int m_fCsInitialized;
}; /* size: 0x00b8 */

class MAP<XSLOCK,MAP_KEY_GUID,TYPEINFOVTBL *>::iterator
{
  /* 0x0000 */ class EnumMap<MAP_KEY_GUID,TYPEINFOVTBL *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow> m_enum;
  /* 0x0018 */ int m_fDone;
  /* 0x0020 */ class MAP_KEY_GUID* m_pkey;
  /* 0x0028 */ struct TYPEINFOVTBL** m_pvalue;
  /* 0x0030 */ class Map<MAP_KEY_GUID,TYPEINFOVTBL *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>* m_pmap;
}; /* size: 0x0038 */

enum MAPPED_STREAM_OPTS
{
  MAPPED_STREAM_CREATE = 0,
  MAPPED_STREAM_QI = 1,
};

struct MAP_HASHER<MAP_KEY_GUID>
{
}; /* size: 0x0001 */

class MAP_KEY_GUID
{
  /* 0x0000 */ struct _GUID guid;
}; /* size: 0x0010 */

struct MAP_SHARED<MAP_KEY_GUID,INTERFACE_HELPER_CLSID *>
{
}; /* size: 0x00b8 */

struct MAP_SHARED<MAP_KEY_GUID,MD_INTERFACE *>
{
}; /* size: 0x00b8 */

struct MAP_SHARED<MAP_KEY_GUID,TYPEINFOVTBL *>
{
}; /* size: 0x00b8 */

enum MARKUPLINKTEXT
{
  MARKUPLINKTEXT_URL = 0,
  MARKUPLINKTEXT_ID = 1,
  MARKUPLINKTEXT_TEXT = 2,
};

enum MARKUPMESSAGE
{
  MARKUPMESSAGE_KEYEXECUTE = 0,
  MARKUPMESSAGE_CLICKEXECUTE = 1,
  MARKUPMESSAGE_WANTFOCUS = 2,
};

enum MARKUPSIZE
{
  MARKUPSIZE_CALCWIDTH = 0,
  MARKUPSIZE_CALCHEIGHT = 1,
};

struct MARK_HANDLE_INFO
{
  /* 0x0000 */ unsigned long UsnSourceInfo;
  /* 0x0008 */ void* VolumeHandle;
  /* 0x0010 */ unsigned long HandleInfo;
  /* 0x0014 */ long __PADDING__[1];
}; /* size: 0x0018 */

struct MARK_HANDLE_INFO32
{
  /* 0x0000 */ unsigned long UsnSourceInfo;
  /* 0x0004 */ unsigned int VolumeHandle;
  /* 0x0008 */ unsigned long HandleInfo;
}; /* size: 0x000c */

enum MCA_EXCEPTION_TYPE
{
  HAL_MCE_RECORD = 0,
  HAL_MCA_RECORD = 1,
};

struct MD_INTERFACE
{
  /* 0x0000 */ volatile long m_refs;
  /* 0x0004 */ unsigned long m_cMethods;
  /* 0x0008 */ unsigned long m_cMethodsInBaseInterface;
  /* 0x0010 */ struct MD_METHOD* m_rgMethodsAlloc;
  /* 0x0018 */ struct MD_METHOD* m_rgMethods;
  /* 0x0020 */ struct MD_PARAM* m_rgParams;
  /* 0x0028 */ int m_fFreeInfoOnRelease;
  /* 0x002c */ int m_fDerivesFromIDispatch;
  /* 0x0030 */ const struct tagCInterfaceStubHeader* m_pHeader;
  /* 0x0038 */ const char* m_szInterfaceName;
  /* 0x0040 */ struct MD_INTERFACE_CACHE* m_pcache;
}; /* size: 0x0048 */

struct MD_INTERFACE_CACHE
{
}; /* size: 0x00b8 */

struct MD_METHOD
{
  /* 0x0000 */ unsigned long m_numberOfParams;
  /* 0x0008 */ struct PARAM_DESCRIPTION* m_params;
  /* 0x0010 */ struct INTERPRETER_OPT_FLAGS m_optFlags;
  /* 0x0014 */ unsigned long m_rpcFlags;
  /* 0x0018 */ const struct _MIDL_STUB_DESC* m_pStubDesc;
  /* 0x0020 */ unsigned long m_cbPushedByCaller;
  /* 0x0024 */ unsigned short m_cbClientBuffer;
  /* 0x0026 */ unsigned short m_cbServerBuffer;
  /* 0x0028 */ unsigned long m_cbStackInclRet;
  /* 0x002c */ struct __MIDL_ICallFrame_0001 m_info;
  /* 0x0068 */ int m_fCanShareAllParameters;
  /* 0x0070 */ const struct tagCInterfaceStubHeader* m_pHeader;
  /* 0x0078 */ unsigned long m_iMethod;
  /* 0x0080 */ struct MD_INTERFACE* m_pmdInterface;
  /* 0x0088 */ struct MD_PARAM* m_rgParams;
  /* 0x0090 */ wchar_t* m_wszMethodName;
  /* 0x0098 */ struct NDR_PROC_HEADER_EXTS* m_pHeaderExts;
}; /* size: 0x00a0 */

struct MD_PARAM
{
  /* 0x0000 */ int m_fCanShare;
  /* 0x0004 */ int m_fMayHaveInterfacePointers;
}; /* size: 0x0008 */

struct MEMSTM
{
  /* 0x0000 */ unsigned long cb;
  /* 0x0004 */ unsigned long cRef;
  /* 0x0008 */ unsigned char* m_pBuf;
  /* 0x0010 */ void* hGlobal;
  /* 0x0018 */ int fDeleteOnRelease;
  /* 0x001c */ long __PADDING__[1];
}; /* size: 0x0020 */

struct MENUITEMTEMPLATE
{
  /* 0x0000 */ unsigned short mtOption;
  /* 0x0002 */ unsigned short mtID;
  /* 0x0004 */ wchar_t mtString[1];
}; /* size: 0x0006 */

struct MENUITEMTEMPLATEHEADER
{
  /* 0x0000 */ unsigned short versionNumber;
  /* 0x0002 */ unsigned short offset;
}; /* size: 0x0004 */

struct METHOD_DESCRIPTOR
{
  /* 0x0000 */ wchar_t* m_szMethodName;
  /* 0x0008 */ short m_cParams;
  /* 0x0010 */ unsigned short* m_paramVTs;
}; /* size: 0x0018 */

struct MFT_ENUM_DATA
{
  /* 0x0000 */ unsigned __int64 StartFileReferenceNumber;
  /* 0x0008 */ __int64 LowUsn;
  /* 0x0010 */ __int64 HighUsn;
}; /* size: 0x0018 */

class MIDEntry
{
  /* 0x0000 */ struct SStringHashNode _Node;
  /* 0x0020 */ unsigned __int64 _mid;
  /* 0x0028 */ unsigned long _cRefs;
  /* 0x002c */ unsigned long _dwFlags;
}; /* size: 0x0030 */

enum MIDL_ES_CODE
{
  MES_ENCODE = 0,
  MES_DECODE = 1,
  MES_ENCODE_NDR64 = 2,
};

enum MIDL_ES_HANDLE_STYLE
{
  MES_INCREMENTAL_HANDLE = 0,
  MES_FIXED_BUFFER_HANDLE = 1,
  MES_DYNAMIC_BUFFER_HANDLE = 2,
};

class MINICOMPUTE_QUEUE_CONTEXT
{
  /* 0x0000 */ class MINICOMPUTE_QUEUE_CONTEXT* pNext;
  /* 0x0008 */ class NDR_MINICOMPUTE_QUEUE_ELEMENT* pHead;
  /* 0x0010 */ class NDR_MINICOMPUTE_QUEUE_ELEMENT* pTail;
  /* 0x0018 */ class NDR_MINICOMPUTE_QUEUE_ELEMENT* pConfStruct;
  /* 0x0020 */ int IsConfStructValid;
}; /* size: 0x0028 */

struct MINIDUMP_EXCEPTION_STREAM
{
  /* 0x0000 */ unsigned int ThreadId;
  /* 0x0004 */ unsigned int __alignment;
  /* 0x0008 */ struct _MINIDUMP_EXCEPTION ExceptionRecord;
  /* 0x00a0 */ struct _MINIDUMP_LOCATION_DESCRIPTOR ThreadContext;
}; /* size: 0x00a8 */

struct MIPID
{
  /* 0x0000 */ unsigned __int64 mid;
  /* 0x0008 */ struct _GUID ipid;
  /* 0x0018 */ unsigned long dwApt;
  /* 0x001c */ long __PADDING__[1];
}; /* size: 0x0020 */

struct MOVE_FILE_DATA
{
  /* 0x0000 */ void* FileHandle;
  /* 0x0008 */ union _LARGE_INTEGER StartingVcn;
  /* 0x0010 */ union _LARGE_INTEGER StartingLcn;
  /* 0x0018 */ unsigned long ClusterCount;
  /* 0x001c */ long __PADDING__[1];
}; /* size: 0x0020 */

struct MOVE_FILE_RECORD_DATA
{
  /* 0x0000 */ void* FileHandle;
  /* 0x0008 */ union _LARGE_INTEGER SourceFileRecord;
  /* 0x0010 */ union _LARGE_INTEGER TargetFileRecord;
}; /* size: 0x0018 */

class Map<MAP_KEY_GUID,INTERFACE_HELPER_CLSID *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>
{
  /* 0x0000 */ class Map<MAP_KEY_GUID,INTERFACE_HELPER_CLSID *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>::Assoc** m_rgpAssoc;
  /* 0x0008 */ unsigned int m_cAssoc;
  /* 0x000c */ unsigned int m_cPresent;
  /* 0x0010 */ class Map<MAP_KEY_GUID,INTERFACE_HELPER_CLSID *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>::Assoc* m_pAssocFree;
  /* 0x0018 */ class CListHeader m_listInUse;
}; /* size: 0x0028 */

class Map<MAP_KEY_GUID,INTERFACE_HELPER_CLSID *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>::Assoc
{
  /* 0x0010 */ class Map<MAP_KEY_GUID,INTERFACE_HELPER_CLSID *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>::Assoc* m_pAssocNext;
  /* 0x0018 */ long m_lcUse;
  /* 0x001c */ class MAP_KEY_GUID m_d;
  /* 0x0030 */ struct INTERFACE_HELPER_CLSID* m_r;
}; /* size: 0x0038 */

class Map<MAP_KEY_GUID,MD_INTERFACE *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>
{
  /* 0x0000 */ class Map<MAP_KEY_GUID,MD_INTERFACE *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>::Assoc** m_rgpAssoc;
  /* 0x0008 */ unsigned int m_cAssoc;
  /* 0x000c */ unsigned int m_cPresent;
  /* 0x0010 */ class Map<MAP_KEY_GUID,MD_INTERFACE *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>::Assoc* m_pAssocFree;
  /* 0x0018 */ class CListHeader m_listInUse;
}; /* size: 0x0028 */

class Map<MAP_KEY_GUID,MD_INTERFACE *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>::Assoc
{
  /* 0x0010 */ class Map<MAP_KEY_GUID,MD_INTERFACE *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>::Assoc* m_pAssocNext;
  /* 0x0018 */ long m_lcUse;
  /* 0x001c */ class MAP_KEY_GUID m_d;
  /* 0x0030 */ struct MD_INTERFACE* m_r;
}; /* size: 0x0038 */

class Map<MAP_KEY_GUID,TYPEINFOVTBL *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>
{
  /* 0x0000 */ class Map<MAP_KEY_GUID,TYPEINFOVTBL *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>::Assoc** m_rgpAssoc;
  /* 0x0008 */ unsigned int m_cAssoc;
  /* 0x000c */ unsigned int m_cPresent;
  /* 0x0010 */ class Map<MAP_KEY_GUID,TYPEINFOVTBL *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>::Assoc* m_pAssocFree;
  /* 0x0018 */ class CListHeader m_listInUse;
}; /* size: 0x0028 */

class Map<MAP_KEY_GUID,TYPEINFOVTBL *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>::Assoc
{
  /* 0x0010 */ class Map<MAP_KEY_GUID,TYPEINFOVTBL *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>::Assoc* m_pAssocNext;
  /* 0x0018 */ long m_lcUse;
  /* 0x001c */ class MAP_KEY_GUID m_d;
  /* 0x0030 */ struct TYPEINFOVTBL* m_r;
}; /* size: 0x0038 */

class MapEnumToSQMData<enum Ole32SQMFlags>
{
}; /* size: 0x0001 */

typedef enum _TAG_UNNAMED_17
{
  DataID = 2343,
} TAG_UNNAMED_17, *PTAG_UNNAMED_17;

class MapEnumToSQMData<enum RpcssSQMFlags>
{
}; /* size: 0x0001 */

typedef enum _TAG_UNNAMED_18
{
  DataID = 2342,
} TAG_UNNAMED_18, *PTAG_UNNAMED_18;

struct MarshalParams
{
  /* 0x0000 */ struct _GUID iid;
  /* 0x0010 */ unsigned long mshlflags;
}; /* size: 0x0014 */

struct MarshallingChannel
{
  /* 0x0018 */ struct IMarshallingManager* m_pMarshaller;
  /* 0x0020 */ unsigned long m_dwDestContext;
  /* 0x0028 */ void* m_pvDestContext;
  /* 0x0030 */ struct IUnknown* m_punkOuter;
  /* 0x0038 */ long m_refs;
  /* 0x003c */ long __PADDING__[1];
}; /* size: 0x0040 */

enum NAMESPACE_FOLDER_PREFERENCES_FLAGS
{
  FVPF_DEFAULT = 0,
  FVPF_ALLOWITEMSVIEW = 1,
};

enum NCIFLAGS
{
  NCI_HAVECLSID = 1,
  NCI_HAVEPROGID = 2,
};

struct NCryptKeyName
{
  /* 0x0000 */ wchar_t* pszName;
  /* 0x0008 */ wchar_t* pszAlgid;
  /* 0x0010 */ unsigned long dwLegacyKeySpec;
  /* 0x0014 */ unsigned long dwFlags;
}; /* size: 0x0018 */

struct NCryptProviderName
{
  /* 0x0000 */ wchar_t* pszName;
  /* 0x0008 */ wchar_t* pszComment;
}; /* size: 0x0010 */

class NDR64_BUFSIZE_POINTER_QUEUE_ELEMENT
{
  /* 0x0010 */ __int64* pBufferMark;
  /* 0x0018 */ unsigned char* pMemory;
  /* 0x0020 */ const unsigned char* pFormat;
  /* 0x0028 */ unsigned char* pCorrMemory;
  /* 0x0030 */ unsigned char uFlags;
}; /* size: 0x0038 */

enum NDR64_FORMAT_CHARACTER
{
  FC64_ZERO = 0,
  FC64_UINT8 = 1,
  FC64_INT8 = 2,
  FC64_UINT16 = 3,
  FC64_INT16 = 4,
  FC64_INT32 = 5,
  FC64_UINT32 = 6,
  FC64_INT64 = 7,
  FC64_UINT64 = 8,
  FC64_INT128 = 9,
  FC64_UINT128 = 10,
  FC64_FLOAT32 = 11,
  FC64_FLOAT64 = 12,
  FC64_FLOAT80 = 13,
  FC64_FLOAT128 = 14,
  FC64_CHAR = 16,
  FC64_WCHAR = 17,
  FC64_IGNORE = 18,
  FC64_ERROR_STATUS_T = 19,
  FC64_POINTER = 20,
  FC64_RP = 32,
  FC64_UP = 33,
  FC64_OP = 34,
  FC64_FP = 35,
  FC64_IP = 36,
  FC64_STRUCT = 48,
  FC64_PSTRUCT = 49,
  FC64_CONF_STRUCT = 50,
  FC64_CONF_PSTRUCT = 51,
  FC64_BOGUS_STRUCT = 52,
  FC64_FORCED_BOGUS_STRUCT = 53,
  FC64_CONF_BOGUS_STRUCT = 54,
  FC64_FORCED_CONF_BOGUS_STRUCT = 55,
  FC64_FIX_ARRAY = 64,
  FC64_CONF_ARRAY = 65,
  FC64_VAR_ARRAY = 66,
  FC64_CONFVAR_ARRAY = 67,
  FC64_FIX_FORCED_BOGUS_ARRAY = 68,
  FC64_FIX_BOGUS_ARRAY = 69,
  FC64_FORCED_BOGUS_ARRAY = 70,
  FC64_BOGUS_ARRAY = 71,
  FC64_ENCAPSULATED_UNION = 80,
  FC64_NON_ENCAPSULATED_UNION = 81,
  FC64_CHAR_STRING = 96,
  FC64_WCHAR_STRING = 97,
  FC64_STRUCT_STRING = 98,
  FC64_CONF_CHAR_STRING = 99,
  FC64_CONF_WCHAR_STRING = 100,
  FC64_CONF_STRUCT_STRING = 101,
  FC64_BIND_CONTEXT = 112,
  FC64_BIND_GENERIC = 113,
  FC64_BIND_PRIMITIVE = 114,
  FC64_AUTO_HANDLE = 115,
  FC64_CALLBACK_HANDLE = 116,
  FC64_SUPPLEMENT = 117,
  FC64_NO_REPEAT = 128,
  FC64_FIXED_REPEAT = 129,
  FC64_VARIABLE_REPEAT = 130,
  FC64_FIXED_OFFSET = 131,
  FC64_VARIABLE_OFFSET = 132,
  FC64_STRUCTPADN = 144,
  FC64_EMBEDDED_COMPLEX = 145,
  FC64_BUFFER_ALIGN = 146,
  FC64_END = 147,
  FC64_TRANSMIT_AS = 160,
  FC64_REPRESENT_AS = 161,
  FC64_USER_MARSHAL = 162,
  FC64_PIPE = 163,
  FC64_RANGE = 164,
  FC64_PAD = 165,
};

class NDR64_FREE_POINTER_QUEUE_ELEMENT
{
  /* 0x0010 */ unsigned char* const pMemory;
  /* 0x0018 */ const unsigned char* const pFormat;
  /* 0x0020 */ unsigned char* const pCorrMemory;
  /* 0x0028 */ const unsigned char uFlags;
}; /* size: 0x0030 */

class NDR64_MEMSIZE_POINTER_QUEUE_ELEMENT
{
  /* 0x0010 */ const unsigned char* const pFormat;
  /* 0x0018 */ const unsigned char uFlags;
  /* 0x0020 */ __int64* const pBufferMark;
}; /* size: 0x0028 */

class NDR64_MRSHL_POINTER_QUEUE_ELEMENT
{
  /* 0x0010 */ __int64* const pBufferMark;
  /* 0x0018 */ unsigned char* const pMemory;
  /* 0x0020 */ const unsigned char* const pFormat;
  /* 0x0028 */ unsigned char* const pCorrMemory;
  /* 0x0030 */ const unsigned char uFlags;
}; /* size: 0x0038 */

struct NDR64_PIPE_FLAGS
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned char Reserved1 : 5; /* bit position: 0 */
    /* 0x0000 */ unsigned char HasRange : 1; /* bit position: 5 */
    /* 0x0000 */ unsigned char BlockCopy : 1; /* bit position: 6 */
    /* 0x0000 */ unsigned char Reserved2 : 1; /* bit position: 7 */
  }; /* bitfield */
}; /* size: 0x0001 */

struct NDR64_SIZED_CONFORMANT_STRING_FORMAT
{
  /* 0x0000 */ struct NDR64_STRING_HEADER_FORMAT Header;
  /* 0x0008 */ const void* SizeDescription;
}; /* size: 0x0010 */

struct NDR64_STRING_HEADER_FORMAT
{
  /* 0x0000 */ unsigned char FormatCode;
  /* 0x0001 */ struct _NDR64_STRING_FLAGS Flags;
  /* 0x0002 */ unsigned short ElementSize;
}; /* size: 0x0004 */

class NDR64_UNMRSHL_POINTER_QUEUE_ELEMENT
{
  /* 0x0010 */ __int64 WirePtr;
  /* 0x0018 */ unsigned char** ppMemory;
  /* 0x0020 */ unsigned char* pMemory;
  /* 0x0028 */ const unsigned char* pFormat;
  /* 0x0030 */ unsigned char* pCorrMemory;
  /* 0x0038 */ struct NDR_ALLOC_ALL_NODES_CONTEXT* pAllocAllNodesContext;
  /* 0x0040 */ int fInDontFree;
  /* 0x0044 */ unsigned char uFlags;
}; /* size: 0x0048 */

class NDR64_USR_MRSHL_BUFSIZE_POINTER_QUEUE_ELEMENT
{
  /* 0x0010 */ unsigned char* const pMemory;
  /* 0x0018 */ const unsigned char* const pFormat;
}; /* size: 0x0020 */

class NDR64_USR_MRSHL_MEMSIZE_POINTER_QUEUE_ELEMENT
{
  /* 0x0010 */ const unsigned char* const pFormat;
}; /* size: 0x0018 */

class NDR64_USR_MRSHL_MRSHL_POINTER_QUEUE_ELEMENT
{
  /* 0x0010 */ unsigned char* const pMemory;
  /* 0x0018 */ const unsigned char* const pFormat;
  /* 0x0020 */ __int64* const pWireMarkerPtr;
}; /* size: 0x0028 */

class NDR64_USR_MRSHL_UNMRSHL_POINTER_QUEUE_ELEMENT
{
  /* 0x0010 */ unsigned char* const pMemory;
  /* 0x0018 */ const unsigned char* const pFormat;
}; /* size: 0x0020 */

class NDRHash<_CONTEXT_HANDLE_ELEMENT>;

class NDRHash<_FULL_PTR_TO_REFID_ELEMENT>;

class NDRHash<_REFID_TO_FULLPTR_ELEMENT>;

struct NDR_ALLOC_ALL_NODES_CONTEXT
{
  /* 0x0000 */ unsigned char* AllocAllNodesMemory;
  /* 0x0008 */ unsigned char* AllocAllNodesMemoryBegin;
  /* 0x0010 */ unsigned char* AllocAllNodesMemoryEnd;
  /* 0x0018 */ int IsByteCount;
  /* 0x001c */ long __PADDING__[1];
}; /* size: 0x0020 */

class NDR_BUFSIZE_POINTER_QUEUE_ELEMENT
{
  /* 0x0010 */ unsigned char* const pMemory;
  /* 0x0018 */ const unsigned char* const pFormat;
  /* 0x0020 */ unsigned char* const Memory;
  /* 0x0028 */ const unsigned char uFlags;
}; /* size: 0x0030 */

struct NDR_CONTEXT_HANDLE_ARG_DESC
{
  /* 0x0000 */ unsigned char Fc;
  /* 0x0001 */ struct NDR_CONTEXT_HANDLE_FLAGS Flags;
  /* 0x0002 */ unsigned char RundownRtnIndex;
  /* 0x0003 */ unsigned char ParamOrdinal;
}; /* size: 0x0004 */

struct NDR_CONTEXT_HANDLE_FLAGS
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned char CannotBeNull : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned char Serialize : 1; /* bit position: 1 */
    /* 0x0000 */ unsigned char NoSerialize : 1; /* bit position: 2 */
    /* 0x0000 */ unsigned char IsStrict : 1; /* bit position: 3 */
    /* 0x0000 */ unsigned char IsReturn : 1; /* bit position: 4 */
    /* 0x0000 */ unsigned char IsOut : 1; /* bit position: 5 */
    /* 0x0000 */ unsigned char IsIn : 1; /* bit position: 6 */
    /* 0x0000 */ unsigned char IsViaPtr : 1; /* bit position: 7 */
  }; /* bitfield */
}; /* size: 0x0001 */

class NDR_CONVERT_POINTER_QUEUE_ELEMENT
{
  /* 0x0010 */ const unsigned char* const pFormat;
  /* 0x0018 */ unsigned char* const pBufferMark;
  /* 0x0020 */ const unsigned char uFlags;
}; /* size: 0x0028 */

class NDR_FREE_POINTER_QUEUE_ELEMENT
{
  /* 0x0010 */ unsigned char* const pMemory;
  /* 0x0018 */ const unsigned char* const pFormat;
  /* 0x0020 */ unsigned char* const Memory;
  /* 0x0028 */ const unsigned char uFlags;
}; /* size: 0x0030 */

struct NDR_MEMORY_VALIDATION
{
  /* 0x0000 */ void* pfn /* function */;
  /* 0x0008 */ void* pCookie;
}; /* size: 0x0010 */

class NDR_MEMSIZE_POINTER_QUEUE_ELEMENT
{
  /* 0x0010 */ const unsigned char* const pFormat;
  /* 0x0018 */ unsigned char* const pBufferMark;
  /* 0x0020 */ unsigned char* const Memory;
  /* 0x0028 */ const unsigned char uFlags;
}; /* size: 0x0030 */

class NDR_MINICOMPUTE_QUEUE
{
  /* 0x0008 */ struct _MIDL_STUB_MESSAGE* pStubMsg;
  /* 0x0010 */ struct _NDR_PROC_CONTEXT* pProcContext;
  /* 0x0018 */ class MINICOMPUTE_QUEUE_CONTEXT* pQueueState;
}; /* size: 0x0020 */

class NDR_MINICOMPUTE_QUEUE_ELEMENT
{
  /* 0x0000 */ class NDR_MINICOMPUTE_QUEUE_ELEMENT* pNext;
  /* 0x0008 */ const unsigned char* pConfFormat;
  /* 0x0010 */ unsigned __int64 ConfValue;
  /* 0x0018 */ unsigned __int64 VaryingValue;
}; /* size: 0x0020 */

class NDR_MRSHL_POINTER_QUEUE_ELEMENT
{
  /* 0x0010 */ unsigned char* const pBufferMark;
  /* 0x0018 */ unsigned char* const pMemory;
  /* 0x0020 */ const unsigned char* const pFormat;
  /* 0x0028 */ unsigned char* const Memory;
  /* 0x0030 */ const unsigned char uFlags;
}; /* size: 0x0038 */

class NDR_PFNFREE_POINTER_QUEUE_ELEMENT
{
  /* 0x0010 */ void* pfnFree /* function */;
  /* 0x0018 */ unsigned char* pMemory;
}; /* size: 0x0020 */

class NDR_PIPE_HELPER
{
}; /* size: 0x0008 */

struct NDR_PIPE_STATE
{
  /* 0x0000 */ int CurrentState;
  /* 0x0004 */ int TotalElemsCount;
  /* 0x0008 */ int OrigElemsInChunk;
  /* 0x000c */ int ElemsInChunk;
  /* 0x0010 */ int ElemAlign;
  /* 0x0014 */ int ElemWireSize;
  /* 0x0018 */ int ElemMemSize;
  /* 0x001c */ int PartialBufferSize;
  /* 0x0020 */ unsigned char* PartialElem;
  /* 0x0028 */ int PartialElemSize;
  /* 0x002c */ int PartialOffset;
  struct /* bitfield */
  {
    /* 0x0030 */ int EndOfPipe : 1; /* bit position: 0 */
    /* 0x0030 */ int EndOfPipePending : 1; /* bit position: 1 */
  }; /* bitfield */
  /* 0x0034 */ int LowChunkLimit;
  /* 0x0038 */ int HighChunkLimit;
  /* 0x003c */ int fBlockCopy;
  /* 0x0040 */ int ElemPad;
  /* 0x0048 */ const unsigned char* TypeFormat;
}; /* size: 0x0050 */

enum NDR_PIPE_STATUS
{
  NDR_PIPE_NOT_OPENED = 0,
  NDR_PIPE_ACTIVE_IN = 1,
  NDR_PIPE_ACTIVE_OUT = 2,
  NDR_PIPE_DRAINED = 3,
};

class NDR_POINTER_CONTEXT<NONOICF_POINTER_QUEUE_STATE>
{
  /* 0x0000 */ BOOL bNewState;
  /* 0x0001 */ BOOL bNewQueue;
  /* 0x0008 */ struct _MIDL_STUB_MESSAGE* const pStubMsg;
  /* 0x0010 */ char PointerQueueStateStorage[80];
  /* 0x0060 */ class NDR_POINTER_QUEUE* pActiveQueue;
  /* 0x0068 */ char PointerQueueStorage[48];
}; /* size: 0x0098 */

class NDR_POINTER_CONTEXT<OICF_POINTER_QUEUE_STATE>
{
  /* 0x0000 */ BOOL bNewState;
  /* 0x0001 */ BOOL bNewQueue;
  /* 0x0008 */ struct _MIDL_STUB_MESSAGE* const pStubMsg;
  /* 0x0010 */ char PointerQueueStateStorage[72];
  /* 0x0058 */ class NDR_POINTER_QUEUE* pActiveQueue;
  /* 0x0060 */ char PointerQueueStorage[48];
}; /* size: 0x0090 */

class NDR_POINTER_QUEUE
{
  /* 0x0000 */ struct _MIDL_STUB_MESSAGE* pStubMsg;
  /* 0x0008 */ struct NDR_POINTER_QUEUE_STATE* pQueueState;
  /* 0x0010 */ class NDR_POINTER_QUEUE::STORAGE Storage;
}; /* size: 0x0030 */

class NDR_POINTER_QUEUE::STORAGE
{
  /* 0x0000 */ class NDR_POINTER_QUEUE_ELEMENT* pHead;
  /* 0x0008 */ class NDR_POINTER_QUEUE_ELEMENT* pPrevHead;
  /* 0x0010 */ class NDR_POINTER_QUEUE_ELEMENT** pInsertPointer;
  /* 0x0018 */ class NDR_POINTER_QUEUE_ELEMENT** pPrevInsertPointer;
}; /* size: 0x0020 */

class NDR_POINTER_QUEUE_ELEMENT
{
  /* 0x0008 */ class NDR_POINTER_QUEUE_ELEMENT* pNext;
}; /* size: 0x0010 */

struct NDR_POINTER_QUEUE_STATE
{
  /* 0x0008 */ class NDR_POINTER_QUEUE* pActiveQueue;
  /* 0x0010 */ struct ARRAY_INFO ArrayInfo;
}; /* size: 0x0040 */

struct NDR_PROC_HEADER_EXTS
{
  /* 0x0000 */ unsigned char Size;
  /* 0x0001 */ struct INTERPRETER_OPT_FLAGS2 Flags2;
  /* 0x0002 */ unsigned short ClientCorrHint;
  /* 0x0004 */ unsigned short ServerCorrHint;
  /* 0x0006 */ unsigned short NotifyIndex;
}; /* size: 0x0008 */

struct NDR_PROC_HEADER_EXTS64
{
  /* 0x0000 */ unsigned char Size;
  /* 0x0001 */ struct INTERPRETER_OPT_FLAGS2 Flags2;
  /* 0x0002 */ unsigned short ClientCorrHint;
  /* 0x0004 */ unsigned short ServerCorrHint;
  /* 0x0006 */ unsigned short NotifyIndex;
  /* 0x0008 */ unsigned short FloatArgMask;
}; /* size: 0x000a */

class NDR_UNMRSHL_POINTER_QUEUE_ELEMENT
{
  /* 0x0010 */ unsigned char** const ppMemory;
  /* 0x0018 */ unsigned char* const pMemory;
  /* 0x0020 */ long* const pBufferPointer;
  /* 0x0028 */ const unsigned char* const pFormat;
  /* 0x0030 */ unsigned char* const Memory;
  /* 0x0038 */ const unsigned char uFlags;
  /* 0x003a */ const unsigned short uFlags2;
  /* 0x003c */ const int fInDontFree;
  /* 0x0040 */ unsigned char* const pCorrMemory;
  /* 0x0048 */ struct NDR_ALLOC_ALL_NODES_CONTEXT* const pAllocAllNodesContext;
}; /* size: 0x0050 */

class NDR_USR_MRSHL_BUFSIZE_POINTER_QUEUE_ELEMENT
{
  /* 0x0010 */ unsigned char* const pMemory;
  /* 0x0018 */ const unsigned char* const pFormat;
}; /* size: 0x0020 */

class NDR_USR_MRSHL_MEMSIZE_POINTER_QUEUE_ELEMENT
{
  /* 0x0010 */ const unsigned char* const pFormat;
}; /* size: 0x0018 */

class NDR_USR_MRSHL_MRSHL_POINTER_QUEUE_ELEMENT
{
  /* 0x0010 */ unsigned char* const pMemory;
  /* 0x0018 */ const unsigned char* const pFormat;
  /* 0x0020 */ unsigned long* const pWireMarkerPtr;
}; /* size: 0x0028 */

class NDR_USR_MRSHL_UNMRSHL_POINTER_QUEUE_ELEMENT
{
  /* 0x0010 */ unsigned char* const pMemory;
  /* 0x0018 */ const unsigned char* const pFormat;
}; /* size: 0x0020 */

struct NET_ADDRESS_INFO_;

class NONOICF_POINTER_QUEUE_STATE
{
  /* 0x0000 */ const int ItemsToAllocate;
  /* 0x0040 */ class NDR_POINTER_QUEUE_ELEMENT* pFreeList;
  /* 0x0048 */ struct NONOICF_POINTER_QUEUE_STATE::AllocationElement* pAllocationList;
}; /* size: 0x0050 */

struct NONOICF_POINTER_QUEUE_STATE::AllocationElement
{
  /* 0x0000 */ unsigned __int64 ItemsAllocated;
  /* 0x0008 */ struct NONOICF_POINTER_QUEUE_STATE::AllocationElement* pNext;
  /* 0x0010 */ char Data[80][10];
}; /* size: 0x0330 */

struct NOTIFY_USER_POWER_SETTING
{
  /* 0x0000 */ struct _GUID Guid;
}; /* size: 0x0010 */

struct NTFS_EXTENDED_VOLUME_DATA
{
  /* 0x0000 */ unsigned long ByteCount;
  /* 0x0004 */ unsigned short MajorVersion;
  /* 0x0006 */ unsigned short MinorVersion;
}; /* size: 0x0008 */

struct NTFS_FILE_RECORD_INPUT_BUFFER
{
  /* 0x0000 */ union _LARGE_INTEGER FileReferenceNumber;
}; /* size: 0x0008 */

struct NTFS_FILE_RECORD_OUTPUT_BUFFER
{
  /* 0x0000 */ union _LARGE_INTEGER FileReferenceNumber;
  /* 0x0008 */ unsigned long FileRecordLength;
  /* 0x000c */ unsigned char FileRecordBuffer[1];
  /* 0x000d */ char __PADDING__[3];
}; /* size: 0x0010 */

struct NTFS_VOLUME_DATA_BUFFER
{
  /* 0x0000 */ union _LARGE_INTEGER VolumeSerialNumber;
  /* 0x0008 */ union _LARGE_INTEGER NumberSectors;
  /* 0x0010 */ union _LARGE_INTEGER TotalClusters;
  /* 0x0018 */ union _LARGE_INTEGER FreeClusters;
  /* 0x0020 */ union _LARGE_INTEGER TotalReserved;
  /* 0x0028 */ unsigned long BytesPerSector;
  /* 0x002c */ unsigned long BytesPerCluster;
  /* 0x0030 */ unsigned long BytesPerFileRecordSegment;
  /* 0x0034 */ unsigned long ClustersPerFileRecordSegment;
  /* 0x0038 */ union _LARGE_INTEGER MftValidDataLength;
  /* 0x0040 */ union _LARGE_INTEGER MftStartLcn;
  /* 0x0048 */ union _LARGE_INTEGER Mft2StartLcn;
  /* 0x0050 */ union _LARGE_INTEGER MftZoneStart;
  /* 0x0058 */ union _LARGE_INTEGER MftZoneEnd;
}; /* size: 0x0060 */

struct NUMPARSE
{
  /* 0x0000 */ int cDig;
  /* 0x0004 */ unsigned long dwInFlags;
  /* 0x0008 */ unsigned long dwOutFlags;
  /* 0x000c */ int cchUsed;
  /* 0x0010 */ int nBaseShift;
  /* 0x0014 */ int nPwr10;
}; /* size: 0x0018 */

struct NdrStringHeader
{
  /* 0x0000 */ unsigned long dwMax;
  /* 0x0004 */ unsigned long dwOffset;
  /* 0x0008 */ unsigned long dwActual;
}; /* size: 0x000c */

struct NdrStringPtrHeader
{
  /* 0x0000 */ unsigned long dwUnique;
  /* 0x0004 */ unsigned long dwMax;
  /* 0x0008 */ unsigned long dwOffset;
  /* 0x000c */ unsigned long dwActual;
}; /* size: 0x0010 */

class NuSafeNtHandle
{
  /* 0x0000 */ void* _handle;
}; /* size: 0x0008 */

struct OAUTIL
{
  /* 0x0000 */ struct ICallFrameWalker* m_pWalkerCopy;
  /* 0x0008 */ struct ICallFrameWalker* m_pWalkerFree;
  /* 0x0010 */ struct ICallFrameWalker* m_pWalkerWalk;
  /* 0x0018 */ int m_fWorkingOnInParam;
  /* 0x001c */ int m_fWorkingOnOutParam;
  /* 0x0020 */ int m_fDoNotWalkInterfaces;
  /* 0x0024 */ long __PADDING__[1];
}; /* size: 0x0028 */

struct OFFSETINSTANCEDATAANDLENGTH
{
  /* 0x0000 */ unsigned long OffsetInstanceData;
  /* 0x0004 */ unsigned long LengthInstanceData;
}; /* size: 0x0008 */

class OICF_POINTER_QUEUE_STATE
{
  /* 0x0040 */ struct _NDR_PROC_CONTEXT* const pProcContext;
}; /* size: 0x0048 */

struct OLEAUTOMATION_FUNCTIONS
{
  /* 0x0000 */ struct HINSTANCE__* hOleAut32;
  /* 0x0008 */ int fProcAddressesLoaded;
  /* 0x0010 */ struct _USER_MARSHAL_ROUTINE_QUADRUPLE UserMarshalRoutines[3];
}; /* size: 0x0070 */

typedef enum _TAG_UNNAMED_19
{
  UserMarshal_Index_BSTR = 0,
  UserMarshal_Index_VARIANT = 1,
  UserMarshal_Index_SafeArray = 2,
} TAG_UNNAMED_19, *PTAG_UNNAMED_19;

enum OLE_NOTIFICATION
{
  OLE_CHANGED = 0,
  OLE_SAVED = 1,
  OLE_CLOSED = 2,
  OLE_RENAMED = 3,
};

enum OLE_TRISTATE
{
  triUnchecked = 0,
  triChecked = 1,
  triGray = 2,
};

class OPAQUE_HANDLE<1>
{
  /* 0x0000 */ unsigned __int64 m_h;
}; /* size: 0x0008 */

struct ORPC_DBG_ALL
{
  /* 0x0000 */ unsigned char* pSignature;
  /* 0x0008 */ struct tagRPCOLEMESSAGE* pMessage;
  /* 0x0010 */ const struct _GUID* refiid;
  /* 0x0018 */ struct IRpcChannelBuffer* pChannel;
  /* 0x0020 */ struct IUnknown* pUnkProxyMgr;
  /* 0x0028 */ void* pInterface;
  /* 0x0030 */ struct IUnknown* pUnkObject;
  /* 0x0038 */ HRESULT hresult;
  /* 0x0040 */ void* pvBuffer;
  /* 0x0048 */ unsigned long cbBuffer;
  /* 0x0050 */ unsigned long* lpcbBuffer;
  /* 0x0058 */ void* reserved;
}; /* size: 0x0060 */

struct ORPC_INIT_ARGS
{
  /* 0x0000 */ struct IOrpcDebugNotify* lpIntfOrpcDebug;
  /* 0x0008 */ void* pvPSN;
  /* 0x0010 */ unsigned long dwReserved1;
  /* 0x0014 */ unsigned long dwReserved2;
}; /* size: 0x0018 */

class OXIDEntry
{
  union
  {
    struct
    {
      /* 0x0000 */ class OXIDEntry* _pNext;
      /* 0x0008 */ class OXIDEntry* _pPrev;
      /* 0x0010 */ unsigned long _dwPid;
      /* 0x0014 */ unsigned long _dwTid;
      /* 0x0018 */ struct _GUID _moxid;
      /* 0x0028 */ unsigned __int64 _mid;
      /* 0x0030 */ struct _GUID _ipidRundown;
      /* 0x0040 */ unsigned long _dwFlags;
      /* 0x0048 */ struct HWND__* _hServerSTA;
      /* 0x0050 */ class CComApartment* _pParentApt;
      /* 0x0058 */ class CChannelHandle* volatile _pRpc;
      /* 0x0060 */ void* _pAuthId;
      /* 0x0068 */ struct tagDUALSTRINGARRAY* _pBinding;
      /* 0x0070 */ unsigned long _dwAuthnHint;
      /* 0x0074 */ unsigned long _dwAuthnSvc;
      /* 0x0078 */ class MIDEntry* _pMIDEntry;
      /* 0x0080 */ struct IRemUnknown* _pRUSTA;
      /* 0x0088 */ long _cRefs;
      /* 0x0090 */ void* _hComplete;
      /* 0x0098 */ long _cCalls;
      /* 0x009c */ long _cResolverRef;
      /* 0x00a0 */ unsigned long _dwExpiredTime;
      /* 0x00a4 */ struct tagCOMVERSION _version;
      /* 0x00a8 */ unsigned long _ulMarshaledTargetInfoLength;
      /* 0x00b0 */ unsigned char* _pMarshaledTargetInfo;
    }; /* size: 0x00ac */
    /* 0x0000 */ class CPageAllocator _palloc;
  }; /* size: 0x00ac */
}; /* size: 0x00b8 */

struct ObjectSplayNode
{
  /* 0x0000 */ struct _RTL_SPLAY_LINKS SplayLinks;
  /* 0x0018 */ void* pvObject;
  /* 0x0020 */ void* pvVtblTracking;
}; /* size: 0x0028 */

enum OfflineFolderStatus
{
  OFS_INACTIVE = -1,
  OFS_ONLINE = 0,
  OFS_OFFLINE = 1,
  OFS_SERVERBACK = 2,
  OFS_DIRTYCACHE = 3,
};

enum Ole32SQMFlags
{
  SixteenbitOLEUsage = 1,
  OLEDDEUsage = 2,
};

class OleThunkWOW
{
}; /* size: 0x0008 */

class OpaqueDataInfo
{
  /* 0x0020 */ unsigned long _cOpaqueData;
  /* 0x0024 */ unsigned long _dwCollSize;
  /* 0x0028 */ struct tagOpaqueData* _pOpaqueData;
  /* 0x0030 */ void* _pAct;
}; /* size: 0x0038 */

struct OsFrame
{
  /* 0x0000 */ unsigned __int64 P1Home;
  /* 0x0008 */ unsigned __int64 P2Home;
  /* 0x0010 */ unsigned __int64 P3Home;
  /* 0x0018 */ unsigned __int64 P4Home;
  /* 0x0020 */ unsigned __int64 P5Home;
  /* 0x0028 */ unsigned __int64 SavedXmm0;
  /* 0x0030 */ unsigned __int64 SavedXmm1;
  /* 0x0038 */ unsigned __int64 SavedXmm2;
  /* 0x0040 */ unsigned __int64 SavedXmm3;
  /* 0x0048 */ unsigned __int64 pRegs;
  /* 0x0050 */ unsigned __int64 pArgs;
  /* 0x0058 */ unsigned long cbArgs;
  /* 0x005c */ unsigned long Fill1;
  /* 0x0060 */ unsigned long ReturnValue;
  /* 0x0064 */ unsigned long Fill2;
}; /* size: 0x0068 */

class PARAMINFO
{
  /* 0x0000 */ unsigned long wIDLFlags;
  /* 0x0004 */ unsigned short vt;
  /* 0x0008 */ struct ITypeInfo* pTypeInfo;
  /* 0x0010 */ struct tagTYPEATTR* pTypeAttr;
  /* 0x0018 */ unsigned short cbAlignment;
  /* 0x001c */ long lLevelCount;
  /* 0x0020 */ unsigned short realvt;
  union
  {
    /* 0x0028 */ struct _GUID iid;
    /* 0x0028 */ struct tagARRAYDESC* pArray;
  }; /* size: 0x0010 */
}; /* size: 0x0038 */

struct PARAM_ATTRIBUTES
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned short MustSize : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned short MustFree : 1; /* bit position: 1 */
    /* 0x0000 */ unsigned short IsPipe : 1; /* bit position: 2 */
    /* 0x0000 */ unsigned short IsIn : 1; /* bit position: 3 */
    /* 0x0000 */ unsigned short IsOut : 1; /* bit position: 4 */
    /* 0x0000 */ unsigned short IsReturn : 1; /* bit position: 5 */
    /* 0x0000 */ unsigned short IsBasetype : 1; /* bit position: 6 */
    /* 0x0000 */ unsigned short IsByValue : 1; /* bit position: 7 */
    /* 0x0000 */ unsigned short IsSimpleRef : 1; /* bit position: 8 */
    /* 0x0000 */ unsigned short IsDontCallFreeInst : 1; /* bit position: 9 */
    /* 0x0000 */ unsigned short SaveForAsyncFinish : 1; /* bit position: 10 */
    /* 0x0000 */ unsigned short IsPartialIgnore : 1; /* bit position: 11 */
    /* 0x0000 */ unsigned short IsForceAllocate : 1; /* bit position: 12 */
    /* 0x0000 */ unsigned short ServerAllocSize : 3; /* bit position: 13 */
  }; /* bitfield */
}; /* size: 0x0002 */

struct PARAM_DESCRIPTION
{
  /* 0x0000 */ struct PARAM_ATTRIBUTES ParamAttr;
  /* 0x0002 */ unsigned short StackOffset;
  union
  {
    /* 0x0004 */ unsigned short TypeOffset;
    struct
    {
      /* 0x0004 */ unsigned char Type;
      /* 0x0005 */ unsigned char Unused;
    } /* size: 0x0002 */ SimpleType;
  }; /* size: 0x0002 */
}; /* size: 0x0006 */

enum PATH_TYPE
{
  PATH_TYPE_UNKNOWN = 0,
  PATH_TYPE_UNC_ABSOLUTE = 1,
  PATH_TYPE_LOCAL_DEVICE = 2,
  PATH_TYPE_ROOT_LOCAL_DEVICE = 3,
  PATH_TYPE_DRIVE_ABSOLUTE = 4,
  PATH_TYPE_DRIVE_RELATIVE = 5,
  PATH_TYPE_ROOTED = 6,
  PATH_TYPE_RELATIVE = 7,
};

class PBasicEntry
{
  /* 0x0000 */ unsigned long _sig;
  /* 0x0004 */ long _cReferences;
  /* 0x0008 */ const unsigned long _dl;
}; /* size: 0x000c */

class PDeSerStream;

class PDocFile
{
}; /* size: 0x000c */

struct PICTINFO
{
  /* 0x0000 */ void* hmf;
  /* 0x0008 */ struct tagRECT bbox;
  /* 0x0018 */ unsigned short inch;
  /* 0x001a */ char __PADDING__[6];
}; /* size: 0x0020 */

enum PIDMSI_STATUS_VALUE
{
  PIDMSI_STATUS_NORMAL = 0,
  PIDMSI_STATUS_NEW = 1,
  PIDMSI_STATUS_PRELIM = 2,
  PIDMSI_STATUS_DRAFT = 3,
  PIDMSI_STATUS_INPROGRESS = 4,
  PIDMSI_STATUS_EDIT = 5,
  PIDMSI_STATUS_REVIEW = 6,
  PIDMSI_STATUS_PROOF = 7,
  PIDMSI_STATUS_FINAL = 8,
  PIDMSI_STATUS_OTHER = 32767,
};

enum PIPE_ATTRIBUTE_TYPE
{
  PipeAttribute = 0,
  PipeConnectionAttribute = 1,
  PipeHandleAttribute = 2,
};

enum PKA_FLAGS
{
  PKA_SET = 0,
  PKA_APPEND = 1,
  PKA_DELETE = 2,
};

class PMSIHANDLE
{
  /* 0x0000 */ unsigned long m_h;
}; /* size: 0x0004 */

class PMemoryAllocator
{
}; /* size: 0x0008 */

class POINTER_BUFFERLENGTH_SWAP_CONTEXT
{
  /* 0x0000 */ struct _MIDL_STUB_MESSAGE* pStubMsg;
  /* 0x0008 */ unsigned long LengthSave;
  /* 0x000c */ const BOOL DoSwap;
}; /* size: 0x0010 */

class POINTER_BUFFER_SWAP_CONTEXT
{
  /* 0x0000 */ struct _MIDL_STUB_MESSAGE* pStubMsg;
  /* 0x0008 */ unsigned char* pBufferSave;
  /* 0x0010 */ const BOOL DoSwap;
}; /* size: 0x0018 */

class POINTER_MEMSIZE_SWAP_CONTEXT
{
  /* 0x0000 */ struct _MIDL_STUB_MESSAGE* pStubMsg;
  /* 0x0008 */ unsigned long MemorySave;
  /* 0x0010 */ unsigned char* pBufferSave;
  /* 0x0018 */ const BOOL DoSwap;
}; /* size: 0x0020 */

struct POSTRELRIFREF
{
  /* 0x0010 */ long cRefs;
  /* 0x0018 */ class OXIDEntry* pOXIDEntry;
  /* 0x0020 */ struct IRemUnknown* pRemUnk;
  /* 0x0028 */ int fReleaseRemUnkProxy;
  /* 0x0030 */ struct IUnknown* pAsyncRelease;
  /* 0x0038 */ unsigned short cRifRef;
  /* 0x003c */ struct tagREMINTERFACEREF arRifRef;
  /* 0x0054 */ long __PADDING__[1];
}; /* size: 0x0058 */

struct POWERBROADCAST_SETTING
{
  /* 0x0000 */ struct _GUID PowerSetting;
  /* 0x0010 */ unsigned long DataLength;
  /* 0x0014 */ unsigned char Data[1];
  /* 0x0015 */ char __PADDING__[3];
}; /* size: 0x0018 */

enum POWER_ACTION
{
  PowerActionNone = 0,
  PowerActionReserved = 1,
  PowerActionSleep = 2,
  PowerActionHibernate = 3,
  PowerActionShutdown = 4,
  PowerActionShutdownReset = 5,
  PowerActionShutdownOff = 6,
  PowerActionWarmEject = 7,
};

struct POWER_ACTION_POLICY
{
  /* 0x0000 */ enum POWER_ACTION Action;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ unsigned long EventCode;
}; /* size: 0x000c */

enum POWER_INFORMATION_LEVEL
{
  SystemPowerPolicyAc = 0,
  SystemPowerPolicyDc = 1,
  VerifySystemPolicyAc = 2,
  VerifySystemPolicyDc = 3,
  SystemPowerCapabilities = 4,
  SystemBatteryState = 5,
  SystemPowerStateHandler = 6,
  ProcessorStateHandler = 7,
  SystemPowerPolicyCurrent = 8,
  AdministratorPowerPolicy = 9,
  SystemReserveHiberFile = 10,
  ProcessorInformation = 11,
  SystemPowerInformation = 12,
  ProcessorStateHandler2 = 13,
  LastWakeTime = 14,
  LastSleepTime = 15,
  SystemExecutionState = 16,
  SystemPowerStateNotifyHandler = 17,
  ProcessorPowerPolicyAc = 18,
  ProcessorPowerPolicyDc = 19,
  VerifyProcessorPowerPolicyAc = 20,
  VerifyProcessorPowerPolicyDc = 21,
  ProcessorPowerPolicyCurrent = 22,
  SystemPowerStateLogging = 23,
  SystemPowerLoggingEntry = 24,
  SetPowerSettingValue = 25,
  NotifyUserPowerSetting = 26,
  PowerInformationLevelUnused0 = 27,
  PowerInformationLevelUnused1 = 28,
  SystemVideoState = 29,
  TraceApplicationPowerMessage = 30,
  TraceApplicationPowerMessageEnd = 31,
  ProcessorPerfStates = 32,
  ProcessorIdleStates = 33,
  ProcessorCap = 34,
  SystemWakeSource = 35,
  SystemHiberFileInformation = 36,
  TraceServicePowerMessage = 37,
  ProcessorLoad = 38,
  PowerShutdownNotification = 39,
  MonitorCapabilities = 40,
  SessionPowerInit = 41,
  SessionDisplayState = 42,
  PowerRequestCreate = 43,
  PowerRequestAction = 44,
  GetPowerRequestList = 45,
  ProcessorInformationEx = 46,
  NotifyUserModeLegacyPowerEvent = 47,
  GroupPark = 48,
  ProcessorIdleDomains = 49,
  WakeTimerList = 50,
  SystemHiberFileSize = 51,
  PowerInformationLevelMaximum = 52,
};

enum POWER_PLATFORM_ROLE
{
  PlatformRoleUnspecified = 0,
  PlatformRoleDesktop = 1,
  PlatformRoleMobile = 2,
  PlatformRoleWorkstation = 3,
  PlatformRoleEnterpriseServer = 4,
  PlatformRoleSOHOServer = 5,
  PlatformRoleAppliancePC = 6,
  PlatformRolePerformanceServer = 7,
  PlatformRoleMaximum = 8,
};

struct POWER_STATE_HANDLER
{
  /* 0x0000 */ enum POWER_STATE_HANDLER_TYPE Type;
  /* 0x0004 */ unsigned char RtcWake;
  /* 0x0005 */ unsigned char Spare[3];
  /* 0x0008 */ void* Handler /* function */;
  /* 0x0010 */ void* Context;
}; /* size: 0x0018 */

enum POWER_STATE_HANDLER_TYPE
{
  PowerStateSleeping1 = 0,
  PowerStateSleeping2 = 1,
  PowerStateSleeping3 = 2,
  PowerStateSleeping4 = 3,
  PowerStateShutdownOff = 4,
  PowerStateShutdownReset = 5,
  PowerStateSleeping4Firmware = 6,
  PowerStateMaximum = 7,
};

struct POWER_STATE_NOTIFY_HANDLER
{
  /* 0x0000 */ void* Handler /* function */;
  /* 0x0008 */ void* Context;
}; /* size: 0x0010 */

enum PO_FIXED_WAKE_SOURCE_TYPE
{
  FixedWakeSourcePowerButton = 0,
  FixedWakeSourceSleepButton = 1,
  FixedWakeSourceRtc = 2,
  FixedWakeSourceDozeToHibernate = 3,
};

enum PO_WAKE_SOURCE_TYPE
{
  DeviceWakeSourceType = 0,
  FixedWakeSourceType = 1,
  TimerWakeSourceType = 2,
};

struct PPM_IDLESTATE_EVENT
{
  /* 0x0000 */ unsigned long NewState;
  /* 0x0004 */ unsigned long OldState;
  /* 0x0008 */ unsigned __int64 Processors;
}; /* size: 0x0010 */

struct PPM_IDLE_ACCOUNTING
{
  /* 0x0000 */ unsigned long StateCount;
  /* 0x0004 */ unsigned long TotalTransitions;
  /* 0x0008 */ unsigned long ResetCount;
  /* 0x0010 */ unsigned __int64 StartTime;
  /* 0x0018 */ struct PPM_IDLE_STATE_ACCOUNTING State[1];
}; /* size: 0x0048 */

struct PPM_IDLE_ACCOUNTING_EX
{
  /* 0x0000 */ unsigned long StateCount;
  /* 0x0004 */ unsigned long TotalTransitions;
  /* 0x0008 */ unsigned long ResetCount;
  /* 0x0010 */ unsigned __int64 StartTime;
  /* 0x0018 */ struct PPM_IDLE_STATE_ACCOUNTING_EX State[1];
}; /* size: 0x01b8 */

struct PPM_IDLE_STATE_ACCOUNTING
{
  /* 0x0000 */ unsigned long IdleTransitions;
  /* 0x0004 */ unsigned long FailedTransitions;
  /* 0x0008 */ unsigned long InvalidBucketIndex;
  /* 0x0010 */ unsigned __int64 TotalTime;
  /* 0x0018 */ unsigned long IdleTimeBuckets[6];
}; /* size: 0x0030 */

struct PPM_IDLE_STATE_ACCOUNTING_EX
{
  /* 0x0000 */ unsigned __int64 TotalTime;
  /* 0x0008 */ unsigned long IdleTransitions;
  /* 0x000c */ unsigned long FailedTransitions;
  /* 0x0010 */ unsigned long InvalidBucketIndex;
  /* 0x0014 */ unsigned long MinTimeUs;
  /* 0x0018 */ unsigned long MaxTimeUs;
  /* 0x0020 */ struct PPM_IDLE_STATE_BUCKET_EX IdleTimeBuckets[16];
}; /* size: 0x01a0 */

struct PPM_IDLE_STATE_BUCKET_EX
{
  /* 0x0000 */ unsigned __int64 TotalTimeUs;
  /* 0x0008 */ unsigned long MinTimeUs;
  /* 0x000c */ unsigned long MaxTimeUs;
  /* 0x0010 */ unsigned long Count;
  /* 0x0014 */ long __PADDING__[1];
}; /* size: 0x0018 */

struct PPM_PERFSTATE_DOMAIN_EVENT
{
  /* 0x0000 */ unsigned long State;
  /* 0x0004 */ unsigned long Latency;
  /* 0x0008 */ unsigned long Speed;
  /* 0x0010 */ unsigned __int64 Processors;
}; /* size: 0x0018 */

struct PPM_PERFSTATE_EVENT
{
  /* 0x0000 */ unsigned long State;
  /* 0x0004 */ unsigned long Status;
  /* 0x0008 */ unsigned long Latency;
  /* 0x000c */ unsigned long Speed;
  /* 0x0010 */ unsigned long Processor;
}; /* size: 0x0014 */

struct PPM_THERMALCHANGE_EVENT
{
  /* 0x0000 */ unsigned long ThermalConstraint;
  /* 0x0008 */ unsigned __int64 Processors;
}; /* size: 0x0010 */

struct PPM_THERMAL_POLICY_EVENT
{
  /* 0x0000 */ unsigned char Mode;
  /* 0x0008 */ unsigned __int64 Processors;
}; /* size: 0x0010 */

struct PPM_WMI_IDLE_STATE
{
  /* 0x0000 */ unsigned long Latency;
  /* 0x0004 */ unsigned long Power;
  /* 0x0008 */ unsigned long TimeCheck;
  /* 0x000c */ unsigned char PromotePercent;
  /* 0x000d */ unsigned char DemotePercent;
  /* 0x000e */ unsigned char StateType;
  /* 0x000f */ unsigned char Reserved;
  /* 0x0010 */ unsigned long StateFlags;
  /* 0x0014 */ unsigned long Context;
  /* 0x0018 */ unsigned long IdleHandler;
  /* 0x001c */ unsigned long Reserved1;
}; /* size: 0x0020 */

struct PPM_WMI_IDLE_STATES
{
  /* 0x0000 */ unsigned long Type;
  /* 0x0004 */ unsigned long Count;
  /* 0x0008 */ unsigned long TargetState;
  /* 0x000c */ unsigned long OldState;
  /* 0x0010 */ unsigned __int64 TargetProcessors;
  /* 0x0018 */ struct PPM_WMI_IDLE_STATE State[1];
}; /* size: 0x0038 */

struct PPM_WMI_IDLE_STATES_EX
{
  /* 0x0000 */ unsigned long Type;
  /* 0x0004 */ unsigned long Count;
  /* 0x0008 */ unsigned long TargetState;
  /* 0x000c */ unsigned long OldState;
  /* 0x0010 */ void* TargetProcessors;
  /* 0x0018 */ struct PPM_WMI_IDLE_STATE State[1];
}; /* size: 0x0038 */

struct PPM_WMI_LEGACY_PERFSTATE
{
  /* 0x0000 */ unsigned long Frequency;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ unsigned long PercentFrequency;
}; /* size: 0x000c */

struct PPM_WMI_PERF_STATE
{
  /* 0x0000 */ unsigned long Frequency;
  /* 0x0004 */ unsigned long Power;
  /* 0x0008 */ unsigned char PercentFrequency;
  /* 0x0009 */ unsigned char IncreaseLevel;
  /* 0x000a */ unsigned char DecreaseLevel;
  /* 0x000b */ unsigned char Type;
  /* 0x000c */ unsigned long IncreaseTime;
  /* 0x0010 */ unsigned long DecreaseTime;
  /* 0x0018 */ unsigned __int64 Control;
  /* 0x0020 */ unsigned __int64 Status;
  /* 0x0028 */ unsigned long HitCount;
  /* 0x002c */ unsigned long Reserved1;
  /* 0x0030 */ unsigned __int64 Reserved2;
  /* 0x0038 */ unsigned __int64 Reserved3;
}; /* size: 0x0040 */

struct PPM_WMI_PERF_STATES
{
  /* 0x0000 */ unsigned long Count;
  /* 0x0004 */ unsigned long MaxFrequency;
  /* 0x0008 */ unsigned long CurrentState;
  /* 0x000c */ unsigned long MaxPerfState;
  /* 0x0010 */ unsigned long MinPerfState;
  /* 0x0014 */ unsigned long LowestPerfState;
  /* 0x0018 */ unsigned long ThermalConstraint;
  /* 0x001c */ unsigned char BusyAdjThreshold;
  /* 0x001d */ unsigned char PolicyType;
  /* 0x001e */ unsigned char Type;
  /* 0x001f */ unsigned char Reserved;
  /* 0x0020 */ unsigned long TimerInterval;
  /* 0x0028 */ unsigned __int64 TargetProcessors;
  /* 0x0030 */ unsigned long PStateHandler;
  /* 0x0034 */ unsigned long PStateContext;
  /* 0x0038 */ unsigned long TStateHandler;
  /* 0x003c */ unsigned long TStateContext;
  /* 0x0040 */ unsigned long FeedbackHandler;
  /* 0x0044 */ unsigned long Reserved1;
  /* 0x0048 */ unsigned __int64 Reserved2;
  /* 0x0050 */ struct PPM_WMI_PERF_STATE State[1];
}; /* size: 0x0090 */

struct PPM_WMI_PERF_STATES_EX
{
  /* 0x0000 */ unsigned long Count;
  /* 0x0004 */ unsigned long MaxFrequency;
  /* 0x0008 */ unsigned long CurrentState;
  /* 0x000c */ unsigned long MaxPerfState;
  /* 0x0010 */ unsigned long MinPerfState;
  /* 0x0014 */ unsigned long LowestPerfState;
  /* 0x0018 */ unsigned long ThermalConstraint;
  /* 0x001c */ unsigned char BusyAdjThreshold;
  /* 0x001d */ unsigned char PolicyType;
  /* 0x001e */ unsigned char Type;
  /* 0x001f */ unsigned char Reserved;
  /* 0x0020 */ unsigned long TimerInterval;
  /* 0x0028 */ void* TargetProcessors;
  /* 0x0030 */ unsigned long PStateHandler;
  /* 0x0034 */ unsigned long PStateContext;
  /* 0x0038 */ unsigned long TStateHandler;
  /* 0x003c */ unsigned long TStateContext;
  /* 0x0040 */ unsigned long FeedbackHandler;
  /* 0x0044 */ unsigned long Reserved1;
  /* 0x0048 */ unsigned __int64 Reserved2;
  /* 0x0050 */ struct PPM_WMI_PERF_STATE State[1];
}; /* size: 0x0090 */

struct PROCESSOR_IDLESTATE_INFO
{
  /* 0x0000 */ unsigned long TimeCheck;
  /* 0x0004 */ unsigned char DemotePercent;
  /* 0x0005 */ unsigned char PromotePercent;
  /* 0x0006 */ unsigned char Spare[2];
}; /* size: 0x0008 */

struct PROCESSOR_IDLESTATE_POLICY
{
  /* 0x0000 */ unsigned short Revision;
  union
  {
    union
    {
      /* 0x0002 */ unsigned short AsUSHORT;
      struct /* bitfield */
      {
        /* 0x0002 */ unsigned short AllowScaling : 1; /* bit position: 0 */
        /* 0x0002 */ unsigned short Disabled : 1; /* bit position: 1 */
        /* 0x0002 */ unsigned short Reserved : 14; /* bit position: 2 */
      }; /* bitfield */
    }; /* size: 0x0002 */
  } /* size: 0x0002 */ Flags;
  /* 0x0004 */ unsigned long PolicyCount;
  /* 0x0008 */ struct PROCESSOR_IDLESTATE_INFO Policy[3];
}; /* size: 0x0020 */

struct PROCESSOR_IDLE_TIMES
{
  /* 0x0000 */ unsigned __int64 StartTime;
  /* 0x0008 */ unsigned __int64 EndTime;
  /* 0x0010 */ unsigned long Reserved[4];
}; /* size: 0x0020 */

struct PROCESSOR_PERFSTATE_POLICY
{
  /* 0x0000 */ unsigned long Revision;
  /* 0x0004 */ unsigned char MaxThrottle;
  /* 0x0005 */ unsigned char MinThrottle;
  /* 0x0006 */ unsigned char BusyAdjThreshold;
  union
  {
    /* 0x0007 */ unsigned char Spare;
    union
    {
      union
      {
        /* 0x0007 */ unsigned char AsUCHAR;
        struct /* bitfield */
        {
          /* 0x0007 */ unsigned char NoDomainAccounting : 1; /* bit position: 0 */
          /* 0x0007 */ unsigned char IncreasePolicy : 2; /* bit position: 1 */
          /* 0x0007 */ unsigned char DecreasePolicy : 2; /* bit position: 3 */
          /* 0x0007 */ unsigned char Reserved : 3; /* bit position: 5 */
        }; /* bitfield */
      }; /* size: 0x0001 */
    } /* size: 0x0001 */ Flags;
  }; /* size: 0x0001 */
  /* 0x0008 */ unsigned long TimeCheck;
  /* 0x000c */ unsigned long IncreaseTime;
  /* 0x0010 */ unsigned long DecreaseTime;
  /* 0x0014 */ unsigned long IncreasePercent;
  /* 0x0018 */ unsigned long DecreasePercent;
}; /* size: 0x001c */

enum PROXY_PHASE
{
  PROXY_CALCSIZE = 0,
  PROXY_GETBUFFER = 1,
  PROXY_MARSHAL = 2,
  PROXY_SENDRECEIVE = 3,
  PROXY_UNMARSHAL = 4,
};

class PRevertable
{
  /* 0x0000 */ unsigned long _sig;
  /* 0x0004 */ unsigned long _luid;
  /* 0x0008 */ unsigned long _df;
  /* 0x000c */ class CDfName _dfn;
  /* 0x0050 */ class CBasedRevertablePtr _prvNext;
}; /* size: 0x0058 */

class PSStream
{
}; /* size: 0x000c */

enum PS_CREATE_STATE
{
  PsCreateInitialState = 0,
  PsCreateFailOnFileOpen = 1,
  PsCreateFailOnSectionCreate = 2,
  PsCreateFailExeFormat = 3,
  PsCreateFailMachineMismatch = 4,
  PsCreateFailExeName = 5,
  PsCreateSuccess = 6,
  PsCreateMaximumStates = 7,
};

class PSerStream;

class PTSetMember
{
  /* 0x0010 */ unsigned long _dlTree;
  /* 0x0014 */ unsigned long _dlName;
  /* 0x0018 */ unsigned long _ulLevel;
  /* 0x001c */ class CDfName _dfnName;
  /* 0x005e */ const unsigned short _uType;
}; /* size: 0x0060 */

class PTimeEntry
{
}; /* size: 0x000c */

enum PULLSTATE
{
  PULLSTATE0_ENTRY = 0,
  PULLSTATE1_FIRST_CALL = 1,
  PULLSTATE2_NS_RQlsRA = 2,
  PULLSTATE3_NS_RQgeRA = 3,
  PULLSTATE4_S_RQlsBS = 4,
  PULLSTATE5_S_RQgeBS = 5,
  PULLSTATE6_DONE = 6,
};

enum PUSHSTATE
{
  PUSHSTATE0_ENTRY = 0,
  PUSHSTATE1_FIRSTCALL = 1,
  PUSHSTATE2_FS_PSgeFS = 2,
  PUSHSTATE3_FS_PSltFS = 3,
  PUSHSTATE4_FS_PSZERO = 4,
  PUSHSTATE5_DONE_ERROR = 5,
};

enum QUERY_USER_NOTIFICATION_STATE
{
  QUNS_NOT_PRESENT = 1,
  QUNS_BUSY = 2,
  QUNS_RUNNING_D3D_FULL_SCREEN = 3,
  QUNS_PRESENTATION_MODE = 4,
  QUNS_ACCEPTS_NOTIFICATIONS = 5,
  QUNS_QUIET_TIME = 6,
};

struct READ_USN_JOURNAL_DATA
{
  /* 0x0000 */ __int64 StartUsn;
  /* 0x0008 */ unsigned long ReasonMask;
  /* 0x000c */ unsigned long ReturnOnlyOnClose;
  /* 0x0010 */ unsigned __int64 Timeout;
  /* 0x0018 */ unsigned __int64 BytesToWaitFor;
  /* 0x0020 */ unsigned __int64 UsnJournalID;
}; /* size: 0x0028 */

enum RECEIVE_STATES
{
  START = 0,
  COPY_PIPE_ELEM = 1,
  RETURN_PARTIAL_ELEM = 2,
  READ_PARTIAL_ELEM = 3,
  VERIFY_TAIL_CHUNK = 4,
};

struct REF_COUNTED_STRUCT
{
  /* 0x0008 */ long m_refs;
  /* 0x000c */ long __PADDING__[1];
}; /* size: 0x0010 */

enum REMOVEITEMTYPE
{
  RIT_DEFAULT = 0,
  RIT_DELETE = 1,
};

struct RETRIEVAL_POINTERS_BUFFER
{
  /* 0x0000 */ unsigned long ExtentCount;
  /* 0x0008 */ union _LARGE_INTEGER StartingVcn;
  /* 0x0010 */ struct
  {
    /* 0x0010 */ union _LARGE_INTEGER NextVcn;
    /* 0x0018 */ union _LARGE_INTEGER Lcn;
  } /* size: 0x0010 */ Extents[1];
}; /* size: 0x0020 */

enum RPC_ADDRESS_CHANGE_TYPE
{
  PROTOCOL_NOT_LOADED = 1,
  PROTOCOL_LOADED = 2,
  PROTOCOL_ADDRESS_CHANGE = 3,
};

struct RPC_CLIENT_INFORMATION1
{
  /* 0x0000 */ unsigned char* UserName;
  /* 0x0008 */ unsigned char* ComputerName;
  /* 0x0010 */ unsigned short Privilege;
  /* 0x0014 */ unsigned long AuthFlags;
}; /* size: 0x0018 */

struct RPC_DISPATCH_TABLE
{
  /* 0x0000 */ unsigned int DispatchTableCount;
  /* 0x0008 */ void** DispatchTable /* function */;
  /* 0x0010 */ __int64 Reserved;
}; /* size: 0x0018 */

struct RPC_IF_ID_VECTOR
{
  /* 0x0000 */ unsigned long Count;
  /* 0x0008 */ struct _RPC_IF_ID* IfId[1];
}; /* size: 0x0010 */

struct RPC_IMPORT_CONTEXT_P
{
  /* 0x0000 */ void* LookupContext;
  /* 0x0008 */ void* ProposedHandle;
  /* 0x0010 */ struct _RPC_BINDING_VECTOR* Bindings;
}; /* size: 0x0018 */

struct RPC_STATS_VECTOR
{
  /* 0x0000 */ unsigned int Count;
  /* 0x0004 */ unsigned long Stats[1];
}; /* size: 0x0008 */

struct RTL_ACE_DATA
{
  /* 0x0000 */ unsigned char AceType;
  /* 0x0001 */ unsigned char InheritFlags;
  /* 0x0002 */ unsigned char AceFlags;
  /* 0x0004 */ unsigned long Mask;
  /* 0x0008 */ void** Sid;
}; /* size: 0x0010 */

enum RTL_BSD_ITEM_TYPE
{
  RtlBsdItemVersionNumber = 0,
  RtlBsdItemProductType = 1,
  RtlBsdItemAabEnabled = 2,
  RtlBsdItemAabTimeout = 3,
  RtlBsdItemBootGood = 4,
  RtlBsdItemBootShutdown = 5,
  RtlBsdSleepInProgress = 6,
  RtlBsdPowerTransition = 7,
  RtlBsdItemMax = 8,
};

struct RTL_FILTER_LUNICODE_STRING_CTX
{
  /* 0x0000 */ unsigned char* WriteCursor;
  /* 0x0008 */ unsigned char* WriteEnd;
}; /* size: 0x0010 */

struct RTL_FILTER_LUNICODE_STRING_FILTER
{
  /* 0x0000 */ void* Transform /* function */;
  /* 0x0008 */ void* Match /* function */;
  /* 0x0010 */ void* MatchContext;
  /* 0x0018 */ unsigned char DropHighUnicodeValues;
  /* 0x0019 */ unsigned char MatchFirst;
  /* 0x001a */ char __PADDING__[6];
}; /* size: 0x0020 */

enum RegistrationState
{
  NOT_REGISTERED = 0,
  PENDING_REGISTRATION = 1,
  FULLY_REGISTERED = 2,
};

struct RegistryKeyValue
{
  /* 0x0000 */ wchar_t* key;
  /* 0x0008 */ wchar_t* value;
}; /* size: 0x0010 */

enum ReplacesCorHdrNumericDefines
{
  COMIMAGE_FLAGS_ILONLY = 1,
  COMIMAGE_FLAGS_32BITREQUIRED = 2,
  COMIMAGE_FLAGS_IL_LIBRARY = 4,
  COMIMAGE_FLAGS_STRONGNAMESIGNED = 8,
  COMIMAGE_FLAGS_NATIVE_ENTRYPOINT = 16,
  COMIMAGE_FLAGS_TRACKDEBUGDATA = 0x10000,
  COR_VERSION_MAJOR_V2 = 2,
  COR_VERSION_MAJOR = 2,
  COR_VERSION_MINOR = 0,
  COR_DELETED_NAME_LENGTH = 8,
  COR_VTABLEGAP_NAME_LENGTH = 8,
  NATIVE_TYPE_MAX_CB = 1,
  COR_ILMETHOD_SECT_SMALL_MAX_DATASIZE = 255,
  IMAGE_COR_MIH_METHODRVA = 1,
  IMAGE_COR_MIH_EHRVA = 2,
  IMAGE_COR_MIH_BASICBLOCK = 8,
  COR_VTABLE_32BIT = 1,
  COR_VTABLE_64BIT = 2,
  COR_VTABLE_FROM_UNMANAGED = 4,
  COR_VTABLE_FROM_UNMANAGED_RETAIN_APPDOMAIN = 8,
  COR_VTABLE_CALL_MOST_DERIVED = 16,
  IMAGE_COR_EATJ_THUNK_SIZE = 32,
  MAX_CLASS_NAME = 1024,
  MAX_PACKAGE_NAME = 1024,
};

struct ReportedExceptions
{
  /* 0x0000 */ unsigned long dwExceptionCode;
  /* 0x0004 */ unsigned long dwReportCount;
  /* 0x0008 */ unsigned long dwMaxCount;
}; /* size: 0x000c */

enum RpcProxyPerfCounters
{
  RpcCurrentUniqueUser = 1,
  RpcBackEndConnectionAttempts = 2,
  RpcBackEndConnectionFailed = 3,
  RpcRequestsPerSecond = 4,
  RpcIncomingConnections = 5,
  RpcIncomingBandwidth = 6,
  RpcOutgoingBandwidth = 7,
  RpcAttemptedLbsDecisions = 8,
  RpcFailedLbsDecisions = 9,
  RpcAttemptedLbsMessages = 10,
  RpcFailedLbsMessages = 11,
  RpcLastCounter = 12,
};

struct SAFEARRAY_INTERNAL
{
  union
  {
    /* 0x0000 */ struct _GUID iid;
    struct
    {
      /* 0x0000 */ long __dummy0[3];
      /* 0x000c */ long vt;
    }; /* size: 0x0010 */
    struct
    {
      /* 0x0000 */ unsigned long __dummy1[2];
      /* 0x0008 */ struct IRecordInfo* piri;
    }; /* size: 0x0010 */
  }; /* size: 0x0010 */
  /* 0x0010 */ struct tagSAFEARRAY array;
}; /* size: 0x0030 */

class SAVE_NDRSLOT
{
  /* 0x0000 */ void* pOldSlotValue;
  /* 0x0008 */ unsigned char fSucceededInSet;
}; /* size: 0x0010 */

struct SAccessCache
{
  /* 0x0000 */ int fAccess;
  /* 0x0004 */ struct _LUID lClient;
}; /* size: 0x000c */

struct SBlanket
{
  /* 0x0000 */ wchar_t* _pPrincipal;
  /* 0x0008 */ unsigned long _lAuthnLevel;
  /* 0x000c */ unsigned long _lAuthnSvc;
  /* 0x0010 */ void* _pAuthId;
  /* 0x0018 */ unsigned long _lAuthzSvc;
  /* 0x001c */ struct _RPC_SECURITY_QOS _sQos;
  /* 0x002c */ unsigned long _lCapabilities;
  /* 0x0030 */ struct _SCHANNEL_CRED _sCred;
  /* 0x0080 */ const struct _CERT_CONTEXT* _pCert;
}; /* size: 0x0088 */

struct SC_HANDLE__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct SCacheEntry
{
  /* 0x0000 */ unsigned long ulOffset;
  /* 0x0004 */ unsigned long sect;
  /* 0x0008 */ unsigned long ulRunLength;
}; /* size: 0x000c */

struct SChannelHookCallInfo
{
  /* 0x0000 */ struct _GUID iid;
  /* 0x0010 */ unsigned long cbSize;
  /* 0x0014 */ struct _GUID uCausality;
  /* 0x0024 */ unsigned long dwServerPid;
  /* 0x0028 */ unsigned long iMethod;
