struct tagCOMBOBOXEXITEMW
{
  /* 0x0000 */ unsigned int mask;
  /* 0x0008 */ __int64 iItem;
  /* 0x0010 */ wchar_t* pszText;
  /* 0x0018 */ int cchTextMax;
  /* 0x001c */ int iImage;
  /* 0x0020 */ int iSelectedImage;
  /* 0x0024 */ int iOverlay;
  /* 0x0028 */ int iIndent;
  /* 0x0030 */ __int64 lParam;
}; /* size: 0x0038 */

