struct tagLVGROUPMETRICS
{
  /* 0x0000 */ unsigned int cbSize;
  /* 0x0004 */ unsigned int mask;
  /* 0x0008 */ unsigned int Left;
  /* 0x000c */ unsigned int Top;
  /* 0x0010 */ unsigned int Right;
  /* 0x0014 */ unsigned int Bottom;
  /* 0x0018 */ unsigned long crLeft;
  /* 0x001c */ unsigned long crTop;
  /* 0x0020 */ unsigned long crRight;
  /* 0x0024 */ unsigned long crBottom;
  /* 0x0028 */ unsigned long crHeader;
  /* 0x002c */ unsigned long crFooter;
}; /* size: 0x0030 */

