typedef struct _NDR_FWD_ROUTINES
{
  /* 0x0000 */ void* CStdStubBuffer_AddRef /* function */;
  /* 0x0008 */ void* CStdStubBuffer_Connect /* function */;
  /* 0x0010 */ void* CStdStubBuffer_CountRefs /* function */;
  /* 0x0018 */ void* CStdStubBuffer_DebugServerQueryInterface /* function */;
  /* 0x0020 */ void* CStdStubBuffer_DebugServerRelease /* function */;
  /* 0x0028 */ void* CStdStubBuffer_Disconnect /* function */;
  /* 0x0030 */ void* CStdStubBuffer_Invoke /* function */;
  /* 0x0038 */ void* CStdStubBuffer_IsIIDSupported /* function */;
  /* 0x0040 */ void* CStdStubBuffer_QueryInterface /* function */;
  /* 0x0048 */ void* CreateProxyFromTypeInfo /* function */;
  /* 0x0050 */ void* CreateStubFromTypeInfo /* function */;
  /* 0x0058 */ void* DllGetClassObject /* function */;
  /* 0x0060 */ void* DllRegisterServer /* function */;
  /* 0x0068 */ void* IUnknown_AddRef_Proxy /* function */;
  /* 0x0070 */ void* IUnknown_QueryInterface_Proxy /* function */;
  /* 0x0078 */ void* IUnknown_Release_Proxy /* function */;
  /* 0x0080 */ void* NdrCStdStubBuffer2_Release /* function */;
  /* 0x0088 */ void* NdrCStdStubBuffer_Release /* function */;
  /* 0x0090 */ void* NdrCreateServerInterfaceFromStub /* function */;
  /* 0x0098 */ void* NdrpDcomAsyncClientCall /* function */;
  /* 0x00a0 */ void* NdrDcomAsyncStubCall /* function */;
  /* 0x00a8 */ void* Ndr64pDcomAsyncClientCall /* function */;
  /* 0x00b0 */ void* Ndr64DcomAsyncStubCall /* function */;
  /* 0x00b8 */ void* NdrDllCanUnloadNow /* function */;
  /* 0x00c0 */ void* NdrDllGetClassObject /* function */;
  /* 0x00c8 */ void* NdrDllRegisterProxy /* function */;
  /* 0x00d0 */ void* NdrDllUnregisterProxy /* function */;
  /* 0x00d8 */ void* NdrGetBaseInterfaceFromStub /* function */;
  /* 0x00e0 */ void* NdrOleAllocate /* function */;
  /* 0x00e8 */ void* NdrOleFree /* function */;
  /* 0x00f0 */ void* NdrStubForwardingFunction /* function */;
  /* 0x00f8 */ void* NdrStubInitializeMarshall /* function */;
  /* 0x0100 */ void* NdrpCreateProxy /* function */;
  /* 0x0108 */ void* NdrpCreateStub /* function */;
  /* 0x0110 */ void* NdrpGetProcFormatString /* function */;
  /* 0x0118 */ void* NdrpGetTypeFormatString /* function */;
  /* 0x0120 */ void* NdrpGetTypeGenCookie /* function */;
  /* 0x0128 */ void* NdrpReleaseTypeFormatString /* function */;
  /* 0x0130 */ void* NdrpReleaseTypeGenCookie /* function */;
  /* 0x0138 */ void* NdrpVarVtOfTypeDesc /* function */;
} NDR_FWD_ROUTINES, *PNDR_FWD_ROUTINES; /* size: 0x0140 */

