enum _SYSTEM_INFORMATION_CLASS;
struct tagRECT;
class CAbstractStream;
enum DCOM_ENDPOINT_FLAGS;
struct tagVS_FIXEDFILEINFO;
struct _MINIDUMP_MODULE_CALLBACK;
enum tagTYPEFLAGS;
struct HUMPD__;
struct _SID_AND_ATTRIBUTES_HASH;
struct tagNMHDR;
struct _OFNOTIFYEXW;
enum _PROC_THREAD_ATTRIBUTE_NUM;
struct IOleInPlaceSiteEx;
struct IXMLElement2;
enum _SYSDBG_COMMAND;
struct _MINIDUMP_TOKEN_INFO_HEADER;
enum _BIN_TYPES;
struct _CERT_POLICY_MAPPINGS_INFO;
enum POWER_INFORMATION_LEVEL;
struct tagContexts;
enum _TOKEN_SECURITY_ATTRIBUTE_OPERATION;
struct ILayoutStorage;
struct _GUID;
struct _RPC_VERSION;
struct _RPC_SYNTAX_IDENTIFIER;
struct _MIDL_SYNTAX_INFO;
enum DISK_CACHE_RETENTION_PRIORITY;
struct _SYSTEM_PREFETCH_OPTIONS;
struct IActivationPropertiesIn;
struct _CRYPTOAPI_BLOB;
struct _CRYPT_ALGORITHM_IDENTIFIER;
struct _CRYPT_BIT_BLOB;
struct _CERT_PUBLIC_KEY_INFO;
class Microsoft::WRL::ComPtr<ApartmentShutdownNode>;
class Microsoft::WRL::ComPtr<IApartmentShutdown>;
struct ApartmentShutdownNode;
enum WELL_KNOWN_SID_TYPE;
struct _PS_SYSTEM_DLL_INIT_BLOCK;
enum VARENUM;
class CInprocSystemActivator;
enum _TAG_UNNAMED_1;
enum _PROCESSOR_CACHE_TYPE;
struct _CACHE_DESCRIPTOR;
struct _HTTPSPolicyCallbackData;
enum POWER_ACTION;
struct IEncodingFilterFactory;
enum _RUNLEVEL;
struct Microsoft::WRL::CloakedIid<IMarshal>;
struct IRootStorage;
struct HMIDISTRM__;
enum _PROCESS_MITIGATION_POLICY;
enum SHSTOCKICONID;
struct _MESSAGE_RESOURCE_BLOCK;
struct _GET_CHANGER_PARAMETERS;

struct _CMSG_RC2_AUX_INFO;
struct _PSHNOTIFY;
struct _MnkEqBuf;
struct _MIDL_STUB_MESSAGE;
struct tagLocationInfoData;
class ServerLocationInfo;
struct tagScmRequestInfoData;
class ScmRequestInfo;
class ActivationPropertiesIn;
struct IRemUnknown;
struct _FILE_SET_SPARSE_BUFFER;
struct _WIN32_STREAM_ID;
struct NDR_POINTER_QUEUE_STATE;
class CWinRTApartmentActivator;
struct _MIDL_STUB_DESC;
struct _tagRemBINDINFO;
struct _QUERY_SERVICE_LOCK_STATUSW;
struct _stati64;
struct IActivationPropertiesOut;
struct __GENERIC_BINDING_INFO;
class CRemoteUnknown;
struct __vc_attributes::event_receiverAttribute;
struct _SERVICE_CONTROL_STATUS_REASON_PARAMSA;
struct _CERT_OR_CRL_BLOB;
struct _USER_MARSHAL_CB;
struct _MALLOC_FREE_STRUCT;
struct _TOKEN_ORIGIN;
struct __vc_attributes::iid_isAttribute;
struct _FIBER;
struct _COMM_FAULT_OFFSETS;
class CTmpMkEqBuf;
class CStdIdentity::CInternalUnk;
class Windows::Rtl::AutoInterface<Windows::Rtl::IRtlROFOStream *,Windows::Auto<Windows::Rtl::IRtlROFOStream *> >;
struct _POWER_PLATFORM_INFORMATION;
struct _OCSP_SIGNATURE_INFO;
struct _RTL_UCSCHAR_ENCODER_RETURN_VALUE;
struct _CRYPT_PKCS12_PBE_PARAMS;
struct COPYFILE2_MESSAGE;
struct _NDR_CS_SIZE_CONVERT_ROUTINES;
struct joyinfoex_tag;
struct _IMAGE_DOS_HEADER;
struct _FSCTL_OFFLOAD_WRITE_OUTPUT;
struct _JOB_INFO_4A;
struct IInternetZoneManagerEx2;
struct _PSM_APPSTATE_REGISTRATION;
class CPres;
class CClassMoniker;
struct _CRYPT_CSP_PROVIDER;
class CClassMonikerFactory;
struct _ACCESS_DENIED_OBJECT_ACE;
struct tagPolicyEntry;
struct tagEMRALPHABLEND;
class CProcessPatternTbl;
struct __vc_attributes::atl::rdxAttribute;
struct _FORM_INFO_2A;
struct _RC_CONFIG;
struct _SYSTEM_HIBERFILE_INFORMATION;
struct DISPLAYCONFIG_SOURCE_DEVICE_NAME;
struct __vc_attributes::atl::perf_counterAttribute;
class CFastBH;
class CContextLife;
struct __midl_frag293_t;
struct tagDELETEITEMSTRUCT;
class CStdWrapper;
struct IProvideClassInfo2;
struct _DEVICE_MANAGE_DATA_SET_ATTRIBUTES_OUTPUT;
struct IOleInPlaceSite;
struct IFastRundown;
struct _PARTITION_INFORMATION_MBR;
struct _PARTITION_INFORMATION_EX;
struct _DRIVE_LAYOUT_INFORMATION_EX;
struct ARRAY_INFO;
struct _NDR_ASYNC_MESSAGE;
struct tagMCI_GETDEVCAPS_PARMS;
struct _TP_WAIT;
struct IOverrideTargetContext;
struct _iinspectable_MIDL_TYPE_FORMAT_STRING;
struct IEnumOleUndoUnits;
struct _NDR_PROC_CONTEXT;
struct _IMAGE_RESOURCE_DIR_STRING_U;
struct _POINTFLOAT;
struct _GLYPHMETRICSFLOAT;
class CBindStatusCallback;
struct _CSV_QUERY_MDS_PATH;
struct IDLLHost;
class CBasedContextPtr;
class CContext;
struct _SYSTEM_ALARM_CALLBACK_ACE;
struct _CM_SCSI_DEVICE_DATA;
struct _TOKEN_DEFAULT_DACL;
struct IPointerInactive;
struct _PRINTPROCESSOR_CAPS_1;
struct _IO_STATUS_BLOCK32;
struct _SYSTEM_ERROR_PORT_TIMEOUTS;
struct _s__RTTIBaseClassDescriptor2;
struct tagMCI_VD_ESCAPE_PARMSA;
struct _EFS_ENCRYPTION_STATUS_INFO;
struct _TXFS_MODIFY_RM;
struct __midl_frag166_t;
struct _FILE_FS_DATA_COPY_INFORMATION;
struct _STORAGE_PROPERTY_QUERY;
struct _CM_PNP_BIOS_DEVICE_NODE;
class CBrokeredClipDataObject::{dtor}::__l9::<lambda_32D80D6E4B00AA95>;
struct _SYSTEM_SYSTEM_PARTITION_INFORMATION;
struct tagAUXCAPS2A;
struct _TRANSACTIONMANAGER_OLDEST_INFORMATION;
struct _QUOTA_LIMITS;
struct _IMAGE_IMPORT_BY_NAME;
struct _DEVICE_DATA_SET_REPAIR_PARAMETERS;
struct _SYSTEM_VERIFIER_INFORMATION_EX;
struct _FILE_FULL_DIR_INFO;
struct __vc_attributes::publicAttribute;
struct _RTL_CALLER_ALLOCATED_ACTIVATION_CONTEXT_STACK_FRAME_EXTENDED;
struct _BIDI_REQUEST_DATA;
struct __vc_attributes::idAttribute;
class Microsoft::WRL::RuntimeClass<Microsoft::WRL::RuntimeClassFlags<2>,IUnknown,Microsoft::WRL::FtmBase,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil>;
struct _WNF_DELIVERY_DESCRIPTOR;
struct tagMCI_OVLY_LOAD_PARMSW;
struct _PO_WAKE_SOURCE_HISTORY;
struct _SYSDBG_BUS_DATA;
struct _LANA_ENUM;
struct _CERT_NAME_CONSTRAINTS_INFO;
struct tagBITMAPINFO;
struct tagSAFEARRAY;
struct _tagSTACKFRAME64;
struct ISerializable;
struct _NDR64_MEMPAD_FORMAT;
struct __midl_frag258_t;
struct _CRYPT_PASSWORD_CREDENTIALSA;
class Microsoft::WRL::Details::ComPtrRefBase<Microsoft::WRL::WeakRef const >;
struct _MINIDUMP_MODULE_LIST;
class SerializableProperty;
struct CREATE_USN_JOURNAL_DATA;
class Microsoft::WRL::Wrappers::HandleT<Microsoft::WRL::Wrappers::HandleTraits::MutexTraits>;
struct _PROVIDOR_INFO_1W;
struct _RTL_PROCESS_BACKTRACES_CONTROL;
struct _SE_ACCESS_REQUEST;
struct _EFS_HASH_BLOB;
struct _MINIDUMP_DIRECTORY;
class Microsoft::WRL::Wrappers::Event;
struct ISimpleFrameSite;
struct USN_JOURNAL_DATA_V0;
struct _PUBLIC_OBJECT_BASIC_INFORMATION;
struct __vc_attributes::helper_attributes::source_annotation_attributeAttribute;
struct _FSCTL_OFFLOAD_READ_OUTPUT;
struct _SCMREGKEY;
class CROTItem;
struct DISPLAYCONFIG_TARGET_DEVICE_NAME_FLAGS;
class PBasicEntry;
struct _OUTLINETEXTMETRICW;
class CStgHandle;
class CObjrefMoniker;
struct _SYSTEM_AUDIT_CALLBACK_ACE;
struct _SYSTEM_MEMORY_TOPOLOGY_INFORMATION;
struct HTOUCHINPUT__;
struct __vc_attributes::helper_attributes::help_stringAttribute;
struct __vc_attributes::helper_attributes::multi_valueAttribute;
class CContextList;
struct _RPC_SECURITY_QOS;
struct _SYSTEM_HOTPATCH_CODE_INFORMATION;
struct _CMC_TAGGED_CONTENT_INFO;
struct tagFUNCDESC;
struct __vc_attributes::noncreatableAttribute;
struct _SYSTEM_HANDLE_INFORMATION_EX;
struct _RPC_PROTSEQ_VECTORW;
struct __midl_frag75_t;
struct __vc_attributes::ms_unionAttribute;
struct IPSFactoryBuffer;
struct __midl_frag70_t;
struct _SOURCEFILE;
struct _userHMETAFILEPICT;
struct _PUBKEY;
class PTSetMember;
struct _CMSG_CONTENT_ENCRYPT_INFO;
struct _RTL_CONDITION_VARIABLE;
class CMapStringToPtr;
struct _WPP_TRACE_CONTROL_BLOCK;
struct _CMSG_RECIPIENT_ENCRYPTED_KEY_ENCODE_INFO;
struct _WPP_WIN2K_CONTROL_BLOCK;
struct _FILE_PIPE_REMOTE_INFORMATION;
class SafeIStream;
struct _MIDL_STUBLESS_PROXY_INFO;
struct tagGESTURECONFIG;
struct SCARD_READERSTATEW;
struct _ASSEMBLY_FILE_DETAILED_INFORMATION;
class COleConditionVariable;
struct _CERT_DH_PARAMETERS;
struct IInternetSecurityManagerEx;
struct SC_HANDLE__;
struct _STORAGE_QUERY_DEPENDENT_VOLUME_RESPONSE;
class CNameHashTable;
struct IRpcHelper;
struct __midl_frag317_t;
struct tagDRVCONFIGINFO;
struct __vc_attributes::helper_attributes::v1_nameAttribute;
struct IOleInPlaceUIWindow;
struct _BCRYPT_OID;
struct tagJOYCAPSA;
struct _CRYPT_ENCRYPT_MESSAGE_PARA;
class CLimitedWritableStorage::OpenStream::__l3::<lambda_DBBA6E15974D88A0>;
struct _CERT_REVOCATION_PARA;
struct _CRYPT_DES_KEY_STATE;
struct __midl_frag21_t;
struct _IMAGEHLP_DUPLICATE_SYMBOL64;
struct _DRAWPATRECT;
struct tagSCROLLBARINFO;
struct _DRIVER_INFO_2A;
struct tagALTTABINFO;
struct _IMAGE_DEBUG_DIRECTORY;
struct _TPP_THREAD_DATA_CALLBACK;
struct PACKAGE_INFO;
struct __midl_frag1059_t;
struct tagMOUSEHOOKSTRUCTEX;
struct _SL_KMEM_CACHE_VALUE_DESCRIPTOR;
struct _SL_KMEM_CACHE;
struct _TOKEN_OWNER;
struct CPlex;
struct tagEMRSETARCDIRECTION;
class PTimeEntry;
struct _DEVICE_LB_PROVISIONING_DESCRIPTOR;
struct _API_SET_VALUE_ARRAY;
struct _FILE_PIPE_EVENT_BUFFER;
struct _SYSTEM_SECUREBOOT_POLICY_INFORMATION;
struct _MINIDUMP_HANDLE_DATA_STREAM;
struct IParseDisplayName;
struct IActivationStageInfo;
class CMultiGUIDHashTable;
struct _ACCESS_DENIED_ACE;
struct __midl_frag891_t;
struct _POWER_USER_PRESENCE;
struct _OCSP_BASIC_SIGNED_RESPONSE_INFO;
struct _CERT_REQUEST_INFO;
struct _PRIV_RESOLVER_INFO;
struct _SYSTEM_NUMA_PROXIMITY_MAP;
class CFatSect;
struct _CMSG_CTRL_KEY_TRANS_DECRYPT_PARA;
struct IDataObject;
class CPagedVector;
struct _RTL_HEAP_TAG_INFO;
struct _REPARSE_POINT_INFORMATION;
struct _SECTIONBASICINFO;
class CBindCtx::CObjList;
struct _THREAD_PERFORMANCE_DATA;
struct _PAGE_PRIORITY_INFORMATION;
struct tagCInterfaceStubVtbl;
struct _FILESYSTEM_STATISTICS;
struct _TP_IO;
struct tagEMRARC;
struct _CERT_REGISTRY_STORE_CLIENT_GPT_PARA;
struct _iinspectable_MIDL_PROC_FORMAT_STRING;
struct _CERT_KEYGEN_REQUEST_INFO;
class OleThunkWOW;
struct _IMAGE_ALPHA_RUNTIME_FUNCTION_ENTRY;
class Windows::Rtl::AutoHandleBase<Windows::Rtl::AutoHandleDefaultTraits<void *>,Windows::Rtl::AutoKeyHandle>::COperatorAmpersandReturnType;
struct __midl_frag1656_t;
struct _CRYPT_CONTENT_INFO;
struct IRpcChannelBuffer2;
class CROIDTable;
struct _EISA_IRQ_DESCRIPTOR;
struct _EISA_IRQ_CONFIGURATION;
struct _EISA_MEMORY_CONFIGURATION;
union _RTL_ELEVATION_FLAGS;
struct _RESOURCEMANAGER_BASIC_INFORMATION;
struct _REQUEST_OPLOCK_OUTPUT_BUFFER;
struct tagENUMLOGFONTEXA;
struct tagDESIGNVECTOR;
struct tagENUMLOGFONTEXDVA;
struct _RegOutput;
struct tagGCP_RESULTSW;
struct IRCEntry;
struct _MIDL_FORMAT_STRING;
struct __midl_frag1444_t;
struct HICON__;
struct tagHARDWAREHOOKSTRUCT;
struct Windows::Rtl::IRtlWORAStream;
struct _NT_TIB32;
struct _PLUGPLAY_CONTROL_DEVICE_RELATIONS_DATA;
struct _SYSTEM_SECUREBOOT_INFORMATION;
struct _HEAP_SUMMARY;
struct _SYSTEM_CRASH_DUMP_STATE_INFORMATION;
class CClassCache::CDPEHashTable;
struct IComServices;
class BUCL::CIsSignedType<unsigned __int64>;
struct __midl_frag796_t;
class LargeIntRegMultiply<int,unsigned __int64>;
struct _REPAIR_COPIES_INPUT;
struct _RPC_IF_ID;
struct _SHFILEOPSTRUCTW;
struct _PO_WAKE_SOURCE_FIXED;
struct _SYSTEM_KERNEL_DEBUGGER_INFORMATION;
struct BULK_SECURITY_TEST_DATA;
struct __midl_frag187_t;
struct _ADMINISTRATOR_POWER_POLICY;
struct _SYSTEM_WORKINGSET_ENTRY;
struct _SYSTEM_PROCESS_ID_INFORMATION;
struct _ASSEMBLY_STORAGE_MAP_RESOLUTION_CALLBACK_DATA_RESOLUTION_ENDING;
struct _TRANSACTIONMANAGER_BASIC_INFORMATION;
class BUCL::CConvertToSignedType<long>;
struct tagCOLORMATCHTOTARGET;
union _RATE_QUOTA_LIMIT;
struct _QUOTA_LIMITS_EX;
class CHandle;
struct _OSVERSIONINFOEXA;
struct CMachineNamesHelper::_SBTOTAL;
struct __midl_frag93_t;
class CAptCallCtrl;
struct tagDATAELEMENT;
struct tagEMRPOLYLINE16;
struct _CSTRING;
struct _NDR_USER_MARSHAL_INFO;
class CUserMarshalInfo;
struct Windows::Rtl::IRtlRORAStream;
struct _OCSP_RESPONSE_INFO;
class BUCL::CConvertToUnsignedType<short>;
struct _SYSTEM_MEMORY_CHANNEL_INFORMATION;
class Windows::Lock<_RTL_CRITICAL_SECTION>;
struct __midl_frag744_t;
class Microsoft::WRL::ComPtr<IMessageParam>;
struct _SYSTEM_REF_TRACE_INFORMATION;
struct IXMLDOMEntityReference;
struct IPSFactoryBufferVtbl;
struct _STARTUPINFOA;
struct threadmbcinfostruct;
struct _CRYPT_CONTEXT_FUNCTION_CONFIG;
struct _ACCESS_DENIED_CALLBACK_OBJECT_ACE;
struct _SYMBOL_INFO;
struct _tagPROTOCOL_ARGUMENT;
struct _CRYPT_CONTENT_INFO_SEQUENCE_OF_ANY;
struct _PROCESS_MITIGATION_ASLR_POLICY;
struct _PROCESS_MITIGATION_SYSTEM_CALL_DISABLE_POLICY;
struct _PROCESS_MITIGATION_EXTENSION_POINT_DISABLE_POLICY;
struct _PROCESS_MITIGATION_POLICY_INFORMATION;
class Windows::Auto<Windows::Rtl::IRtlInterface *>;
struct __midl_frag1686_t;
struct NTFS_EXTENDED_VOLUME_DATA;
struct SET_POWER_SETTING_VALUE;
struct _FILE_COMPRESSION_INFO;
struct MARK_HANDLE_INFO32;
struct _CRYPT_RSA_SSA_PSS_PARAMETERS;
struct IXMLElementCollection;
struct _SYSTEM_PROCESSOR_POLICY_INFORMATION;
struct _SYSTEM_LOGICAL_PROCESSOR_INFORMATION;
struct IPrivActivationPropertiesOut;
struct __midl_frag457_t;
struct IRemUnknownN;
struct _devicemodeA;
struct _SERVICE_TRIGGER;
struct tagInitializeSpyNode;
struct __vc_attributes::helper_attributes::v1_earlyAttribute;
struct __vc_attributes::v1_enumAttribute;
struct tagMIXERCAPS2A;
struct _KSPIN_LOCK_QUEUE;
struct _KLOCK_QUEUE_HANDLE;
struct _JOB_INFO_2A;
struct _NDR64_EXPR_NOOP;
struct _NDR64_EXPR_CONST64;
struct __midl_frag528_t;
struct _SYSTEM_DPC_BEHAVIOR_INFORMATION;
class CSessionMoniker;
union _DL_EUI48;
struct tagOutgoingActivationData;
struct HWINSTA__;
struct _SE_SECURITY_DESCRIPTOR;
struct _LDRP_DLL_SNAP_CONTEXT;
struct _WIN32_FIND_DATAA;
struct _SYSTEM_PLATFORM_BINARY_INFORMATION;
class CWriteMarshalingStreamOnBuffer;
struct IOleControl;
struct _FILE_GET_EA_INFORMATION;
struct __vc_attributes::switch_isAttribute;
struct _CERT_QC_STATEMENTS_EXT_INFO;
struct _PROCESS_KEEPALIVE_COUNT_INFORMATION;
struct tagMCI_ANIM_OPEN_PARMSW;
struct _SYSTEM_POWER_LOGGING_ENTRY;
struct _SYSTEM_IMAGE_FILE_EXECUTION_OPTIONS_INFORMATION;
struct _MEMORY_RANGE_ENTRY;
struct _MUTANT_BASIC_INFORMATION;
struct IProxyServerIdentity;
struct _MINIDUMP_MEMORY64_LIST;
struct tagHIGHCONTRASTW;
struct __midl_frag71_t;
struct SHA512_CTX;
struct __midl_frag252_t;
struct _CRYPT_AES_256_KEY_STATE;
struct _cpinfoexA;
struct _SYSTEM_PROCESSOR_PERFORMANCE_INFORMATION_EX;
struct USN_JOURNAL_DATA_V1;
struct tagOleMenuGroupWidths;
struct IServiceProvider;
struct _PROPSHEETPAGEW_V2;
struct _PLUGPLAY_CONTROL_CLASS_ASSOCIATION_DATA;
struct _ENLISTMENT_CRM_INFORMATION;
struct __MIDL___MIDL_itf_wtypes_0000_0001_0001;
struct __midl_frag1384_t;
struct IXMLDSOControl;
struct __lc_time_data;
struct value_entA;
struct IResourceGates;
struct _TRANSACTION_NOTIFICATION_SAVEPOINT_ARGUMENT;
class Windows::ErrorHandling::Rtl::CBaseRaiseFrame<Windows::ErrorHandling::Rtl::CVoidRaiseFrame,Windows::ErrorHandling::Rtl::CBaseNtStatusCarryingFrame<Windows::ErrorHandling::Rtl::CVoidRaiseFrame> >;
struct _PLUGPLAY_CONTROL_LEGACY_DEVGEN_DATA;
struct _SYSTEM_FILECACHE_INFORMATION;
class BUCL::CMultiplier<unsigned __int64,BUCL::Rtl::CCallDisposition>;
struct _nlsversioninfo;
class CRtlSmartUcsEncoderTraits<_LUTF8_STRING>;
struct _RPC_SECURITY_QOS_V5_A;
class CContextPropList;
class CObjectContext;
struct tagMETAFILEPICT;
struct XMLDOMDocumentEvents;
struct _CRYPT_HASH_MESSAGE_PARA;
struct _SHELLEXECUTEINFOA;
struct SHA256_CTX;
struct _IMAGE_TLS_DIRECTORY64;
struct __midl_frag44_t;
struct _SYSTEM_PROCESSOR_PERFORMANCE_DISTRIBUTION;
struct _CERT_BASIC_CONSTRAINTS_INFO;
struct tagHELPWININFOW;
struct _CLASS_MEDIA_CHANGE_CONTEXT;
struct __midl_frag684_t;
struct tagEMRBITBLT;
class Microsoft::WRL::Details::Nil;
struct _SYSTEM_VERIFIER_CANCELLATION_INFORMATION;
struct _SYSTEM_SESSION_POOLTAG_INFORMATION;
struct _PSP;
struct _OCSP_REQUEST_INFO;
class Microsoft::WRL::Details::DontUseNewUseMake;
struct tagAUDIODESCRIPTION;
struct _IMAGE_FUNCTION_ENTRY;
class CClassCache::CpUnkMoniker;
struct tagMCI_SYSINFO_PARMSW;
struct __midl_frag82_t;
struct tagRPC_CALL_ATTRIBUTES_V3_A;
struct _SHNAMEMAPPINGA;
struct IInitActivationPropertiesIn;
struct _MONITOR_INFO_1W;
struct _EXCEPTION_RECORD64;
struct _FILE_NOTIFY_INFORMATION;
class CClassCache::IMiniMoniker;
struct tagInterfaceData;
struct tagMIXERCONTROLW;
struct _CRYPT_TIMESTAMP_PARA;
struct _RTL_CRITICAL_SECTION32;
struct _CERT_AUTHORITY_KEY_ID2_INFO;
struct _STORAGE_DESCRIPTOR_HEADER;
struct _SYSTEM_HANDLE_INFORMATION;
struct _FSCTL_OFFLOAD_WRITE_INPUT;
struct SIterBuffer;
struct _NAME_BUFFER;
struct _FILE_REGION_INFO;
struct _FILE_REGION_OUTPUT;
struct __midl_frag16_t;
struct ClassicSTAState;
class CStdIdentity;
struct tagEMRSETWORLDTRANSFORM;
struct _APPLICATIONLAUNCH_SETTING_VALUE;
class CUrlMonWrapper;
struct _PERFORMANCE_DATA;
struct IClassClassicInfo2;
struct _PRINTER_INFO_9W;
struct _BOOT_AREA_INFO;
struct __midl_frag55_t;
struct _HARDERROR_MSG;
struct tagICONMETRICSW;
struct _CONSOLE_SCREEN_BUFFER_INFOEX;
class CObjrefMonikerFactory;
struct __midl_frag369_t;
struct IInterfaceInfo;
struct SPreDirEntry;
struct _FILE_IO_PRIORITY_HINT_INFORMATION;
struct _SECTION_IMAGE_INFORMATION64;
struct _STARTUPINFOEXA;
struct IOleLink;
struct __midl_frag59_t;
struct _CONSOLE_FONT_INFOEX;
struct _NDR64_ENCAPSULATED_UNION;
struct _NDR64_UNION_ARM_SELECTOR;
struct _NDR64_UNION_ARM;
struct __midl_frag80_t;
struct FRAME_RemoteInvoke;
struct DISPATCH_CLIENT_FRAME;
struct _FILE_IO_COMPLETION_NOTIFICATION_INFORMATION;
struct _JOURNAL_SET_KEY_USER_FLAGS_INFORMATION;
struct tagMCI_SYSINFO_PARMSA;
struct __midl_frag195_t;
struct ASSOCIATIONELEMENT;
struct tagEMRRESTOREDC;
struct tagGUITHREADINFO;
struct Windows::AutoPODBase<_UNICODE_STRING,Windows::Auto<_UNICODE_STRING> >::is_pointer<_UNICODE_STRING>;
struct IOleItemContainer;
struct __midl_frag368_t;
struct _UMS_CREATE_THREAD_ATTRIBUTES;
struct _JOB_INFO_1A;
struct IHttpNegotiate2;
struct _FILE_ALLOCATION_INFORMATION;
struct HTASK__;
struct tagCURSORINFO;
struct _RTL_RESOURCE;
struct tagENUMLOGFONTEXDVW;
struct REFS_VOLUME_DATA_BUFFER;
struct _EXCEPTION_POINTERS;
union _PROCESS_AFFINITY_UPDATE_MODE;
struct _SD_CHANGE_MACHINE_SID_OUTPUT;
class CHeapHeader;
struct Windows::ErrorHandling::_RTL_CALL_SITE;
struct __midl_frag288_t;
struct _SYMBOL_INFO_PACKAGE;
union _SE_SID;
struct _OBJECT_TYPE_INFORMATION;
struct _REASSIGN_BLOCKS_EX;
struct IDirectWriterLock;
struct _CM_INT13_DRIVE_PARAMETER;
class OpaqueDataInfo;
struct __midl_frag1256_t;
struct _SHELLEXECUTEINFOW;
struct tagORPC_EXTENT_ARRAY;
struct IEnumConnectionsVtbl;
struct IInternetBindInfo;
struct tagCLEANLOCALSTORAGE;
struct tagHELPINFO;
struct _MINIDUMP_THREAD;
class Windows::AutoOperatorAmpersandHelper<Windows::Rtl::IRtlBlobProvider *,Windows::Auto<Windows::Rtl::IRtlBlobProvider *> >;
struct IBindProtocol;
struct _SERVICE_CONTROL_STATUS_REASON_PARAMSW;
struct _JOBOBJECT_FREEZE_INFORMATION;
struct _IMAGE_ARCHIVE_MEMBER_HEADER;
struct __midl_frag31_t;
struct _BCRYPT_AUTHENTICATED_CIPHER_MODE_INFO;
struct _CERT_DSS_PARAMETERS;
struct _TXFS_GET_TRANSACTED_VERSION;
struct __midl_frag1170_t;
struct _REG_NOTIFY_INFORMATION;
struct _SC_ACTION;
struct __midl_frag747_t;
struct _CRYPT_PROVIDER_DEFUSAGE;
struct _SERVICE_PREFERRED_NODE_INFO;
struct __midl_frag25_t;
struct _PROCESSOR_PROFILE_CONTROL_AREA;
struct tagENUMTEXTMETRICW;
struct _REMOTE_NAME_INFOA;
struct _PRINTER_CONNECTION_INFO_1W;
struct __midl_frag1496_t;
union _POWER_STATE;
struct tagRPC_CALL_ATTRIBUTES_V1_W;
struct IEnumMoniker;
struct __midl_frag1307_t;
struct tagMONITORINFOEXA;
struct _GRADIENT_RECT;
struct IOleWindow;
struct _complex;
struct _FILE_QUERY_ON_DISK_VOL_INFO_BUFFER;
struct _IMAGE_RESOURCE_DATA_ENTRY;
struct _DEDUP_CHUNK_INFORMATION_HASH32;
struct _KEY_CACHED_INFORMATION;
struct _TOKEN_MANDATORY_POLICY;
struct _TOKEN_ACCESS_INFORMATION;
struct _PRINTER_INFO_1A;
struct _CMSG_SP3_COMPATIBLE_AUX_INFO;
struct ISCMProcessControl;
struct tagCUSTDATA;
struct DDEACK;
struct __midl_frag804_t;
struct _COMPRESSED_DATA_INFO;
struct tagCUSTDATAITEM;
struct _SERVICE_REQUIRED_PRIVILEGES_INFOA;
struct _TI_FINDCHILDREN_PARAMS;
struct _SYSTEM_PERFORMANCE_INFORMATION;
struct _RTL_MODULE_EXTENDED_INFO;
struct _SYSTEM_NUMA_INFORMATION;
struct _ASSEMBLY_STORAGE_MAP_RESOLUTION_CALLBACK_DATA_RESOLUTION_BEGINNING;
union _ASSEMBLY_STORAGE_MAP_RESOLUTION_CALLBACK_DATA;
struct IObjectWithSite;
class BUCL::CIsSignedType<long>;
struct _BCRYPT_RSAKEY_BLOB;
struct _SYSTEM_EXCEPTION_INFORMATION;
struct _PSFEATURE_OUTPUT;
struct _CM_FLOPPY_DEVICE_DATA;
struct _RPC_HTTP_TRANSPORT_CREDENTIALS_V3_W;
struct _PROPSHEETHEADERA_V1;
struct _RTL_RXACT_LOG;
struct IPolicyMaker;
struct tagKERNINGPAIR;
struct _LEARNING_MODE_OBJECT_INFORMATION;
struct IBindStatusCallbackEx;
struct __midl_frag1599_t;
struct tagORPCTHIS;
struct __MIDL_ILocalObjectExporter_0003;
struct tagREMINTERFACEREF;
struct _CALL_FRAME;
struct _SYSTEM_CODEINTEGRITY_INFORMATION;
struct _SYSTEM_PORTABLE_WORKSPACE_EFI_LAUNCHER_INFORMATION;
struct tagIPIDEntry;
class CIPIDTable;
struct _RPC_SERVER_INTERFACE;
struct Windows::Rtl::IRtlWOFOUCSStream;
struct _RPC_PROTSEQ_ENDPOINT;
struct HSPRITE__;
struct _CRYPT_OBJECT_LOCATOR_PROVIDER_TABLE;
class CClientCall;
struct _DEVICE_WRITE_AGGREGATION_DESCRIPTOR;
struct tagMCI_ANIM_WINDOW_PARMSW;
struct tagEMRGLSRECORD;
struct _WINDOWS_OS_OPTIONS;
class Windows::Rtl::AutoBlob<Windows::Auto<_LBLOB> >;
struct IOleInPlaceUIWindowVtbl;
struct tagEMRCREATEPALETTE;
struct _FILE_ID_BOTH_DIR_INFORMATION;
struct _FILE_LINK_ENTRY_INFORMATION;
struct _FILE_LINKS_INFORMATION;
struct _FORM_INFO_1A;
struct _SYSTEM_POWER_INFORMATION;
struct IActivationFactory;
struct HDDEDATA__;
struct tagACTCTX_SECTION_KEYED_DATA_2600;
struct IPrivActivationPropertiesIn;
class CMIPIDHashTable;
class CSafeSem;
struct __vc_attributes::moduleAttribute;
struct Windows::AutoPointerBase<Windows::Rtl::IRtlObject *,Windows::Auto<Windows::Rtl::IRtlObject *> >::is_pointer<Windows::Rtl::IRtlObject *>;
struct __midl_frag1670_t;
struct IErrorLog;
struct tagCallEntry;
struct _IMAGE_DEBUG_MISC;
struct HPEN__;
struct _CERT_RDN;
struct tagNONCLIENTMETRICSW;
struct _CONSOLE_SCREEN_BUFFER_INFO;
struct tagCONTROLINFO;
struct IShellItem;
struct _SERVICE_DESCRIPTIONA;
struct _BCRYPT_DSA_KEY_BLOB;
struct __vc_attributes::hiddenAttribute;
struct _WIN_TRUST_ACTDATA_CONTEXT_WITH_SUBJECT;
struct _SCOPE_TABLE_AMD64;
struct _STORAGE_ACCESS_ALIGNMENT_DESCRIPTOR;
struct __midl_frag480_t;
struct _MODLOAD_PDBGUID_PDBAGE;
struct _API_SET_NAMESPACE_ARRAY;
struct _REMOTE_NAME_INFOW;
struct IEnumSTATPROPSETSTG;
struct _DEVICE_DSM_OFFLOAD_READ_PARAMETERS;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IApartmentShutdown> >;
struct _OMAP;
struct _MINIDUMP_USER_STREAM_INFORMATION;
struct IScmRequestInfo;
struct tagFILTERKEYS;
struct _MINIDUMP_HANDLE_DESCRIPTOR;
struct tagSTATPROPSTG;
struct _CERT_KEY_ATTRIBUTES_INFO;
struct SPC_LINK_;
struct _DRIVERSTATUS;
struct __vc_attributes::licensedAttribute;
struct _REPARSE_DATA_BUFFER;
struct IUserToken;
struct _XSAVE_AREA;
struct _THREAD_CYCLE_TIME_INFORMATION;
struct _VARIABLE_NAME_AND_VALUE;
struct IOleControlSite;
class Windows::AutoOperatorAmpersandHelper<_UNICODE_STRING,Windows::Auto<_UNICODE_STRING> >;
struct _RPC_C_OPT_COOKIE_AUTH_DESCRIPTOR;
class Microsoft::WRL::Details::ModuleBase;
struct _MINIDUMP_EXCEPTION;
class Microsoft::WRL::ComPtr<IImpersonateClipboardOwner>;
struct _FILE_PIPE_CLIENT_PROCESS_BUFFER_EX;
struct _FILE_NAME_INFO;
struct _CERT_SYSTEM_STORE_INFO;
struct IEnumVARIANT;
struct tagMCI_WAVE_OPEN_PARMSW;
struct _SYSTEM_AUDIT_OBJECT_ACE;
struct _IMAGEHLP_CBA_EVENT;
struct Microsoft::WRL::Details::CreatorMap;
struct _MINIDUMP_HANDLE_OPERATION_LIST;
struct _SYSTEM_PROCESSOR_PROFILE_CONTROL_AREA;
struct __midl_frag826_t;
struct _BOOT_OPTIONS;
struct tagSOUNDSENTRYW;
struct __vc_attributes::immediatebindAttribute;
class CStmBuf;
struct WSAData;
struct __vc_attributes::inAttribute;
struct Microsoft::WRL::Details::ImplementsHelper<Microsoft::WRL::RuntimeClassFlags<3>,Microsoft::WRL::Details::InterfaceList<Microsoft::WRL::CloakedIid<IAgileObject>,Microsoft::WRL::Details::Nil>,1,0>;
struct __vc_attributes::exportAttribute;
struct __vc_attributes::controlAttribute;
class Microsoft::WRL::Details::FtmBaseMarker;
struct tagQACONTAINER;
struct __vc_attributes::helpstringcontextAttribute;
struct __vc_attributes::defaultbindAttribute;
struct __NCRYPT_UI_POLICY;
struct __vc_attributes::localAttribute;
struct __vc_attributes::importlibAttribute;
struct __midl_frag742_t;
struct IMarshal2;
struct __vc_attributes::dispinterfaceAttribute;
struct __vc_attributes::dualAttribute;
struct __midl_frag201_t;
struct _STORAGE_WRITE_CACHE_PROPERTY;
class CProperty;
struct __vc_attributes::defaultAttribute;
struct __vc_attributes::providerAttribute;
struct tagPRINTPAGERANGE;
struct __vc_attributes::importAttribute;
class CEnumSTATPROPBAG;
struct __vc_attributes::satypeAttribute;
struct __vc_attributes::async_uuidAttribute;
struct SStorageFile;
struct __vc_attributes::unhookAttribute;
struct __vc_attributes::nonextensibleAttribute;
struct _PRINTER_OPTIONSA;
struct __vc_attributes::aggregatableAttribute;
struct tagPROPHEADER;
class CArray<CPropertySection *,CPropertySection * &>;
class CPropertySet;
struct __vc_attributes::progidAttribute;
struct __vc_attributes::wire_marshalAttribute;
struct __vc_attributes::vi_progidAttribute;
struct __vc_attributes::odlAttribute;
struct __vc_attributes::bindableAttribute;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IRuntimeBroker> >;
struct __vc_attributes::helpstringdllAttribute;
struct __vc_attributes::defaultcollelemAttribute;
struct __vc_attributes::atl::db_commandAttribute;
struct __vc_attributes::atl::db_columnAttribute;
struct __vc_attributes::atl::db_tableAttribute;
struct midistrmbuffver_tag;
struct __vc_attributes::atl::aggregatesAttribute;
struct __vc_attributes::atl::soap_headerAttribute;
struct __vc_attributes::atl::perfmonAttribute;
struct _EVENT_DATA_DESCRIPTOR;
class C2Security;
struct __vc_attributes::atl::support_error_infoAttribute;
struct __vc_attributes::atl::tag_nameAttribute;
struct PrintNamedProperty;
struct __vc_attributes::atl::db_paramAttribute;
struct __vc_attributes::atl::soap_methodAttribute;
struct __midl_frag1754_t;
struct __vc_attributes::atl::synchronizeAttribute;
struct _DEVICE_DATA_SET_RANGE;
struct __vc_attributes::caseAttribute;
struct __midl_frag1584_t;
struct __vc_attributes::helpstringAttribute;
struct __vc_attributes::entryAttribute;
struct tagOFN_NT4W;
struct __midl_frag1703_t;
struct __vc_attributes::defaultvtableAttribute;
struct WireThisPart1;
class Windows::AutoPointerBase<Windows::Rtl::IRtlWORAStream *,Windows::Auto<Windows::Rtl::IRtlWORAStream *> >;
struct __vc_attributes::event_sourceAttribute;
struct IBuffer;
struct __vc_attributes::last_isAttribute;
struct __vc_attributes::helper_attributes::usageAttribute;
struct tagMCI_STATUS_PARMS;
struct __vc_attributes::helper_attributes::attributeAttribute;
class Windows::AutoOperatorAmpersandConstHelper<Windows::Rtl::IRtlWOFOStream *,Windows::Auto<Windows::Rtl::IRtlWOFOStream *> >;
struct __vc_attributes::helper_attributes::v1_alttypeAttribute;
class CGlobalContext;
class AdditionHelper<long,long,6>;
struct __vc_attributes::helper_attributes::default_valueAttribute;
struct _PRINTER_INFO_8A;
struct __vc_attributes::importidlAttribute;
struct __vc_attributes::cpp_quoteAttribute;
struct __vc_attributes::refAttribute;
struct SystemBlockHeader;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<ICallingProcessInfo> >;
class Windows::ErrorHandling::Rtl::CBaseFrame<Windows::ErrorHandling::Rtl::CVoidRaiseFrame>;
struct __vc_attributes::lcidAttribute;
struct __vc_attributes::helpfileAttribute;
struct __vc_attributes::transmit_asAttribute;
struct __vc_attributes::library_blockAttribute;
struct __vc_attributes::optionalAttribute;
class CArray<CFormatEtc>;
struct timecaps_tag;
struct _FILE_FS_SECTOR_SIZE_INFORMATION;
struct tagEMRGDICOMMENT;
class Windows::Auto<Windows::Rtl::IRtlObject *>;
struct _ALPC_BASIC_INFORMATION;
class Microsoft::WRL::Details::RemoveIUnknownBase<IImpersonateClipboardOwner>;
struct _SENDCMDOUTPARAMS;
class Microsoft::WRL::RuntimeClass<Microsoft::WRL::RuntimeClassFlags<2>,IClipboardBrokerInternal,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil>;
struct tagRECONVERTSTRING;
class CDfNameList;
struct _AUTHENTICODE_EXTRA_CERT_CHAIN_POLICY_PARA;
class CPatternTbl;
struct __MIDL___MIDL_itf_activate_0000_0010_0004;
class TXLargeIntegerWrapper<_LARGE_INTEGER,long,__int64>;
struct _DEVICE_DSM_OFFLOAD_WRITE_PARAMETERS;
struct _SET_PARTITION_INFORMATION;
struct _RTL_UNLOAD_EVENT_TRACE32;
struct __midl_frag406_t;
struct _SYSTEM_POWER_POLICY;
class CClassCache::CDllClassEntry;
struct _TRANSACTION_LIST_INFORMATION;
struct _NCRYPT_CIPHER_PADDING_INFO;
class CPropertyBagEx;
class CNtfsStorage;
struct _IMAGE_DELAYLOAD_DESCRIPTOR;
class DeserializeHelper::SafeArrayDestroyer;
struct tagMIXERLINECONTROLSW;
struct __midl_frag199_t;
struct _EX_WNF_SUBSCRIPTION;
struct tagMCI_WAVE_SET_PARMS;
struct _SYSTEM_BOOT_LOGO_INFORMATION;
class Microsoft::WRL::Details::RemoveIUnknownBase<IClipboardBroker>;
struct _DRIVER_INFO_4W;
struct __midl_frag1399_t;
struct tagMEASUREITEMSTRUCT;
struct IInterfaceFromWindowProp;
struct IEnumFORMATETCVtbl;
struct __midl_frag617_t;
struct _CM_PCCARD_DEVICE_DATA;
struct _COUNTED_REASON_CONTEXT;
class CClassCache::CWinRTDllClassEntry;
class RunSyncOnMTAThread::__l6::<lambda_112812E40241EED9>;
struct tagOFNA;
struct tagPDA;
struct _CONSOLE_FONT_INFO;
class Microsoft::WRL::Details::RemoveIUnknownBase<ClipboardDataObjectTask>;
struct tagSTGOPTIONS;
struct _SD_QUERY_STATS_OUTPUT;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IMarshalingStream> const >;
class CEnumFormatEtcDataArray;
struct tagLOCALESIGNATURE;
struct __midl_frag254_t;
struct _BIN_RESULTS;
struct _JOBOBJECT_BASIC_PROCESS_ID_LIST;
struct IMalloc;
struct tagMIDIOUTCAPS2W;
class CLimitedWritableStream::Revert::__l3::<lambda_90BBF1240E966676>;
struct HMIXEROBJ__;
struct __midl_frag395_t;
class CLimitedWritableStream::CopyTo::__l9::<lambda_AC2301D1AB195848>;
class type_info;
struct hostent;
class TStackBuffer<unsigned long,64>;
class CFormatEtc;
struct _PROPSHEETHEADERW_V1;
struct IFillInfo;
struct __midl_frag35_t;
struct _FILE_SYSTEM_RECOGNITION_INFORMATION;
struct _UNICODE_PREFIX_TABLE;
struct Microsoft::WRL::Details::ImplementsHelper<Microsoft::WRL::RuntimeClassFlags<2>,Microsoft::WRL::Details::InterfaceList<IClipboardBrokerInternal,Microsoft::WRL::Details::Nil>,0,0>;
struct _PROPSHEETPAGEW_V3;
struct _PROCESS_SESSION_INFORMATION;
struct _SYSTEM_CONTEXT_SWITCH_INFORMATION;
class BUCL::CConvertToUnsignedType<unsigned long>;
struct _FLS_DATA;
struct _MINIDUMP_THREAD_EX_CALLBACK;
struct _MINIDUMP_INCLUDE_MODULE_CALLBACK;
struct _MINIDUMP_IO_CALLBACK;
struct _MINIDUMP_READ_MEMORY_FAILURE_CALLBACK;
struct _MINIDUMP_CALLBACK_INPUT;
class HashInt;
struct _DISK_EX_INT13_INFO;
class Windows::Auto<Windows::Rtl::IRtlWORAStream *>;
struct __midl_frag216_t;
struct _WGLSWAP;
struct __midl_frag88_t;
struct IEnumUnknown;
class CReadOnlyStorage::CopyTo::__l12::<lambda_48830B8A68BE8DE9>;
struct tagMCI_ANIM_OPEN_PARMSA;
struct _MINIDUMP_MEMORY_LIST;
struct _CMC_DATA_INFO;
struct _CMC_TAGGED_OTHER_MSG;
struct _FILE_ID_EXTD_DIR_INFORMATION;
class ostream;
class Windows::AutoOperatorAmpersandHelper<Windows::Rtl::IRtlUtf16LEStringBuilder *,Windows::Auto<Windows::Rtl::IRtlUtf16LEStringBuilder *> >;
struct _MEMORY_COMBINE_INFORMATION;
struct _PSINJECTDATA;
struct _tagHIT_LOGGING_INFO;
struct tagEMREXTFLOODFILL;
struct __midl_frag467_t;
struct _ACCESS_ALLOWED_CALLBACK_ACE;
struct _EVENTLOG_FULL_INFORMATION;
class CEnumSTATPROPSETSTG;
struct _SYSTEM_THREAD_CID_PRIORITY_INFORMATION;
struct __midl_frag113_t;
struct AsyncIAdviseSink2;
struct __midl_frag209_t;
struct _DRIVER_INFO_3A;
struct _FILE_IOSTATUSBLOCK_RANGE_INFORMATION;
struct _CRYPT_PROVUI_DATA;
struct _REASSIGN_BLOCKS;
struct _RTL_VERIFIER_RUNTIME_FLAGS_INFORMATION;
struct IImageList;
class Windows::Rtl::AutoHandleBase<Windows::Rtl::AutoHandleDefaultTraits<void *>,Windows::Rtl::AutoHandle>;
struct __midl_frag704_t;
struct _RTL_USER_PROCESS_INFORMATION64;
struct _PROCESS_HANDLE_TRACING_QUERY;
struct _SPC_SP_AGENCY_INFO;
struct _exception;
struct _CRYPT_SEQUENCE_OF_ANY;
struct __midl_frag86_t;
struct IInterfaceRelated;
struct HWAVEIN__;
struct __midl_frag275_t;
struct _KEY_OPEN_SUBKEYS_INFORMATION;
struct _SYMBOL_INFOW;
struct _SYMBOL_INFO_PACKAGEW;
class BUCL::CConvertToSignedType<unsigned int>;
struct _CRYPT_ENCRYPTED_PRIVATE_KEY_INFO;
struct IWinInetInfo;
class BUCL::CConvertToUnsignedType<unsigned short>;
struct _EXTENDED_ENCRYPTED_DATA_INFO;
struct _CLINFO;
class BUCL::CConvertToUnsignedType<signed char>;
struct tagTTPOLYCURVE;
struct IMarshallingManager;
struct SPC_SIGINFO_;
struct _MEMORY_WORKING_SET_EX_INFORMATION;
struct tagPSDW;
struct _TP_POOL_STACK_INFORMATION;
struct _RPC_SECURITY_QOS_V4_W;
struct _RESOURCEMANAGER_COMPLETION_INFORMATION;
struct __midl_frag1518_t;
struct _JOB_INFO_1W;
struct _SYSTEM_VERIFIER_FAULTS_INFORMATION;
class BUCL::CConvertToUnsignedType<unsigned int>;
class BUCL::CIsSignedType<short>;
struct _NCRYPT_KEY_BLOB_HEADER;
struct IUnwrappableDataObject;
struct _IMAGEHLP_STACK_FRAME;
struct MEMSTM;
class BUCL::CConvertToUnsignedType<long>;
struct SYMSRV_INDEX_INFO;
struct _CHANGER_SET_ACCESS;
struct _JOBOBJECT_BASIC_UI_RESTRICTIONS;
class Windows::AutoOperatorAmpersandConstHelper<Windows::Rtl::IRtlRORAStream *,Windows::Auto<Windows::Rtl::IRtlRORAStream *> >;
struct __MIDL_ICallFrame_0001;
struct tagMIXERCAPSW;
struct __midl_frag54_t;
struct _FILE_NUMA_NODE_INFORMATION;
struct Windows::Rtl::IRtlROFOStream;
struct _SECURITY_CAPABILITIES;
struct Windows::Rtl::IRtlFormattableInterface::FormattingLevels;
class Windows::AutoOperatorAmpersandConstHelper<Windows::Rtl::IRtlBlobProvider *,Windows::Auto<Windows::Rtl::IRtlBlobProvider *> >;
struct _COMMTIMEOUTS;
struct TYPEINFOVTBL;
struct _CMSG_CMS_SIGNER_INFO;
struct IIdentifyHive;
class EnumMap<MAP_KEY_GUID,TYPEINFOVTBL *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>;
class MAP<XSLOCK,MAP_KEY_GUID,TYPEINFOVTBL *>::iterator;
struct PARAM_ATTRIBUTES;
struct PARAM_DESCRIPTION;
struct HWAVE__;
struct ISyncAdvise;
struct _CrtMemBlockHeader;
class Windows::Rtl::StringTraits<_LUTF8_STRING>;
struct tagMCI_VD_STEP_PARMS;
struct tagPELARRAY;
struct _PROCESS_DEVICEMAP_INFORMATION_EX;
struct tagDVTARGETDEVICE;
struct Windows::AutoPointerBase<Windows::Rtl::IRtlWOUCSStream *,Windows::Auto<Windows::Rtl::IRtlWOUCSStream *> >::is_pointer<Windows::Rtl::IRtlWOUCSStream *>;
struct __midl_frag378_t;
struct tagI_RpcProxyCallbackInterface;
class CArray<CCacheNode>;
struct tagMCI_SEEK_PARMS;
struct IFunctionInstance;
class CLimitedWritableStorage::Commit::__l3::<lambda_CC1FC64EEBB82396>;
struct Windows::Rtl::IRtlFormattableObject::FormattingLevels;
struct __midl_frag282_t;
class CClipboardBroker::ValidateAndAcquireACImpersonationSource::__l14::<lambda_CDF35D9A0ACF867E>;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IOSTaskCompletion> const >;
class CApartmentHashTable;
struct __midl_frag450_t;
class Windows::Rtl::AutoHandleBase<Windows::Rtl::AutoHandleDefaultTraits<void *>,Windows::Rtl::AutoFileHandle>::COperatorAmpersandReturnType;
class Common::AutoPtr<_TOKEN_SECURITY_ATTRIBUTES_INFORMATION,&ARI::AutoPtrAriHeapDeallocate<_TOKEN_SECURITY_ATTRIBUTES_INFORMATION> >;
struct _FILE_PROCESS_IDS_USING_FILE_INFORMATION;
struct _IMAGEHLP_MODULEW64;
struct IUserTokenWithImpersonate;
struct _PORT_DATA_INFORMATION;
struct __midl_frag48_t;
struct _ALPC_HANDLE_ATTR;
struct __midl_frag382_t;
struct _SERVICE_TRIGGER_INFO;
struct tagCALPOLESTR;
struct _DOC_INFO_2A;
struct _COVERAGE_UNLOADED_MODULE_ENTRY;
class CClipDataObject;
class Windows::Rtl::StringTraits<_LUNICODE_STRING>;
struct tagPARAMDESCEX;
struct _RTLP_PROCESS_REFLECTION_CONTEXT;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IGlobalInterfaceTable> const >;
struct Windows::AutoPODBase<_LUTF8_STRING,Windows::Auto<_LUTF8_STRING> >::is_pointer<_LUTF8_STRING>;
class Microsoft::WRL::Details::ComPtrRefBase<Microsoft::WRL::ComPtr<IStorage> >;
struct __midl_frag409_t;
struct _BCRYPT_DH_KEY_BLOB;
struct pvalueW;
struct _PRIV_SCM_INFO;
struct _FILE_SFIO_VOLUME_INFORMATION;
struct _HEAP_BLOCK_SETTABLE_INFORMATION;
struct __midl_frag699_t;
class CLimitedStreamBase::LockRegion::__l3::<lambda_1118F1833D0D7A0F>;
struct _TXFS_LIST_TRANSACTIONS_ENTRY;
struct _PORT_INFO_2W;
struct _PLUGPLAY_CONTROL_CONFLICT_STRINGS;
struct _CMC_RESPONSE_INFO;
struct _MUTANT_OWNER_INFORMATION;
struct _FORMAT_PARAMETERS;
struct OPENCARD_SEARCH_CRITERIAA;
struct __midl_frag732_t;
struct __midl_frag1451_t;
struct _RPC_CLIENT_INTERFACE;
struct __midl_frag1330_t;
struct _CTL_USAGE_MATCH;
struct COPYFILE2_EXTENDED_PARAMETERS;
struct PrintPropertiesCollection;
class LargeIntRegMultiply<unsigned int,__int64>;
struct _AUTHENTICODE_TS_EXTRA_CERT_CHAIN_POLICY_PARA;
struct _SYSTEM_VDM_INSTEMUL_INFO;
struct provider_info;
struct __midl_frag183_t;
class AdditionHelper<__int64,unsigned __int64,13>;
struct __midl_frag322_t;
struct HMIXER__;
struct __midl_frag142_t;
struct __midl_frag1520_t;
struct _CRYPT_SIGN_MESSAGE_PARA;
struct _MMIOINFO;
struct __midl_frag931_t;
class CArray<CStatData>;
struct pcmwaveformat_tag;
struct LockCookie;
class RenderFormat::__l40::<lambda_E19A7055556DA8EC>;
struct __midl_frag1043_t;
struct servent;
class CClipboardBroker;
class Windows::AutoPointerBase<Windows::Rtl::IRtlUtf8StringBuilder *,Windows::Auto<Windows::Rtl::IRtlUtf8StringBuilder *> >;
struct _MEMORYSTATUSEX;
struct _STORAGE_OFFLOAD_READ_OUTPUT;
struct _RTL_GENERIC_TABLE;
struct STORAGE_BREAK_RESERVATION_REQUEST;
struct __midl_frag1857_t;
class CClipboardBroker::CClipboardBrokerMTAHelper;
class CSharedMemoryBlock;
struct __midl_frag1322_t;
struct _ICONINFOEXA;
class Microsoft::WRL::Wrappers::HandleT<Microsoft::WRL::Wrappers::HandleTraits::EventTraits>;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IWeakReference> >;
struct IBindCallbackRedirect;
struct tagMCI_ANIM_PLAY_PARMS;
struct _PERF_COUNTER_DEFINITION;
struct tagEMRGLSBOUNDEDRECORD;
struct _HMAPPER;
struct _NDR64_BOGUS_ARRAY_HEADER_FORMAT;
struct _NDR64_CONF_VAR_BOGUS_ARRAY_HEADER_FORMAT;
struct __midl_frag767_t;
struct tMIXERCONTROLDETAILS;
struct _NDR64_BUFFER_ALIGN_FORMAT;
struct tagHANDLETABLE;
class Windows::Internal::GitPtr;
struct _WINTRUST_DATA;
struct __midl_frag233_t;
struct _PREVENT_MEDIA_REMOVAL;
struct WINTRUST_CERT_INFO_;
struct tagJOYCAPS2A;
struct _PROVIDOR_INFO_2W;
struct __midl_frag295_t;
struct IStackWalker;
struct DISPLAYCONFIG_MODE_INFO;
struct IXMLDocument;
class Microsoft::WRL::ComPtr<IUnwrappableDataObject>;
struct _NDR64_CONF_VAR_ARRAY_HEADER_FORMAT;
struct _MEMORY_REGION_INFORMATION;
class CBool;
struct DDELN;
class Microsoft::WRL::Details::RemoveIUnknownBase<IRuntimeBroker>;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IClipboardBroker> >;
struct _SET_PARTITION_INFORMATION_EX;
class Microsoft::WRL::ComPtr<IOSTaskCompletion>;
struct OPENCARDNAMEA;
struct _KEY_NODE_INFORMATION;
struct tagMCI_WAVE_DELETE_PARMS;
union WPP_PROJECT_CONTROL_BLOCK;
struct _PLUGPLAY_CONTROL_QUERY_AND_REMOVE_DATA;
struct __midl_frag1014_t;
struct tagOLEMENUITEM;
struct tagOLEMENU;
struct _CONTRACT_DESCRIPTION;
struct __midl_frag1177_t;
class CStaticWriteLock;
struct DDEUP;
struct __midl_frag225_t;
struct _TOKEN_SECURITY_ATTRIBUTES_AND_OPERATION_INFORMATION;
struct tagMCI_OVLY_SAVE_PARMSW;
struct _FILE_FS_OBJECTID_INFORMATION;
struct SCopyVars;
struct __midl_frag1310_t;
struct HWAVEOUT__;
struct _SYSTEM_FIRMWARE_TABLE_HANDLER;
struct __midl_frag316_t;
class CContainer_PolicySysFree;
struct _SYSTEM_FIRMWARE_TABLE_INFORMATION;
class CSeekPointer;
struct tagNCCALCSIZE_PARAMS;
struct IRunnableObjectVtbl;
struct IExternalConnection;
class CDocFile;
struct IEnumRGBQuad;
struct sockaddr;
struct __midl_frag1722_t;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<ApartmentShutdownNode> const >;
struct _TXFS_READ_BACKUP_INFORMATION_OUT;
class CStmBufRead;
struct __midl_frag1799_t;
struct _TP_DEBUG_FREE_INFO;
struct _SYSDBG_PHYSICAL;
struct __midl_frag205_t;
struct _CORE_PRINTER_DRIVERA;
struct __midl_frag1161_t;
struct _ENLISTMENT_BASIC_INFORMATION;
struct tagSTATDATA;
class CAutoHandle_Policy<HPEN__ *>;
struct _mega_MIDL_PROC_FORMAT_STRING;
struct _TIMER_BASIC_INFORMATION;
struct HRSRC__;
struct _IMAGELIST;
struct __midl_frag1803_t;
struct _CERT_CRL_CONTEXT_PAIR;
class CLimitedWritableStorage::SetStateBits::__l3::<lambda_C6BB18B0BF4BE775>;
struct _REASON_BUFFER;
struct _WORKER_FACTORY_BASIC_INFORMATION;
struct __midl_frag99_t;
struct _IMAGEHLP_DEFERRED_SYMBOL_LOADW64;
struct _FILE_STREAM_INFORMATION;
struct __midl_frag446_t;
struct __midl_frag1015_t;
struct tagMInterfacePointer;
class BUCL::CConvertToSignedType<__int64>;
struct _ACTIVATION_CONTEXT_DATA_COM_SERVER_REDIRECTION;
struct tm;
struct __midl_frag24_t;
struct _HARDWARE_COUNTER;
class CBmpLoader;
struct tagEMRFORMAT;
struct _SD_GLOBAL_CHANGE_OUTPUT;
struct _FILE_ID_INFO;
struct HFONT__;
class Windows::Auto<Windows::Rtl::IRtlUtf16LEStringBuilder *>;
struct _BCRYPT_KEY_DATA_BLOB_HEADER;
struct HMMIO__;
struct _xml_error;
class Microsoft::WRL::Details::RuntimeClassBaseT<14>;
struct MAP_SHARED<MAP_KEY_GUID,TYPEINFOVTBL *>;
struct _CERTIFICATE_BLOB;
struct __midl_frag959_t;
struct _PROCESS_EXTENDED_BASIC_INFORMATION64;
struct __midl_frag1492_t;
struct tagOIFI;
struct __midl_frag1816_t;
struct HDESK__;
struct tagMIXERCONTROLDETAILS_LISTTEXTW;
struct _RTL_DYNAMIC_TIME_ZONE_INFORMATION;
struct _THREAD_UMS_INFORMATION;
struct IWinInetCacheHints;
struct __midl_frag739_t;
class CallFrame;
struct _PORT_INFO_3A;
struct __midl_frag39_t;
struct __midl_frag1694_t;
struct _CMSG_CTRL_MAIL_LIST_DECRYPT_PARA;
struct _NCB;
struct __midl_frag1484_t;
struct _CMSG_MAIL_LIST_RECIPIENT_INFO;
struct ICallFrameWalker;
struct HSTR__;
struct IPrintDialogServices;
struct tagEMRSETMAPPERFLAGS;
struct tagCBT_CREATEWNDA;
struct tagDDEDISPATCHDATA;
struct __midl_frag1203_t;
struct tagPIDData;
struct _DEVICEDUMP_PRIVATE_SUBSECTION;
class CDdeServerCallMgr;
struct EXECUTEACK;
struct CDefClient::CUnknownImpl;
struct CDefClient::COleClientSiteImpl;
struct CDefClient::CAdviseSinkImpl;
class CDefClient;
struct ANON_OBJECT_HEADER_BIGOBJ;
struct _DISK_CONTROLLER_NUMBER;
struct _FILE_DISPOSITION_INFORMATION;
struct PPM_WMI_IDLE_STATES;
struct _PRINTER_INFO_9A;
struct _SE_IMPERSONATION_STATE;
struct _PRINTER_INFO_7A;
struct _currencyfmtA;
struct AsyncIRemUnknown;
struct InterfaceWalkerFree;
struct __midl_frag934_t;
struct tagDRAWITEMSTRUCT;
struct __s_GUID;
struct __midl_frag468_t;
class CScmPatternTbl;
class BUCL::MultiplyHelpers::CPromotedSize<unsigned char>;
struct IXMLElement;
struct _CERT_CHAIN_ENGINE_CONFIG;
struct _GETVERSIONINPARAMS;
struct tagEMREXTSELECTCLIPRGN;
struct tagRemSNB;
struct _STORAGE_DEVICE_DESCRIPTOR;
struct __midl_frag1609_t;
struct IRpcChannelBuffer3;
struct DISPATCH_FRAME;
struct sockproto;
struct __midl_frag1000_t;
class CReadMInterfacePointerWithSourceAttributesMarshalingStream;
struct __midl_frag1139_t;
struct _FILE_END_OF_FILE_INFO;
class Windows::Rtl::StringTraits<_UNICODE_STRING>;
class CBaseInterfaceDataMarshalingStream;
struct tagEMRSETPALETTEENTRIES;
struct _PRINTER_INFO_4A;
class CLimitedWritableStorage::SetElementTimes::__l3::<lambda_8A48F4084DADEF3>;
struct _EX_ATTRIBUTE_INFORMATION_REGISTRATION;
struct _PRINTER_NOTIFY_OPTIONS;
struct _VERIFY_INFORMATION;
struct HMIDI__;
struct IXTLRuntime;
class DDE_CHANNEL;
struct __midl_frag1610_t;
struct _CM_SONIC_DEVICE_DATA;
struct IContext;
struct _PROCESS_HANDLE_SNAPSHOT_INFORMATION;
struct localeinfo_struct;
struct CDdeObject::CProxyManagerImpl;
struct STARTING_LCN_INPUT_BUFFER;
struct __midl_frag738_t;
struct STARTING_VCN_INPUT_BUFFER;
struct Windows::AutoPODBase<_LUNICODE_STRING,Windows::Auto<_LUNICODE_STRING> >::is_pointer<_LUNICODE_STRING>;
struct FIND_BY_SID_DATA;
struct NCryptKeyName;
struct _CHANGER_SEND_VOLUME_TAG_INFORMATION;
struct MFT_ENUM_DATA_V1;
struct HAS_INTERFACES;
struct netent;
struct __midl_frag449_t;
struct READ_FILE_USN_DATA;
class CReadOnlyStorage;
struct USN_RECORD_V3;
class Microsoft::WRL::Details::RemoveIUnknownBase<IUnknown>;
struct __midl_frag242_t;
struct _callframeinternal_MIDL_PROC_FORMAT_STRING;
struct _EFS_COMPATIBILITY_INFO;
struct __midl_frag1372_t;
struct PPM_WMI_PERF_STATES_EX;
struct tagWAVEOUTCAPS2A;
struct _ais_MIDL_TYPE_FORMAT_STRING;
struct __midl_frag34_t;
struct tagWAVEINCAPSW;
struct PPM_IDLE_ACCOUNTING_EX;
class CLimitedWritableStorage::CreateStorage::__l3::<lambda_E9CECF399B911A5C>;
struct PPM_PERFSTATE_DOMAIN_EVENT;
struct PPM_IDLESTATE_EVENT;
struct _ADDJOB_INFO_1A;
struct PPM_THERMALCHANGE_EVENT;
struct PROCESSOR_IDLESTATE_POLICY;
struct tagAUXCAPSA;
struct NOTIFY_USER_POWER_SETTING;
struct RTL_ACE_DATA;
class COXIDTable;
struct _CRT_DOUBLE;
struct _LONGDOUBLE;
struct __midl_frag1805_t;
struct SHELLHOOKINFO;
struct FLASHWINFO;
struct __midl_frag770_t;
struct MENUITEMTEMPLATEHEADER;
struct RPC_STATS_VECTOR;
class CLimitedWritableStream::Write::__l3::<lambda_FC1ED2C6D0404BF6>;
struct tagMCI_INFO_PARMSW;
struct __midl_frag1666_t;
struct RPC_CLIENT_INFORMATION1;
struct RPC_ENDPOINT_TEMPLATEA;
class Microsoft::WRL::FtmBase;
struct tagCHOOSECOLORW;
struct __midl_frag57_t;
struct RPC_INTERFACE_TEMPLATEW;
struct _MONITOR_INFO_2A;
struct UDATE;
class _RTL_CONSTANT_STRING_remove_const_template_class<2>;
struct _DATATYPES_INFO_1W;
struct __midl_frag1440_t;
struct IUriContainer;
struct ICacheControl;
struct _ZONEATTRIBUTES;
struct _SYSTEM_LOW_PRIORITY_IO_INFORMATION;
struct _EFS_DECRYPTION_STATUS_INFO;
struct _CHAR_INFO;
struct IOleCache;
struct _BCRYPT_PKCS1_PADDING_INFO;
struct _PS_CPU_QUOTA_SET_INFORMATION;
struct NTFS_VOLUME_DATA_BUFFER;
struct _SYSTEM_MEMORY_INFORMATION;
struct Microsoft::WRL::Details::FactoryCache;
struct _MESSAGE_RESOURCE_DATA;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<CClipboardBroker> const >;
struct _CRYPT_KEY_VERIFY_MESSAGE_PARA;
struct OPENCARDNAME_EXA;
struct _TOKEN_AUDIT_POLICY;
struct NET_ADDRESS_INFO_;
struct __midl_frag1410_t;
struct _BCRYPT_PROVIDER_NAME;
struct _stat32;
struct IMonikerVtbl;
struct _OBJECT_TYPES_INFORMATION;
struct _FILE_REMOTE_PROTOCOL_INFO;
class CDefObject::CAdvSinkImpl;
struct _STORAGE_IDLE_POWERUP_REASON;
struct _RTL_CALLER_ALLOCATED_ACTIVATION_CONTEXT_STACK_FRAME_BASIC;
struct tagMCI_OVLY_RECT_PARMS;
class CDefClassFactory;
struct tagCONNECTDATA;
struct ITypeFactory;
class Microsoft::WRL::Wrappers::Mutex;
class Microsoft::WRL::Wrappers::Details::SyncLockWithStatusT<Microsoft::WRL::Wrappers::HandleTraits::MutexTraits>;
struct _GDI_NONREMOTE;
struct tagWAVEINCAPS2A;
struct _APPINFO_STARTUPINFO;
struct _PRINTER_INFO_3;
struct IHttpNegotiate;
union __m64;
struct __midl_frag56_t;
class CLimitedWritableStream::Commit::__l3::<lambda_EA8073E2406EBE81>;
struct __midl_frag104_t;
struct __midl_frag809_t;
class CRpcCall;
struct tagINTERFACEINFO;
struct _CM_EISA_FUNCTION_INFORMATION;
class CReadOnlyStream::Clone::__l3::<lambda_F4743C547ADAAD6D>;
struct STblHdr;
struct Microsoft::WRL::Details::InterfaceTraits<Microsoft::WRL::Details::Nil>;
struct _STORAGE_IDLE_POWER;
struct IEnumCallback;
struct IDispatchVtbl;
struct _SYSTEM_HOTPATCH_MODULE_QUERY_PARAMETERS;
struct tagCANDIDATELIST;
class OLE_TYPEMGR;
struct Microsoft::WRL::Details::VerifyInterfaceHelper<3,IAgileObject,1,0>;
struct __midl_frag964_t;
struct wavehdr_tag;
struct _BEM_REFERENCE;
struct __midl_frag1819_t;
struct XLOCK_LEAF;
struct IInternetProtocolRoot;
struct tagMIDIINCAPSW;
struct IRunningObjectTableVtbl;
struct DISPLAYCONFIG_TARGET_DEVICE_NAME;
struct _KEY_FLAGS_INFORMATION;
struct __midl_frag453_t;
struct _NDR64_IID_FORMAT;
struct IPolicy;
struct CDdeObject::CUnknownImpl;
struct CDdeObject::COleObjectImpl;
struct CDdeObject::CDataObjectImpl;
struct CDdeObject::CPersistStgImpl;
struct CDdeObject::COleItemContainerImpl;
struct CDdeObject::CRpcStubBufferImpl;
class CDdeConnectionTable;
class CDdeObject;
struct RPC_IMPORT_CONTEXT_P;
struct _OBJECT_HANDLE_FLAG_INFORMATION;
struct tagCOMPOSITIONFORM;
class Microsoft::WRL::ComPtr<IDataObject>;
class CBrokeredClipDataObject;
struct __midl_frag23_t;
struct __midl_frag657_t;
class CMessageCall;
struct IPropertySetStorage;
struct BITMAPV5HEADER;
class RunSyncOnMTAThread::__l6::<lambda_202A87E349F7136C>;
struct __midl_frag381_t;
struct _TRACE_GUID_REGISTRATION;
struct IPipeDouble;
struct _SET_DISK_ATTRIBUTES;
struct tagOutgoingCallData;
struct tagIncomingCallData;
struct tagSOleTlsData;
class EnumMap<MAP_KEY_GUID,INTERFACE_HELPER_CLSID *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>;
class MAP<XSLOCK,MAP_KEY_GUID,INTERFACE_HELPER_CLSID *>::iterator;
struct __midl_frag286_t;
class CPerContext;
struct CFileStream;
union tagBINDPTR;
class MultiplicationHelper<unsigned long,unsigned long,3>;
struct _DPA;
struct __midl_frag241_t;
struct __midl_frag302_t;
struct _MonikerReadStruct;
class CChannelHandle;
struct __midl_frag1298_t;
struct _prop_MIDL_EXPR_FORMAT_STRING;
struct _mpProp;
struct __midl_frag40_t;
struct __midl_frag13_t;
class CLimitedEnum<IEnumSTATSTG,tagSTATSTG>;
struct _GET_DISK_ATTRIBUTES;
struct __midl_frag403_t;
class Microsoft::WRL::Details::RemoveIUnknownBase<IEnumFORMATETC>;
class CGdiCustodian;
struct _PERSISTENT_RESERVE_COMMAND;
class CNtfsEnumSTATSTG;
class CDualStringArray;
struct _tagSCtxListIndex;
struct _KUSER_SHARED_DATA;
struct CClassCache::CFinishComposite::node;
class CCtxConnectionManager;
struct _OLETARGETDEVICE;
class CPrivAlloc;
class SafeIntInternal::SafeIntExceptionHandler<SafeIntException>;
struct ISystemActivator;
struct __midl_frag283_t;
struct IMessageFilter;
class CTContainer_PolicyCoTaskMem;
class CDwordBag;
class CPointerMoniker;
class CAutoHandle_Policy<HMENU__ *>;
struct tagFINDREPLACEA;
struct __midl_frag206_t;
struct _TRANSMIT_FILE_BUFFERS;
class Microsoft::WRL::ComPtr<IStream>;
struct IEnumGUID;
struct CRIFTable::tagRIFEntry;
struct __midl_frag46_t;
class Microsoft::WRL::Details::RemoveIUnknownBase<IWeakReference>;
struct tagPROPBAG2;
struct tagWAVEOUTCAPS2W;
class CArray<CPageHolder *,CPageHolder * &>;
struct _DEVICE_TRIM_DESCRIPTOR;
struct __midl_frag101_t;
struct _CRYPT_PROVIDER_REGDEFUSAGE;
class CSCMergedEnum<IEnumCATEGORYINFO,tagCATEGORYINFO>;
struct __midl_frag315_t;
struct tagQACONTROL;
struct WINTRUST_BLOB_INFO_;
struct __midl_frag1690_t;
struct tagMIXERCONTROLDETAILS_LISTTEXTA;
struct WINTRUST_FILE_INFO_;
struct WINTRUST_CATALOG_INFO_;
struct __midl_frag415_t;
struct _SESSION_BUFFER;
struct _CRYPT_PROVIDER_FUNCTIONS;
struct __midl_frag394_t;
struct __midl_frag210_t;
class Microsoft::WRL::Details::ComPtrRefBase<Microsoft::WRL::ComPtr<IUnwrappableDataObject> >;
struct __midl_frag200_t;
struct _CRYPT_PROVIDER_SGNR;
struct _CRYPT_PROVIDER_CERT;
struct _ProcessActivatorToken;
struct __midl_frag231_t;
struct Microsoft::WRL::Details::VerifyInterfaceHelper<2,IWeakReference,0,0>;
struct _OFNOTIFYA;
class LargeIntRegMultiply<unsigned __int64,unsigned __int64>;
struct __midl_frag1226_t;
struct __midl_frag390_t;
class CRtlSmartUcsEncoderTraitsBase<CRtlSmartUcsEncoderTraits<_LUNICODE_STRING> >;
struct _NDR64_FIX_ARRAY_HEADER_FORMAT;
struct __midl_frag1641_t;
struct _PROVDATA_SIP;
struct tagMIDIINCAPS2W;
struct __midl_frag129_t;
struct _CRYPT_PROVIDER_SIGSTATE;
class Microsoft::WRL::ComPtr<CClipboardBroker::CClipboardBrokerMTAHelper>;
struct Microsoft::WRL::Details::ImplementsBase;
struct __midl_frag863_t;
struct _IMAGEHLP_CBA_READ_MEMORY;
class Windows::Auto<Windows::Rtl::IRtlROFOStream *>;
class CExposedDocFile;
struct _CAT_MEMBERINFO2;
struct _MINIDUMP_FUNCTION_TABLE_STREAM;
struct _SPC_FINANCIAL_CRITERIA;
struct _MINIDUMP_USER_STREAM;
struct __midl_frag881_t;
struct _DEVICEDUMP_RESTRICTED_SUBSECTION;
struct _MINIDUMP_THREAD_EX_LIST;
struct __midl_frag1877_t;
class Microsoft::WRL::Details::ComPtrRefBase<Microsoft::WRL::WeakRef>;
class BUCL::CConvertToSignedType<unsigned __int64>;
class CAbstractMarshalingStream;
class Windows::AutoOperatorAmpersandHelper<Windows::Rtl::IRtlWOFOStream *,Windows::Auto<Windows::Rtl::IRtlWOFOStream *> >;
struct Microsoft::WRL::Wrappers::HandleTraits::SemaphoreTraits;
struct __midl_frag873_t;
struct _WIN_TRUST_ACTDATA_SUBJECT_ONLY;
struct _MINIDUMP_USER_RECORD;
struct _MINIDUMP_THREAD_LIST;
class CClass;
struct _MINIDUMP_MISC_INFO;
struct _SPC_INDIRECT_DATA_CONTENT;
struct _MINIDUMP_MEMORY_INFO_LIST;
class CLimitedEnum<IEnumSTATSTG,tagSTATSTG>::Reset::__l3::<lambda_BA168E9DE3CFD21B>;
class Windows::AutoOperatorAmpersandConstHelper<_LUNICODE_STRING,Windows::Auto<_LUNICODE_STRING> >;
class Microsoft::WRL::Wrappers::HString;
struct __midl_frag728_t;
class CBasedDeltaBlockPtrPtr;
class CBasedTransactedStreamPtr;
class CDeltaList;
class CTransactedStream;
struct _SPC_SP_OPUS_INFO;
struct _SPC_PE_IMAGE_DATA;
struct RTL_FILTER_LUNICODE_STRING_CTX;
struct __midl_frag1704_t;
struct _SPC_IMAGE;
struct tagExtentInfo;
class ARI::ProcessToken::AutoSysAppId;
struct _DEVICEDUMP_STORAGESTACK_PUBLIC_STATE_RECORD;
struct _DEVICEDUMP_STORAGESTACK_PUBLIC_DUMP;
struct tagPOINTF;
class CNumInfo;
class CEnumHolder;
struct __midl_frag1513_t;
struct _WIN_TRUST_SUBJECT_FILE_AND_DISPLAY;
struct _PORT_INFO_3W;
struct Microsoft::WRL::RuntimeClassFlags<2>;
struct _IMAGEHLP_MODULE64;
struct __midl_frag163_t;
struct tagCADWORD;
struct _mega_MIDL_EXPR_FORMAT_STRING;
struct __midl_frag1457_t;
class BUCL::CConvertToSignedType<unsigned short>;
struct SYMSRV_INDEX_INFOW;
struct API_VERSION;
class CEnumFormatEtc;
struct tagMIXERLINEW;
struct __midl_frag487_t;
struct _SRCCODEINFO;
struct MINIDUMP_EXCEPTION_STREAM;
struct Microsoft::WRL::RuntimeClassFlags<14>;
struct _LDT_ENTRY;
class CALLFRAME_CACHE<TYPEINFOVTBL>;
class CLimitedWritableStream::Clone::__l3::<lambda_B9A5E8BAA9924D4D>;
struct _TAPE_WMI_OPERATIONS;
struct _TAPE_ERASE;
struct __midl_frag128_t;
struct tagOCPFIPARAMS;
struct __midl_frag36_t;
struct __midl_frag186_t;
struct _TAPE_CREATE_PARTITION;
struct _TAPE_SET_MEDIA_PARAMETERS;
struct _iinspectablederived_MIDL_PROC_FORMAT_STRING;
class CRefExportCount;
struct _customREMOTE_REPLY_SCM_INFO;
class CThreadCheck;
class CRefStabilize;
struct __midl_frag702_t;
class PDeSerStream;
class PSerStream;
struct CompObjHdr;
struct __midl_frag532_t;
struct __midl_frag1079_t;
struct tagFORMATIDOFFSET;
class CSafeAccess;
struct HSTRING__;
class CDFBasis;
struct __midl_frag1488_t;
struct tagMCI_PLAY_PARMS;
class CWrapperBase<IEnumFORMATETC>::{dtor}::__l3::<lambda_5B474553FA606D78>;
class CPropertySetStream;
struct __midl_frag867_t;
struct CStreamChunk;
struct __midl_frag1231_t;
struct _MonikerWriteStruct;
class Microsoft::WRL::Details::RemoveIUnknownBase<IEnumSTATSTG>;
struct HCONVLIST__;
struct _INDIRECTPROPERTY;
class CArray<CProperty *,CProperty * &>;
struct FR;
struct _NDR64_VAR_ARRAY_HEADER_FORMAT;
struct tagMONHSZSTRUCTW;
class BUCL::CConvertToSignedType<signed char>;
class ScheduleClipboardWorkWithPLM::__l15::<lambda_12D3045CEFEFBAF>;
struct midihdr_tag;
class EventPoolEntry;
class CDirSect;
struct tagSAmdRegs;
struct __midl_frag1482_t;
class CLimitedWritableStream::SetSize::__l3::<lambda_29B2CCEB6A2CEC56>;
class GenericStream;
struct SEntryBuffer;
class Microsoft::WRL::ComPtr<IMarshalingStream>;
struct __midl_frag718_t;
struct tagMONCONVSTRUCT;
class PDocFile;
class CCliModalLoop::SuspendPointerMessageReorderingForCallout;
struct tagMONLINKSTRUCT;
class TStackBuffer<tagPROPVARIANT,64>;
class Windows::AutoPointerBase<Windows::Rtl::IRtlROFOStream *,Windows::Auto<Windows::Rtl::IRtlROFOStream *> >;
class CComCat::CInnerUnk;
struct Microsoft::WRL::Details::BoolStruct;
class CLocalAlloc;
class Microsoft::WRL::ComPtr<ClipboardDataObjectTask>;
class CWrapperBase<IStream>;
struct INTERPRETER_OPT_FLAGS2;
struct NDR_PROC_HEADER_EXTS;
struct __midl_frag1469_t;
class Windows::Auto<_RTL_SMART_LBLOB_UCSCHAR_WRITING_CONTEXT>;
struct IRunAsClipboard;
struct __midl_frag336_t;
struct __midl_frag161_t;
class TStackBuffer<unsigned short *,64>;
struct __midl_frag1697_t;
struct __midl_frag1872_t;
struct __midl_frag1349_t;
class DeserializeHelper;
struct __midl_frag735_t;
class Windows::Rtl::AutoBlob<Windows::Auto<_LBLOB> >::COperatorAmpersandReturnType;
class SerializedPropertyReader;
struct __midl_frag1455_t;
struct _EVENT_FILTER_DESCRIPTOR;
struct _OFLONGSTRUCTA;
struct tagSRVRDISPATCHDATA;
struct FONTFACEDATA;
class BUCL::CConvertToUnsignedType<int>;
struct BUCL::ComparisonResultKind<BUCL::Rtl::CCallDisposition>;
class BUCL::CIsSignedType<signed char>;
class BUCL::CConvertToSignedType<unsigned long>;
class BUCL::CConvertToUnsignedType<unsigned __int64>;
class BUCL::CConvertToUnsignedType<__int64>;
class BUCL::MultiplyHelpers::CPromotedSize<unsigned int>;
class CSafeMoniker;
class BUCL::CIsSignedType<unsigned int>;
struct __midl_frag522_t;
struct _CRT_CRITICAL_SECTION;
struct __midl_frag192_t;
struct _iinspectablederived_MIDL_TYPE_FORMAT_STRING;
struct CONFIRM_CONFLICT_ITEM;
class CSafeBYTEArray;
class Windows::AutoOperatorAmpersandConstHelper<Windows::Rtl::IRtlWOFOUCSStream *,Windows::Auto<Windows::Rtl::IRtlWOFOUCSStream *> >;
class Windows::AutoPointerBase<Windows::Rtl::IRtlWOUCSStream *,Windows::Auto<Windows::Rtl::IRtlWOUCSStream *> >;
class Windows::AutoOperatorAmpersandConstHelper<Windows::Rtl::IRtlWOUCSStream *,Windows::Auto<Windows::Rtl::IRtlWOUCSStream *> >;
struct ICatInformation;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<CBrokeredClipDataObject> >;
class Windows::AutoOperatorAmpersandHelper<Windows::Rtl::IRtlROFOStream *,Windows::Auto<Windows::Rtl::IRtlROFOStream *> >;
class CLimitedStreamBase::Seek::__l3::<lambda_56DB86726463D2C6>;
struct __midl_frag281_t;
class Windows::AutoOperatorAmpersandConstHelper<Windows::Rtl::IRtlUtf8StringBuilder *,Windows::Auto<Windows::Rtl::IRtlUtf8StringBuilder *> >;
struct Windows::ErrorHandling::StatusTypeNTSTATUS;
class Microsoft::WRL::ComPtr<IClipboardBroker>;
class CClipboardBroker::CClipboardBrokerExternalReference;
class Windows::ErrorHandling::Rtl::CSimpleNtStatusCarryingFrame;
class Windows::ErrorHandling::CBaseFrame;
class CClassCache::CWinRTLocalSvrClassEntry;
class Windows::AutoOperatorAmpersandHelper<_LUTF8_STRING,Windows::Auto<_LUTF8_STRING> >;
struct __midl_frag38_t;
class CClassCache::CDllAptEntry;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IRuntimeBroker> const >;
struct _PORT_INFO_1W;
struct WireThisPart2;
union WireThis;
class RunSyncOnMTAThread::__l6::<lambda_A5D95E4C135FCBCE>;
struct tagAUXCAPS2W;
struct _JOB_INFO_4W;
struct _PRINTER_INFO_8W;
class CTHeapAllocPolicy;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IStorage> const >;
struct __midl_frag219_t;
struct sockaddr_in;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IUnwrappableDataObject> >;
struct __midl_frag217_t;
struct _DISK_RECORD;
struct IClipboardBroker;
struct _HISTOGRAM_BUCKET;
struct APP_DATA::FreeListElem;
struct APP_DATA::FreeList;
struct _STORAGE_BUS_RESET_REQUEST;
struct _MONITOR_INFO_1A;
struct _DOC_INFO_3A;
struct ICallIndirect;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IEnumFORMATETC> const >;
struct tMIXERCONTROLDETAILS_SIGNED;
struct _EFS_PIN_BLOB;
struct _PRINTER_ENUM_VALUESW;
struct tagMCI_ANIM_WINDOW_PARMSA;
struct INdrVersion;
struct tagMCI_LOAD_PARMSA;
struct _BIDI_REQUEST_CONTAINER;
struct _PRINTER_INFO_7W;
struct tagMCI_OVLY_LOAD_PARMSA;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IInspectable> >;
struct _STORAGE_DEVICE_NUMBER;
struct _EFS_RPC_BLOB;
struct Microsoft::WRL::Wrappers::HandleTraits::SRWLockExclusiveTraits;
struct _ENCRYPTION_CERTIFICATE_HASH_LIST;
struct _READ_ELEMENT_ADDRESS_INFO;
struct _GET_MEDIA_TYPES;
struct DISPATCH_INTERCEPTOR;
struct tagMIXERCAPS2W;
struct _FIND_NAME_BUFFER;
class CAutoHandle_Policy<void *>;
struct _DISK_DETECTION_INFO;
struct _DEVICE_POWER_DESCRIPTOR;
struct tagMIDIINCAPSA;
struct tagMCI_VD_PLAY_PARMS;
struct _DRIVER_INFO_1W;
struct tagMIXERLINECONTROLSA;
struct tagWAVEINCAPSA;
struct _FORM_INFO_1W;
struct joyinfo_tag;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IStream> >;
struct midiproptimediv_tag;
struct tagFINDREPLACEW;
struct _STORAGE_OFFLOAD_WRITE_OUTPUT;
class COleStaticLock;
struct _ADAPTER_STATUS;
struct _PERF_COUNTER_BLOCK;
struct VerbList;
struct OPENCARD_SEARCH_CRITERIAW;
class SafeCastHelper<unsigned long,unsigned long,0>;
struct _STORAGE_DEVICE_RESILIENCY_DESCRIPTOR;
struct HDRVR__;
struct _DISK_LOGGING;
struct tagMCI_OVLY_SAVE_PARMSA;
struct __midl_frag1560_t;
struct _DISK_PERFORMANCE;
class CRIFTable;
struct IAdviseSink;
class CReadOnlyStorage::EnumElements::__l3::<lambda_EDF4E34D1FFC32DE>;
class CEnumCategoriesOfClass;
class CLock2;
struct SMIPIDHashNode;
class CEnumGeneric;
struct tagTYPEATTR;
struct tagSECTIONHEADER;
class CMap<unsigned short *,unsigned short * &,unsigned long,unsigned long &>;
class CPropertySection;
class CDDEServer;
struct CFont::Save::__l2::FONTDATA;
struct _ldiv_t;
class CRgPv;
class CEnumConnectionsImpl;
struct SPatternEntry;
class CDAHolder;
class SafeIntException;
class CReadInterfaceDataFromInternalSourceMarshalingStream;
class CSplit_QI;
class Microsoft::WRL::WeakRef;
struct CONFLICT_ITEM_METADATA;
class Microsoft::WRL::Details::RemoveIUnknownBase<IInspectable>;
struct std::nothrow_t;
struct ClpboardOwnerState;
struct Microsoft::WRL::Wrappers::HandleTraits::HANDLETraits;
struct Microsoft::WRL::Wrappers::HandleTraits::CriticalSectionTraits;
class Microsoft::WRL::Details::ComPtrRefBase<Microsoft::WRL::ComPtr<ICallingProcessInfo> >;
struct RTL_FILTER_LUNICODE_STRING_FILTER;
class CCallTable;
class Microsoft::WRL::Details::ComPtrRefBase<Microsoft::WRL::ComPtr<IDataObject> >;
class COIDTable;
struct CMemString_PolicyLocalMem;
struct tagQICONTEXT;
class CtxEntry;
class Windows::Internal::NativeString<Windows::Internal::CoTaskMemPolicy<unsigned short> >::InitializeFormat::__l3::<lambda_8D5FB22F65A17B6>;
struct tagFORMATETC32;
struct FORMATETCDATA32;
class CClassCache;
class Microsoft::WRL::ComPtr<IEnumFORMATETC>;
struct ICallFrameEvents;
class CWrapperBase<IEnumFORMATETC>;
struct LEGACY_INTERCEPTOR;
class CClassCache::CFinishComposite;
struct OLEAUTOMATION_FUNCTIONS;
class MapEnumToSQMData<enum Ole32SQMFlags>;
class IInternalChannelBuffer;
class CAutoHandle_Policy<HFONT__ *>;
struct __midl_frag1316_t;
struct SNameKey;
class CLimitedStreamBase;
class CMarshalingStreamOnUserMarshalCallback;
class CEnumVerb;
class CDefLink::CPrivUnknown;
class CWrapperBase<IUnknown>::{dtor}::__l3::<lambda_E5C33FFF9ACC27CD>;
struct __midl_frag111_t;
struct __midl_frag117_t;
struct __midl_frag62_t;
struct _NDR64_USER_MARSHAL_FORMAT;
class CWrapperBase<IStorage>::{dtor}::__l3::<lambda_F81FF86945D4F89B>;
struct __midl_frag8_t;
struct __midl_frag17_t;
struct __midl_frag597_t;
struct IEnumGeneric;
struct __midl_frag1426_t;
struct __midl_frag180_t;
struct __midl_frag1221_t;
struct __midl_frag1795_t;
struct __midl_frag1866_t;
struct __midl_frag720_t;
struct __midl_frag1539_t;
struct __midl_frag431_t;
struct __midl_frag1650_t;
struct __midl_frag1615_t;
struct __midl_frag1726_t;
struct __midl_frag29_t;
struct __midl_frag1417_t;
struct __midl_frag1837_t;
struct __midl_frag893_t;
struct __midl_frag701_t;
struct __midl_frag917_t;
struct __midl_frag1386_t;
struct __midl_frag1639_t;
struct __midl_frag801_t;
struct tagFontPropSetTable;
struct __midl_frag1780_t;
struct __midl_frag816_t;
struct __midl_frag887_t;
struct __midl_frag1335_t;
struct __midl_frag1529_t;
struct __midl_frag1638_t;
struct METADC;
struct METAINFO;
struct __midl_frag1883_t;
struct __midl_frag1312_t;
struct __midl_frag1846_t;
struct __midl_frag221_t;
struct __midl_frag257_t;
struct __midl_frag827_t;
struct __midl_frag1251_t;
struct __midl_frag273_t;
struct __midl_frag1420_t;
struct __midl_frag1108_t;
struct __midl_frag585_t;
class CPtrBlock;
struct __midl_frag535_t;
struct __midl_frag1233_t;
struct __midl_frag1003_t;
struct __midl_frag1186_t;
class CStreamDummy;
struct __midl_frag895_t;
struct NEWHEADER;
struct __midl_frag552_t;
struct __midl_frag865_t;
struct __midl_frag1643_t;
struct __midl_frag649_t;
struct __midl_frag1829_t;
struct __midl_frag920_t;
struct __midl_frag905_t;
struct __midl_frag1674_t;
struct __midl_frag837_t;
struct __midl_frag1073_t;
class MultiplicationHelper<long,long,1>;
struct __midl_frag787_t;
struct __midl_frag27_t;
struct __midl_frag983_t;
struct __midl_frag1649_t;
struct __midl_frag45_t;
struct __midl_frag736_t;
struct __midl_frag940_t;
struct __midl_frag1624_t;
struct __midl_frag1655_t;
struct __midl_frag653_t;
class COlePropertySheet;
struct __midl_frag260_t;
class CPictioFileStream;
struct __midl_frag1110_t;
struct __midl_frag633_t;
struct __midl_frag1658_t;
struct __midl_frag841_t;
struct __midl_frag1432_t;
struct __midl_frag263_t;
struct __midl_frag125_t;
struct __midl_frag1146_t;
struct __midl_frag810_t;
struct __midl_frag615_t;
class CNotifyCP;
struct __midl_frag250_t;
struct __midl_frag330_t;
struct __midl_frag1158_t;
struct __midl_frag255_t;
struct __midl_frag1143_t;
struct __midl_frag306_t;
struct __midl_frag445_t;
struct __midl_frag352_t;
struct __midl_frag194_t;
struct __midl_frag232_t;
class CBasedDeltaBlockPtr;
struct __midl_frag669_t;
struct __midl_frag1402_t;
struct __midl_frag147_t;
struct __midl_frag1050_t;
struct __midl_frag1512_t;
struct __midl_frag1677_t;
struct __midl_frag473_t;
struct __midl_frag1622_t;
struct __midl_frag525_t;
struct __midl_frag1476_t;
struct __midl_frag1640_t;
struct __midl_frag526_t;
struct __midl_frag269_t;
struct __midl_frag417_t;
struct __midl_frag1434_t;
struct __midl_frag1358_t;
struct __midl_frag157_t;
struct __midl_frag808_t;
class CNtfsUpdateStreamName;
struct __midl_frag557_t;
struct __midl_frag1826_t;
struct __midl_frag1377_t;
struct __midl_frag1612_t;
class CNtfsSTATSTGArray;
struct __midl_frag37_t;
struct __midl_frag859_t;
struct __midl_frag376_t;
struct __midl_frag1465_t;
class CExpParameterValidate;
struct __midl_frag309_t;
struct __midl_frag1675_t;
struct __midl_frag230_t;
struct __midl_frag1031_t;
class LargeIntRegMultiply<__int64,__int64>;
struct __midl_frag1841_t;
struct __midl_frag279_t;
class LargeIntRegMultiply<unsigned __int64,unsigned int>;
struct __midl_frag741_t;
struct __midl_frag516_t;
struct __midl_frag1613_t;
struct __midl_frag366_t;
struct __midl_frag1126_t;
struct __midl_frag274_t;
struct __midl_frag175_t;
struct __midl_frag327_t;
struct __midl_frag1437_t;
struct __midl_frag835_t;
struct __midl_frag821_t;
struct __midl_frag1606_t;
struct __midl_frag167_t;
struct __midl_frag688_t;
struct __midl_frag1041_t;
struct __midl_frag889_t;
struct __midl_frag334_t;
struct __midl_frag603_t;
struct __midl_frag844_t;
struct __midl_frag1152_t;
struct __midl_frag148_t;
struct __midl_frag992_t;
struct __midl_frag266_t;
struct tagCATEGORYINFO;
struct __midl_frag1100_t;
struct __midl_frag1103_t;
struct __midl_frag586_t;
struct __midl_frag1192_t;
struct __midl_frag74_t;
struct __midl_frag398_t;
struct __midl_frag903_t;
struct __midl_frag1663_t;
struct IEnumCATEGORYINFO;
struct __midl_frag680_t;
struct __midl_frag439_t;
struct __midl_frag771_t;
struct __midl_frag1853_t;
struct __midl_frag1723_t;
struct __midl_frag1835_t;
class CEnumCategories;
struct __midl_frag885_t;
struct __midl_frag1634_t;
class std::bad_exception;
struct __midl_frag1423_t;
struct __midl_frag737_t;
struct __midl_frag948_t;
struct __midl_frag290_t;
struct __midl_frag1831_t;
struct __midl_frag264_t;
struct __midl_frag711_t;
struct __midl_frag1448_t;
struct __midl_frag173_t;
struct __midl_frag259_t;
class exception;
struct __midl_frag1592_t;
struct __midl_frag355_t;
struct __midl_frag1075_t;
struct __midl_frag1688_t;
struct __midl_frag805_t;
struct __midl_frag1563_t;
struct __midl_frag1719_t;
struct __midl_frag1343_t;
struct __midl_frag838_t;
struct __midl_frag1629_t;
struct __midl_frag1713_t;
struct __midl_frag621_t;
struct __midl_frag1685_t;
struct __midl_frag1838_t;
struct __midl_frag1026_t;
struct __midl_frag1524_t;
struct __midl_frag1166_t;
struct __midl_frag1070_t;
struct __midl_frag137_t;
struct __midl_frag875_t;
struct __midl_frag828_t;
struct __midl_frag1024_t;
struct __midl_frag1832_t;
struct __midl_frag911_t;
struct __midl_frag899_t;
struct __midl_frag135_t;
struct __midl_frag1824_t;
struct __midl_frag764_t;
struct __midl_frag929_t;
struct __midl_frag1679_t;
struct __midl_frag791_t;
struct __midl_frag1294_t;
struct __midl_frag509_t;
struct __midl_frag1053_t;
class CRtlSmartUcsEncoderTraitsBase<CRtlSmartUcsEncoderTraits<_LUTF8_STRING> >;
struct __midl_frag576_t;
struct __midl_frag1812_t;
struct __midl_frag18_t;
struct __midl_frag832_t;
struct __midl_frag1653_t;
struct __midl_frag1544_t;
struct __midl_frag754_t;
struct __midl_frag203_t;
struct __midl_frag154_t;
struct __midl_frag1698_t;
struct __midl_frag145_t;
struct __midl_frag1747_t;
struct __midl_frag1278_t;
struct __midl_frag1506_t;
struct __midl_frag461_t;
struct __midl_frag970_t;
struct __midl_frag1473_t;
struct __midl_frag223_t;
struct __midl_frag4_t;
struct __midl_frag823_t;
struct __midl_frag1346_t;
struct __midl_frag165_t;
struct __midl_frag496_t;
struct __midl_frag515_t;
struct __midl_frag1588_t;
struct __midl_frag978_t;
struct __midl_frag267_t;
struct __midl_frag777_t;
struct __midl_frag659_t;
struct __midl_frag261_t;
struct __midl_frag1379_t;
struct __midl_frag566_t;
struct __midl_frag584_t;
struct __midl_frag1214_t;
struct __midl_frag1680_t;
struct __midl_frag1522_t;
struct __midl_frag1702_t;
struct __midl_frag1338_t;
struct __midl_frag1811_t;
struct __midl_frag1843_t;
struct _PATCH_BUFFER;
struct __midl_frag542_t;
struct __midl_frag646_t;
struct __midl_frag924_t;
struct __midl_frag112_t;
struct __midl_frag782_t;
struct __midl_frag1709_t;
struct __midl_frag673_t;
struct DICTENTRYHEADER;
struct __midl_frag1209_t;
struct __midl_frag989_t;
struct __midl_frag1828_t;
struct __midl_frag78_t;
struct __midl_frag725_t;
struct __midl_frag1798_t;
struct __midl_frag1301_t;
struct __midl_frag1248_t;
struct __midl_frag1013_t;
struct __midl_frag1801_t;
struct __midl_frag65_t;
struct __midl_frag420_t;
struct __midl_frag211_t;
struct __midl_frag1091_t;
struct __midl_frag768_t;
struct __midl_frag1296_t;
struct __midl_frag1769_t;
struct SGetFreeStruct;
struct __midl_frag149_t;
struct __midl_frag846_t;
struct __midl_frag1645_t;
struct __midl_frag1782_t;
struct __midl_frag121_t;
struct __midl_frag994_t;
struct __midl_frag1842_t;
struct __midl_frag1647_t;
struct __midl_frag1242_t;
struct __midl_frag513_t;
struct __midl_frag1705_t;
struct __midl_frag836_t;
struct __midl_frag693_t;
struct __midl_frag1390_t;
struct __midl_frag1228_t;
struct __midl_frag1413_t;
struct __midl_frag10_t;
struct __midl_frag1275_t;
struct __midl_frag176_t;
struct __midl_frag855_t;
struct __midl_frag759_t;
struct __midl_frag213_t;
struct __midl_frag1672_t;
struct __midl_frag384_t;
struct __midl_frag1619_t;
struct __midl_frag1695_t;
struct __midl_frag1212_t;
struct __midl_frag1263_t;
struct __midl_frag1569_t;
struct __midl_frag1064_t;
struct __midl_frag612_t;
struct __midl_frag67_t;
struct __midl_frag1781_t;
struct __midl_frag1774_t;
struct __midl_frag629_t;
struct __midl_frag993_t;
struct __midl_frag1597_t;
struct __midl_frag123_t;
struct __midl_frag639_t;
struct __midl_frag320_t;
struct __midl_frag1683_t;
struct _mega_MIDL_TYPE_FORMAT_STRING;
class Windows::Internal::CoTaskMemPolicy<unsigned short>;
struct __midl_frag224_t;
struct __midl_frag799_t;
struct __midl_frag773_t;
struct __midl_frag951_t;
struct __midl_frag740_t;
struct __midl_frag1363_t;
struct __midl_frag1044_t;
struct __midl_frag237_t;
struct __midl_frag1190_t;
struct __midl_frag107_t;
struct __midl_frag1718_t;
struct __midl_frag115_t;
struct __midl_frag284_t;
struct __midl_frag722_t;
struct __midl_frag214_t;
struct __midl_frag879_t;
struct __midl_frag1635_t;
struct __midl_frag1578_t;
class CEndPointAtom;
struct __midl_frag239_t;
struct __midl_frag956_t;
class Microsoft::WRL::Details::ComPtrRefBase<Microsoft::WRL::ComPtr<IEnumSTATSTG> >;
struct __midl_frag1763_t;
struct __midl_frag1490_t;
struct __midl_frag664_t;
struct __midl_frag1480_t;
struct __midl_frag593_t;
struct __midl_frag1038_t;
struct __midl_frag218_t;
struct __midl_frag709_t;
struct __midl_frag780_t;
class CTSmartObj<void *,CAutoHandle_Policy<void *> >;
struct __midl_frag1527_t;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IEnumFORMATETC> >;
struct __midl_frag1611_t;
struct __midl_frag1808_t;
struct __midl_frag1494_t;
struct __midl_frag340_t;
struct __midl_frag798_t;
struct __midl_frag156_t;
struct __midl_frag1005_t;
struct __midl_frag1714_t;
struct __midl_frag622_t;
struct __midl_frag1052_t;
struct __midl_frag1646_t;
class CLimitedEnum<IEnumFORMATETC,tagFORMATETC>;
struct __midl_frag185_t;
struct __midl_frag1821_t;
struct __midl_frag1061_t;
struct __midl_frag1106_t;
struct __midl_frag204_t;
struct __midl_frag58_t;
struct __midl_frag678_t;
struct __midl_frag1010_t;
struct __midl_frag343_t;
struct __midl_frag127_t;
struct __midl_frag1863_t;
class CLimitedWritableStorage::Revert::__l3::<lambda_202158885EF0BB85>;
struct __midl_frag558_t;
struct __midl_frag1742_t;
struct __midl_frag757_t;
struct __midl_frag1701_t;
struct __midl_frag1287_t;
struct __midl_frag91_t;
struct __midl_frag769_t;
struct __midl_frag813_t;
struct __midl_frag371_t;
struct __midl_frag527_t;
struct __midl_frag1325_t;
struct __midl_frag297_t;
struct __midl_frag1716_t;
struct __midl_frag1237_t;
struct __midl_frag703_t;
struct __midl_frag712_t;
struct __midl_frag596_t;
class CBrokeredClipDataObject::GetCanonicalFormatEtc::__l9::<lambda_435835F2906B906C>;
struct __midl_frag1367_t;
struct __midl_frag1669_t;
struct __midl_frag845_t;
struct __midl_frag246_t;
class CLimitedWritableStorage::EnumElements::__l3::<lambda_75806E06F2DD87D9>;
class CReadOnlyStream::CopyTo::__l9::<lambda_7DA0A3C7D7999BB8>;
class CLimitedStreamBase::Stat::__l3::<lambda_859B9105128902AF>;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IEnumSTATSTG> >;
struct IConnectionPointContainerVtbl;
class Microsoft::WRL::ComPtr<IEnumSTATSTG>;
struct IConnectionPointContainer;
class RunSyncOnMTAThread::__l6::<lambda_229B830753C4A8F8>;
struct IEnumConnectionPoints;
class CClipboardBroker::SetClipboard::__l43::<lambda_E6908BB0B11F0B55>;
struct IEnumConnectionPointsVtbl;
class Microsoft::WRL::Details::ComPtrRefBase<Microsoft::WRL::ComPtr<IOSTaskCompletion> >;
struct IConnectionPoint;
struct IConnectionPointVtbl;
class ClipboardDataObjectTask;
struct IEnumConnections;
class CAutoHandle_Policy<HWND__ *>;
class CAutoHandle_Policy<HDESK__ *>;
class CWrapperBase<IUnknown>;
struct __midl_frag312_t;
struct __midl_frag130_t;
struct __midl_frag168_t;
struct __midl_frag1783_t;
struct IStorageVtbl;
class Microsoft::WRL::Details::ComPtrRefBase<Microsoft::WRL::ComPtr<IStream> >;
struct FMTCACHE;
class CEnumFmt;
struct EnumVerbCache;
class CDefLink::CAdvSinkImpl;
class CDefLink;
struct tagHDIBFILEHDR;
class CAsyncConnection;
struct IEnumUnknownVtbl;
class CExposedStream;
class CLimitedStreamBase::Read::__l3::<lambda_89A7BD4872294177>;
class CLimitedEnum<IEnumSTATSTG,tagSTATSTG>::Clone::__l3::<lambda_9BDFBD0AF00B6A49>;
class CLimitedWritableStorage::Stat::__l3::<lambda_A45E3065BC097B94>;
struct IAdviseSink2Vtbl;
struct IFillLockBytesVtbl;
class CPropSetName;
class CWrapperBase<IStream>::{dtor}::__l3::<lambda_F4605E2997508A8D>;
struct IContinueVtbl;
struct IViewObjectVtbl;
class CDropTarget;
struct DDEPOKE;
struct tagRECT16;
class CMapUintPtr;
struct IBindCtxVtbl;
class CBaseMInterfacePointerMarshalingStream;
class InitializeAndReadIsAppContainer::__l3::<lambda_1CB8F1C635DE6DBC>;
struct IEnumOLEVERBVtbl;
struct __CRT_LIST_ENTRY;
struct _CRT_CRITICAL_SECTION_DEBUG;
class istream;
struct AsyncIAdviseSinkVtbl;
class COleCache::CCacheUnkImpl;
class COleCache::CCacheDataImpl;
class COleCache::CCacheViewImpl;
class COleCache::CAdviseSinkImpl;
class COleCache;
struct IOleCache2Vtbl;
struct IEnumStringVtbl;
struct ISequentialStreamVtbl;
class CWriteInterfaceDataMarshalingStream;
struct ILockBytesVtbl;
struct IPropertyStore;
class RemoveClipboardDataObject::__l15::<lambda_E474B8135FEA7565>;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<CBrokeredClipDataObject> const >;
class Microsoft::WRL::RuntimeClass<Microsoft::WRL::RuntimeClassFlags<2>,IClipboardBroker,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil,Microsoft::WRL::Details::Nil>;
struct IEnumSTATDATAVtbl;
class Microsoft::WRL::Details::RemoveIUnknownBase<CClipboardBroker::CClipboardBrokerExternalReference>;
class Microsoft::WRL::Details::ComPtrRefBase<Microsoft::WRL::ComPtr<IGlobalInterfaceTable> >;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IClipboardBrokerInternal> >;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<CClipboardBroker::CClipboardBrokerMTAHelper> >;
struct IClassFactoryVtbl;
class Microsoft::WRL::ComPtr<IRuntimeBroker>;
struct IDataObjectVtbl;
class RenderFormat::__l29::<lambda_4E12DA02AC3212FD>;
struct __midl_frag1016_t;
struct CArray<CFormatEtc>::ArrayNode;
struct __midl_frag995_t;
struct __midl_frag226_t;
struct __midl_frag188_t;
struct __midl_frag150_t;
struct IAdviseSinkVtbl;
struct IImpersonateClipboardOwner;
struct AsyncIAdviseSink2Vtbl;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IImpersonateClipboardOwner> const >;
struct IStreamVtbl;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IClipboardBroker> const >;
struct Microsoft::WRL::Details::ImplementsHelper<Microsoft::WRL::RuntimeClassFlags<2>,Microsoft::WRL::Details::InterfaceList<IUnknown,Microsoft::WRL::Details::InterfaceList<Microsoft::WRL::FtmBase,Microsoft::WRL::Details::Nil> >,0,0>;
struct Microsoft::WRL::Details::ImplementsHelper<Microsoft::WRL::RuntimeClassFlags<2>,Microsoft::WRL::Details::InterfaceList<Microsoft::WRL::FtmBase,Microsoft::WRL::Details::Nil>,1,1>;
class Interceptor;
struct IInterceptorBase;
struct IEnumMonikerVtbl;
struct SSimpleWalker;
struct BSTR_INTERNAL;
class HashWSTR;
class Enum;
struct FRAME_GetTypeInfoCount;
class MAP<XSLOCK,MAP_KEY_GUID,MD_INTERFACE *>::iterator;
struct IOleInPlaceActiveObjectVtbl;
struct FRAME_Invoke;
class CALLFRAME_CACHE<INTERFACE_HELPER_CLSID>;
struct tagMethodInfo;
struct _prop_MIDL_PROC_FORMAT_STRING;
struct __midl_frag26_t;
struct __midl_frag298_t;
struct MD_PARAM;
struct __midl_frag363_t;
struct __midl_frag265_t;
struct __midl_frag291_t;
struct _prop_MIDL_TYPE_FORMAT_STRING;
struct __midl_frag296_t;
struct __midl_frag182_t;
struct __midl_frag367_t;
struct __midl_frag83_t;
struct __midl_frag289_t;
struct __midl_frag227_t;
struct __midl_frag387_t;
struct __midl_frag240_t;
struct __midl_frag470_t;
struct __midl_frag234_t;
struct __midl_frag379_t;
struct __midl_frag100_t;
struct __midl_frag318_t;
struct __midl_frag94_t;
struct __midl_frag244_t;
struct __midl_frag301_t;
struct __midl_frag12_t;
struct __midl_frag247_t;
struct __midl_frag197_t;
struct __midl_frag253_t;
struct __midl_frag248_t;
struct __midl_frag189_t;
struct ITypeCompVtbl;
struct __midl_frag285_t;
struct __midl_frag215_t;
struct __midl_frag193_t;
struct __midl_frag184_t;
struct __midl_frag81_t;
struct __midl_frag319_t;
struct __midl_frag236_t;
struct __midl_frag229_t;
struct __midl_frag207_t;
struct __midl_frag482_t;
struct __midl_frag272_t;
struct __midl_frag77_t;
struct __midl_frag385_t;
struct __midl_frag181_t;
struct __midl_frag53_t;
struct __midl_frag304_t;
struct __midl_frag14_t;
struct __midl_frag400_t;
struct __midl_frag477_t;
struct __midl_frag126_t;
struct __midl_frag251_t;
struct __midl_frag410_t;
struct __midl_frag202_t;
struct __midl_frag105_t;
struct __midl_frag397_t;
struct __midl_frag373_t;
struct __midl_frag391_t;
struct __midl_frag308_t;
struct __midl_frag87_t;
struct __midl_frag303_t;
struct __midl_frag313_t;
struct __midl_frag451_t;
struct __midl_frag441_t;
struct __midl_frag222_t;
struct __midl_frag262_t;
struct __midl_frag388_t;
struct __midl_frag212_t;
struct __midl_frag438_t;
struct __midl_frag287_t;
struct __midl_frag462_t;
struct __midl_frag396_t;
struct __midl_frag249_t;
struct __midl_frag95_t;
struct __midl_frag418_t;
struct __midl_frag471_t;
struct __midl_frag292_t;
struct _NDR64_CONF_BOGUS_STRUCTURE_HEADER_FORMAT;
struct __midl_frag76_t;
struct __midl_frag472_t;
struct __midl_frag5_t;
struct __midl_frag235_t;
struct __midl_frag6_t;
struct __midl_frag32_t;
struct __midl_frag270_t;
struct __midl_frag49_t;
struct __midl_frag52_t;
struct __midl_frag277_t;
struct __midl_frag220_t;
struct __midl_frag374_t;
struct __midl_frag305_t;
struct __midl_frag102_t;
struct __midl_frag196_t;
struct __midl_frag278_t;
struct _NDR64_NON_ENCAPSULATED_UNION;
struct __midl_frag460_t;
struct __midl_frag268_t;
struct __midl_frag422_t;
struct __midl_frag245_t;
struct __midl_frag365_t;
struct __midl_frag294_t;
struct IEnumSTATPROPSETSTGVtbl;
struct IEnumSTATPROPSTGVtbl;
struct ICallFactoryVtbl;
struct REF_COUNTED_STRUCT;
class CLinkable;
class HashVoidPtr;
struct AllocateThrow;
struct SAFEARRAY_INTERNAL;
struct HREG;
struct __MIDL_ICallFrame_0002;
struct __MIDL_ICallFrame_0004;
struct OAUTIL;
struct METHOD_DESCRIPTOR;
class CALLFRAME_CACHE_ENTRY<TYPEINFOVTBL>;
struct INTERFACE_HELPER_CLSID;
class CALLFRAME_CACHE_ENTRY<INTERFACE_HELPER_CLSID>;
struct INTERPRETER_OPT_FLAGS;
struct MD_METHOD;
struct MD_INTERFACE;
struct MD_INTERFACE_CACHE;
struct INTERPRETER_FLAGS;
struct MAP_SHARED<MAP_KEY_GUID,MD_INTERFACE *>;
struct MAP_HASHER<MAP_KEY_GUID>;
struct ICallInterceptor;
struct ICallFrame;
struct ICallFrameInit;
struct DedicatedAllocator<CallFrame>;
struct ICallUnmarshal;
struct IUnkInner;
struct MarshallingChannel;
struct IMarshalSomeone;
struct NDR_PROC_HEADER_EXTS64;
struct LEGACY_FRAME;
struct DedicatedAllocator<DISPATCH_CLIENT_FRAME>;
struct DISPATCH_SERVER_FRAME;
struct DedicatedAllocator<DISPATCH_SERVER_FRAME>;
struct MAP_SHARED<MAP_KEY_GUID,INTERFACE_HELPER_CLSID *>;
class Map<MAP_KEY_GUID,INTERFACE_HELPER_CLSID *,MAP_HASHER<MAP_KEY_GUID>,AllocateThrow>::Assoc;
class GenericInstantiator<DISPATCH_INTERCEPTOR>;
class ClassRegistration;
class AppRegistration;
struct FRAME_GetTypeInfo;
struct FRAME_GetIDsOfNames;
struct _callframeinternal_MIDL_TYPE_FORMAT_STRING;
struct ITypeLibVtbl;
struct ITypeInfoVtbl;
struct IRecordInfoVtbl;
class CSafeBindCtx;
class CReadInterfaceDataWithSourceAttributesMarshalingStream;
struct tagDDECALLDATA;
struct IShellItem2;
struct _TREEITEM;
struct tagTVITEMEXW;
class CPackagerMoniker;
struct _IMAGELISTDRAWPARAMS;
struct _IMAGEINFO;
struct IOlePackagerLinkNotify;
struct IFunctionDiscoveryNotification;
struct tagDISPATCHDATA;
struct tagOLE1DISPATCHDATA;
struct DDEADVISE;
struct DDEDATA;
struct _SQM_STREAM_ENTRY_EX;
struct _SQM_STREAM_ENTRY;
class MapEnumToSQMData<enum RpcssSQMFlags>;
struct INFO;
struct tagDOCDISPATCHDATA;
struct _CLILIST;
class CMapDwordPtr;
struct _HOSTNAMES;
class CEnumSTATDATA;
class COAHolder;
class CMemBytes;
class CDragDefaultCursors;
class CForcedDropTarget;
class CompObjStmData;
class CCacheNode;
class ios;
class streambuf;
class iostream;
struct CArray<CCacheNode>::ArrayNode;
class CEnumStatData;
class CMfObject;
struct _METAINFO;
class CEMfObject;
class CGenObject;
struct Microsoft::WRL::RuntimeClassFlags<3>;
class CancellableCall;
class Microsoft::WRL::Details::RemoveIUnknownBase<IDataObject>;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IDataObject> >;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IGlobalInterfaceTable> >;
class CClipClientDataWrapper;
class Windows::Internal::GitPtrImpl<Windows::Internal::GitPtr>;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IUnwrappableDataObject> const >;
class Microsoft::WRL::Details::RemoveIUnknownBase<IUnwrappableDataObject>;
class Microsoft::WRL::Details::ComPtrRefBase<Microsoft::WRL::ComPtr<IClipboardBroker> >;
struct FORMATETCDATAARRAY32;
class Microsoft::WRL::Details::RuntimeClass<Microsoft::WRL::Details::InterfaceList<IUnknown,Microsoft::WRL::Details::InterfaceList<Microsoft::WRL::FtmBase,Microsoft::WRL::Details::Nil> >,Microsoft::WRL::RuntimeClassFlags<2>,1,0,0>;
struct Microsoft::WRL::Details::VerifyInterfaceHelper<2,Microsoft::WRL::FtmBase,1,1>;
struct Microsoft::WRL::Details::VerifyInterfaceHelper<3,IMarshal,1,0>;
class RunSyncOnMTAThread::__l6::<lambda_2417A7241A3718ED>;
class Microsoft::WRL::ComPtr<CBrokeredClipDataObject>;
class Microsoft::WRL::Details::RuntimeClass<Microsoft::WRL::Details::InterfaceList<IClipboardBroker,Microsoft::WRL::Details::Nil>,Microsoft::WRL::RuntimeClassFlags<2>,1,0,0>;
struct Microsoft::WRL::Details::ImplementsHelper<Microsoft::WRL::RuntimeClassFlags<2>,Microsoft::WRL::Details::InterfaceList<IClipboardBroker,Microsoft::WRL::Details::Nil>,0,0>;
class Microsoft::WRL::ComPtr<ICallingProcessInfo>;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<ICallingProcessInfo> const >;
class Microsoft::WRL::Details::RemoveIUnknownBase<ICallingProcessInfo>;
class Microsoft::WRL::ComPtr<CClipboardBroker::CClipboardBrokerExternalReference>;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<CClipboardBroker::CClipboardBrokerExternalReference> const >;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<CClipboardBroker::CClipboardBrokerExternalReference> >;
class Microsoft::WRL::Details::RuntimeClass<Microsoft::WRL::Details::InterfaceList<IClipboardBrokerInternal,Microsoft::WRL::Details::Nil>,Microsoft::WRL::RuntimeClassFlags<2>,1,0,0>;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IImpersonateClipboardOwner> >;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IClipboardBrokerInternal> const >;
class Microsoft::WRL::Details::RemoveIUnknownBase<IClipboardBrokerInternal>;
class Microsoft::WRL::Details::ComPtrRefBase<Microsoft::WRL::ComPtr<IClipboardBrokerInternal> >;
class Microsoft::WRL::Details::RemoveIUnknownBase<CClipboardBroker::CClipboardBrokerMTAHelper>;
class CBrokerInstanceHolder;
class Microsoft::WRL::Details::ComPtrRefBase<Microsoft::WRL::ComPtr<IRuntimeBroker> >;
class ClipboardBrokerFactory;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<CClipboardBroker> >;
class Microsoft::WRL::Details::MakeAllocator<CClipboardBroker::CClipboardBrokerExternalReference,0>;
class Microsoft::WRL::Details::MakeAllocator<CClipboardBroker::CClipboardBrokerMTAHelper,0>;
class Microsoft::WRL::Details::MakeAllocator<CClipboardBroker,0>;
struct Microsoft::WRL::Details::VerifyInterfaceHelper<2,IClipboardBroker,0,0>;
struct Microsoft::WRL::Details::VerifyInterfaceHelper<2,IClipboardBrokerInternal,0,0>;
class RunSyncOnMTAThread::__l6::<lambda_2E683E8F639D62FE>;
class CClipboardBroker::SetClipboard::__l27::<lambda_AB1878220BE05968>;
class Microsoft::WRL::Details::RemoveIUnknownBase<IOSTaskCompletion>;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IOSTaskCompletion> >;
class CGenericObject;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<ClipboardDataObjectTask> const >;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<ClipboardDataObjectTask> >;
class Microsoft::WRL::Details::RemoveIUnknownBase<CBrokeredClipDataObject>;
class CClipDataObject::GetRealDataObjPtr::__l45::<lambda_7601126E30B421F7>;
class CAutoHandle_HGLOBALPolicy;
class CTContainer_PolicyLocalMem;
class CTContainer_PolicyHeapMem;
class CAutoHandle_Policy<HKEY__ *>;
class CAutoHandle_Policy<HACCEL__ *>;
class CAutoHandle_Policy<HICON__ *>;
class CAutoHandle_Policy<HWINSTA__ *>;
class CAutoHandle_Policy<HBITMAP__ *>;
class CAutoHandle_Policy<HBRUSH__ *>;
class CAutoHandle_Policy<HPALETTE__ *>;
class CAutoHandle_Policy<HRGN__ *>;
class CAutoHandle_Policy<HDC__ *>;
class CAutoHandle_Policy<_IMAGELIST *>;
class CUnkownOnlyWrapper;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IStream> const >;
class Microsoft::WRL::Details::RemoveIUnknownBase<IStream>;
class CReadOnlyStream;
class CLimitedWritableStream;
class Microsoft::WRL::ComPtr<IStorage>;
class CWrapperBase<IStorage>;
class Microsoft::WRL::Details::RemoveIUnknownBase<IStorage>;
class CWrapperBase<IEnumSTATSTG>;
class CLimitedWritableStorage;
class CAutoHandle<void *>;
class Microsoft::WRL::Details::ComPtrRefBase<Microsoft::WRL::ComPtr<IEnumFORMATETC> >;
class CReadOnlyStorage::OpenStorage::__l3::<lambda_191F798414ADB84B>;
class CReadOnlyStorage::Stat::__l3::<lambda_2864C89247375571>;
class CLimitedEnum<IEnumFORMATETC,tagFORMATETC>::Reset::__l3::<lambda_385285479B38A6BA>;
class CLimitedEnum<IEnumSTATSTG,tagSTATSTG>::Skip::__l3::<lambda_3FE4B16529315704>;
class CLimitedEnum<IEnumFORMATETC,tagFORMATETC>::Clone::__l3::<lambda_535061216AA0B9B3>;
class CLimitedWritableStorage::CreateStream::__l3::<lambda_80612E54ECEB959E>;
class CLimitedEnum<IEnumSTATSTG,tagSTATSTG>::Next::__l3::<lambda_8A2C96338B5302B9>;
class CBrokeredClipDataObject::GetDataHere::__l25::<lambda_B48BF3BF89CC31FF>;
class CReadOnlyStorage::OpenStream::__l3::<lambda_B6E0DDFFD7B936DC>;
class CBrokeredClipDataObject::QueryGetData::__l9::<lambda_C1C14A71CE15713B>;
class CBrokeredClipDataObject::EnumFormatEtc::__l9::<lambda_CC6CC56F32D72DC0>;
class CWrapperBase<IEnumSTATSTG>::{dtor}::__l3::<lambda_FF87648DB59E4816>;
struct IEnumHolder;
struct _DROPFILES;
class CDragDataObject;
class CPaccelEnum;
class CFrameFilter;
class CDefObject::CPrivUnknown;
class CDefObject;
union _ASSEMBLY_VERSION;
class CEnumFmt10;
struct FMT;
struct USERPREFS;
struct PICTINFO;
struct tagWIN16BITMAP;
struct tagWIN16METAFILEPICT;
struct tagOLEPRESSTMHDR;
class PSStream;
struct tagSTATPROPBAG;
struct IPropertyBagEx;
struct IEnumSTATPROPBAG;
class CSTATPROPBAGArray;
class CSinkList;
class CConnectionPoint;
class CAsyncConnectionContainer;
class SafeCExposedDocFile;
class CBasedMappedStreamPtr;
class SafeCExposedStream;
class CUpdate;
struct SDeltaBlock;
class CWrappedDocFile;
class CNtfsStream;
class CNtfsUpdateStreamForPropStg;
class CNFFTreeMutex;
class TXLargeIntegerWrapper<_ULARGE_INTEGER,unsigned long,unsigned __int64>;
class CNtfsStreamName;
class CDocfileStreamName;
class CRootPubDocFile;
class SafeCExposedIterator;
struct CExposedIterator;
struct SDfMarshalPacket;
class CDocfileUnmarshalFactory;
class CPtrCache;
class ProcessToken;
class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IMarshalingStream> >;
class Microsoft::WRL::Details::RemoveIUnknownBase<IMarshalingStream>;
class CComCat;
struct ICatRegister;
class CsCatInfo;
class CEnumClassesOfCategories;
struct tagCLASS_DATA;
struct CMap<unsigned short *,unsigned short * &,unsigned long,unsigned long &>::CAssoc;
class CFontEventsCP;
class CFont;
struct FCR;
struct CFont::Load::__l2::FONTDATA;
class CCacheStream;
struct ICacheStream;
class CPicture;
struct ISimpleBinding;
class SafeIntInternal::SafeIntWin32Exception;
class SafeIntInternal::SafeIntExceptionHandler<SafeIntInternal::SafeIntWin32Exception>;
class LargeIntRegMultiply<unsigned int,unsigned __int64>;
class LargeIntRegMultiply<__int64,unsigned int>;
class LargeIntRegMultiply<__int64,int>;
class LargeIntRegMultiply<int,__int64>;
class LargeIntRegMultiply<__int64,unsigned __int64>;
class MultiplicationHelper<unsigned __int64,__int64,7>;
class MultiplicationHelper<__int64,__int64,11>;
class SubtractionHelper<__int64,unsigned __int64,11>;
class SubtractionHelper<__int64,unsigned __int64,21>;
class SafeInt<unsigned short,SafeIntInternal::SafeIntExceptionHandler<SafeIntException> >;
class SafeInt<long,SafeIntInternal::SafeIntExceptionHandler<SafeIntException> >;
struct DESCRIPTOR;
class SafeInt<unsigned long,SafeIntInternal::SafeIntExceptionHandler<SafeIntException> >;
class SafeCastHelper<unsigned short,unsigned short,0>;
class SafeCastHelper<long,long,0>;
class MultiplicationHelper<unsigned short,unsigned short,2>;
class SafeCastHelper<unsigned long,long,1>;
class AdditionHelper<unsigned long,unsigned long,1>;
class MultiplicationHelper<unsigned long,unsigned int,3>;
class AdditionHelper<unsigned long,unsigned int,1>;
class SafeCastHelper<long,int,0>;
class BinaryAndHelper<long,int,0>;
class CArray<_GUID,_GUID &>;
struct DLGTEMPLATEEX;
struct DICTENTRY;
class MultiplicationHelper<unsigned long,unsigned __int64,8>;
class SafeCastHelper<unsigned long,int,1>;
class SafeCastHelper<unsigned long,unsigned __int64,2>;
class SafeCastHelper<unsigned long,unsigned int,0>;
struct IImageFilter;
class CClassObj;
class CUnknown;
struct ITaskAdvise;
class CBindHost;
struct _CONTEXT32_UPDATE;
struct _APPINFO_PROCESS_INFORMATION;
struct __midl_frag51_t;
struct __midl_frag89_t;
struct __midl_frag64_t;
class Windows::AutoOperatorAmpersandHelper<_LUNICODE_STRING,Windows::Auto<_LUNICODE_STRING> >;
class CTLocalAllocPolicy;
class CTCoAllocPolicy;
class CTGlobalAllocPolicy;
struct CMemString_PolicyCoTaskMem;
class ARI::AutoPtrAriHeap<_TOKEN_SECURITY_ATTRIBUTES_INFORMATION>;
struct CMemString_PolicyAutoMem;
class CMemString<CMemString_PolicyCoTaskMem>;
class Windows::Internal::ResourceString;
class Windows::Internal::NativeString<Windows::Internal::CoTaskMemPolicy<unsigned short> >;
class CDateInfo;
struct APP_DATA;
class CInterfaceFromWindowProp;
class CPrivDragDrop;
struct IPrivDragDrop;
struct SDDInfo;
struct OsFrame;
struct InFrame;
struct _DELAYLOAD_PROC_DESCRIPTOR;
struct _DELAYLOAD_INFO;
class std::bad_alloc;
struct $_s__CatchableTypeArray$_extraBytes_16;
struct $_TypeDescriptor$_extraBytes_24;
struct CsFrame;
union FT;
struct _GS_HANDLER_DATA;

typedef enum _SYSTEM_INFORMATION_CLASS
{
  SystemBasicInformation = 0,
  SystemProcessorInformation = 1,
  SystemPerformanceInformation = 2,
  SystemTimeOfDayInformation = 3,
  SystemPathInformation = 4,
  SystemProcessInformation = 5,
  SystemCallCountInformation = 6,
  SystemDeviceInformation = 7,
  SystemProcessorPerformanceInformation = 8,
  SystemFlagsInformation = 9,
  SystemCallTimeInformation = 10,
  SystemModuleInformation = 11,
  SystemLocksInformation = 12,
  SystemStackTraceInformation = 13,
  SystemPagedPoolInformation = 14,
  SystemNonPagedPoolInformation = 15,
  SystemHandleInformation = 16,
  SystemObjectInformation = 17,
  SystemPageFileInformation = 18,
  SystemVdmInstemulInformation = 19,
  SystemVdmBopInformation = 20,
  SystemFileCacheInformation = 21,
  SystemPoolTagInformation = 22,
  SystemInterruptInformation = 23,
  SystemDpcBehaviorInformation = 24,
  SystemFullMemoryInformation = 25,
  SystemLoadGdiDriverInformation = 26,
  SystemUnloadGdiDriverInformation = 27,
  SystemTimeAdjustmentInformation = 28,
  SystemSummaryMemoryInformation = 29,
  SystemMirrorMemoryInformation = 30,
  SystemPerformanceTraceInformation = 31,
  SystemObsolete0 = 32,
  SystemExceptionInformation = 33,
  SystemCrashDumpStateInformation = 34,
  SystemKernelDebuggerInformation = 35,
  SystemContextSwitchInformation = 36,
  SystemRegistryQuotaInformation = 37,
  SystemExtendServiceTableInformation = 38,
  SystemPrioritySeperation = 39,
  SystemVerifierAddDriverInformation = 40,
  SystemVerifierRemoveDriverInformation = 41,
  SystemProcessorIdleInformation = 42,
  SystemLegacyDriverInformation = 43,
  SystemCurrentTimeZoneInformation = 44,
  SystemLookasideInformation = 45,
  SystemTimeSlipNotification = 46,
  SystemSessionCreate = 47,
  SystemSessionDetach = 48,
  SystemSessionInformation = 49,
  SystemRangeStartInformation = 50,
  SystemVerifierInformation = 51,
  SystemVerifierThunkExtend = 52,
  SystemSessionProcessInformation = 53,
  SystemLoadGdiDriverInSystemSpace = 54,
  SystemNumaProcessorMap = 55,
  SystemPrefetcherInformation = 56,
  SystemExtendedProcessInformation = 57,
  SystemRecommendedSharedDataAlignment = 58,
  SystemComPlusPackage = 59,
  SystemNumaAvailableMemory = 60,
  SystemProcessorPowerInformation = 61,
  SystemEmulationBasicInformation = 62,
  SystemEmulationProcessorInformation = 63,
  SystemExtendedHandleInformation = 64,
  SystemLostDelayedWriteInformation = 65,
  SystemBigPoolInformation = 66,
  SystemSessionPoolTagInformation = 67,
  SystemSessionMappedViewInformation = 68,
  SystemHotpatchInformation = 69,
  SystemObjectSecurityMode = 70,
  SystemWatchdogTimerHandler = 71,
  SystemWatchdogTimerInformation = 72,
  SystemLogicalProcessorInformation = 73,
  SystemWow64SharedInformationObsolete = 74,
  SystemRegisterFirmwareTableInformationHandler = 75,
  SystemFirmwareTableInformation = 76,
  SystemModuleInformationEx = 77,
  SystemVerifierTriageInformation = 78,
  SystemSuperfetchInformation = 79,
  SystemMemoryListInformation = 80,
  SystemFileCacheInformationEx = 81,
  SystemThreadPriorityClientIdInformation = 82,
  SystemProcessorIdleCycleTimeInformation = 83,
  SystemVerifierCancellationInformation = 84,
  SystemProcessorPowerInformationEx = 85,
  SystemRefTraceInformation = 86,
  SystemSpecialPoolInformation = 87,
  SystemProcessIdInformation = 88,
  SystemErrorPortInformation = 89,
  SystemBootEnvironmentInformation = 90,
  SystemHypervisorInformation = 91,
  SystemVerifierInformationEx = 92,
  SystemTimeZoneInformation = 93,
  SystemImageFileExecutionOptionsInformation = 94,
  SystemCoverageInformation = 95,
  SystemPrefetchPatchInformation = 96,
  SystemVerifierFaultsInformation = 97,
  SystemSystemPartitionInformation = 98,
  SystemSystemDiskInformation = 99,
  SystemProcessorPerformanceDistribution = 100,
  SystemNumaProximityNodeInformation = 101,
  SystemDynamicTimeZoneInformation = 102,
  SystemCodeIntegrityInformation = 103,
  SystemProcessorMicrocodeUpdateInformation = 104,
  SystemProcessorBrandString = 105,
  SystemVirtualAddressInformation = 106,
  SystemLogicalProcessorAndGroupInformation = 107,
  SystemProcessorCycleTimeInformation = 108,
  SystemStoreInformation = 109,
  SystemRegistryAppendString = 110,
  SystemAitSamplingValue = 111,
  SystemVhdBootInformation = 112,
  SystemCpuQuotaInformation = 113,
  SystemNativeBasicInformation = 114,
  SystemErrorPortTimeouts = 115,
  SystemLowPriorityIoInformation = 116,
  SystemBootEntropyInformation = 117,
  SystemVerifierCountersInformation = 118,
  SystemPagedPoolInformationEx = 119,
  SystemSystemPtesInformationEx = 120,
  SystemNodeDistanceInformation = 121,
  SystemAcpiAuditInformation = 122,
  SystemBasicPerformanceInformation = 123,
  SystemQueryPerformanceCounterInformation = 124,
  SystemSessionBigPoolInformation = 125,
  SystemBootGraphicsInformation = 126,
  SystemScrubPhysicalMemoryInformation = 127,
  SystemBadPageInformation = 128,
  SystemProcessorProfileControlArea = 129,
  SystemCombinePhysicalMemoryInformation = 130,
  SystemEntropyInterruptTimingInformation = 131,
  SystemConsoleInformation = 132,
  SystemPlatformBinaryInformation = 133,
  SystemThrottleNotificationInformation = 134,
  SystemHypervisorProcessorCountInformation = 135,
  SystemDeviceDataInformation = 136,
  SystemDeviceDataEnumerationInformation = 137,
  SystemMemoryTopologyInformation = 138,
  SystemMemoryChannelInformation = 139,
  SystemBootLogoInformation = 140,
  SystemProcessorPerformanceInformationEx = 141,
  SystemSpare0 = 142,
  SystemSecureBootPolicyInformation = 143,
  SystemPageFileInformationEx = 144,
  SystemSecureBootInformation = 145,
  SystemEntropyInterruptTimingRawInformation = 146,
  SystemPortableWorkspaceEfiLauncherInformation = 147,
  SystemFullProcessInformation = 148,
  MaxSystemInfoClass = 149,
} SYSTEM_INFORMATION_CLASS, *PSYSTEM_INFORMATION_CLASS;

struct tagRECT
{
  /* 0x0000 */ long left;
  /* 0x0004 */ long top;
  /* 0x0008 */ long right;
  /* 0x000c */ long bottom;
}; /* size: 0x0010 */

class CAbstractStream
{
  /* 0x0000 */ long Padding_0[2];
  /* 0x0008 */ volatile unsigned long _cRefs;
}; /* size: 0x0010 */

enum DCOM_ENDPOINT_FLAGS
{
  fUseInternetPorts = 1,
};

struct tagVS_FIXEDFILEINFO
{
  /* 0x0000 */ unsigned long dwSignature;
  /* 0x0004 */ unsigned long dwStrucVersion;
  /* 0x0008 */ unsigned long dwFileVersionMS;
  /* 0x000c */ unsigned long dwFileVersionLS;
  /* 0x0010 */ unsigned long dwProductVersionMS;
  /* 0x0014 */ unsigned long dwProductVersionLS;
  /* 0x0018 */ unsigned long dwFileFlagsMask;
  /* 0x001c */ unsigned long dwFileFlags;
  /* 0x0020 */ unsigned long dwFileOS;
  /* 0x0024 */ unsigned long dwFileType;
  /* 0x0028 */ unsigned long dwFileSubtype;
  /* 0x002c */ unsigned long dwFileDateMS;
  /* 0x0030 */ unsigned long dwFileDateLS;
}; /* size: 0x0034 */

typedef struct _MINIDUMP_MODULE_CALLBACK
{
  /* 0x0000 */ wchar_t* FullPath;
  /* 0x0008 */ unsigned __int64 BaseOfImage;
  /* 0x0010 */ unsigned long SizeOfImage;
  /* 0x0014 */ unsigned long CheckSum;
  /* 0x0018 */ unsigned long TimeDateStamp;
  /* 0x001c */ struct tagVS_FIXEDFILEINFO VersionInfo;
  /* 0x0050 */ void* CvRecord;
  /* 0x0058 */ unsigned long SizeOfCvRecord;
  /* 0x005c */ void* MiscRecord;
  /* 0x0064 */ unsigned long SizeOfMiscRecord;
} MINIDUMP_MODULE_CALLBACK, *PMINIDUMP_MODULE_CALLBACK; /* size: 0x0068 */

enum tagTYPEFLAGS
{
  TYPEFLAG_FAPPOBJECT = 1,
  TYPEFLAG_FCANCREATE = 2,
  TYPEFLAG_FLICENSED = 4,
  TYPEFLAG_FPREDECLID = 8,
  TYPEFLAG_FHIDDEN = 16,
  TYPEFLAG_FCONTROL = 32,
  TYPEFLAG_FDUAL = 64,
  TYPEFLAG_FNONEXTENSIBLE = 128,
  TYPEFLAG_FOLEAUTOMATION = 256,
  TYPEFLAG_FRESTRICTED = 512,
  TYPEFLAG_FAGGREGATABLE = 1024,
  TYPEFLAG_FREPLACEABLE = 2048,
  TYPEFLAG_FDISPATCHABLE = 4096,
  TYPEFLAG_FREVERSEBIND = 8192,
  TYPEFLAG_FPROXY = 16384,
};

struct HUMPD__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

typedef struct _SID_AND_ATTRIBUTES_HASH
{
  /* 0x0000 */ unsigned long SidCount;
  /* 0x0004 */ long Padding_1;
  /* 0x0008 */ struct _SID_AND_ATTRIBUTES* SidAttr;
  /* 0x0010 */ unsigned __int64 Hash[32];
} SID_AND_ATTRIBUTES_HASH, *PSID_AND_ATTRIBUTES_HASH; /* size: 0x0110 */

struct tagNMHDR
{
  /* 0x0000 */ struct HWND__* hwndFrom;
  /* 0x0008 */ unsigned __int64 idFrom;
  /* 0x0010 */ unsigned int code;
  /* 0x0014 */ long __PADDING__[1];
}; /* size: 0x0018 */

typedef struct _OFNOTIFYEXW
{
  /* 0x0000 */ struct tagNMHDR hdr;
  /* 0x0018 */ struct tagOFNW* lpOFN;
  /* 0x0020 */ void* psf;
  /* 0x0028 */ void* pidl;
} OFNOTIFYEXW, *POFNOTIFYEXW; /* size: 0x0030 */

typedef enum _PROC_THREAD_ATTRIBUTE_NUM
{
  ProcThreadAttributeParentProcess = 0,
  ProcThreadAttributeHandleList = 2,
  ProcThreadAttributeGroupAffinity = 3,
  ProcThreadAttributePreferredNode = 4,
  ProcThreadAttributeIdealProcessor = 5,
  ProcThreadAttributeUmsThread = 6,
  ProcThreadAttributeMitigationPolicy = 7,
  ProcThreadAttributeSecurityCapabilities = 9,
} PROC_THREAD_ATTRIBUTE_NUM, *PPROC_THREAD_ATTRIBUTE_NUM;

struct IOleInPlaceSiteEx
{
}; /* size: 0x0008 */

struct IXMLElement2
{
}; /* size: 0x0008 */

typedef enum _SYSDBG_COMMAND
{
  SysDbgQueryModuleInformation = 0,
  SysDbgQueryTraceInformation = 1,
  SysDbgSetTracepoint = 2,
  SysDbgSetSpecialCall = 3,
  SysDbgClearSpecialCalls = 4,
  SysDbgQuerySpecialCalls = 5,
  SysDbgBreakPoint = 6,
  SysDbgQueryVersion = 7,
  SysDbgReadVirtual = 8,
  SysDbgWriteVirtual = 9,
  SysDbgReadPhysical = 10,
  SysDbgWritePhysical = 11,
  SysDbgReadControlSpace = 12,
  SysDbgWriteControlSpace = 13,
  SysDbgReadIoSpace = 14,
  SysDbgWriteIoSpace = 15,
  SysDbgReadMsr = 16,
  SysDbgWriteMsr = 17,
  SysDbgReadBusData = 18,
  SysDbgWriteBusData = 19,
  SysDbgCheckLowMemory = 20,
  SysDbgEnableKernelDebugger = 21,
  SysDbgDisableKernelDebugger = 22,
  SysDbgGetAutoKdEnable = 23,
  SysDbgSetAutoKdEnable = 24,
  SysDbgGetPrintBufferSize = 25,
  SysDbgSetPrintBufferSize = 26,
  SysDbgGetKdUmExceptionEnable = 27,
  SysDbgSetKdUmExceptionEnable = 28,
  SysDbgGetTriageDump = 29,
  SysDbgGetKdBlockEnable = 30,
  SysDbgSetKdBlockEnable = 31,
  SysDbgRegisterForUmBreakInfo = 32,
  SysDbgGetUmBreakPid = 33,
  SysDbgClearUmBreakPid = 34,
  SysDbgGetUmAttachPid = 35,
  SysDbgClearUmAttachPid = 36,
} SYSDBG_COMMAND, *PSYSDBG_COMMAND;

typedef struct _MINIDUMP_TOKEN_INFO_HEADER
{
  /* 0x0000 */ unsigned long TokenSize;
  /* 0x0004 */ unsigned long TokenId;
  /* 0x0008 */ unsigned __int64 TokenHandle;
} MINIDUMP_TOKEN_INFO_HEADER, *PMINIDUMP_TOKEN_INFO_HEADER; /* size: 0x0010 */

typedef enum _BIN_TYPES
{
  RequestSize = 0,
  RequestLocation = 1,
} BIN_TYPES, *PBIN_TYPES;

typedef struct _CERT_POLICY_MAPPINGS_INFO
{
  /* 0x0000 */ unsigned long cPolicyMapping;
  /* 0x0004 */ long Padding_2;
  /* 0x0008 */ struct _CERT_POLICY_MAPPING* rgPolicyMapping;
} CERT_POLICY_MAPPINGS_INFO, *PCERT_POLICY_MAPPINGS_INFO; /* size: 0x0010 */

enum POWER_INFORMATION_LEVEL
{
  SystemPowerPolicyAc = 0,
  SystemPowerPolicyDc = 1,
  VerifySystemPolicyAc = 2,
  VerifySystemPolicyDc = 3,
  SystemPowerCapabilities = 4,
  SystemBatteryState = 5,
  SystemPowerStateHandler = 6,
  ProcessorStateHandler = 7,
  SystemPowerPolicyCurrent = 8,
  AdministratorPowerPolicy = 9,
  SystemReserveHiberFile = 10,
  ProcessorInformation = 11,
  SystemPowerInformation = 12,
  ProcessorStateHandler2 = 13,
  LastWakeTime = 14,
  LastSleepTime = 15,
  SystemExecutionState = 16,
  SystemPowerStateNotifyHandler = 17,
  ProcessorPowerPolicyAc = 18,
  ProcessorPowerPolicyDc = 19,
  VerifyProcessorPowerPolicyAc = 20,
  VerifyProcessorPowerPolicyDc = 21,
  ProcessorPowerPolicyCurrent = 22,
  SystemPowerStateLogging = 23,
  SystemPowerLoggingEntry = 24,
  SetPowerSettingValue = 25,
  NotifyUserPowerSetting = 26,
  PowerInformationLevelUnused0 = 27,
  SystemMonitorHiberBootPowerOff = 28,
  SystemVideoState = 29,
  TraceApplicationPowerMessage = 30,
  TraceApplicationPowerMessageEnd = 31,
  ProcessorPerfStates = 32,
  ProcessorIdleStates = 33,
  ProcessorCap = 34,
  SystemWakeSource = 35,
  SystemHiberFileInformation = 36,
  TraceServicePowerMessage = 37,
  ProcessorLoad = 38,
  PowerShutdownNotification = 39,
  MonitorCapabilities = 40,
  SessionPowerInit = 41,
  SessionDisplayState = 42,
  PowerRequestCreate = 43,
  PowerRequestAction = 44,
  GetPowerRequestList = 45,
  ProcessorInformationEx = 46,
  NotifyUserModeLegacyPowerEvent = 47,
  GroupPark = 48,
  ProcessorIdleDomains = 49,
  WakeTimerList = 50,
  SystemHiberFileSize = 51,
  ProcessorIdleStatesHv = 52,
  ProcessorPerfStatesHv = 53,
  ProcessorPerfCapHv = 54,
  ProcessorSetIdle = 55,
  LogicalProcessorIdling = 56,
  UserPresence = 57,
  PowerSettingNotificationName = 58,
  GetPowerSettingValue = 59,
  IdleResiliency = 60,
  SessionRITState = 61,
  SessionConnectNotification = 62,
  SessionPowerCleanup = 63,
  SessionLockState = 64,
  SystemHiberbootState = 65,
  PlatformInformation = 66,
  PdcInvocation = 67,
  MonitorInvocation = 68,
  FirmwareTableInformationRegistered = 69,
  SetShutdownSelectedTime = 70,
  SuspendResumeInvocation = 71,
  PlmPowerRequestCreate = 72,
  ScreenOff = 73,
  CsDeviceNotification = 74,
  PlatformRole = 75,
  LastResumePerformance = 76,
  DisplayBurst = 77,
  ExitLatencySamplingPercentage = 78,
  ApplyLowPowerScenarioSettings = 79,
  PowerInformationLevelMaximum = 80,
};

struct tagContexts
{
  /* 0x0000 */ class CObjectContext* pClientCtx;
  /* 0x0008 */ class CObjectContext* pServerCtx;
}; /* size: 0x0010 */

typedef enum _TOKEN_SECURITY_ATTRIBUTE_OPERATION
{
  TOKEN_SECURITY_ATTRIBUTE_OPERATION_NONE = 0,
  TOKEN_SECURITY_ATTRIBUTE_OPERATION_REPLACE_ALL = 1,
  TOKEN_SECURITY_ATTRIBUTE_OPERATION_ADD = 2,
  TOKEN_SECURITY_ATTRIBUTE_OPERATION_DELETE = 3,
  TOKEN_SECURITY_ATTRIBUTE_OPERATION_REPLACE = 4,
} TOKEN_SECURITY_ATTRIBUTE_OPERATION, *PTOKEN_SECURITY_ATTRIBUTE_OPERATION;

struct ILayoutStorage
{
}; /* size: 0x0008 */

typedef struct _GUID
{
  /* 0x0000 */ unsigned long Data1;
  /* 0x0004 */ unsigned short Data2;
  /* 0x0006 */ unsigned short Data3;
  /* 0x0008 */ unsigned char Data4[8];
} GUID, *PGUID; /* size: 0x0010 */

typedef struct _RPC_VERSION
{
  /* 0x0000 */ unsigned short MajorVersion;
  /* 0x0002 */ unsigned short MinorVersion;
} RPC_VERSION, *PRPC_VERSION; /* size: 0x0004 */

typedef struct _RPC_SYNTAX_IDENTIFIER
{
  /* 0x0000 */ struct _GUID SyntaxGUID;
  /* 0x0010 */ struct _RPC_VERSION SyntaxVersion;
} RPC_SYNTAX_IDENTIFIER, *PRPC_SYNTAX_IDENTIFIER; /* size: 0x0014 */

typedef struct _MIDL_SYNTAX_INFO
{
  /* 0x0000 */ struct _RPC_SYNTAX_IDENTIFIER TransferSyntax;
  /* 0x0014 */ long Padding_3;
  /* 0x0018 */ struct RPC_DISPATCH_TABLE* DispatchTable;
  /* 0x0020 */ const unsigned char* ProcString;
  /* 0x0028 */ const unsigned short* FmtStringOffset;
  /* 0x0030 */ const unsigned char* TypeString;
  /* 0x0038 */ const void* aUserMarshalQuadruple;
  /* 0x0040 */ unsigned __int64 pReserved1;
  /* 0x0048 */ unsigned __int64 pReserved2;
} MIDL_SYNTAX_INFO, *PMIDL_SYNTAX_INFO; /* size: 0x0050 */

enum DISK_CACHE_RETENTION_PRIORITY
{
  EqualPriority = 0,
  KeepPrefetchedData = 1,
  KeepReadData = 2,
};

typedef struct _SYSTEM_PREFETCH_OPTIONS
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned long LowerPriority : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned long VirtualOffsets : 1; /* bit position: 1 */
    /* 0x0000 */ unsigned long TrickleIOs : 1; /* bit position: 2 */
    /* 0x0000 */ unsigned long SkipInStorePages : 1; /* bit position: 3 */
    /* 0x0000 */ unsigned long PrefetchFilesByVa : 1; /* bit position: 4 */
    /* 0x0000 */ unsigned long Spare : 3; /* bit position: 5 */
    /* 0x0000 */ unsigned long ScenarioType : 8; /* bit position: 8 */
  }; /* bitfield */
} SYSTEM_PREFETCH_OPTIONS, *PSYSTEM_PREFETCH_OPTIONS; /* size: 0x0004 */

struct IActivationPropertiesIn
{
}; /* size: 0x0008 */

typedef struct _CRYPTOAPI_BLOB
{
  /* 0x0000 */ unsigned long cbData;
  /* 0x0004 */ long Padding_4;
  /* 0x0008 */ unsigned char* pbData;
} CRYPTOAPI_BLOB, *PCRYPTOAPI_BLOB; /* size: 0x0010 */

typedef struct _CRYPT_ALGORITHM_IDENTIFIER
{
  /* 0x0000 */ char* pszObjId;
  /* 0x0008 */ struct _CRYPTOAPI_BLOB Parameters;
} CRYPT_ALGORITHM_IDENTIFIER, *PCRYPT_ALGORITHM_IDENTIFIER; /* size: 0x0018 */

typedef struct _CRYPT_BIT_BLOB
{
  /* 0x0000 */ unsigned long cbData;
  /* 0x0004 */ long Padding_5;
  /* 0x0008 */ unsigned char* pbData;
  /* 0x0010 */ unsigned long cUnusedBits;
  /* 0x0014 */ long __PADDING__[1];
} CRYPT_BIT_BLOB, *PCRYPT_BIT_BLOB; /* size: 0x0018 */

typedef struct _CERT_PUBLIC_KEY_INFO
{
  /* 0x0000 */ struct _CRYPT_ALGORITHM_IDENTIFIER Algorithm;
  /* 0x0018 */ struct _CRYPT_BIT_BLOB PublicKey;
} CERT_PUBLIC_KEY_INFO, *PCERT_PUBLIC_KEY_INFO; /* size: 0x0030 */

class Microsoft::WRL::ComPtr<ApartmentShutdownNode>
{
  /* 0x0000 */ struct ApartmentShutdownNode* ptr_;
}; /* size: 0x0008 */

class Microsoft::WRL::ComPtr<IApartmentShutdown>
{
  /* 0x0000 */ struct IApartmentShutdown* ptr_;
}; /* size: 0x0008 */

struct ApartmentShutdownNode
{
  /* 0x0000 */ long Padding_6[4];
  /* 0x0010 */ class Microsoft::WRL::ComPtr<ApartmentShutdownNode> spNext;
  /* 0x0018 */ class Microsoft::WRL::ComPtr<ApartmentShutdownNode> spPrev;
  /* 0x0020 */ struct APARTMENT_SHUTDOWN_REGISTRATION_COOKIE__* cookie;
  /* 0x0028 */ class Microsoft::WRL::ComPtr<IApartmentShutdown> spShutdown;
  /* 0x0030 */ unsigned char bCallbackInvoked;
  /* 0x0031 */ char __PADDING__[7];
}; /* size: 0x0038 */

enum WELL_KNOWN_SID_TYPE
{
  WinNullSid = 0,
  WinWorldSid = 1,
  WinLocalSid = 2,
  WinCreatorOwnerSid = 3,
  WinCreatorGroupSid = 4,
  WinCreatorOwnerServerSid = 5,
  WinCreatorGroupServerSid = 6,
  WinNtAuthoritySid = 7,
  WinDialupSid = 8,
  WinNetworkSid = 9,
  WinBatchSid = 10,
  WinInteractiveSid = 11,
  WinServiceSid = 12,
  WinAnonymousSid = 13,
  WinProxySid = 14,
  WinEnterpriseControllersSid = 15,
  WinSelfSid = 16,
  WinAuthenticatedUserSid = 17,
  WinRestrictedCodeSid = 18,
  WinTerminalServerSid = 19,
  WinRemoteLogonIdSid = 20,
  WinLogonIdsSid = 21,
  WinLocalSystemSid = 22,
  WinLocalServiceSid = 23,
  WinNetworkServiceSid = 24,
  WinBuiltinDomainSid = 25,
  WinBuiltinAdministratorsSid = 26,
  WinBuiltinUsersSid = 27,
  WinBuiltinGuestsSid = 28,
  WinBuiltinPowerUsersSid = 29,
  WinBuiltinAccountOperatorsSid = 30,
  WinBuiltinSystemOperatorsSid = 31,
  WinBuiltinPrintOperatorsSid = 32,
  WinBuiltinBackupOperatorsSid = 33,
  WinBuiltinReplicatorSid = 34,
  WinBuiltinPreWindows2000CompatibleAccessSid = 35,
  WinBuiltinRemoteDesktopUsersSid = 36,
  WinBuiltinNetworkConfigurationOperatorsSid = 37,
  WinAccountAdministratorSid = 38,
  WinAccountGuestSid = 39,
  WinAccountKrbtgtSid = 40,
  WinAccountDomainAdminsSid = 41,
  WinAccountDomainUsersSid = 42,
  WinAccountDomainGuestsSid = 43,
  WinAccountComputersSid = 44,
  WinAccountControllersSid = 45,
  WinAccountCertAdminsSid = 46,
  WinAccountSchemaAdminsSid = 47,
  WinAccountEnterpriseAdminsSid = 48,
  WinAccountPolicyAdminsSid = 49,
  WinAccountRasAndIasServersSid = 50,
  WinNTLMAuthenticationSid = 51,
  WinDigestAuthenticationSid = 52,
  WinSChannelAuthenticationSid = 53,
  WinThisOrganizationSid = 54,
  WinOtherOrganizationSid = 55,
  WinBuiltinIncomingForestTrustBuildersSid = 56,
  WinBuiltinPerfMonitoringUsersSid = 57,
  WinBuiltinPerfLoggingUsersSid = 58,
  WinBuiltinAuthorizationAccessSid = 59,
  WinBuiltinTerminalServerLicenseServersSid = 60,
  WinBuiltinDCOMUsersSid = 61,
  WinBuiltinIUsersSid = 62,
  WinIUserSid = 63,
  WinBuiltinCryptoOperatorsSid = 64,
  WinUntrustedLabelSid = 65,
  WinLowLabelSid = 66,
  WinMediumLabelSid = 67,
  WinHighLabelSid = 68,
  WinSystemLabelSid = 69,
  WinWriteRestrictedCodeSid = 70,
  WinCreatorOwnerRightsSid = 71,
  WinCacheablePrincipalsGroupSid = 72,
  WinNonCacheablePrincipalsGroupSid = 73,
  WinEnterpriseReadonlyControllersSid = 74,
  WinAccountReadonlyControllersSid = 75,
  WinBuiltinEventLogReadersGroup = 76,
  WinNewEnterpriseReadonlyControllersSid = 77,
  WinBuiltinCertSvcDComAccessGroup = 78,
  WinMediumPlusLabelSid = 79,
  WinLocalLogonSid = 80,
  WinConsoleLogonSid = 81,
  WinThisOrganizationCertificateSid = 82,
  WinApplicationPackageAuthoritySid = 83,
  WinBuiltinAnyPackageSid = 84,
  WinCapabilityInternetClientSid = 85,
  WinCapabilityInternetClientServerSid = 86,
  WinCapabilityPrivateNetworkClientServerSid = 87,
  WinCapabilityPicturesLibrarySid = 88,
  WinCapabilityVideosLibrarySid = 89,
  WinCapabilityMusicLibrarySid = 90,
  WinCapabilityDocumentsLibrarySid = 91,
  WinCapabilitySharedUserCertificatesSid = 92,
  WinCapabilityEnterpriseAuthenticationSid = 93,
  WinCapabilityRemovableStorageSid = 94,
  WinBuiltinRDSRemoteAccessServersSid = 95,
  WinBuiltinRDSEndpointServersSid = 96,
  WinBuiltinRDSManagementServersSid = 97,
  WinUserModeDriversSid = 98,
  WinBuiltinHyperVAdminsSid = 99,
  WinAccountCloneableControllersSid = 100,
  WinBuiltinAccessControlAssistanceOperatorsSid = 101,
  WinBuiltinRemoteManagementUsersSid = 102,
  WinAuthenticationAuthorityAssertedSid = 103,
  WinAuthenticationServiceAssertedSid = 104,
};

typedef struct _PS_SYSTEM_DLL_INIT_BLOCK
{
  /* 0x0000 */ unsigned long Size;
  /* 0x0004 */ unsigned long SystemDllWowRelocation;
  /* 0x0008 */ unsigned __int64 SystemDllNativeRelocation;
  /* 0x0010 */ unsigned long Wow64SharedInformation[16];
  /* 0x0050 */ unsigned long RngData;
  /* 0x0054 */ long Padding_7;
  /* 0x0058 */ unsigned __int64 MitigationOptions;
} PS_SYSTEM_DLL_INIT_BLOCK, *PPS_SYSTEM_DLL_INIT_BLOCK; /* size: 0x0060 */

enum VARENUM
{
  VT_EMPTY = 0,
  VT_NULL = 1,
  VT_I2 = 2,
  VT_I4 = 3,
  VT_R4 = 4,
  VT_R8 = 5,
  VT_CY = 6,
  VT_DATE = 7,
  VT_BSTR = 8,
  VT_DISPATCH = 9,
  VT_ERROR = 10,
  VT_BOOL = 11,
  VT_VARIANT = 12,
  VT_UNKNOWN = 13,
  VT_DECIMAL = 14,
  VT_I1 = 16,
  VT_UI1 = 17,
  VT_UI2 = 18,
  VT_UI4 = 19,
  VT_I8 = 20,
  VT_UI8 = 21,
  VT_INT = 22,
  VT_UINT = 23,
  VT_VOID = 24,
  VT_HRESULT = 25,
  VT_PTR = 26,
  VT_SAFEARRAY = 27,
  VT_CARRAY = 28,
  VT_USERDEFINED = 29,
  VT_LPSTR = 30,
  VT_LPWSTR = 31,
  VT_RECORD = 36,
  VT_INT_PTR = 37,
  VT_UINT_PTR = 38,
  VT_FILETIME = 64,
  VT_BLOB = 65,
  VT_STREAM = 66,
  VT_STORAGE = 67,
  VT_STREAMED_OBJECT = 68,
  VT_STORED_OBJECT = 69,
  VT_BLOB_OBJECT = 70,
  VT_CF = 71,
  VT_CLSID = 72,
  VT_VERSIONED_STREAM = 73,
  VT_BSTR_BLOB = 4095,
  VT_VECTOR = 4096,
  VT_ARRAY = 8192,
  VT_BYREF = 16384,
  VT_RESERVED = 0xffff8000,
  VT_ILLEGAL = 0xffffffff,
  VT_ILLEGALMASKED = 4095,
  VT_TYPEMASK = 4095,
};

class CInprocSystemActivator
{
}; /* size: 0x0008 */

typedef enum _TAG_UNNAMED_1
{
  WPP_VER_WIN2K_CB_FORWARD_PTR = 1,
  WPP_VER_WHISTLER_CB_FORWARD_PTR = 2,
  WPP_VER_LH_CB_FORWARD_PTR = 3,
} TAG_UNNAMED_1, *PTAG_UNNAMED_1;

typedef enum _PROCESSOR_CACHE_TYPE
{
  CacheUnified = 0,
  CacheInstruction = 1,
  CacheData = 2,
  CacheTrace = 3,
} PROCESSOR_CACHE_TYPE, *PPROCESSOR_CACHE_TYPE;

typedef struct _CACHE_DESCRIPTOR
{
  /* 0x0000 */ unsigned char Level;
  /* 0x0001 */ unsigned char Associativity;
  /* 0x0002 */ unsigned short LineSize;
  /* 0x0004 */ unsigned long Size;
  /* 0x0008 */ enum _PROCESSOR_CACHE_TYPE Type;
} CACHE_DESCRIPTOR, *PCACHE_DESCRIPTOR; /* size: 0x000c */

typedef struct _HTTPSPolicyCallbackData
{
  union
  {
    /* 0x0000 */ unsigned long cbStruct;
    /* 0x0000 */ unsigned long cbSize;
  }; /* size: 0x0004 */
  /* 0x0004 */ unsigned long dwAuthType;
  /* 0x0008 */ unsigned long fdwChecks;
  /* 0x000c */ long Padding_8;
  /* 0x0010 */ wchar_t* pwszServerName;
} HTTPSPolicyCallbackData, *PHTTPSPolicyCallbackData; /* size: 0x0018 */

enum POWER_ACTION
{
  PowerActionNone = 0,
  PowerActionReserved = 1,
  PowerActionSleep = 2,
  PowerActionHibernate = 3,
  PowerActionShutdown = 4,
  PowerActionShutdownReset = 5,
  PowerActionShutdownOff = 6,
  PowerActionWarmEject = 7,
};

struct IEncodingFilterFactory
{
}; /* size: 0x0008 */

typedef enum _RUNLEVEL
{
  RUNLEVEL_LUA = 0,
  RUNLEVEL_HIGHEST = 1,
  RUNLEVEL_ADMIN = 2,
  RUNLEVEL_MAX_NON_UIA = 3,
  RUNLEVEL_LUA_UIA = 16,
  RUNLEVEL_HIGHEST_UIA = 17,
  RUNLEVEL_ADMIN_UIA = 18,
  RUNLEVEL_MAX = 19,
} RUNLEVEL, *PRUNLEVEL;

struct Microsoft::WRL::CloakedIid<IMarshal>
{
}; /* size: 0x0008 */

struct IRootStorage
{
}; /* size: 0x0008 */

struct HMIDISTRM__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

typedef enum _PROCESS_MITIGATION_POLICY
{
  ProcessDEPPolicy = 0,
  ProcessASLRPolicy = 1,
  ProcessReserved1MitigationPolicy = 2,
  ProcessStrictHandleCheckPolicy = 3,
  ProcessSystemCallDisablePolicy = 4,
  ProcessMitigationOptionsMask = 5,
  ProcessExtensionPointDisablePolicy = 6,
  MaxProcessMitigationPolicy = 7,
} PROCESS_MITIGATION_POLICY, *PPROCESS_MITIGATION_POLICY;

enum SHSTOCKICONID
{
  SIID_DOCNOASSOC = 0,
  SIID_DOCASSOC = 1,
  SIID_APPLICATION = 2,
  SIID_FOLDER = 3,
  SIID_FOLDEROPEN = 4,
  SIID_DRIVE525 = 5,
  SIID_DRIVE35 = 6,
  SIID_DRIVEREMOVE = 7,
  SIID_DRIVEFIXED = 8,
  SIID_DRIVENET = 9,
  SIID_DRIVENETDISABLED = 10,
  SIID_DRIVECD = 11,
  SIID_DRIVERAM = 12,
  SIID_WORLD = 13,
  SIID_SERVER = 15,
  SIID_PRINTER = 16,
  SIID_MYNETWORK = 17,
  SIID_FIND = 22,
  SIID_HELP = 23,
  SIID_SHARE = 28,
  SIID_LINK = 29,
  SIID_SLOWFILE = 30,
  SIID_RECYCLER = 31,
  SIID_RECYCLERFULL = 32,
  SIID_MEDIACDAUDIO = 40,
  SIID_LOCK = 47,
  SIID_AUTOLIST = 49,
  SIID_PRINTERNET = 50,
  SIID_SERVERSHARE = 51,
  SIID_PRINTERFAX = 52,
  SIID_PRINTERFAXNET = 53,
  SIID_PRINTERFILE = 54,
  SIID_STACK = 55,
  SIID_MEDIASVCD = 56,
  SIID_STUFFEDFOLDER = 57,
  SIID_DRIVEUNKNOWN = 58,
  SIID_DRIVEDVD = 59,
  SIID_MEDIADVD = 60,
  SIID_MEDIADVDRAM = 61,
  SIID_MEDIADVDRW = 62,
  SIID_MEDIADVDR = 63,
  SIID_MEDIADVDROM = 64,
  SIID_MEDIACDAUDIOPLUS = 65,
  SIID_MEDIACDRW = 66,
  SIID_MEDIACDR = 67,
  SIID_MEDIACDBURN = 68,
  SIID_MEDIABLANKCD = 69,
  SIID_MEDIACDROM = 70,
  SIID_AUDIOFILES = 71,
  SIID_IMAGEFILES = 72,
  SIID_VIDEOFILES = 73,
  SIID_MIXEDFILES = 74,
  SIID_FOLDERBACK = 75,
  SIID_FOLDERFRONT = 76,
  SIID_SHIELD = 77,
  SIID_WARNING = 78,
  SIID_INFO = 79,
  SIID_ERROR = 80,
  SIID_KEY = 81,
  SIID_SOFTWARE = 82,
  SIID_RENAME = 83,
  SIID_DELETE = 84,
  SIID_MEDIAAUDIODVD = 85,
  SIID_MEDIAMOVIEDVD = 86,
  SIID_MEDIAENHANCEDCD = 87,
  SIID_MEDIAENHANCEDDVD = 88,
  SIID_MEDIAHDDVD = 89,
  SIID_MEDIABLURAY = 90,
  SIID_MEDIAVCD = 91,
  SIID_MEDIADVDPLUSR = 92,
  SIID_MEDIADVDPLUSRW = 93,
  SIID_DESKTOPPC = 94,
  SIID_MOBILEPC = 95,
  SIID_USERS = 96,
  SIID_MEDIASMARTMEDIA = 97,
  SIID_MEDIACOMPACTFLASH = 98,
  SIID_DEVICECELLPHONE = 99,
  SIID_DEVICECAMERA = 100,
  SIID_DEVICEVIDEOCAMERA = 101,
  SIID_DEVICEAUDIOPLAYER = 102,
  SIID_NETWORKCONNECT = 103,
  SIID_INTERNET = 104,
  SIID_ZIPFILE = 105,
  SIID_SETTINGS = 106,
  SIID_DRIVEHDDVD = 132,
  SIID_DRIVEBD = 133,
  SIID_MEDIAHDDVDROM = 134,
  SIID_MEDIAHDDVDR = 135,
  SIID_MEDIAHDDVDRAM = 136,
  SIID_MEDIABDROM = 137,
  SIID_MEDIABDR = 138,
  SIID_MEDIABDRE = 139,
  SIID_CLUSTEREDDRIVE = 140,
  SIID_MAX_ICONS = 175,
};

typedef struct _MESSAGE_RESOURCE_BLOCK
{
  /* 0x0000 */ unsigned long LowId;
  /* 0x0004 */ unsigned long HighId;
  /* 0x0008 */ unsigned long OffsetToEntries;
} MESSAGE_RESOURCE_BLOCK, *PMESSAGE_RESOURCE_BLOCK; /* size: 0x000c */

typedef struct _GET_CHANGER_PARAMETERS
{
  /* 0x0000 */ unsigned long Size;
  /* 0x0004 */ unsigned short NumberTransportElements;
  /* 0x0006 */ unsigned short NumberStorageElements;
  /* 0x0008 */ unsigned short NumberCleanerSlots;
  /* 0x000a */ unsigned short NumberIEElements;
  /* 0x000c */ unsigned short NumberDataTransferElements;
  /* 0x000e */ unsigned short NumberOfDoors;
  /* 0x0010 */ unsigned short FirstSlotNumber;
  /* 0x0012 */ unsigned short FirstDriveNumber;
  /* 0x0014 */ unsigned short FirstTransportNumber;
  /* 0x0016 */ unsigned short FirstIEPortNumber;
  /* 0x0018 */ unsigned short FirstCleanerSlotAddress;
  /* 0x001a */ unsigned short MagazineSize;
  /* 0x001c */ unsigned long DriveCleanTimeout;
  /* 0x0020 */ unsigned long Features0;
  /* 0x0024 */ unsigned long Features1;
  /* 0x0028 */ unsigned char MoveFromTransport;
  /* 0x0029 */ unsigned char MoveFromSlot;
  /* 0x002a */ unsigned char MoveFromIePort;
  /* 0x002b */ unsigned char MoveFromDrive;
  /* 0x002c */ unsigned char ExchangeFromTransport;
  /* 0x002d */ unsigned char ExchangeFromSlot;
  /* 0x002e */ unsigned char ExchangeFromIePort;
  /* 0x002f */ unsigned char ExchangeFromDrive;
  /* 0x0030 */ unsigned char LockUnlockCapabilities;
  /* 0x0031 */ unsigned char PositionCapabilities;
  /* 0x0032 */ unsigned char Reserved1[2];
  /* 0x0034 */ unsigned long Reserved2[2];
} GET_CHANGER_PARAMETERS, *PGET_CHANGER_PARAMETERS; /* size: 0x003c */

typedef enum _PRINTER_OPTION_FLAGS
{
  PRINTER_OPTION_NO_CACHE = 1,
  PRINTER_OPTION_CACHE = 2,
  PRINTER_OPTION_CLIENT_CHANGE = 4,
  PRINTER_OPTION_NO_CLIENT_DATA = 8,
} PRINTER_OPTION_FLAGS, *PPRINTER_OPTION_FLAGS;

enum HASHALGORITHM_ENUM
{
  DSA_HASH_ALGORITHM_SHA1 = 0,
  DSA_HASH_ALGORITHM_SHA256 = 1,
  DSA_HASH_ALGORITHM_SHA512 = 2,
};

enum DSAFIPSVERSION_ENUM
{
  DSA_FIPS186_2 = 0,
  DSA_FIPS186_3 = 1,
};

typedef struct _BCRYPT_DSA_KEY_BLOB_V2
{
  /* 0x0000 */ unsigned long dwMagic;
  /* 0x0004 */ unsigned long cbKey;
  /* 0x0008 */ enum HASHALGORITHM_ENUM hashAlgorithm;
  /* 0x000c */ enum DSAFIPSVERSION_ENUM standardVersion;
  /* 0x0010 */ unsigned long cbSeedLength;
  /* 0x0014 */ unsigned long cbGroupSize;
  /* 0x0018 */ unsigned char Count[4];
} BCRYPT_DSA_KEY_BLOB_V2, *PBCRYPT_DSA_KEY_BLOB_V2; /* size: 0x001c */

struct IDebug
{
}; /* size: 0x0008 */

typedef struct _RTL_BITMAP
{
  /* 0x0000 */ unsigned long SizeOfBitMap;
  /* 0x0004 */ long Padding_9;
  /* 0x0008 */ unsigned long* Buffer;
} RTL_BITMAP, *PRTL_BITMAP; /* size: 0x0010 */

typedef enum _tagQUERYOPTION
{
  QUERY_EXPIRATION_DATE = 1,
  QUERY_TIME_OF_LAST_CHANGE = 2,
  QUERY_CONTENT_ENCODING = 3,
  QUERY_CONTENT_TYPE = 4,
  QUERY_REFRESH = 5,
  QUERY_RECOMBINE = 6,
  QUERY_CAN_NAVIGATE = 7,
  QUERY_USES_NETWORK = 8,
  QUERY_IS_CACHED = 9,
  QUERY_IS_INSTALLEDENTRY = 10,
  QUERY_IS_CACHED_OR_MAPPED = 11,
  QUERY_USES_CACHE = 12,
  QUERY_IS_SECURE = 13,
  QUERY_IS_SAFE = 14,
  QUERY_USES_HISTORYFOLDER = 15,
  QUERY_IS_CACHED_AND_USABLE_OFFLINE = 16,
} tagQUERYOPTION, *PtagQUERYOPTION;

typedef struct _ALPC_CONTEXT_ATTR
{
  /* 0x0000 */ void* PortContext;
  /* 0x0008 */ void* MessageContext;
  /* 0x0010 */ unsigned long Sequence;
  /* 0x0014 */ unsigned long MessageId;
  /* 0x0018 */ unsigned long CallbackId;
  /* 0x001c */ long __PADDING__[1];
} ALPC_CONTEXT_ATTR, *PALPC_CONTEXT_ATTR; /* size: 0x0020 */

struct PACKAGE_VERSION
{
  union
  {
    /* 0x0000 */ unsigned __int64 Version;
    struct
    {
      /* 0x0000 */ unsigned short Revision;
      /* 0x0002 */ unsigned short Build;
      /* 0x0004 */ unsigned short Minor;
      /* 0x0006 */ unsigned short Major;
    }; /* size: 0x0008 */
  }; /* size: 0x0008 */
}; /* size: 0x0008 */

struct PACKAGE_ID
{
  /* 0x0000 */ unsigned int reserved;
  /* 0x0004 */ unsigned int processorArchitecture;
  /* 0x0008 */ struct PACKAGE_VERSION version;
  /* 0x0010 */ wchar_t* name;
  /* 0x0018 */ wchar_t* publisher;
  /* 0x0020 */ wchar_t* resourceId;
  /* 0x0028 */ wchar_t* publisherId;
}; /* size: 0x0030 */

typedef enum _COPYFILE2_MESSAGE_TYPE
{
  COPYFILE2_CALLBACK_NONE = 0,
  COPYFILE2_CALLBACK_CHUNK_STARTED = 1,
  COPYFILE2_CALLBACK_CHUNK_FINISHED = 2,
  COPYFILE2_CALLBACK_STREAM_STARTED = 3,
  COPYFILE2_CALLBACK_STREAM_FINISHED = 4,
  COPYFILE2_CALLBACK_POLL_CONTINUE = 5,
  COPYFILE2_CALLBACK_ERROR = 6,
  COPYFILE2_CALLBACK_MAX = 7,
} COPYFILE2_MESSAGE_TYPE, *PCOPYFILE2_MESSAGE_TYPE;

typedef struct _BCRYPT_DSA_PARAMETER_HEADER_V2
{
  /* 0x0000 */ unsigned long cbLength;
  /* 0x0004 */ unsigned long dwMagic;
  /* 0x0008 */ unsigned long cbKeyLength;
  /* 0x000c */ enum HASHALGORITHM_ENUM hashAlgorithm;
  /* 0x0010 */ enum DSAFIPSVERSION_ENUM standardVersion;
  /* 0x0014 */ unsigned long cbSeedLength;
  /* 0x0018 */ unsigned long cbGroupSize;
  /* 0x001c */ unsigned char Count[4];
} BCRYPT_DSA_PARAMETER_HEADER_V2, *PBCRYPT_DSA_PARAMETER_HEADER_V2; /* size: 0x0020 */

typedef struct _RPC_MESSAGE
{
  /* 0x0000 */ void* Handle;
  /* 0x0008 */ unsigned long DataRepresentation;
  /* 0x000c */ long Padding_10;
  /* 0x0010 */ void* Buffer;
  /* 0x0018 */ unsigned int BufferLength;
  /* 0x001c */ unsigned int ProcNum;
  /* 0x0020 */ struct _RPC_SYNTAX_IDENTIFIER* TransferSyntax;
  /* 0x0028 */ void* RpcInterfaceInformation;
  /* 0x0030 */ void* ReservedForRuntime;
  /* 0x0038 */ void* ManagerEpv;
  /* 0x0040 */ void* ImportContext;
  /* 0x0048 */ unsigned long RpcFlags;
  /* 0x004c */ long __PADDING__[1];
} RPC_MESSAGE, *PRPC_MESSAGE; /* size: 0x0050 */

typedef union _LARGE_INTEGER
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned long LowPart;
      /* 0x0004 */ long HighPart;
    }; /* size: 0x0008 */
    struct
    {
      /* 0x0000 */ unsigned long LowPart;
      /* 0x0004 */ long HighPart;
    } /* size: 0x0008 */ u;
    /* 0x0000 */ __int64 QuadPart;
  }; /* size: 0x0008 */
} LARGE_INTEGER, *PLARGE_INTEGER; /* size: 0x0008 */

typedef struct _FILE_ID_FULL_DIR_INFORMATION
{
  /* 0x0000 */ unsigned long NextEntryOffset;
  /* 0x0004 */ unsigned long FileIndex;
  /* 0x0008 */ union _LARGE_INTEGER CreationTime;
  /* 0x0010 */ union _LARGE_INTEGER LastAccessTime;
  /* 0x0018 */ union _LARGE_INTEGER LastWriteTime;
  /* 0x0020 */ union _LARGE_INTEGER ChangeTime;
  /* 0x0028 */ union _LARGE_INTEGER EndOfFile;
  /* 0x0030 */ union _LARGE_INTEGER AllocationSize;
  /* 0x0038 */ unsigned long FileAttributes;
  /* 0x003c */ unsigned long FileNameLength;
  /* 0x0040 */ unsigned long EaSize;
  /* 0x0044 */ long Padding_11;
  /* 0x0048 */ union _LARGE_INTEGER FileId;
  /* 0x0050 */ wchar_t FileName[1];
  /* 0x0052 */ char __PADDING__[6];
} FILE_ID_FULL_DIR_INFORMATION, *PFILE_ID_FULL_DIR_INFORMATION; /* size: 0x0058 */

enum ACTIVATION_PROPERTIES::eFlags
{
  fFOR_SCM = 1,
  fSURROGATE = 4,
  fDO_NOT_LOAD = 8,
  fRELOAD_DARWIN = 16,
  fLSVR_ONLY = 32,
};

struct tagNEWTEXTMETRICA
{
  /* 0x0000 */ long tmHeight;
  /* 0x0004 */ long tmAscent;
  /* 0x0008 */ long tmDescent;
  /* 0x000c */ long tmInternalLeading;
  /* 0x0010 */ long tmExternalLeading;
  /* 0x0014 */ long tmAveCharWidth;
  /* 0x0018 */ long tmMaxCharWidth;
  /* 0x001c */ long tmWeight;
  /* 0x0020 */ long tmOverhang;
  /* 0x0024 */ long tmDigitizedAspectX;
  /* 0x0028 */ long tmDigitizedAspectY;
  /* 0x002c */ unsigned char tmFirstChar;
  /* 0x002d */ unsigned char tmLastChar;
  /* 0x002e */ unsigned char tmDefaultChar;
  /* 0x002f */ unsigned char tmBreakChar;
  /* 0x0030 */ unsigned char tmItalic;
  /* 0x0031 */ unsigned char tmUnderlined;
  /* 0x0032 */ unsigned char tmStruckOut;
  /* 0x0033 */ unsigned char tmPitchAndFamily;
  /* 0x0034 */ unsigned char tmCharSet;
  /* 0x0035 */ char Padding_12[3];
  /* 0x0038 */ unsigned long ntmFlags;
  /* 0x003c */ unsigned int ntmSizeEM;
  /* 0x0040 */ unsigned int ntmCellHeight;
  /* 0x0044 */ unsigned int ntmAvgWidth;
}; /* size: 0x0048 */

struct tagFONTSIGNATURE
{
  /* 0x0000 */ unsigned long fsUsb[4];
  /* 0x0010 */ unsigned long fsCsb[2];
}; /* size: 0x0018 */

struct tagNEWTEXTMETRICEXA
{
  /* 0x0000 */ struct tagNEWTEXTMETRICA ntmTm;
  /* 0x0048 */ struct tagFONTSIGNATURE ntmFontSig;
}; /* size: 0x0060 */

class CMSFHeaderData
{
  /* 0x0000 */ long Padding_13[19];
  /* 0x004c */ unsigned long _sectFat[109];
}; /* size: 0x0200 */

class CMSFHeader
{
  /* 0x0000 */ class CMSFHeaderData _hdr;
  /* 0x0200 */ int _fDirty;
}; /* size: 0x0204 */

struct CSimpStorage
{
  /* 0x0000 */ long Padding_14[14];
  /* 0x0038 */ long _cReferences;
  /* 0x003c */ long Padding_15;
  /* 0x0040 */ void* _hFile;
  /* 0x0048 */ int _fDirty;
  /* 0x004c */ class CMSFHeader _hdr;
  /* 0x0250 */ unsigned char* _pbBuf;
  /* 0x0258 */ unsigned long _sectMax;
  /* 0x025c */ struct _GUID _clsid;
  /* 0x026c */ long Padding_16;
  /* 0x0270 */ class CDfNameList* _pdfl;
  /* 0x0278 */ class CDfNameList* _pdflCurrent;
  /* 0x0280 */ unsigned long _cStreams;
  /* 0x0284 */ long __PADDING__[1];
}; /* size: 0x0288 */

typedef struct _EVENTLOGRECORD
{
  /* 0x0000 */ unsigned long Length;
  /* 0x0004 */ unsigned long Reserved;
  /* 0x0008 */ unsigned long RecordNumber;
  /* 0x000c */ unsigned long TimeGenerated;
  /* 0x0010 */ unsigned long TimeWritten;
  /* 0x0014 */ unsigned long EventID;
  /* 0x0018 */ unsigned short EventType;
  /* 0x001a */ unsigned short NumStrings;
  /* 0x001c */ unsigned short EventCategory;
  /* 0x001e */ unsigned short ReservedFlags;
  /* 0x0020 */ unsigned long ClosingRecordNumber;
  /* 0x0024 */ unsigned long StringOffset;
  /* 0x0028 */ unsigned long UserSidLength;
  /* 0x002c */ unsigned long UserSidOffset;
  /* 0x0030 */ unsigned long DataLength;
  /* 0x0034 */ unsigned long DataOffset;
} EVENTLOGRECORD, *PEVENTLOGRECORD; /* size: 0x0038 */

enum SYSGEOTYPE
{
  GEO_NATION = 1,
  GEO_LATITUDE = 2,
  GEO_LONGITUDE = 3,
  GEO_ISO2 = 4,
  GEO_ISO3 = 5,
  GEO_RFC1766 = 6,
  GEO_LCID = 7,
  GEO_FRIENDLYNAME = 8,
  GEO_OFFICIALNAME = 9,
  GEO_TIMEZONES = 10,
  GEO_OFFICIALLANGUAGES = 11,
  GEO_ISO_UN_NUMBER = 12,
  GEO_PARENT = 13,
};

typedef struct _RTL_QUERY_DEBUG_INFORMATION_INFO
{
  /* 0x0000 */ unsigned long UniqueProcessId;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ unsigned __int64 Buffer;
} RTL_QUERY_DEBUG_INFORMATION_INFO, *PRTL_QUERY_DEBUG_INFORMATION_INFO; /* size: 0x0010 */

typedef enum _DPFLTR_TYPE
{
  DPFLTR_SYSTEM_ID = 0,
  DPFLTR_SMSS_ID = 1,
  DPFLTR_SETUP_ID = 2,
  DPFLTR_NTFS_ID = 3,
  DPFLTR_FSTUB_ID = 4,
  DPFLTR_CRASHDUMP_ID = 5,
  DPFLTR_CDAUDIO_ID = 6,
  DPFLTR_CDROM_ID = 7,
  DPFLTR_CLASSPNP_ID = 8,
  DPFLTR_DISK_ID = 9,
  DPFLTR_REDBOOK_ID = 10,
  DPFLTR_STORPROP_ID = 11,
  DPFLTR_SCSIPORT_ID = 12,
  DPFLTR_SCSIMINIPORT_ID = 13,
  DPFLTR_CONFIG_ID = 14,
  DPFLTR_I8042PRT_ID = 15,
  DPFLTR_SERMOUSE_ID = 16,
  DPFLTR_LSERMOUS_ID = 17,
  DPFLTR_KBDHID_ID = 18,
  DPFLTR_MOUHID_ID = 19,
  DPFLTR_KBDCLASS_ID = 20,
  DPFLTR_MOUCLASS_ID = 21,
  DPFLTR_TWOTRACK_ID = 22,
  DPFLTR_WMILIB_ID = 23,
  DPFLTR_ACPI_ID = 24,
  DPFLTR_AMLI_ID = 25,
  DPFLTR_HALIA64_ID = 26,
  DPFLTR_VIDEO_ID = 27,
  DPFLTR_SVCHOST_ID = 28,
  DPFLTR_VIDEOPRT_ID = 29,
  DPFLTR_TCPIP_ID = 30,
  DPFLTR_DMSYNTH_ID = 31,
  DPFLTR_NTOSPNP_ID = 32,
  DPFLTR_FASTFAT_ID = 33,
  DPFLTR_SAMSS_ID = 34,
  DPFLTR_PNPMGR_ID = 35,
  DPFLTR_NETAPI_ID = 36,
  DPFLTR_SCSERVER_ID = 37,
  DPFLTR_SCCLIENT_ID = 38,
  DPFLTR_SERIAL_ID = 39,
  DPFLTR_SERENUM_ID = 40,
  DPFLTR_UHCD_ID = 41,
  DPFLTR_RPCPROXY_ID = 42,
  DPFLTR_AUTOCHK_ID = 43,
  DPFLTR_DCOMSS_ID = 44,
  DPFLTR_UNIMODEM_ID = 45,
  DPFLTR_SIS_ID = 46,
  DPFLTR_FLTMGR_ID = 47,
  DPFLTR_WMICORE_ID = 48,
  DPFLTR_BURNENG_ID = 49,
  DPFLTR_IMAPI_ID = 50,
  DPFLTR_SXS_ID = 51,
  DPFLTR_FUSION_ID = 52,
  DPFLTR_IDLETASK_ID = 53,
  DPFLTR_SOFTPCI_ID = 54,
  DPFLTR_TAPE_ID = 55,
  DPFLTR_MCHGR_ID = 56,
  DPFLTR_IDEP_ID = 57,
  DPFLTR_PCIIDE_ID = 58,
  DPFLTR_FLOPPY_ID = 59,
  DPFLTR_FDC_ID = 60,
  DPFLTR_TERMSRV_ID = 61,
  DPFLTR_W32TIME_ID = 62,
  DPFLTR_PREFETCHER_ID = 63,
  DPFLTR_RSFILTER_ID = 64,
  DPFLTR_FCPORT_ID = 65,
  DPFLTR_PCI_ID = 66,
  DPFLTR_DMIO_ID = 67,
  DPFLTR_DMCONFIG_ID = 68,
  DPFLTR_DMADMIN_ID = 69,
  DPFLTR_WSOCKTRANSPORT_ID = 70,
  DPFLTR_VSS_ID = 71,
  DPFLTR_PNPMEM_ID = 72,
  DPFLTR_PROCESSOR_ID = 73,
  DPFLTR_DMSERVER_ID = 74,
  DPFLTR_SR_ID = 75,
  DPFLTR_INFINIBAND_ID = 76,
  DPFLTR_IHVDRIVER_ID = 77,
  DPFLTR_IHVVIDEO_ID = 78,
  DPFLTR_IHVAUDIO_ID = 79,
  DPFLTR_IHVNETWORK_ID = 80,
  DPFLTR_IHVSTREAMING_ID = 81,
  DPFLTR_IHVBUS_ID = 82,
  DPFLTR_HPS_ID = 83,
  DPFLTR_RTLTHREADPOOL_ID = 84,
  DPFLTR_LDR_ID = 85,
  DPFLTR_TCPIP6_ID = 86,
  DPFLTR_ISAPNP_ID = 87,
  DPFLTR_SHPC_ID = 88,
  DPFLTR_STORPORT_ID = 89,
  DPFLTR_STORMINIPORT_ID = 90,
  DPFLTR_PRINTSPOOLER_ID = 91,
  DPFLTR_VSSDYNDISK_ID = 92,
  DPFLTR_VERIFIER_ID = 93,
  DPFLTR_VDS_ID = 94,
  DPFLTR_VDSBAS_ID = 95,
  DPFLTR_VDSDYN_ID = 96,
  DPFLTR_VDSDYNDR_ID = 97,
  DPFLTR_VDSLDR_ID = 98,
  DPFLTR_VDSUTIL_ID = 99,
  DPFLTR_DFRGIFC_ID = 100,
  DPFLTR_DEFAULT_ID = 101,
  DPFLTR_MM_ID = 102,
  DPFLTR_DFSC_ID = 103,
  DPFLTR_WOW64_ID = 104,
  DPFLTR_ALPC_ID = 105,
  DPFLTR_WDI_ID = 106,
  DPFLTR_PERFLIB_ID = 107,
  DPFLTR_KTM_ID = 108,
  DPFLTR_IOSTRESS_ID = 109,
  DPFLTR_HEAP_ID = 110,
  DPFLTR_WHEA_ID = 111,
  DPFLTR_USERGDI_ID = 112,
  DPFLTR_MMCSS_ID = 113,
  DPFLTR_TPM_ID = 114,
  DPFLTR_THREADORDER_ID = 115,
  DPFLTR_ENVIRON_ID = 116,
  DPFLTR_EMS_ID = 117,
  DPFLTR_WDT_ID = 118,
  DPFLTR_FVEVOL_ID = 119,
  DPFLTR_NDIS_ID = 120,
  DPFLTR_NVCTRACE_ID = 121,
  DPFLTR_LUAFV_ID = 122,
  DPFLTR_APPCOMPAT_ID = 123,
  DPFLTR_USBSTOR_ID = 124,
  DPFLTR_SBP2PORT_ID = 125,
  DPFLTR_COVERAGE_ID = 126,
  DPFLTR_CACHEMGR_ID = 127,
  DPFLTR_MOUNTMGR_ID = 128,
  DPFLTR_CFR_ID = 129,
  DPFLTR_TXF_ID = 130,
  DPFLTR_KSECDD_ID = 131,
  DPFLTR_FLTREGRESS_ID = 132,
  DPFLTR_MPIO_ID = 133,
  DPFLTR_MSDSM_ID = 134,
  DPFLTR_UDFS_ID = 135,
  DPFLTR_PSHED_ID = 136,
  DPFLTR_STORVSP_ID = 137,
  DPFLTR_LSASS_ID = 138,
  DPFLTR_SSPICLI_ID = 139,
  DPFLTR_CNG_ID = 140,
  DPFLTR_EXFAT_ID = 141,
  DPFLTR_FILETRACE_ID = 142,
  DPFLTR_XSAVE_ID = 143,
  DPFLTR_SE_ID = 144,
  DPFLTR_DRIVEEXTENDER_ID = 145,
  DPFLTR_POWER_ID = 146,
  DPFLTR_CRASHDUMPXHCI_ID = 147,
  DPFLTR_GPIO_ID = 148,
  DPFLTR_REFS_ID = 149,
  DPFLTR_ENDOFTABLE_ID = 150,
} DPFLTR_TYPE, *PDPFLTR_TYPE;

class Microsoft::WRL::Details::ComPtrRefBase<Microsoft::WRL::ComPtr<ClipboardDataObjectTask> >
{
  /* 0x0000 */ class Microsoft::WRL::ComPtr<ClipboardDataObjectTask>* ptr_;
}; /* size: 0x0008 */

typedef struct _FILETIME
{
  /* 0x0000 */ unsigned long dwLowDateTime;
  /* 0x0004 */ unsigned long dwHighDateTime;
} FILETIME, *PFILETIME; /* size: 0x0008 */

typedef struct _DRIVER_INFO_8W
{
  /* 0x0000 */ unsigned long cVersion;
  /* 0x0004 */ long Padding_17;
  /* 0x0008 */ wchar_t* pName;
  /* 0x0010 */ wchar_t* pEnvironment;
  /* 0x0018 */ wchar_t* pDriverPath;
  /* 0x0020 */ wchar_t* pDataFile;
  /* 0x0028 */ wchar_t* pConfigFile;
  /* 0x0030 */ wchar_t* pHelpFile;
  /* 0x0038 */ wchar_t* pDependentFiles;
  /* 0x0040 */ wchar_t* pMonitorName;
  /* 0x0048 */ wchar_t* pDefaultDataType;
  /* 0x0050 */ wchar_t* pszzPreviousNames;
  /* 0x0058 */ struct _FILETIME ftDriverDate;
  /* 0x0060 */ unsigned __int64 dwlDriverVersion;
  /* 0x0068 */ wchar_t* pszMfgName;
  /* 0x0070 */ wchar_t* pszOEMUrl;
  /* 0x0078 */ wchar_t* pszHardwareID;
  /* 0x0080 */ wchar_t* pszProvider;
  /* 0x0088 */ wchar_t* pszPrintProcessor;
  /* 0x0090 */ wchar_t* pszVendorSetup;
  /* 0x0098 */ wchar_t* pszzColorProfiles;
  /* 0x00a0 */ wchar_t* pszInfPath;
  /* 0x00a8 */ unsigned long dwPrinterDriverAttributes;
  /* 0x00ac */ long Padding_18;
  /* 0x00b0 */ wchar_t* pszzCoreDriverDependencies;
  /* 0x00b8 */ struct _FILETIME ftMinInboxDriverVerDate;
  /* 0x00c0 */ unsigned __int64 dwlMinInboxDriverVerVersion;
} DRIVER_INFO_8W, *PDRIVER_INFO_8W; /* size: 0x00c8 */

enum APPLICATION_VIEW_STATE
{
  AVS_FULLSCREEN_LANDSCAPE = 0,
  AVS_FILLED = 1,
  AVS_SNAPPED = 2,
  AVS_FULLSCREEN_PORTRAIT = 3,
};

enum DISPLAYCONFIG_DEVICE_INFO_TYPE
{
  DISPLAYCONFIG_DEVICE_INFO_GET_SOURCE_NAME = 1,
  DISPLAYCONFIG_DEVICE_INFO_GET_TARGET_NAME = 2,
  DISPLAYCONFIG_DEVICE_INFO_GET_TARGET_PREFERRED_MODE = 3,
  DISPLAYCONFIG_DEVICE_INFO_GET_ADAPTER_NAME = 4,
  DISPLAYCONFIG_DEVICE_INFO_SET_TARGET_PERSISTENCE = 5,
  DISPLAYCONFIG_DEVICE_INFO_FORCE_UINT32 = -1,
};

typedef struct _LUID
{
  /* 0x0000 */ unsigned long LowPart;
  /* 0x0004 */ long HighPart;
} LUID, *PLUID; /* size: 0x0008 */

struct DISPLAYCONFIG_DEVICE_INFO_HEADER
{
  /* 0x0000 */ enum DISPLAYCONFIG_DEVICE_INFO_TYPE type;
  /* 0x0004 */ unsigned int size;
  /* 0x0008 */ struct _LUID adapterId;
  /* 0x0010 */ unsigned int id;
}; /* size: 0x0014 */

struct DISPLAYCONFIG_ADAPTER_NAME
{
  /* 0x0000 */ struct DISPLAYCONFIG_DEVICE_INFO_HEADER header;
  /* 0x0014 */ wchar_t adapterDevicePath[128];
}; /* size: 0x0114 */

struct _TP_JOB;

typedef enum _PS_ATTRIBUTE_NUM
{
  PsAttributeParentProcess = 0,
  PsAttributeDebugObject = 1,
  PsAttributeToken = 2,
  PsAttributeClientId = 3,
  PsAttributeTebAddress = 4,
  PsAttributeImageName = 5,
  PsAttributeImageInfo = 6,
  PsAttributeMemoryReserve = 7,
  PsAttributePriorityClass = 8,
  PsAttributeErrorMode = 9,
  PsAttributeStdHandleInfo = 10,
  PsAttributeHandleList = 11,
  PsAttributeGroupAffinity = 12,
  PsAttributePreferredNode = 13,
  PsAttributeIdealProcessor = 14,
  PsAttributeUmsThread = 15,
  PsAttributeMitigationOptions = 16,
  PsAttributeMax = 17,
} PS_ATTRIBUTE_NUM, *PPS_ATTRIBUTE_NUM;

struct IWrappedProtocol
{
}; /* size: 0x0008 */

typedef struct _SCARD_IO_REQUEST
{
  /* 0x0000 */ unsigned long dwProtocol;
  /* 0x0004 */ unsigned long cbPciLength;
} SCARD_IO_REQUEST, *PSCARD_IO_REQUEST; /* size: 0x0008 */

struct SCARD_T0_COMMAND
{
  /* 0x0000 */ unsigned char bCla;
  /* 0x0001 */ unsigned char bIns;
  /* 0x0002 */ unsigned char bP1;
  /* 0x0003 */ unsigned char bP2;
  /* 0x0004 */ unsigned char bP3;
}; /* size: 0x0005 */

struct SCARD_T0_REQUEST
{
  /* 0x0000 */ struct _SCARD_IO_REQUEST ioRequest;
  /* 0x0008 */ unsigned char bSw1;
  /* 0x0009 */ unsigned char bSw2;
  union
  {
    /* 0x000a */ struct SCARD_T0_COMMAND CmdBytes;
    /* 0x000a */ unsigned char rgbHeader[5];
  }; /* size: 0x0005 */
  /* 0x000f */ char __PADDING__[1];
}; /* size: 0x0010 */

typedef enum _PROCESSINFOCLASS
{
  ProcessBasicInformation = 0,
  ProcessQuotaLimits = 1,
  ProcessIoCounters = 2,
  ProcessVmCounters = 3,
  ProcessTimes = 4,
  ProcessBasePriority = 5,
  ProcessRaisePriority = 6,
  ProcessDebugPort = 7,
  ProcessExceptionPort = 8,
  ProcessAccessToken = 9,
  ProcessLdtInformation = 10,
  ProcessLdtSize = 11,
  ProcessDefaultHardErrorMode = 12,
  ProcessIoPortHandlers = 13,
  ProcessPooledUsageAndLimits = 14,
  ProcessWorkingSetWatch = 15,
  ProcessUserModeIOPL = 16,
  ProcessEnableAlignmentFaultFixup = 17,
  ProcessPriorityClass = 18,
  ProcessWx86Information = 19,
  ProcessHandleCount = 20,
  ProcessAffinityMask = 21,
  ProcessPriorityBoost = 22,
  ProcessDeviceMap = 23,
  ProcessSessionInformation = 24,
  ProcessForegroundInformation = 25,
  ProcessWow64Information = 26,
  ProcessImageFileName = 27,
  ProcessLUIDDeviceMapsEnabled = 28,
  ProcessBreakOnTermination = 29,
  ProcessDebugObjectHandle = 30,
  ProcessDebugFlags = 31,
  ProcessHandleTracing = 32,
  ProcessIoPriority = 33,
  ProcessExecuteFlags = 34,
  ProcessTlsInformation = 35,
  ProcessCookie = 36,
  ProcessImageInformation = 37,
  ProcessCycleTime = 38,
  ProcessPagePriority = 39,
  ProcessInstrumentationCallback = 40,
  ProcessThreadStackAllocation = 41,
  ProcessWorkingSetWatchEx = 42,
  ProcessImageFileNameWin32 = 43,
  ProcessImageFileMapping = 44,
  ProcessAffinityUpdateMode = 45,
  ProcessMemoryAllocationMode = 46,
  ProcessGroupInformation = 47,
  ProcessTokenVirtualizationEnabled = 48,
  ProcessConsoleHostProcess = 49,
  ProcessWindowInformation = 50,
  ProcessHandleInformation = 51,
  ProcessMitigationPolicy = 52,
  ProcessDynamicFunctionTableInformation = 53,
  ProcessHandleCheckingMode = 54,
  ProcessKeepAliveCount = 55,
  ProcessRevokeFileHandles = 56,
  ProcessWorkingSetControl = 57,
  MaxProcessInfoClass = 58,
} PROCESSINFOCLASS, *PPROCESSINFOCLASS;

struct tagMDINEXTMENU
{
  /* 0x0000 */ struct HMENU__* hmenuIn;
  /* 0x0008 */ struct HMENU__* hmenuNext;
  /* 0x0010 */ struct HWND__* hwndNext;
}; /* size: 0x0018 */

typedef enum _WPP_FLAG_LEN_ENUM_MAX
{
  WPP_MAX_FLAG_LEN_CHECK = 1,
} WPP_FLAG_LEN_ENUM_MAX, *PWPP_FLAG_LEN_ENUM_MAX;

typedef struct _FILE_ATTRIBUTE_CACHE_VALUE
{
  /* 0x0000 */ long Status;
  /* 0x0004 */ unsigned short Size;
  /* 0x0006 */ unsigned short RequiredSize;
  /* 0x0008 */ unsigned char Data[1];
  /* 0x0009 */ char __PADDING__[3];
} FILE_ATTRIBUTE_CACHE_VALUE, *PFILE_ATTRIBUTE_CACHE_VALUE; /* size: 0x000c */

typedef struct _FILE_ATTRIBUTE_CACHE_PAIR
{
  /* 0x0000 */ wchar_t Name[100];
  /* 0x00c8 */ struct _FILE_ATTRIBUTE_CACHE_VALUE Value;
} FILE_ATTRIBUTE_CACHE_PAIR, *PFILE_ATTRIBUTE_CACHE_PAIR; /* size: 0x00d4 */

typedef struct _FILE_ATTRIBUTE_CACHE_VALUES
{
  /* 0x0000 */ unsigned long Flags;
  /* 0x0004 */ unsigned long NumberOfValues;
  /* 0x0008 */ struct _FILE_ATTRIBUTE_CACHE_PAIR Attributes[1];
} FILE_ATTRIBUTE_CACHE_VALUES, *PFILE_ATTRIBUTE_CACHE_VALUES; /* size: 0x00dc */

typedef struct _CRYPT_PASSWORD_CREDENTIALSW
{
  /* 0x0000 */ unsigned long cbSize;
  /* 0x0004 */ long Padding_19;
  /* 0x0008 */ wchar_t* pszUsername;
  /* 0x0010 */ wchar_t* pszPassword;
} CRYPT_PASSWORD_CREDENTIALSW, *PCRYPT_PASSWORD_CREDENTIALSW; /* size: 0x0018 */

struct IAsyncRpcChannelBuffer
{
}; /* size: 0x0008 */

typedef enum _tagPARSEACTION
{
  PARSE_CANONICALIZE = 1,
  PARSE_FRIENDLY = 2,
  PARSE_SECURITY_URL = 3,
  PARSE_ROOTDOCUMENT = 4,
  PARSE_DOCUMENT = 5,
  PARSE_ANCHOR = 6,
  PARSE_ENCODE_IS_UNESCAPE = 7,
  PARSE_DECODE_IS_ESCAPE = 8,
  PARSE_PATH_FROM_URL = 9,
  PARSE_URL_FROM_PATH = 10,
  PARSE_MIME = 11,
  PARSE_SERVER = 12,
  PARSE_SCHEMA = 13,
  PARSE_SITE = 14,
  PARSE_DOMAIN = 15,
  PARSE_LOCATION = 16,
  PARSE_SECURITY_DOMAIN = 17,
  PARSE_ESCAPE = 18,
  PARSE_UNESCAPE = 19,
} tagPARSEACTION, *PtagPARSEACTION;

typedef enum _SUITE_TYPE
{
  SmallBusiness = 0,
  Enterprise = 1,
  BackOffice = 2,
  CommunicationServer = 3,
  TerminalServer = 4,
  SmallBusinessRestricted = 5,
  EmbeddedNT = 6,
  DataCenter = 7,
  SingleUserTS = 8,
  Personal = 9,
  Blade = 10,
  EmbeddedRestricted = 11,
  SecurityAppliance = 12,
  StorageServer = 13,
  ComputeServer = 14,
  WHServer = 15,
  PhoneNT = 16,
  MaxSuiteType = 17,
} SUITE_TYPE, *PSUITE_TYPE;

typedef struct _FILE_STORAGE_INFO
{
  /* 0x0000 */ unsigned long LogicalBytesPerSector;
  /* 0x0004 */ unsigned long PhysicalBytesPerSectorForAtomicity;
  /* 0x0008 */ unsigned long PhysicalBytesPerSectorForPerformance;
  /* 0x000c */ unsigned long FileSystemEffectivePhysicalBytesPerSectorForAtomicity;
  /* 0x0010 */ unsigned long Flags;
  /* 0x0014 */ unsigned long ByteOffsetForSectorAlignment;
  /* 0x0018 */ unsigned long ByteOffsetForPartitionAlignment;
} FILE_STORAGE_INFO, *PFILE_STORAGE_INFO; /* size: 0x001c */

typedef struct _CERT_SYSTEM_STORE_RELOCATE_PARA
{
  union
  {
    /* 0x0000 */ struct HKEY__* hKeyBase;
    /* 0x0000 */ void* pvBase;
  }; /* size: 0x0008 */
  union
  {
    /* 0x0008 */ void* pvSystemStore;
    /* 0x0008 */ const char* pszSystemStore;
    /* 0x0008 */ const wchar_t* pwszSystemStore;
  }; /* size: 0x0008 */
} CERT_SYSTEM_STORE_RELOCATE_PARA, *PCERT_SYSTEM_STORE_RELOCATE_PARA; /* size: 0x0010 */

typedef enum _WPP_FLAG_LEN_ENUM
{
  WPP_FLAG_LEN = 1,
} WPP_FLAG_LEN_ENUM, *PWPP_FLAG_LEN_ENUM;

typedef struct _POWER_IDLE_RESILIENCY
{
  /* 0x0000 */ unsigned long CoalescingTimeout;
  /* 0x0004 */ unsigned long IdleResiliencyPeriod;
} POWER_IDLE_RESILIENCY, *PPOWER_IDLE_RESILIENCY; /* size: 0x0008 */

class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<CClipboardBroker::CClipboardBrokerMTAHelper> const >;

enum DISPLAYCONFIG_SCALING
{
  DISPLAYCONFIG_SCALING_IDENTITY = 1,
  DISPLAYCONFIG_SCALING_CENTERED = 2,
  DISPLAYCONFIG_SCALING_STRETCHED = 3,
  DISPLAYCONFIG_SCALING_ASPECTRATIOCENTEREDMAX = 4,
  DISPLAYCONFIG_SCALING_CUSTOM = 5,
  DISPLAYCONFIG_SCALING_PREFERRED = 128,
  DISPLAYCONFIG_SCALING_FORCE_UINT32 = -1,
};

typedef struct _API_SET_VALUE_ENTRY
{
  /* 0x0000 */ unsigned long NameOffset;
  /* 0x0004 */ unsigned long NameLength;
  /* 0x0008 */ unsigned long ValueOffset;
  /* 0x000c */ unsigned long ValueLength;
} API_SET_VALUE_ENTRY, *PAPI_SET_VALUE_ENTRY; /* size: 0x0010 */

struct ITypeLib2
{
}; /* size: 0x0008 */

enum CFileMoniker::olever
{
  undetermined = 0,
  ole1 = 1,
  ole2 = 2,
};

struct IRpcChannelBufferVtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0008 */ void* AddRef /* function */;
  /* 0x0010 */ void* Release /* function */;
  /* 0x0018 */ void* GetBuffer /* function */;
  /* 0x0020 */ void* SendReceive /* function */;
  /* 0x0028 */ void* FreeBuffer /* function */;
  /* 0x0030 */ void* GetDestCtx /* function */;
  /* 0x0038 */ void* IsConnected /* function */;
}; /* size: 0x0040 */

typedef struct _ACE_HEADER
{
  /* 0x0000 */ unsigned char AceType;
  /* 0x0001 */ unsigned char AceFlags;
  /* 0x0002 */ unsigned short AceSize;
} ACE_HEADER, *PACE_HEADER; /* size: 0x0004 */

typedef struct _ACCESS_ALLOWED_CALLBACK_OBJECT_ACE
{
  /* 0x0000 */ struct _ACE_HEADER Header;
  /* 0x0004 */ unsigned long Mask;
  /* 0x0008 */ unsigned long Flags;
  /* 0x000c */ struct _GUID ObjectType;
  /* 0x001c */ struct _GUID InheritedObjectType;
  /* 0x002c */ unsigned long SidStart;
} ACCESS_ALLOWED_CALLBACK_OBJECT_ACE, *PACCESS_ALLOWED_CALLBACK_OBJECT_ACE; /* size: 0x0030 */

struct IMarshalingStream
{
}; /* size: 0x0008 */

struct _TP_CLEANUP_GROUP;

typedef enum _PLUGPLAY_CONTROL_CLASS
{
  PlugPlayControlEnumerateDevice = 0,
  PlugPlayControlRegisterNewDevice = 1,
  PlugPlayControlDeregisterDevice = 2,
  PlugPlayControlInitializeDevice = 3,
  PlugPlayControlStartDevice = 4,
  PlugPlayControlUnlockDevice = 5,
  PlugPlayControlQueryAndRemoveDevice = 6,
  PlugPlayControlUserResponse = 7,
  PlugPlayControlGenerateLegacyDevice = 8,
  PlugPlayControlGetInterfaceDeviceList = 9,
  PlugPlayControlProperty = 10,
  PlugPlayControlDeviceClassAssociation = 11,
  PlugPlayControlGetRelatedDevice = 12,
  PlugPlayControlGetInterfaceDeviceAlias = 13,
  PlugPlayControlDeviceStatus = 14,
  PlugPlayControlGetDeviceDepth = 15,
  PlugPlayControlQueryDeviceRelations = 16,
  PlugPlayControlTargetDeviceRelation = 17,
  PlugPlayControlQueryConflictList = 18,
  PlugPlayControlRetrieveDock = 19,
  PlugPlayControlResetDevice = 20,
  PlugPlayControlHaltDevice = 21,
  PlugPlayControlGetBlockedDriverList = 22,
  PlugPlayControlGetDeviceInterfaceEnabled = 23,
  MaxPlugPlayControl = 24,
} PLUGPLAY_CONTROL_CLASS, *PPLUGPLAY_CONTROL_CLASS;

struct SHashChain
{
  /* 0x0000 */ struct SHashChain* pNext;
  /* 0x0008 */ struct SHashChain* pPrev;
}; /* size: 0x0010 */

struct SDWORDHashNode
{
  /* 0x0000 */ struct SHashChain chain;
  /* 0x0010 */ unsigned long key;
  /* 0x0014 */ long __PADDING__[1];
}; /* size: 0x0018 */

struct ApartmentEntry
{
  /* 0x0000 */ struct SDWORDHashNode node;
  /* 0x0018 */ unsigned long hCOMActivator;
  /* 0x001c */ unsigned long hWinRTActivator;
}; /* size: 0x0020 */

class CRefcountedObject
{
  /* 0x0000 */ unsigned long _cReferences;
}; /* size: 0x0004 */

enum ReplacesCorHdrNumericDefines
{
  COMIMAGE_FLAGS_ILONLY = 1,
  COMIMAGE_FLAGS_32BITREQUIRED = 2,
  COMIMAGE_FLAGS_IL_LIBRARY = 4,
  COMIMAGE_FLAGS_STRONGNAMESIGNED = 8,
  COMIMAGE_FLAGS_NATIVE_ENTRYPOINT = 16,
  COMIMAGE_FLAGS_TRACKDEBUGDATA = 0x10000,
  COR_VERSION_MAJOR_V2 = 2,
  COR_VERSION_MAJOR = 2,
  COR_VERSION_MINOR = 5,
  COR_DELETED_NAME_LENGTH = 8,
  COR_VTABLEGAP_NAME_LENGTH = 8,
  NATIVE_TYPE_MAX_CB = 1,
  COR_ILMETHOD_SECT_SMALL_MAX_DATASIZE = 255,
  IMAGE_COR_MIH_METHODRVA = 1,
  IMAGE_COR_MIH_EHRVA = 2,
  IMAGE_COR_MIH_BASICBLOCK = 8,
  COR_VTABLE_32BIT = 1,
  COR_VTABLE_64BIT = 2,
  COR_VTABLE_FROM_UNMANAGED = 4,
  COR_VTABLE_FROM_UNMANAGED_RETAIN_APPDOMAIN = 8,
  COR_VTABLE_CALL_MOST_DERIVED = 16,
  IMAGE_COR_EATJ_THUNK_SIZE = 32,
  MAX_CLASS_NAME = 1024,
  MAX_PACKAGE_NAME = 1024,
};

typedef struct _BCryptBufferDesc
{
  /* 0x0000 */ unsigned long ulVersion;
  /* 0x0004 */ unsigned long cBuffers;
  /* 0x0008 */ struct _BCryptBuffer* pBuffers;
} BCryptBufferDesc, *PBCryptBufferDesc; /* size: 0x0010 */

struct IStream
{
}; /* size: 0x0008 */

enum RO_INIT_TYPE
{
  RO_INIT_SINGLETHREADED = 0,
  RO_INIT_MULTITHREADED = 1,
};

typedef struct _CM_KEYBOARD_DEVICE_DATA
{
  /* 0x0000 */ unsigned short Version;
  /* 0x0002 */ unsigned short Revision;
  /* 0x0004 */ unsigned char Type;
  /* 0x0005 */ unsigned char Subtype;
  /* 0x0006 */ unsigned short KeyboardFlags;
} CM_KEYBOARD_DEVICE_DATA, *PCM_KEYBOARD_DEVICE_DATA; /* size: 0x0008 */

typedef enum _SYSTEM_VA_TYPE
{
  SystemVaTypeAll = 0,
  SystemVaTypeNonPagedPool = 1,
  SystemVaTypePagedPool = 2,
  SystemVaTypeSystemCache = 3,
  SystemVaTypeSystemPtes = 4,
  SystemVaTypeSessionSpace = 5,
  SystemVaTypeMax = 6,
} SYSTEM_VA_TYPE, *PSYSTEM_VA_TYPE;

typedef struct _RTL_UNLOAD_EVENT_TRACE64
{
  /* 0x0000 */ unsigned __int64 BaseAddress;
  /* 0x0008 */ unsigned __int64 SizeOfImage;
  /* 0x0010 */ unsigned long Sequence;
  /* 0x0014 */ unsigned long TimeDateStamp;
  /* 0x0018 */ unsigned long CheckSum;
  /* 0x001c */ wchar_t ImageName[32];
  /* 0x005c */ unsigned long Version[2];
  /* 0x0064 */ long __PADDING__[1];
} RTL_UNLOAD_EVENT_TRACE64, *PRTL_UNLOAD_EVENT_TRACE64; /* size: 0x0068 */

typedef enum _INTERFACE_TYPE
{
  InterfaceTypeUndefined = -1,
  Internal = 0,
  Isa = 1,
  Eisa = 2,
  MicroChannel = 3,
  TurboChannel = 4,
  PCIBus = 5,
  VMEBus = 6,
  NuBus = 7,
  PCMCIABus = 8,
  CBus = 9,
  MPIBus = 10,
  MPSABus = 11,
  ProcessorInternal = 12,
  InternalPowerBus = 13,
  PNPISABus = 14,
  PNPBus = 15,
  Vmcs = 16,
  ACPIBus = 17,
  MaximumInterfaceType = 18,
} INTERFACE_TYPE, *PINTERFACE_TYPE;

class Microsoft::WRL::Details::MakeAllocator<ClipboardDataObjectTask,0>
{
  /* 0x0000 */ void* buffer_;
}; /* size: 0x0008 */

typedef struct _WNF_TYPE_ID
{
  /* 0x0000 */ struct _GUID TypeId;
} WNF_TYPE_ID, *PWNF_TYPE_ID; /* size: 0x0010 */

struct tagCOMVERSION
{
  /* 0x0000 */ unsigned short MajorVersion;
  /* 0x0002 */ unsigned short MinorVersion;
}; /* size: 0x0004 */

struct tagInstantiationInfoData
{
  /* 0x0000 */ struct _GUID classId;
  /* 0x0010 */ unsigned long classCtx;
  /* 0x0014 */ unsigned long actvflags;
  /* 0x0018 */ int fIsSurrogate;
  /* 0x001c */ unsigned long cIID;
  /* 0x0020 */ unsigned long instFlag;
  /* 0x0024 */ long Padding_20;
  /* 0x0028 */ struct _GUID* pIID;
  /* 0x0030 */ unsigned long thisSize;
  /* 0x0034 */ struct tagCOMVERSION clientCOMVersion;
}; /* size: 0x0038 */

typedef enum __vc_attributes::event_sourceAttribute::optimize_e
{
  speed = 0,
  size = 1,
} _vc_attributes::event_sourceAttribute::optimize_e, *P_vc_attributes::event_sourceAttribute::optimize_e;

struct tagHSZPAIR
{
  /* 0x0000 */ struct HSZ__* hszSvc;
  /* 0x0008 */ struct HSZ__* hszTopic;
}; /* size: 0x0010 */

typedef struct _PROCESS_HEAP_ENTRY
{
  /* 0x0000 */ void* lpData;
  /* 0x0008 */ unsigned long cbData;
  /* 0x000c */ unsigned char cbOverhead;
  /* 0x000d */ unsigned char iRegionIndex;
  /* 0x000e */ unsigned short wFlags;
  union
  {
    struct
    {
      /* 0x0010 */ void* hMem;
      /* 0x0018 */ unsigned long dwReserved[3];
      /* 0x0024 */ long __PADDING__[1];
    } /* size: 0x0018 */ Block;
    struct
    {
      /* 0x0010 */ unsigned long dwCommittedSize;
      /* 0x0014 */ unsigned long dwUnCommittedSize;
      /* 0x0018 */ void* lpFirstBlock;
      /* 0x0020 */ void* lpLastBlock;
    } /* size: 0x0018 */ Region;
  }; /* size: 0x0018 */
} PROCESS_HEAP_ENTRY, *PPROCESS_HEAP_ENTRY; /* size: 0x0028 */

struct tagPROPSPEC
{
  /* 0x0000 */ unsigned long ulKind;
  /* 0x0004 */ long Padding_21;
  union
  {
    /* 0x0008 */ unsigned long propid;
    /* 0x0008 */ wchar_t* lpwstr;
  }; /* size: 0x0008 */
}; /* size: 0x0010 */

struct tagRemSTGMEDIUM
{
  /* 0x0000 */ unsigned long tymed;
  /* 0x0004 */ unsigned long dwHandleType;
  /* 0x0008 */ unsigned long pData;
  /* 0x000c */ unsigned long pUnkForRelease;
  /* 0x0010 */ unsigned long cbData;
  /* 0x0014 */ unsigned char data[1];
  /* 0x0015 */ char __PADDING__[3];
}; /* size: 0x0018 */

typedef struct _NDR64_STRUCTURE_FLAGS
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned char HasPointerInfo : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned char HasMemberInfo : 1; /* bit position: 1 */
    /* 0x0000 */ unsigned char HasConfArray : 1; /* bit position: 2 */
    /* 0x0000 */ unsigned char HasOrigPointerInfo : 1; /* bit position: 3 */
    /* 0x0000 */ unsigned char HasOrigMemberInfo : 1; /* bit position: 4 */
    /* 0x0000 */ unsigned char Reserved1 : 1; /* bit position: 5 */
    /* 0x0000 */ unsigned char Reserved2 : 1; /* bit position: 6 */
    /* 0x0000 */ unsigned char Reserved3 : 1; /* bit position: 7 */
  }; /* bitfield */
} NDR64_STRUCTURE_FLAGS, *PNDR64_STRUCTURE_FLAGS; /* size: 0x0001 */

typedef struct _NDR64_STRUCTURE_HEADER_FORMAT
{
  /* 0x0000 */ unsigned char FormatCode;
  /* 0x0001 */ unsigned char Alignment;
  /* 0x0002 */ struct _NDR64_STRUCTURE_FLAGS Flags;
  /* 0x0003 */ unsigned char Reserve;
  /* 0x0004 */ unsigned int MemorySize;
} NDR64_STRUCTURE_HEADER_FORMAT, *PNDR64_STRUCTURE_HEADER_FORMAT; /* size: 0x0008 */

typedef struct __midl_frag9_t
{
  /* 0x0000 */ struct _NDR64_STRUCTURE_HEADER_FORMAT frag1;
} _midl_frag9_t, *P_midl_frag9_t; /* size: 0x0008 */

typedef enum _KPROFILE_SOURCE
{
  ProfileTime = 0,
  ProfileAlignmentFixup = 1,
  ProfileTotalIssues = 2,
  ProfilePipelineDry = 3,
  ProfileLoadInstructions = 4,
  ProfilePipelineFrozen = 5,
  ProfileBranchInstructions = 6,
  ProfileTotalNonissues = 7,
  ProfileDcacheMisses = 8,
  ProfileIcacheMisses = 9,
  ProfileCacheMisses = 10,
  ProfileBranchMispredictions = 11,
  ProfileStoreInstructions = 12,
  ProfileFpInstructions = 13,
  ProfileIntegerInstructions = 14,
  Profile2Issue = 15,
  Profile3Issue = 16,
  Profile4Issue = 17,
  ProfileSpecialInstructions = 18,
  ProfileTotalCycles = 19,
  ProfileIcacheIssues = 20,
  ProfileDcacheAccesses = 21,
  ProfileMemoryBarrierCycles = 22,
  ProfileLoadLinkedIssues = 23,
  ProfileMaximum = 24,
} KPROFILE_SOURCE, *PKPROFILE_SOURCE;

struct _TP_ALPC;

typedef enum _INSTALLSPECTYPE
{
  APPNAME = 1,
  FILEEXT = 2,
  PROGID = 3,
  COMCLASS = 4,
} INSTALLSPECTYPE, *PINSTALLSPECTYPE;

typedef struct _IMAGEHLP_DEFERRED_SYMBOL_LOAD64
{
  /* 0x0000 */ unsigned long SizeOfStruct;
  /* 0x0004 */ long Padding_22;
  /* 0x0008 */ unsigned __int64 BaseOfImage;
  /* 0x0010 */ unsigned long CheckSum;
  /* 0x0014 */ unsigned long TimeDateStamp;
  /* 0x0018 */ char FileName[260];
  /* 0x011c */ unsigned char Reparse;
  /* 0x011d */ char Padding_23[3];
  /* 0x0120 */ void* hFile;
  /* 0x0128 */ unsigned long Flags;
  /* 0x012c */ long __PADDING__[1];
} IMAGEHLP_DEFERRED_SYMBOL_LOAD64, *PIMAGEHLP_DEFERRED_SYMBOL_LOAD64; /* size: 0x0130 */

enum SLR_FLAGS
{
  SLR_NO_UI = 1,
  SLR_ANY_MATCH = 2,
  SLR_UPDATE = 4,
  SLR_NOUPDATE = 8,
  SLR_NOSEARCH = 16,
  SLR_NOTRACK = 32,
  SLR_NOLINKINFO = 64,
  SLR_INVOKE_MSI = 128,
  SLR_NO_UI_WITH_MSG_PUMP = 257,
  SLR_OFFER_DELETE_WITHOUT_FILE = 512,
  SLR_KNOWNFOLDER = 1024,
  SLR_MACHINE_IN_LOCAL_TARGET = 2048,
  SLR_UPDATE_MACHINE_AND_SID = 4096,
};

typedef union _ULARGE_INTEGER
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned long LowPart;
      /* 0x0004 */ unsigned long HighPart;
    }; /* size: 0x0008 */
    struct
    {
      /* 0x0000 */ unsigned long LowPart;
      /* 0x0004 */ unsigned long HighPart;
    } /* size: 0x0008 */ u;
    /* 0x0000 */ unsigned __int64 QuadPart;
  }; /* size: 0x0008 */
} ULARGE_INTEGER, *PULARGE_INTEGER; /* size: 0x0008 */

union tagCY
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned long Lo;
      /* 0x0004 */ long Hi;
    }; /* size: 0x0008 */
    /* 0x0000 */ __int64 int64;
  }; /* size: 0x0008 */
}; /* size: 0x0008 */

struct tagBSTRBLOB
{
  /* 0x0000 */ unsigned long cbSize;
  /* 0x0004 */ long Padding_24;
  /* 0x0008 */ unsigned char* pData;
}; /* size: 0x0010 */

struct tagBLOB
{
  /* 0x0000 */ unsigned long cbSize;
  /* 0x0004 */ long Padding_25;
  /* 0x0008 */ unsigned char* pBlobData;
}; /* size: 0x0010 */

struct tagCAC
{
  /* 0x0000 */ unsigned long cElems;
  /* 0x0004 */ long Padding_26;
  /* 0x0008 */ char* pElems;
}; /* size: 0x0010 */

struct tagCAUB
{
  /* 0x0000 */ unsigned long cElems;
  /* 0x0004 */ long Padding_27;
  /* 0x0008 */ unsigned char* pElems;
}; /* size: 0x0010 */

struct tagCAI
{
  /* 0x0000 */ unsigned long cElems;
  /* 0x0004 */ long Padding_28;
  /* 0x0008 */ short* pElems;
}; /* size: 0x0010 */

struct tagCAUI
{
  /* 0x0000 */ unsigned long cElems;
  /* 0x0004 */ long Padding_29;
  /* 0x0008 */ unsigned short* pElems;
}; /* size: 0x0010 */

struct tagCAL
{
  /* 0x0000 */ unsigned long cElems;
  /* 0x0004 */ long Padding_30;
  /* 0x0008 */ long* pElems;
}; /* size: 0x0010 */

struct tagCAUL
{
  /* 0x0000 */ unsigned long cElems;
  /* 0x0004 */ long Padding_31;
  /* 0x0008 */ unsigned long* pElems;
}; /* size: 0x0010 */

struct tagCAH
{
  /* 0x0000 */ unsigned long cElems;
  /* 0x0004 */ long Padding_32;
  /* 0x0008 */ union _LARGE_INTEGER* pElems;
}; /* size: 0x0010 */

struct tagCAUH
{
  /* 0x0000 */ unsigned long cElems;
  /* 0x0004 */ long Padding_33;
  /* 0x0008 */ union _ULARGE_INTEGER* pElems;
}; /* size: 0x0010 */

struct tagCAFLT
{
  /* 0x0000 */ unsigned long cElems;
  /* 0x0004 */ long Padding_34;
  /* 0x0008 */ float* pElems;
}; /* size: 0x0010 */

struct tagCADBL
{
  /* 0x0000 */ unsigned long cElems;
  /* 0x0004 */ long Padding_35;
  /* 0x0008 */ double* pElems;
}; /* size: 0x0010 */

struct tagCABOOL
{
  /* 0x0000 */ unsigned long cElems;
  /* 0x0004 */ long Padding_36;
  /* 0x0008 */ short* pElems;
}; /* size: 0x0010 */

struct tagCASCODE
{
  /* 0x0000 */ unsigned long cElems;
  /* 0x0004 */ long Padding_37;
  /* 0x0008 */ long* pElems;
}; /* size: 0x0010 */

struct tagCACY
{
  /* 0x0000 */ unsigned long cElems;
  /* 0x0004 */ long Padding_38;
  /* 0x0008 */ union tagCY* pElems;
}; /* size: 0x0010 */

struct tagCADATE
{
  /* 0x0000 */ unsigned long cElems;
  /* 0x0004 */ long Padding_39;
  /* 0x0008 */ double* pElems;
}; /* size: 0x0010 */

struct tagCAFILETIME
{
  /* 0x0000 */ unsigned long cElems;
  /* 0x0004 */ long Padding_40;
  /* 0x0008 */ struct _FILETIME* pElems;
}; /* size: 0x0010 */

struct tagCACLSID
{
  /* 0x0000 */ unsigned long cElems;
  /* 0x0004 */ long Padding_41;
  /* 0x0008 */ struct _GUID* pElems;
}; /* size: 0x0010 */

struct tagCACLIPDATA
{
  /* 0x0000 */ unsigned long cElems;
  /* 0x0004 */ long Padding_42;
  /* 0x0008 */ struct tagCLIPDATA* pElems;
}; /* size: 0x0010 */

struct tagCABSTR
{
  /* 0x0000 */ unsigned long cElems;
  /* 0x0004 */ long Padding_43;
  /* 0x0008 */ wchar_t** pElems;
}; /* size: 0x0010 */

struct tagCABSTRBLOB
{
  /* 0x0000 */ unsigned long cElems;
  /* 0x0004 */ long Padding_44;
  /* 0x0008 */ struct tagBSTRBLOB* pElems;
}; /* size: 0x0010 */

struct tagCALPSTR
{
  /* 0x0000 */ unsigned long cElems;
  /* 0x0004 */ long Padding_45;
  /* 0x0008 */ char** pElems;
}; /* size: 0x0010 */

struct tagCALPWSTR
{
  /* 0x0000 */ unsigned long cElems;
  /* 0x0004 */ long Padding_46;
  /* 0x0008 */ wchar_t** pElems;
}; /* size: 0x0010 */

struct tagCAPROPVARIANT
{
  /* 0x0000 */ unsigned long cElems;
  /* 0x0004 */ long Padding_47;
  /* 0x0008 */ struct tagPROPVARIANT* pElems;
}; /* size: 0x0010 */

struct tagDEC
{
  /* 0x0000 */ unsigned short wReserved;
  union
  {
    struct
    {
      /* 0x0002 */ unsigned char scale;
      /* 0x0003 */ unsigned char sign;
    }; /* size: 0x0002 */
    /* 0x0002 */ unsigned short signscale;
  }; /* size: 0x0002 */
  /* 0x0004 */ unsigned long Hi32;
  union
  {
    struct
    {
      /* 0x0008 */ unsigned long Lo32;
      /* 0x000c */ unsigned long Mid32;
    }; /* size: 0x0008 */
    /* 0x0008 */ unsigned __int64 Lo64;
  }; /* size: 0x0008 */
}; /* size: 0x0010 */

struct tagPROPVARIANT
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned short vt;
      /* 0x0002 */ unsigned short wReserved1;
      /* 0x0004 */ unsigned short wReserved2;
      /* 0x0006 */ unsigned short wReserved3;
      union
      {
        /* 0x0008 */ char cVal;
        /* 0x0008 */ unsigned char bVal;
        /* 0x0008 */ short iVal;
        /* 0x0008 */ unsigned short uiVal;
        /* 0x0008 */ long lVal;
        /* 0x0008 */ unsigned long ulVal;
        /* 0x0008 */ int intVal;
        /* 0x0008 */ unsigned int uintVal;
        /* 0x0008 */ union _LARGE_INTEGER hVal;
        /* 0x0008 */ union _ULARGE_INTEGER uhVal;
        /* 0x0008 */ float fltVal;
        /* 0x0008 */ double dblVal;
        /* 0x0008 */ short boolVal;
        /* 0x0008 */ long scode;
        /* 0x0008 */ union tagCY cyVal;
        /* 0x0008 */ double date;
        /* 0x0008 */ struct _FILETIME filetime;
        /* 0x0008 */ struct _GUID* puuid;
        /* 0x0008 */ struct tagCLIPDATA* pclipdata;
        /* 0x0008 */ wchar_t* bstrVal;
        /* 0x0008 */ struct tagBSTRBLOB bstrblobVal;
        /* 0x0008 */ struct tagBLOB blob;
        /* 0x0008 */ char* pszVal;
        /* 0x0008 */ wchar_t* pwszVal;
        /* 0x0008 */ struct IUnknown* punkVal;
        /* 0x0008 */ struct IDispatch* pdispVal;
        /* 0x0008 */ struct IStream* pStream;
        /* 0x0008 */ struct IStorage* pStorage;
        /* 0x0008 */ struct tagVersionedStream* pVersionedStream;
        /* 0x0008 */ struct tagSAFEARRAY* parray;
        /* 0x0008 */ struct tagCAC cac;
        /* 0x0008 */ struct tagCAUB caub;
        /* 0x0008 */ struct tagCAI cai;
        /* 0x0008 */ struct tagCAUI caui;
        /* 0x0008 */ struct tagCAL cal;
        /* 0x0008 */ struct tagCAUL caul;
        /* 0x0008 */ struct tagCAH cah;
        /* 0x0008 */ struct tagCAUH cauh;
        /* 0x0008 */ struct tagCAFLT caflt;
        /* 0x0008 */ struct tagCADBL cadbl;
        /* 0x0008 */ struct tagCABOOL cabool;
        /* 0x0008 */ struct tagCASCODE cascode;
        /* 0x0008 */ struct tagCACY cacy;
        /* 0x0008 */ struct tagCADATE cadate;
        /* 0x0008 */ struct tagCAFILETIME cafiletime;
        /* 0x0008 */ struct tagCACLSID cauuid;
        /* 0x0008 */ struct tagCACLIPDATA caclipdata;
        /* 0x0008 */ struct tagCABSTR cabstr;
        /* 0x0008 */ struct tagCABSTRBLOB cabstrblob;
        /* 0x0008 */ struct tagCALPSTR calpstr;
        /* 0x0008 */ struct tagCALPWSTR calpwstr;
        /* 0x0008 */ struct tagCAPROPVARIANT capropvar;
        /* 0x0008 */ char* pcVal;
        /* 0x0008 */ unsigned char* pbVal;
        /* 0x0008 */ short* piVal;
        /* 0x0008 */ unsigned short* puiVal;
        /* 0x0008 */ long* plVal;
        /* 0x0008 */ unsigned long* pulVal;
        /* 0x0008 */ int* pintVal;
        /* 0x0008 */ unsigned int* puintVal;
        /* 0x0008 */ float* pfltVal;
        /* 0x0008 */ double* pdblVal;
        /* 0x0008 */ short* pboolVal;
        /* 0x0008 */ struct tagDEC* pdecVal;
        /* 0x0008 */ long* pscode;
        /* 0x0008 */ union tagCY* pcyVal;
        /* 0x0008 */ double* pdate;
        /* 0x0008 */ wchar_t** pbstrVal;
        /* 0x0008 */ struct IUnknown** ppunkVal;
        /* 0x0008 */ struct IDispatch** ppdispVal;
        /* 0x0008 */ struct tagSAFEARRAY** pparray;
        /* 0x0008 */ struct tagPROPVARIANT* pvarVal;
      }; /* size: 0x0010 */
    }; /* size: 0x0018 */
    struct
    {
      /* 0x0000 */ struct tagDEC decVal;
      /* 0x0010 */ long __PADDING__[2];
    }; /* size: 0x0018 */
  }; /* size: 0x0018 */
}; /* size: 0x0018 */

typedef enum __MIDL_IInternetSecurityManager_0001
{
  PUAF_DEFAULT = 0,
  PUAF_NOUI = 1,
  PUAF_ISFILE = 2,
  PUAF_WARN_IF_DENIED = 4,
  PUAF_FORCEUI_FOREGROUND = 8,
  PUAF_CHECK_TIFS = 16,
  PUAF_DONTCHECKBOXINDIALOG = 32,
  PUAF_TRUSTED = 64,
  PUAF_ACCEPT_WILDCARD_SCHEME = 128,
  PUAF_ENFORCERESTRICTED = 256,
  PUAF_NOSAVEDFILECHECK = 512,
  PUAF_REQUIRESAVEDFILECHECK = 1024,
  PUAF_DONT_USE_CACHE = 4096,
  PUAF_RESERVED1 = 8192,
  PUAF_RESERVED2 = 16384,
  PUAF_LMZ_UNLOCKED = 0x10000,
  PUAF_LMZ_LOCKED = 0x20000,
  PUAF_DEFAULTZONEPOL = 0x40000,
  PUAF_NPL_USE_LOCKED_IF_RESTRICTED = 0x80000,
  PUAF_NOUIIFLOCKED = 0x100000,
  PUAF_DRAGPROTOCOLCHECK = 0x200000,
} _MIDL_IInternetSecurityManager_0001, *P_MIDL_IInternetSecurityManager_0001;

enum PROXY_PHASE
{
  PROXY_CALCSIZE = 0,
  PROXY_GETBUFFER = 1,
  PROXY_MARSHAL = 2,
  PROXY_SENDRECEIVE = 3,
  PROXY_UNMARSHAL = 4,
};

typedef union _RPC_ASYNC_NOTIFICATION_INFO
{
  union
  {
    struct
    {
      /* 0x0000 */ void* NotificationRoutine /* function */;
      /* 0x0008 */ void* hThread;
    } /* size: 0x0010 */ APC;
    struct
    {
      /* 0x0000 */ void* hIOPort;
      /* 0x0008 */ unsigned long dwNumberOfBytesTransferred;
      /* 0x000c */ long Padding_48;
      /* 0x0010 */ unsigned __int64 dwCompletionKey;
      /* 0x0018 */ struct _OVERLAPPED* lpOverlapped;
    } /* size: 0x0020 */ IOC;
    struct
    {
      /* 0x0000 */ struct HWND__* hWnd;
      /* 0x0008 */ unsigned int Msg;
      /* 0x000c */ long __PADDING__[1];
    } /* size: 0x0010 */ HWND;
    /* 0x0000 */ void* hEvent;
    /* 0x0000 */ void* NotificationRoutine /* function */;
  }; /* size: 0x0020 */
} RPC_ASYNC_NOTIFICATION_INFO, *PRPC_ASYNC_NOTIFICATION_INFO; /* size: 0x0020 */

typedef struct _CTL_USAGE
{
  /* 0x0000 */ unsigned long cUsageIdentifier;
  /* 0x0004 */ long Padding_49;
  /* 0x0008 */ char** rgpszUsageIdentifier;
} CTL_USAGE, *PCTL_USAGE; /* size: 0x0010 */

typedef struct _TXFS_LIST_TRANSACTIONS
{
  /* 0x0000 */ unsigned __int64 NumberOfTransactions;
  /* 0x0008 */ unsigned __int64 BufferSizeRequired;
} TXFS_LIST_TRANSACTIONS, *PTXFS_LIST_TRANSACTIONS; /* size: 0x0010 */

typedef enum __vc_attributes::helper_attributes::v1_alttypeAttribute::type_e
{
  eBoolean = 0,
  eInteger = 1,
  eFloat = 2,
  eDouble = 3,
} _vc_attributes::helper_attributes::v1_alttypeAttribute::type_e, *P_vc_attributes::helper_attributes::v1_alttypeAttribute::type_e;

struct tagCRGB
{
  /* 0x0000 */ unsigned char bRed;
  /* 0x0001 */ unsigned char bGreen;
  /* 0x0002 */ unsigned char bBlue;
  /* 0x0003 */ unsigned char bExtra;
}; /* size: 0x0004 */

typedef struct _CRYPT_PROVIDER_REG
{
  /* 0x0000 */ unsigned long cAliases;
  /* 0x0004 */ long Padding_50;
  /* 0x0008 */ wchar_t** rgpszAliases;
  /* 0x0010 */ struct _CRYPT_IMAGE_REG* pUM;
  /* 0x0018 */ struct _CRYPT_IMAGE_REG* pKM;
} CRYPT_PROVIDER_REG, *PCRYPT_PROVIDER_REG; /* size: 0x0020 */

class CChannelObject;

typedef struct _FILE_BASIC_INFORMATION
{
  /* 0x0000 */ union _LARGE_INTEGER CreationTime;
  /* 0x0008 */ union _LARGE_INTEGER LastAccessTime;
  /* 0x0010 */ union _LARGE_INTEGER LastWriteTime;
  /* 0x0018 */ union _LARGE_INTEGER ChangeTime;
  /* 0x0020 */ unsigned long FileAttributes;
  /* 0x0024 */ long __PADDING__[1];
} FILE_BASIC_INFORMATION, *PFILE_BASIC_INFORMATION; /* size: 0x0028 */

typedef struct _FILE_STANDARD_INFORMATION
{
  /* 0x0000 */ union _LARGE_INTEGER AllocationSize;
  /* 0x0008 */ union _LARGE_INTEGER EndOfFile;
  /* 0x0010 */ unsigned long NumberOfLinks;
  /* 0x0014 */ unsigned char DeletePending;
  /* 0x0015 */ unsigned char Directory;
  /* 0x0016 */ char __PADDING__[2];
} FILE_STANDARD_INFORMATION, *PFILE_STANDARD_INFORMATION; /* size: 0x0018 */

typedef struct _FILE_INTERNAL_INFORMATION
{
  /* 0x0000 */ union _LARGE_INTEGER IndexNumber;
} FILE_INTERNAL_INFORMATION, *PFILE_INTERNAL_INFORMATION; /* size: 0x0008 */

typedef struct _FILE_EA_INFORMATION
{
  /* 0x0000 */ unsigned long EaSize;
} FILE_EA_INFORMATION, *PFILE_EA_INFORMATION; /* size: 0x0004 */

typedef struct _FILE_ACCESS_INFORMATION
{
  /* 0x0000 */ unsigned long AccessFlags;
} FILE_ACCESS_INFORMATION, *PFILE_ACCESS_INFORMATION; /* size: 0x0004 */

typedef struct _FILE_POSITION_INFORMATION
{
  /* 0x0000 */ union _LARGE_INTEGER CurrentByteOffset;
} FILE_POSITION_INFORMATION, *PFILE_POSITION_INFORMATION; /* size: 0x0008 */

typedef struct _FILE_MODE_INFORMATION
{
  /* 0x0000 */ unsigned long Mode;
} FILE_MODE_INFORMATION, *PFILE_MODE_INFORMATION; /* size: 0x0004 */

typedef struct _FILE_ALIGNMENT_INFORMATION
{
  /* 0x0000 */ unsigned long AlignmentRequirement;
} FILE_ALIGNMENT_INFORMATION, *PFILE_ALIGNMENT_INFORMATION; /* size: 0x0004 */

typedef struct _FILE_NAME_INFORMATION
{
  /* 0x0000 */ unsigned long FileNameLength;
  /* 0x0004 */ wchar_t FileName[1];
  /* 0x0006 */ char __PADDING__[2];
} FILE_NAME_INFORMATION, *PFILE_NAME_INFORMATION; /* size: 0x0008 */

typedef struct _FILE_ALL_INFORMATION
{
  /* 0x0000 */ struct _FILE_BASIC_INFORMATION BasicInformation;
  /* 0x0028 */ struct _FILE_STANDARD_INFORMATION StandardInformation;
  /* 0x0040 */ struct _FILE_INTERNAL_INFORMATION InternalInformation;
  /* 0x0048 */ struct _FILE_EA_INFORMATION EaInformation;
  /* 0x004c */ struct _FILE_ACCESS_INFORMATION AccessInformation;
  /* 0x0050 */ struct _FILE_POSITION_INFORMATION PositionInformation;
  /* 0x0058 */ struct _FILE_MODE_INFORMATION ModeInformation;
  /* 0x005c */ struct _FILE_ALIGNMENT_INFORMATION AlignmentInformation;
  /* 0x0060 */ struct _FILE_NAME_INFORMATION NameInformation;
} FILE_ALL_INFORMATION, *PFILE_ALL_INFORMATION; /* size: 0x0068 */

typedef enum _IDL_CS_CONVERT
{
  IDL_CS_NO_CONVERT = 0,
  IDL_CS_IN_PLACE_CONVERT = 1,
  IDL_CS_NEW_BUFFER_CONVERT = 2,
} IDL_CS_CONVERT, *PIDL_CS_CONVERT;

struct IProcessInitControl
{
}; /* size: 0x0008 */

typedef struct _CMSG_CTRL_ADD_SIGNER_UNAUTH_ATTR_PARA
{
  /* 0x0000 */ unsigned long cbSize;
  /* 0x0004 */ unsigned long dwSignerIndex;
  /* 0x0008 */ struct _CRYPTOAPI_BLOB blob;
} CMSG_CTRL_ADD_SIGNER_UNAUTH_ATTR_PARA, *PCMSG_CTRL_ADD_SIGNER_UNAUTH_ATTR_PARA; /* size: 0x0018 */

typedef enum _BUS_DATA_TYPE
{
  ConfigurationSpaceUndefined = -1,
  Cmos = 0,
  EisaConfiguration = 1,
  Pos = 2,
  CbusConfiguration = 3,
  PCIConfiguration = 4,
  VMEConfiguration = 5,
  NuBusConfiguration = 6,
  PCMCIAConfiguration = 7,
  MPIConfiguration = 8,
  MPSAConfiguration = 9,
  PNPISAConfiguration = 10,
  SgiInternalConfiguration = 11,
  MaximumBusDataType = 12,
} BUS_DATA_TYPE, *PBUS_DATA_TYPE;

typedef enum _TAG_UNNAMED_2
{
  sfImage = 0,
  sfDbg = 1,
  sfPdb = 2,
  sfMpd = 3,
  sfMax = 4,
} TAG_UNNAMED_2, *PTAG_UNNAMED_2;

struct tagCLIPDATA
{
  /* 0x0000 */ unsigned long cbSize;
  /* 0x0004 */ long ulClipFmt;
  /* 0x0008 */ unsigned char* pClipData;
}; /* size: 0x0010 */

enum tagSTGC
{
  STGC_DEFAULT = 0,
  STGC_OVERWRITE = 1,
  STGC_ONLYIFCURRENT = 2,
  STGC_DANGEROUSLYCOMMITMERELYTODISKCACHE = 4,
  STGC_CONSOLIDATE = 8,
};

typedef struct _PROC_THREAD_ATTRIBUTE
{
  /* 0x0000 */ unsigned __int64 Attribute;
  /* 0x0008 */ unsigned __int64 Size;
  /* 0x0010 */ unsigned __int64 Value;
} PROC_THREAD_ATTRIBUTE, *PPROC_THREAD_ATTRIBUTE; /* size: 0x0018 */

typedef enum _RTL_PATH_TYPE
{
  RtlPathTypeUnknown = 0,
  RtlPathTypeUncAbsolute = 1,
  RtlPathTypeDriveAbsolute = 2,
  RtlPathTypeDriveRelative = 3,
  RtlPathTypeRooted = 4,
  RtlPathTypeRelative = 5,
  RtlPathTypeLocalDevice = 6,
  RtlPathTypeRootLocalDevice = 7,
} RTL_PATH_TYPE, *PRTL_PATH_TYPE;

typedef enum _MINIDUMP_CALLBACK_TYPE
{
  ModuleCallback = 0,
  ThreadCallback = 1,
  ThreadExCallback = 2,
  IncludeThreadCallback = 3,
  IncludeModuleCallback = 4,
  MemoryCallback = 5,
  CancelCallback = 6,
  WriteKernelMinidumpCallback = 7,
  KernelMinidumpStatusCallback = 8,
  RemoveMemoryCallback = 9,
  IncludeVmRegionCallback = 10,
  IoStartCallback = 11,
  IoWriteAllCallback = 12,
  IoFinishCallback = 13,
  ReadMemoryFailureCallback = 14,
  SecondaryFlagsCallback = 15,
} MINIDUMP_CALLBACK_TYPE, *PMINIDUMP_CALLBACK_TYPE;

class Windows::Rtl::AutoInterface<Windows::Rtl::IRtlUtf8StringBuilder *,Windows::Auto<Windows::Rtl::IRtlUtf8StringBuilder *> >
{
}; /* size: 0x0008 */

typedef struct _CERT_ISSUER_SERIAL_NUMBER
{
  /* 0x0000 */ struct _CRYPTOAPI_BLOB Issuer;
  /* 0x0010 */ struct _CRYPTOAPI_BLOB SerialNumber;
} CERT_ISSUER_SERIAL_NUMBER, *PCERT_ISSUER_SERIAL_NUMBER; /* size: 0x0020 */

typedef struct _CERT_ID
{
  /* 0x0000 */ unsigned long dwIdChoice;
  /* 0x0004 */ long Padding_51;
  union
  {
    /* 0x0008 */ struct _CERT_ISSUER_SERIAL_NUMBER IssuerSerialNumber;
    /* 0x0008 */ struct _CRYPTOAPI_BLOB KeyId;
    struct
    {
      /* 0x0008 */ struct _CRYPTOAPI_BLOB HashId;
      /* 0x0018 */ long __PADDING__[4];
    }; /* size: 0x0020 */
  }; /* size: 0x0020 */
} CERT_ID, *PCERT_ID; /* size: 0x0028 */

typedef struct _CMSG_RECIPIENT_ENCRYPTED_KEY_INFO
{
  /* 0x0000 */ struct _CERT_ID RecipientId;
  /* 0x0028 */ struct _CRYPTOAPI_BLOB EncryptedKey;
  /* 0x0038 */ struct _FILETIME Date;
  /* 0x0040 */ struct _CRYPT_ATTRIBUTE_TYPE_VALUE* pOtherAttr;
} CMSG_RECIPIENT_ENCRYPTED_KEY_INFO, *PCMSG_RECIPIENT_ENCRYPTED_KEY_INFO; /* size: 0x0048 */

struct tagSIZE
{
  /* 0x0000 */ long cx;
  /* 0x0004 */ long cy;
}; /* size: 0x0008 */

typedef struct _RECTL
{
  /* 0x0000 */ long left;
  /* 0x0004 */ long top;
  /* 0x0008 */ long right;
  /* 0x000c */ long bottom;
} RECTL, *PRECTL; /* size: 0x0010 */

typedef struct _FORM_INFO_2W
{
  /* 0x0000 */ unsigned long Flags;
  /* 0x0004 */ long Padding_52;
  /* 0x0008 */ const wchar_t* pName;
  /* 0x0010 */ struct tagSIZE Size;
  /* 0x0018 */ struct _RECTL ImageableArea;
  /* 0x0028 */ const char* pKeyword;
  /* 0x0030 */ unsigned long StringType;
  /* 0x0034 */ long Padding_53;
  /* 0x0038 */ const wchar_t* pMuiDll;
  /* 0x0040 */ unsigned long dwResourceId;
  /* 0x0044 */ long Padding_54;
  /* 0x0048 */ const wchar_t* pDisplayName;
  /* 0x0050 */ unsigned short wLangId;
  /* 0x0052 */ char __PADDING__[6];
} FORM_INFO_2W, *PFORM_INFO_2W; /* size: 0x0058 */

typedef enum _WORKER_FACTORY_CALLBACK_CLASS
{
  WorkerFactoryCallbackNormal = 0,
  WorkerFactoryCallbackLongRunning = 1,
  WorkerFactoryCallbackIndependent = 2,
  WorkerFactoryCallbackDetectedUnrecoverableError = 3,
} WORKER_FACTORY_CALLBACK_CLASS, *PWORKER_FACTORY_CALLBACK_CLASS;

typedef struct _IMAGEHLP_SYMBOL64
{
  /* 0x0000 */ unsigned long SizeOfStruct;
  /* 0x0004 */ long Padding_55;
  /* 0x0008 */ unsigned __int64 Address;
  /* 0x0010 */ unsigned long Size;
  /* 0x0014 */ unsigned long Flags;
  /* 0x0018 */ unsigned long MaxNameLength;
  /* 0x001c */ char Name[1];
  /* 0x001d */ char __PADDING__[3];
} IMAGEHLP_SYMBOL64, *PIMAGEHLP_SYMBOL64; /* size: 0x0020 */

typedef struct _IMAGEHLP_SYMBOL64_PACKAGE
{
  /* 0x0000 */ struct _IMAGEHLP_SYMBOL64 sym;
  /* 0x0020 */ char name[2001];
  /* 0x07f1 */ char __PADDING__[7];
} IMAGEHLP_SYMBOL64_PACKAGE, *PIMAGEHLP_SYMBOL64_PACKAGE; /* size: 0x07f8 */

class CBasedSStreamPtr
{
  /* 0x0000 */ unsigned __int64 _p;
}; /* size: 0x0008 */

class CBasedPubDocFilePtr
{
  /* 0x0000 */ unsigned __int64 _p;
}; /* size: 0x0008 */

class CBasedPubStreamPtr
{
  /* 0x0000 */ unsigned __int64 _p;
}; /* size: 0x0008 */

class CBasedBytePtr
{
  /* 0x0000 */ unsigned __int64 _p;
}; /* size: 0x0008 */

class CPubMappedStream
{
  /* 0x0000 */ class CBasedPubStreamPtr _pst;
  /* 0x0008 */ class CBasedBytePtr _pb;
  /* 0x0010 */ class CBasedBytePtr _powner;
  /* 0x0018 */ unsigned long _cbUsed;
  /* 0x001c */ unsigned long _cbOriginalStreamSize;
  /* 0x0020 */ unsigned char _fDirty;
}; /* size: 0x0028 */

class CPubStream
{
  /* 0x0000 */ long Padding_56[22];
  /* 0x0058 */ class CBasedSStreamPtr _psParent;
  /* 0x0060 */ class CBasedPubDocFilePtr _ppdfParent;
  /* 0x0068 */ int _fDirty;
  /* 0x006c */ long _cReferences;
  /* 0x0070 */ class CPubMappedStream _PubMappedStream;
}; /* size: 0x0098 */

enum SYSTEM_POWER_CONDITION
{
  PoAc = 0,
  PoDc = 1,
  PoHot = 2,
  PoConditionMaximum = 3,
};

struct IFontEventsDisp
{
}; /* size: 0x0008 */

class Windows::Auto<Windows::Rtl::IRtlUtf8StringBuilder *>
{
}; /* size: 0x0008 */

typedef enum __vc_attributes::moduleAttribute::type_e
{
  dll = 1,
  exe = 2,
  service = 3,
  unspecified = 4,
  EXE = 2,
  SERVICE = 3,
} _vc_attributes::moduleAttribute::type_e, *P_vc_attributes::moduleAttribute::type_e;

enum tagTYPEKIND
{
  TKIND_ENUM = 0,
  TKIND_RECORD = 1,
  TKIND_MODULE = 2,
  TKIND_INTERFACE = 3,
  TKIND_DISPATCH = 4,
  TKIND_COCLASS = 5,
  TKIND_ALIAS = 6,
  TKIND_UNION = 7,
  TKIND_MAX = 8,
};

typedef struct _UNICODE_STRING
{
  /* 0x0000 */ unsigned short Length;
  /* 0x0002 */ unsigned short MaximumLength;
  /* 0x0004 */ long Padding_57;
  /* 0x0008 */ unsigned short* Buffer;
} UNICODE_STRING, *PUNICODE_STRING; /* size: 0x0010 */

typedef struct _SYSTEM_PAGEFILE_INFORMATION
{
  /* 0x0000 */ unsigned long NextEntryOffset;
  /* 0x0004 */ unsigned long TotalSize;
  /* 0x0008 */ unsigned long TotalInUse;
  /* 0x000c */ unsigned long PeakUsage;
  /* 0x0010 */ struct _UNICODE_STRING PageFileName;
} SYSTEM_PAGEFILE_INFORMATION, *PSYSTEM_PAGEFILE_INFORMATION; /* size: 0x0020 */

typedef enum _MUTANT_INFORMATION_CLASS
{
  MutantBasicInformation = 0,
  MutantOwnerInformation = 1,
} MUTANT_INFORMATION_CLASS, *PMUTANT_INFORMATION_CLASS;

typedef struct _tagDATAINFO
{
  /* 0x0000 */ unsigned long ulTotalSize;
  /* 0x0004 */ unsigned long ulavrPacketSize;
  /* 0x0008 */ unsigned long ulConnectSpeed;
  /* 0x000c */ unsigned long ulProcessorSpeed;
} tagDATAINFO, *PtagDATAINFO; /* size: 0x0010 */

struct IDispatch
{
}; /* size: 0x0008 */

struct SChannelHookCallInfo
{
  /* 0x0000 */ struct _GUID iid;
  /* 0x0010 */ unsigned long cbSize;
  /* 0x0014 */ struct _GUID uCausality;
  /* 0x0024 */ unsigned long dwServerPid;
  /* 0x0028 */ unsigned long iMethod;
  /* 0x002c */ long Padding_58;
  /* 0x0030 */ void* pObject;
}; /* size: 0x0038 */

enum tagQACONTAINERFLAGS
{
  QACONTAINER_SHOWHATCHING = 1,
  QACONTAINER_SHOWGRABHANDLES = 2,
  QACONTAINER_USERMODE = 4,
  QACONTAINER_DISPLAYASDEFAULT = 8,
  QACONTAINER_UIDEAD = 16,
  QACONTAINER_AUTOCLIP = 32,
  QACONTAINER_MESSAGEREFLECT = 64,
  QACONTAINER_SUPPORTSMNEMONICS = 128,
};

struct ITypeInfo
{
}; /* size: 0x0008 */

struct tagWIN16RECT
{
  /* 0x0000 */ unsigned short left;
  /* 0x0002 */ unsigned short top;
  /* 0x0004 */ unsigned short right;
  /* 0x0006 */ unsigned short bottom;
}; /* size: 0x0008 */

enum tagBINDSTATUS
{
  BINDSTATUS_FINDINGRESOURCE = 1,
  BINDSTATUS_CONNECTING = 2,
  BINDSTATUS_REDIRECTING = 3,
  BINDSTATUS_BEGINDOWNLOADDATA = 4,
  BINDSTATUS_DOWNLOADINGDATA = 5,
  BINDSTATUS_ENDDOWNLOADDATA = 6,
  BINDSTATUS_BEGINDOWNLOADCOMPONENTS = 7,
  BINDSTATUS_INSTALLINGCOMPONENTS = 8,
  BINDSTATUS_ENDDOWNLOADCOMPONENTS = 9,
  BINDSTATUS_USINGCACHEDCOPY = 10,
  BINDSTATUS_SENDINGREQUEST = 11,
  BINDSTATUS_CLASSIDAVAILABLE = 12,
  BINDSTATUS_MIMETYPEAVAILABLE = 13,
  BINDSTATUS_CACHEFILENAMEAVAILABLE = 14,
  BINDSTATUS_BEGINSYNCOPERATION = 15,
  BINDSTATUS_ENDSYNCOPERATION = 16,
  BINDSTATUS_BEGINUPLOADDATA = 17,
  BINDSTATUS_UPLOADINGDATA = 18,
  BINDSTATUS_ENDUPLOADDATA = 19,
  BINDSTATUS_PROTOCOLCLASSID = 20,
  BINDSTATUS_ENCODING = 21,
  BINDSTATUS_VERIFIEDMIMETYPEAVAILABLE = 22,
  BINDSTATUS_CLASSINSTALLLOCATION = 23,
  BINDSTATUS_DECODING = 24,
  BINDSTATUS_LOADINGMIMEHANDLER = 25,
  BINDSTATUS_CONTENTDISPOSITIONATTACH = 26,
  BINDSTATUS_FILTERREPORTMIMETYPE = 27,
  BINDSTATUS_CLSIDCANINSTANTIATE = 28,
  BINDSTATUS_IUNKNOWNAVAILABLE = 29,
  BINDSTATUS_DIRECTBIND = 30,
  BINDSTATUS_RAWMIMETYPE = 31,
  BINDSTATUS_PROXYDETECTING = 32,
  BINDSTATUS_ACCEPTRANGES = 33,
  BINDSTATUS_COOKIE_SENT = 34,
  BINDSTATUS_COMPACT_POLICY_RECEIVED = 35,
  BINDSTATUS_COOKIE_SUPPRESSED = 36,
  BINDSTATUS_COOKIE_STATE_UNKNOWN = 37,
  BINDSTATUS_COOKIE_STATE_ACCEPT = 38,
  BINDSTATUS_COOKIE_STATE_REJECT = 39,
  BINDSTATUS_COOKIE_STATE_PROMPT = 40,
  BINDSTATUS_COOKIE_STATE_LEASH = 41,
  BINDSTATUS_COOKIE_STATE_DOWNGRADE = 42,
  BINDSTATUS_POLICY_HREF = 43,
  BINDSTATUS_P3P_HEADER = 44,
  BINDSTATUS_SESSION_COOKIE_RECEIVED = 45,
  BINDSTATUS_PERSISTENT_COOKIE_RECEIVED = 46,
  BINDSTATUS_SESSION_COOKIES_ALLOWED = 47,
  BINDSTATUS_CACHECONTROL = 48,
  BINDSTATUS_CONTENTDISPOSITIONFILENAME = 49,
  BINDSTATUS_MIMETEXTPLAINMISMATCH = 50,
  BINDSTATUS_PUBLISHERAVAILABLE = 51,
  BINDSTATUS_DISPLAYNAMEAVAILABLE = 52,
  BINDSTATUS_SSLUX_NAVBLOCKED = 53,
  BINDSTATUS_SERVER_MIMETYPEAVAILABLE = 54,
  BINDSTATUS_SNIFFED_CLASSIDAVAILABLE = 55,
  BINDSTATUS_64BIT_PROGRESS = 56,
  BINDSTATUS_LAST = 56,
  BINDSTATUS_RESERVED_0 = 57,
  BINDSTATUS_RESERVED_1 = 58,
  BINDSTATUS_RESERVED_2 = 59,
  BINDSTATUS_RESERVED_3 = 60,
  BINDSTATUS_RESERVED_4 = 61,
  BINDSTATUS_RESERVED_5 = 62,
  BINDSTATUS_RESERVED_6 = 63,
  BINDSTATUS_RESERVED_7 = 64,
  BINDSTATUS_RESERVED_8 = 65,
  BINDSTATUS_RESERVED_9 = 66,
  BINDSTATUS_LAST_PRIVATE = 66,
};

typedef enum __MIDL_IUri_0001
{
  Uri_PROPERTY_ABSOLUTE_URI = 0,
  Uri_PROPERTY_STRING_START = 0,
  Uri_PROPERTY_AUTHORITY = 1,
  Uri_PROPERTY_DISPLAY_URI = 2,
  Uri_PROPERTY_DOMAIN = 3,
  Uri_PROPERTY_EXTENSION = 4,
  Uri_PROPERTY_FRAGMENT = 5,
  Uri_PROPERTY_HOST = 6,
  Uri_PROPERTY_PASSWORD = 7,
  Uri_PROPERTY_PATH = 8,
  Uri_PROPERTY_PATH_AND_QUERY = 9,
  Uri_PROPERTY_QUERY = 10,
  Uri_PROPERTY_RAW_URI = 11,
  Uri_PROPERTY_SCHEME_NAME = 12,
  Uri_PROPERTY_USER_INFO = 13,
  Uri_PROPERTY_USER_NAME = 14,
  Uri_PROPERTY_STRING_LAST = 14,
  Uri_PROPERTY_HOST_TYPE = 15,
  Uri_PROPERTY_DWORD_START = 15,
  Uri_PROPERTY_PORT = 16,
  Uri_PROPERTY_SCHEME = 17,
  Uri_PROPERTY_ZONE = 18,
  Uri_PROPERTY_DWORD_LAST = 18,
} _MIDL_IUri_0001, *P_MIDL_IUri_0001;

class CFileMonikerFactory
{
}; /* size: 0x0010 */

struct Windows::Rtl::IRtlFormattableInterface
{
}; /* size: 0x0008 */

enum tagOLEDCFLAGS
{
  OLEDC_NODRAW = 1,
  OLEDC_PAINTBKGND = 2,
  OLEDC_OFFSCREEN = 4,
};

typedef enum _JOURNAL_CHANGE_INFORMATION_CLASS
{
  JournalCreateKey = 0,
  JournalDeleteKey = 1,
  JournalRenameKey = 2,
  JournalSetValue = 3,
  JournalDeleteValue = 4,
  JournalSetKeySecurity = 5,
  JournalSetKeyUserFlags = 6,
  JournalSetLastWriteTime = 7,
  JournalBeginTransaction = 8,
  JournalCommitTransaction = 9,
  JournalAbortTransaction = 10,
  MaxJournalChangeAction = 11,
} JOURNAL_CHANGE_INFORMATION_CLASS, *PJOURNAL_CHANGE_INFORMATION_CLASS;

typedef struct _TRANSACTION_NOTIFICATION_MARSHAL_ARGUMENT
{
  /* 0x0000 */ unsigned long MarshalCookie;
  /* 0x0004 */ struct _GUID UOW;
} TRANSACTION_NOTIFICATION_MARSHAL_ARGUMENT, *PTRANSACTION_NOTIFICATION_MARSHAL_ARGUMENT; /* size: 0x0014 */

typedef enum _LDR_DLL_LOAD_REASON
{
  LoadReasonStaticDependency = 0,
  LoadReasonStaticForwarderDependency = 1,
  LoadReasonDynamicForwarderDependency = 2,
  LoadReasonDelayloadDependency = 3,
  LoadReasonDynamicLoad = 4,
  LoadReasonAsImageLoad = 5,
  LoadReasonAsDataLoad = 6,
  LoadReasonUnknown = -1,
} LDR_DLL_LOAD_REASON, *PLDR_DLL_LOAD_REASON;

struct IExceptionNotification
{
}; /* size: 0x0008 */

typedef enum _MINIDUMP_HANDLE_OBJECT_INFORMATION_TYPE
{
  MiniHandleObjectInformationNone = 0,
  MiniThreadInformation1 = 1,
  MiniMutantInformation1 = 2,
  MiniMutantInformation2 = 3,
  MiniProcessInformation1 = 4,
  MiniProcessInformation2 = 5,
  MiniHandleObjectInformationTypeMax = 6,
} MINIDUMP_HANDLE_OBJECT_INFORMATION_TYPE, *PMINIDUMP_HANDLE_OBJECT_INFORMATION_TYPE;

struct IStorage
{
}; /* size: 0x0008 */

typedef struct _IO_STATUS_BLOCK
{
  union
  {
    /* 0x0000 */ long Status;
    /* 0x0000 */ void* Pointer;
  }; /* size: 0x0008 */
  /* 0x0008 */ unsigned __int64 Information;
} IO_STATUS_BLOCK, *PIO_STATUS_BLOCK; /* size: 0x0010 */

typedef enum _TP_TRACE_TYPE
{
  TpTraceThreadPriority = 1,
  TpTraceThreadAffinity = 2,
  MaxTpTraceType = 3,
} TP_TRACE_TYPE, *PTP_TRACE_TYPE;

struct tagKEYBDINPUT
{
  /* 0x0000 */ unsigned short wVk;
  /* 0x0002 */ unsigned short wScan;
  /* 0x0004 */ unsigned long dwFlags;
  /* 0x0008 */ unsigned long time;
  /* 0x000c */ long Padding_59;
  /* 0x0010 */ unsigned __int64 dwExtraInfo;
}; /* size: 0x0018 */

enum tagOLERENDER
{
  OLERENDER_NONE = 0,
  OLERENDER_DRAW = 1,
  OLERENDER_FORMAT = 2,
  OLERENDER_ASIS = 3,
};

struct tagVersionedStream
{
  /* 0x0000 */ struct _GUID guidVersion;
  /* 0x0010 */ struct IStream* pStream;
}; /* size: 0x0018 */

typedef struct _DEVICE_COPY_OFFLOAD_DESCRIPTOR
{
  /* 0x0000 */ unsigned long Version;
  /* 0x0004 */ unsigned long Size;
  /* 0x0008 */ unsigned long MaximumTokenLifetime;
  /* 0x000c */ unsigned long DefaultTokenLifetime;
  /* 0x0010 */ unsigned __int64 MaximumTransferSize;
  /* 0x0018 */ unsigned __int64 OptimalTransferCount;
  /* 0x0020 */ unsigned long MaximumDataDescriptors;
  /* 0x0024 */ unsigned long MaximumTransferLengthPerDescriptor;
  /* 0x0028 */ unsigned long OptimalTransferLengthPerDescriptor;
  /* 0x002c */ unsigned short OptimalTransferLengthGranularity;
  /* 0x002e */ unsigned char Reserved[2];
} DEVICE_COPY_OFFLOAD_DESCRIPTOR, *PDEVICE_COPY_OFFLOAD_DESCRIPTOR; /* size: 0x0030 */

enum tagPROPBAG2_TYPE
{
  PROPBAG2_TYPE_UNDEFINED = 0,
  PROPBAG2_TYPE_DATA = 1,
  PROPBAG2_TYPE_URL = 2,
  PROPBAG2_TYPE_OBJECT = 3,
  PROPBAG2_TYPE_STREAM = 4,
  PROPBAG2_TYPE_STORAGE = 5,
  PROPBAG2_TYPE_MONIKER = 6,
};

typedef struct _REMOTE_PORT_VIEW
{
  /* 0x0000 */ unsigned long Length;
  /* 0x0004 */ long Padding_60;
  /* 0x0008 */ unsigned __int64 ViewSize;
  /* 0x0010 */ void* ViewBase;
} REMOTE_PORT_VIEW, *PREMOTE_PORT_VIEW; /* size: 0x0018 */

typedef struct _KSYSTEM_TIME
{
  /* 0x0000 */ unsigned long LowPart;
  /* 0x0004 */ long High1Time;
  /* 0x0008 */ long High2Time;
} KSYSTEM_TIME, *PKSYSTEM_TIME; /* size: 0x000c */

enum tagMKREDUCE
{
  MKRREDUCE_ONE = 0x30000,
  MKRREDUCE_TOUSER = 0x20000,
  MKRREDUCE_THROUGHUSER = 0x10000,
  MKRREDUCE_ALL = 0,
};

struct tagSTRINGBINDING
{
  /* 0x0000 */ unsigned short wTowerId;
  /* 0x0002 */ unsigned short aNetworkAddr;
}; /* size: 0x0004 */

class CBasedSeekPointerPtr
{
  /* 0x0000 */ unsigned __int64 _p;
}; /* size: 0x0008 */

enum READER_SEL_REQUEST_MATCH_TYPE
{
  RSR_MATCH_TYPE_READER_AND_CONTAINER = 1,
  RSR_MATCH_TYPE_SERIAL_NUMBER = 2,
  RSR_MATCH_TYPE_ALL_CARDS = 3,
};

struct READER_SEL_REQUEST
{
  /* 0x0000 */ unsigned long dwShareMode;
  /* 0x0004 */ unsigned long dwPreferredProtocols;
  /* 0x0008 */ enum READER_SEL_REQUEST_MATCH_TYPE MatchType;
  union
  {
    struct
    {
      /* 0x000c */ unsigned long cbReaderNameOffset;
      /* 0x0010 */ unsigned long cchReaderNameLength;
      /* 0x0014 */ unsigned long cbContainerNameOffset;
      /* 0x0018 */ unsigned long cchContainerNameLength;
      /* 0x001c */ unsigned long dwDesiredCardModuleVersion;
      /* 0x0020 */ unsigned long dwCspFlags;
    } /* size: 0x0018 */ ReaderAndContainerParameter;
    struct
    {
      struct
      {
        /* 0x000c */ unsigned long cbSerialNumberOffset;
        /* 0x0010 */ unsigned long cbSerialNumberLength;
        /* 0x0014 */ unsigned long dwDesiredCardModuleVersion;
      } /* size: 0x000c */ SerialNumberParameter;
      /* 0x0018 */ long __PADDING__[3];
    }; /* size: 0x0018 */
  }; /* size: 0x0018 */
}; /* size: 0x0024 */

enum POWER_STATE_HANDLER_TYPE
{
  PowerStateSleeping1 = 0,
  PowerStateSleeping2 = 1,
  PowerStateSleeping3 = 2,
  PowerStateSleeping4 = 3,
  PowerStateShutdownOff = 4,
  PowerStateShutdownReset = 5,
  PowerStateSleeping4Firmware = 6,
  PowerStateMaximum = 7,
};

struct CONFIRMSAFETY
{
  /* 0x0000 */ struct _GUID clsid;
  /* 0x0010 */ struct IUnknown* pUnk;
  /* 0x0018 */ unsigned long dwFlags;
  /* 0x001c */ long __PADDING__[1];
}; /* size: 0x0020 */

typedef struct _FILE_REPARSE_POINT_INFORMATION
{
  /* 0x0000 */ __int64 FileReference;
  /* 0x0008 */ unsigned long Tag;
  /* 0x000c */ long __PADDING__[1];
} FILE_REPARSE_POINT_INFORMATION, *PFILE_REPARSE_POINT_INFORMATION; /* size: 0x0010 */

class Windows::Rtl::AutoInterface<Windows::Rtl::IRtlWORAStream *,Windows::Auto<Windows::Rtl::IRtlWORAStream *> >
{
}; /* size: 0x0008 */

typedef struct _CMSG_STREAM_INFO
{
  /* 0x0000 */ unsigned long cbContent;
  /* 0x0004 */ long Padding_61;
  /* 0x0008 */ void* pfnStreamOutput /* function */;
  /* 0x0010 */ void* pvArg;
} CMSG_STREAM_INFO, *PCMSG_STREAM_INFO; /* size: 0x0018 */

enum tagUASFLAGS
{
  UAS_NORMAL = 0,
  UAS_BLOCKED = 1,
  UAS_NOPARENTENABLE = 2,
  UAS_MASK = 3,
};

struct tagSAFEARRAYBOUND
{
  /* 0x0000 */ unsigned long cElements;
  /* 0x0004 */ long lLbound;
}; /* size: 0x0008 */

typedef struct _RTL_QUERY_REGISTRY_TABLE
{
  /* 0x0000 */ void* QueryRoutine /* function */;
  /* 0x0008 */ unsigned long Flags;
  /* 0x000c */ long Padding_62;
  /* 0x0010 */ wchar_t* Name;
  /* 0x0018 */ void* EntryContext;
  /* 0x0020 */ unsigned long DefaultType;
  /* 0x0024 */ long Padding_63;
  /* 0x0028 */ void* DefaultData;
  /* 0x0030 */ unsigned long DefaultLength;
  /* 0x0034 */ long __PADDING__[1];
} RTL_QUERY_REGISTRY_TABLE, *PRTL_QUERY_REGISTRY_TABLE; /* size: 0x0038 */

class CCoTaskAllocator
{
}; /* size: 0x0008 */

struct DISPLAYCONFIG_SET_TARGET_PERSISTENCE
{
  /* 0x0000 */ struct DISPLAYCONFIG_DEVICE_INFO_HEADER header;
  union
  {
    struct /* bitfield */
    {
      /* 0x0014 */ unsigned int bootPersistenceOn : 1; /* bit position: 0 */
      /* 0x0014 */ unsigned int reserved : 31; /* bit position: 1 */
    }; /* bitfield */
    /* 0x0014 */ unsigned int value;
  }; /* size: 0x0004 */
}; /* size: 0x0018 */

typedef enum _tagINTERNETFEATURELIST
{
  FEATURE_OBJECT_CACHING = 0,
  FEATURE_ZONE_ELEVATION = 1,
  FEATURE_MIME_HANDLING = 2,
  FEATURE_MIME_SNIFFING = 3,
  FEATURE_WINDOW_RESTRICTIONS = 4,
  FEATURE_WEBOC_POPUPMANAGEMENT = 5,
  FEATURE_BEHAVIORS = 6,
  FEATURE_DISABLE_MK_PROTOCOL = 7,
  FEATURE_LOCALMACHINE_LOCKDOWN = 8,
  FEATURE_SECURITYBAND = 9,
  FEATURE_RESTRICT_ACTIVEXINSTALL = 10,
  FEATURE_VALIDATE_NAVIGATE_URL = 11,
  FEATURE_RESTRICT_FILEDOWNLOAD = 12,
  FEATURE_ADDON_MANAGEMENT = 13,
  FEATURE_PROTOCOL_LOCKDOWN = 14,
  FEATURE_HTTP_USERNAME_PASSWORD_DISABLE = 15,
  FEATURE_SAFE_BINDTOOBJECT = 16,
  FEATURE_UNC_SAVEDFILECHECK = 17,
  FEATURE_GET_URL_DOM_FILEPATH_UNENCODED = 18,
  FEATURE_TABBED_BROWSING = 19,
  FEATURE_SSLUX = 20,
  FEATURE_DISABLE_NAVIGATION_SOUNDS = 21,
  FEATURE_DISABLE_LEGACY_COMPRESSION = 22,
  FEATURE_FORCE_ADDR_AND_STATUS = 23,
  FEATURE_XMLHTTP = 24,
  FEATURE_DISABLE_TELNET_PROTOCOL = 25,
  FEATURE_FEEDS = 26,
  FEATURE_BLOCK_INPUT_PROMPTS = 27,
  FEATURE_ENTRY_COUNT = 28,
} tagINTERNETFEATURELIST, *PtagINTERNETFEATURELIST;

struct IAbandonmentNotification
{
}; /* size: 0x0008 */

typedef enum _DMA_WIDTH
{
  Width8Bits = 0,
  Width16Bits = 1,
  Width32Bits = 2,
  Width64Bits = 3,
  WidthNoWrap = 4,
  MaximumDmaWidth = 5,
} DMA_WIDTH, *PDMA_WIDTH;

typedef struct _PRINTER_NOTIFY_OPTIONS_TYPE
{
  /* 0x0000 */ unsigned short Type;
  /* 0x0002 */ unsigned short Reserved0;
  /* 0x0004 */ unsigned long Reserved1;
  /* 0x0008 */ unsigned long Reserved2;
  /* 0x000c */ unsigned long Count;
  /* 0x0010 */ unsigned short* pFields;
} PRINTER_NOTIFY_OPTIONS_TYPE, *PPRINTER_NOTIFY_OPTIONS_TYPE; /* size: 0x0018 */

typedef enum _MINIDUMP_SECONDARY_FLAGS
{
  MiniSecondaryWithoutPowerInfo = 1,
  MiniSecondaryValidFlags = 1,
} MINIDUMP_SECONDARY_FLAGS, *PMINIDUMP_SECONDARY_FLAGS;

struct IWinRTRuntimeClassInfo
{
}; /* size: 0x0008 */

typedef enum __MIDL_IBindStatusCallback_0006
{
  BSCF_FIRSTDATANOTIFICATION = 1,
  BSCF_INTERMEDIATEDATANOTIFICATION = 2,
  BSCF_LASTDATANOTIFICATION = 4,
  BSCF_DATAFULLYAVAILABLE = 8,
  BSCF_AVAILABLEDATASIZEUNKNOWN = 16,
  BSCF_SKIPDRAINDATAFORFILEURLS = 32,
  BSCF_64BITLENGTHDOWNLOAD = 64,
} _MIDL_IBindStatusCallback_0006, *P_MIDL_IBindStatusCallback_0006;

typedef struct _IMAGE_SYMBOL_EX
{
  union
  {
    union
    {
      /* 0x0000 */ unsigned char ShortName[8];
      struct
      {
        /* 0x0000 */ unsigned long Short;
        /* 0x0004 */ unsigned long Long;
      } /* size: 0x0008 */ Name;
      /* 0x0000 */ unsigned long LongName[2];
    }; /* size: 0x0008 */
  } /* size: 0x0008 */ N;
  /* 0x0008 */ unsigned long Value;
  /* 0x000c */ long SectionNumber;
  /* 0x0010 */ unsigned short Type;
  /* 0x0012 */ unsigned char StorageClass;
  /* 0x0013 */ unsigned char NumberOfAuxSymbols;
} IMAGE_SYMBOL_EX, *PIMAGE_SYMBOL_EX; /* size: 0x0014 */

class XIPersistFile
{
  /* 0x0000 */ struct IPersistFile* _p;
}; /* size: 0x0008 */

struct tagMOUSEINPUT
{
  /* 0x0000 */ long dx;
  /* 0x0004 */ long dy;
  /* 0x0008 */ unsigned long mouseData;
  /* 0x000c */ unsigned long dwFlags;
  /* 0x0010 */ unsigned long time;
  /* 0x0014 */ long Padding_64;
  /* 0x0018 */ unsigned __int64 dwExtraInfo;
}; /* size: 0x0020 */

struct tagHARDWAREINPUT
{
  /* 0x0000 */ unsigned long uMsg;
  /* 0x0004 */ unsigned short wParamL;
  /* 0x0006 */ unsigned short wParamH;
}; /* size: 0x0008 */

struct tagINPUT
{
  /* 0x0000 */ unsigned long type;
  /* 0x0004 */ long Padding_65;
  union
  {
    /* 0x0008 */ struct tagMOUSEINPUT mi;
    /* 0x0008 */ struct tagKEYBDINPUT ki;
    struct
    {
      /* 0x0008 */ struct tagHARDWAREINPUT hi;
      /* 0x0010 */ long __PADDING__[6];
    }; /* size: 0x0020 */
  }; /* size: 0x0020 */
}; /* size: 0x0028 */

typedef struct _XSTATE_FEATURE
{
  /* 0x0000 */ unsigned long Offset;
  /* 0x0004 */ unsigned long Size;
} XSTATE_FEATURE, *PXSTATE_FEATURE; /* size: 0x0008 */

typedef struct _XSTATE_CONFIGURATION
{
  /* 0x0000 */ unsigned __int64 EnabledFeatures;
  /* 0x0008 */ unsigned __int64 EnabledVolatileFeatures;
  /* 0x0010 */ unsigned long Size;
  /* 0x0014 */ unsigned long OptimizedSave : 1; /* bit position: 0 */
  /* 0x0018 */ struct _XSTATE_FEATURE Features[64];
} XSTATE_CONFIGURATION, *PXSTATE_CONFIGURATION; /* size: 0x0218 */

typedef struct _STORAGE_LB_PROVISIONING_MAP_RESOURCES
{
  /* 0x0000 */ unsigned long Size;
  /* 0x0004 */ unsigned long Version;
  struct /* bitfield */
  {
    /* 0x0008 */ unsigned char AvailableMappingResourcesValid : 1; /* bit position: 0 */
    /* 0x0008 */ unsigned char UsedMappingResourcesValid : 1; /* bit position: 1 */
    /* 0x0008 */ unsigned char Reserved0 : 6; /* bit position: 2 */
  }; /* bitfield */
  /* 0x0009 */ unsigned char Reserved1[3];
  struct /* bitfield */
  {
    /* 0x000c */ unsigned char AvailableMappingResourcesScope : 2; /* bit position: 0 */
    /* 0x000c */ unsigned char UsedMappingResourcesScope : 2; /* bit position: 2 */
    /* 0x000c */ unsigned char Reserved2 : 4; /* bit position: 4 */
  }; /* bitfield */
  /* 0x000d */ unsigned char Reserved3[3];
  /* 0x0010 */ unsigned __int64 AvailableMappingResources;
  /* 0x0018 */ unsigned __int64 UsedMappingResources;
} STORAGE_LB_PROVISIONING_MAP_RESOURCES, *PSTORAGE_LB_PROVISIONING_MAP_RESOURCES; /* size: 0x0020 */

enum DISPLAYCONFIG_PIXELFORMAT
{
  DISPLAYCONFIG_PIXELFORMAT_8BPP = 1,
  DISPLAYCONFIG_PIXELFORMAT_16BPP = 2,
  DISPLAYCONFIG_PIXELFORMAT_24BPP = 3,
  DISPLAYCONFIG_PIXELFORMAT_32BPP = 4,
  DISPLAYCONFIG_PIXELFORMAT_NONGDI = 5,
  DISPLAYCONFIG_PIXELFORMAT_FORCE_UINT32 = -1,
};

typedef struct _RPC_SEC_CONTEXT_KEY_INFO
{
  /* 0x0000 */ unsigned long EncryptAlgorithm;
  /* 0x0004 */ unsigned long KeySize;
  /* 0x0008 */ unsigned long SignatureAlgorithm;
} RPC_SEC_CONTEXT_KEY_INFO, *PRPC_SEC_CONTEXT_KEY_INFO; /* size: 0x000c */

typedef struct _KAFFINITY_ENUMERATION_CONTEXT
{
  /* 0x0000 */ struct _KAFFINITY_EX* Affinity;
  /* 0x0008 */ unsigned __int64 CurrentMask;
  /* 0x0010 */ unsigned short CurrentIndex;
  /* 0x0012 */ char __PADDING__[6];
} KAFFINITY_ENUMERATION_CONTEXT, *PKAFFINITY_ENUMERATION_CONTEXT; /* size: 0x0018 */

class Windows::AutoPointerBase<Windows::Rtl::IRtlWOFOUCSStream *,Windows::Auto<Windows::Rtl::IRtlWOFOUCSStream *> >
{
  /* 0x0000 */ struct Windows::Rtl::IRtlWOFOUCSStream* m_Data;
}; /* size: 0x0008 */

enum tagACTIVATEFLAGS
{
  ACTIVATE_WINDOWLESS = 1,
};

typedef struct _EXCEPTION_REGISTRATION_RECORD
{
  /* 0x0000 */ struct _EXCEPTION_REGISTRATION_RECORD* Next;
  /* 0x0008 */ void* Handler /* function */;
} EXCEPTION_REGISTRATION_RECORD, *PEXCEPTION_REGISTRATION_RECORD; /* size: 0x0010 */

typedef struct _FILE_NETWORK_OPEN_INFORMATION
{
  /* 0x0000 */ union _LARGE_INTEGER CreationTime;
  /* 0x0008 */ union _LARGE_INTEGER LastAccessTime;
  /* 0x0010 */ union _LARGE_INTEGER LastWriteTime;
  /* 0x0018 */ union _LARGE_INTEGER ChangeTime;
  /* 0x0020 */ union _LARGE_INTEGER AllocationSize;
  /* 0x0028 */ union _LARGE_INTEGER EndOfFile;
  /* 0x0030 */ unsigned long FileAttributes;
  /* 0x0034 */ long __PADDING__[1];
} FILE_NETWORK_OPEN_INFORMATION, *PFILE_NETWORK_OPEN_INFORMATION; /* size: 0x0038 */

enum RTL_BSD_ITEM_TYPE
{
  RtlBsdItemVersionNumber = 0,
  RtlBsdItemProductType = 1,
  RtlBsdItemAabEnabled = 2,
  RtlBsdItemAabTimeout = 3,
  RtlBsdItemBootGood = 4,
  RtlBsdItemBootShutdown = 5,
  RtlBsdSleepInProgress = 6,
  RtlBsdPowerTransition = 7,
  RtlBsdItemBootAttemptCount = 8,
  RtlBsdItemBootCheckpoint = 9,
  RtlBsdItemMax = 10,
};

typedef enum _SAFER_POLICY_INFO_CLASS
{
  SaferPolicyLevelList = 1,
  SaferPolicyEnableTransparentEnforcement = 2,
  SaferPolicyDefaultLevel = 3,
  SaferPolicyEvaluateUserScope = 4,
  SaferPolicyScopeFlags = 5,
  SaferPolicyDefaultLevelFlags = 6,
  SaferPolicyAuthenticodeEnabled = 7,
} SAFER_POLICY_INFO_CLASS, *PSAFER_POLICY_INFO_CLASS;

typedef enum _TAG_UNNAMED_3
{
  sevInfo = 0,
  sevProblem = 1,
  sevAttn = 2,
  sevFatal = 3,
  sevMax = 4,
} TAG_UNNAMED_3, *PTAG_UNNAMED_3;

typedef struct _SD_ENUM_SDS_ENTRY
{
  /* 0x0000 */ unsigned long Hash;
  /* 0x0004 */ unsigned long SecurityId;
  /* 0x0008 */ unsigned __int64 Offset;
  /* 0x0010 */ unsigned long Length;
  /* 0x0014 */ unsigned char Descriptor[1];
  /* 0x0015 */ char __PADDING__[3];
} SD_ENUM_SDS_ENTRY, *PSD_ENUM_SDS_ENTRY; /* size: 0x0018 */

typedef struct _SD_ENUM_SDS_OUTPUT
{
  /* 0x0000 */ unsigned __int64 NextOffset;
  /* 0x0008 */ unsigned __int64 NumSDEntriesReturned;
  /* 0x0010 */ unsigned __int64 NumSDBytesReturned;
  /* 0x0018 */ struct _SD_ENUM_SDS_ENTRY SDEntry[1];
} SD_ENUM_SDS_OUTPUT, *PSD_ENUM_SDS_OUTPUT; /* size: 0x0030 */

struct tagBIND_OPTS2
{
  /* 0x0000 */ long Padding_66[4];
  /* 0x0010 */ unsigned long dwTrackFlags;
  /* 0x0014 */ unsigned long dwClassContext;
  /* 0x0018 */ unsigned long locale;
  /* 0x001c */ long Padding_67;
  /* 0x0020 */ struct _COSERVERINFO* pServerInfo;
}; /* size: 0x0028 */

typedef enum _ELEMENT_TYPE
{
  AllElements = 0,
  ChangerTransport = 1,
  ChangerSlot = 2,
  ChangerIEPort = 3,
  ChangerDrive = 4,
  ChangerDoor = 5,
  ChangerKeypad = 6,
  ChangerMaxElement = 7,
} ELEMENT_TYPE, *PELEMENT_TYPE;

typedef struct _CHANGER_ELEMENT
{
  /* 0x0000 */ enum _ELEMENT_TYPE ElementType;
  /* 0x0004 */ unsigned long ElementAddress;
} CHANGER_ELEMENT, *PCHANGER_ELEMENT; /* size: 0x0008 */

typedef struct _CHANGER_EXCHANGE_MEDIUM
{
  /* 0x0000 */ struct _CHANGER_ELEMENT Transport;
  /* 0x0008 */ struct _CHANGER_ELEMENT Source;
  /* 0x0010 */ struct _CHANGER_ELEMENT Destination1;
  /* 0x0018 */ struct _CHANGER_ELEMENT Destination2;
  /* 0x0020 */ unsigned char Flip1;
  /* 0x0021 */ unsigned char Flip2;
  /* 0x0022 */ char __PADDING__[2];
} CHANGER_EXCHANGE_MEDIUM, *PCHANGER_EXCHANGE_MEDIUM; /* size: 0x0024 */

enum TrustLevel
{
  BaseTrust = 0,
  PartialTrust = 1,
  FullTrust = 2,
};

typedef struct _RPC_HTTP_TRANSPORT_CREDENTIALS_V2_W
{
  /* 0x0000 */ struct _SEC_WINNT_AUTH_IDENTITY_W* TransportCredentials;
  /* 0x0008 */ unsigned long Flags;
  /* 0x000c */ unsigned long AuthenticationTarget;
  /* 0x0010 */ unsigned long NumberOfAuthnSchemes;
  /* 0x0014 */ long Padding_68;
  /* 0x0018 */ unsigned long* AuthnSchemes;
  /* 0x0020 */ unsigned short* ServerCertificateSubject;
  /* 0x0028 */ struct _SEC_WINNT_AUTH_IDENTITY_W* ProxyCredentials;
  /* 0x0030 */ unsigned long NumberOfProxyAuthnSchemes;
  /* 0x0034 */ long Padding_69;
  /* 0x0038 */ unsigned long* ProxyAuthnSchemes;
} RPC_HTTP_TRANSPORT_CREDENTIALS_V2_W, *PRPC_HTTP_TRANSPORT_CREDENTIALS_V2_W; /* size: 0x0040 */

enum tagBINDSTRING
{
  BINDSTRING_HEADERS = 1,
  BINDSTRING_ACCEPT_MIMES = 2,
  BINDSTRING_EXTRA_URL = 3,
  BINDSTRING_LANGUAGE = 4,
  BINDSTRING_USERNAME = 5,
  BINDSTRING_PASSWORD = 6,
  BINDSTRING_UA_PIXELS = 7,
  BINDSTRING_UA_COLOR = 8,
  BINDSTRING_OS = 9,
  BINDSTRING_USER_AGENT = 10,
  BINDSTRING_ACCEPT_ENCODINGS = 11,
  BINDSTRING_POST_COOKIE = 12,
  BINDSTRING_POST_DATA_MIME = 13,
  BINDSTRING_URL = 14,
  BINDSTRING_IID = 15,
  BINDSTRING_FLAG_BIND_TO_OBJECT = 16,
  BINDSTRING_PTR_BIND_CONTEXT = 17,
  BINDSTRING_XDR_ORIGIN = 18,
  BINDSTRING_DOWNLOADPATH = 19,
  BINDSTRING_ROOTDOC_URL = 20,
  BINDSTRING_INITIAL_FILENAME = 21,
  BINDSTRING_PROXY_USERNAME = 22,
  BINDSTRING_PROXY_PASSWORD = 23,
};

typedef enum _TAG_UNNAMED_4
{
  hdBase = 0,
  hdSym = 1,
  hdSrc = 2,
  hdMax = 3,
} TAG_UNNAMED_4, *PTAG_UNNAMED_4;

struct Windows::AutoPointerBase<Windows::Rtl::IRtlWOFOUCSStream *,Windows::Auto<Windows::Rtl::IRtlWOFOUCSStream *> >::is_pointer<Windows::Rtl::IRtlWOFOUCSStream *>
{
}; /* size: 0x0001 */

enum ORIENTATION_PREFERENCE
{
  ORIENTATION_PREFERENCE_NONE = 0,
  ORIENTATION_PREFERENCE_LANDSCAPE = 1,
  ORIENTATION_PREFERENCE_PORTRAIT = 2,
  ORIENTATION_PREFERENCE_LANDSCAPE_FLIPPED = 4,
  ORIENTATION_PREFERENCE_PORTRAIT_FLIPPED = 8,
};

class CDelayUnlockContainer
{
  /* 0x0000 */ long Padding_70[2];
  /* 0x0008 */ unsigned long m_refs;
  /* 0x000c */ long Padding_71;
  /* 0x0010 */ struct IOleItemContainer* m_pOleCont;
}; /* size: 0x0018 */

typedef struct _OFLONGSTRUCTW
{
  /* 0x0000 */ unsigned int nErrCode;
  /* 0x0004 */ wchar_t szPathName[260];
} OFLONGSTRUCTW, *POFLONGSTRUCTW; /* size: 0x020c */

struct XSAVE_CPU_INFO
{
  /* 0x0000 */ unsigned char Processor;
  /* 0x0001 */ char Padding_72;
  /* 0x0002 */ unsigned short Family;
  /* 0x0004 */ unsigned short Model;
  /* 0x0006 */ unsigned short Stepping;
  /* 0x0008 */ unsigned short ExtendedModel;
  /* 0x000a */ char Padding_73[2];
  /* 0x000c */ unsigned long ExtendedFamily;
  /* 0x0010 */ unsigned __int64 MicrocodeVersion;
  /* 0x0018 */ unsigned long Reserved;
  /* 0x001c */ long __PADDING__[1];
}; /* size: 0x0020 */

typedef struct _XSAVE_SUPPORTED_CPU
{
  /* 0x0000 */ struct XSAVE_CPU_INFO CpuInfo;
  union
  {
    /* 0x0020 */ struct XSAVE_CPU_ERRATA* CpuErrata;
    /* 0x0020 */ unsigned __int64 Unused;
  }; /* size: 0x0008 */
} XSAVE_SUPPORTED_CPU, *PXSAVE_SUPPORTED_CPU; /* size: 0x0028 */

typedef struct _XSAVE_VENDOR
{
  /* 0x0000 */ unsigned long VendorId[3];
  /* 0x000c */ long Padding_74;
  /* 0x0010 */ struct _XSAVE_SUPPORTED_CPU SupportedCpu;
} XSAVE_VENDOR, *PXSAVE_VENDOR; /* size: 0x0038 */

typedef struct _XSAVE_VENDORS
{
  /* 0x0000 */ unsigned long NumberOfVendors;
  /* 0x0004 */ long Padding_75;
  /* 0x0008 */ struct _XSAVE_VENDOR Vendor[1];
} XSAVE_VENDORS, *PXSAVE_VENDORS; /* size: 0x0040 */

typedef enum _FP_IEEE_OPERATION_CODE
{
  FpCodeUnspecified = 0,
  FpCodeAdd = 1,
  FpCodeSubtract = 2,
  FpCodeMultiply = 3,
  FpCodeDivide = 4,
  FpCodeSquareRoot = 5,
  FpCodeRemainder = 6,
  FpCodeCompare = 7,
  FpCodeConvert = 8,
  FpCodeRound = 9,
  FpCodeTruncate = 10,
  FpCodeFloor = 11,
  FpCodeCeil = 12,
  FpCodeAcos = 13,
  FpCodeAsin = 14,
  FpCodeAtan = 15,
  FpCodeAtan2 = 16,
  FpCodeCabs = 17,
  FpCodeCos = 18,
  FpCodeCosh = 19,
  FpCodeExp = 20,
  FpCodeFabs = 21,
  FpCodeFmod = 22,
  FpCodeFrexp = 23,
  FpCodeHypot = 24,
  FpCodeLdexp = 25,
  FpCodeLog = 26,
  FpCodeLog10 = 27,
  FpCodeModf = 28,
  FpCodePow = 29,
  FpCodeSin = 30,
  FpCodeSinh = 31,
  FpCodeTan = 32,
  FpCodeTanh = 33,
  FpCodeY0 = 34,
  FpCodeY1 = 35,
  FpCodeYn = 36,
} FP_IEEE_OPERATION_CODE, *PFP_IEEE_OPERATION_CODE;

typedef enum _TAPE_DRIVE_PROBLEM_TYPE
{
  TapeDriveProblemNone = 0,
  TapeDriveReadWriteWarning = 1,
  TapeDriveReadWriteError = 2,
  TapeDriveReadWarning = 3,
  TapeDriveWriteWarning = 4,
  TapeDriveReadError = 5,
  TapeDriveWriteError = 6,
  TapeDriveHardwareError = 7,
  TapeDriveUnsupportedMedia = 8,
  TapeDriveScsiConnectionError = 9,
  TapeDriveTimetoClean = 10,
  TapeDriveCleanDriveNow = 11,
  TapeDriveMediaLifeExpired = 12,
  TapeDriveSnappedTape = 13,
} TAPE_DRIVE_PROBLEM_TYPE, *PTAPE_DRIVE_PROBLEM_TYPE;

struct tagLOGBRUSH
{
  /* 0x0000 */ unsigned int lbStyle;
  /* 0x0004 */ unsigned long lbColor;
  /* 0x0008 */ unsigned __int64 lbHatch;
}; /* size: 0x0010 */

typedef struct _COAUTHINFO
{
  /* 0x0000 */ unsigned long dwAuthnSvc;
  /* 0x0004 */ unsigned long dwAuthzSvc;
  /* 0x0008 */ wchar_t* pwszServerPrincName;
  /* 0x0010 */ unsigned long dwAuthnLevel;
  /* 0x0014 */ unsigned long dwImpersonationLevel;
  /* 0x0018 */ struct _COAUTHIDENTITY* pAuthIdentityData;
  /* 0x0020 */ unsigned long dwCapabilities;
  /* 0x0024 */ long __PADDING__[1];
} COAUTHINFO, *PCOAUTHINFO; /* size: 0x0028 */

typedef struct _PRINTER_CONNECTION_INFO_1A
{
  /* 0x0000 */ unsigned long dwFlags;
  /* 0x0004 */ long Padding_76;
  /* 0x0008 */ char* pszDriverName;
} PRINTER_CONNECTION_INFO_1A, *PPRINTER_CONNECTION_INFO_1A; /* size: 0x0010 */

class CLimitedEnum<IEnumFORMATETC,tagFORMATETC>::Skip::__l3::<lambda_3F3786490CA4221E>;

enum tagLIBFLAGS
{
  LIBFLAG_FRESTRICTED = 1,
  LIBFLAG_FCONTROL = 2,
  LIBFLAG_FHIDDEN = 4,
  LIBFLAG_FHASDISKIMAGE = 8,
};

typedef struct _PATHNAME_BUFFER
{
  /* 0x0000 */ unsigned long PathNameLength;
  /* 0x0004 */ wchar_t Name[1];
  /* 0x0006 */ char __PADDING__[2];
} PATHNAME_BUFFER, *PPATHNAME_BUFFER; /* size: 0x0008 */

enum tagCOMCALLTYPE
{
  CALLTYPE_OUTGOING_CALL = 0,
  CALLTYPE_INCOMING_CALL = 1,
  CALLTYPE_ACTIVATION = 2,
};

struct tagENHMETAHEADER
{
  /* 0x0000 */ unsigned long iType;
  /* 0x0004 */ unsigned long nSize;
  /* 0x0008 */ struct _RECTL rclBounds;
  /* 0x0018 */ struct _RECTL rclFrame;
  /* 0x0028 */ unsigned long dSignature;
  /* 0x002c */ unsigned long nVersion;
  /* 0x0030 */ unsigned long nBytes;
  /* 0x0034 */ unsigned long nRecords;
  /* 0x0038 */ unsigned short nHandles;
  /* 0x003a */ unsigned short sReserved;
  /* 0x003c */ unsigned long nDescription;
  /* 0x0040 */ unsigned long offDescription;
  /* 0x0044 */ unsigned long nPalEntries;
  /* 0x0048 */ struct tagSIZE szlDevice;
  /* 0x0050 */ struct tagSIZE szlMillimeters;
  /* 0x0058 */ unsigned long cbPixelFormat;
  /* 0x005c */ unsigned long offPixelFormat;
  /* 0x0060 */ unsigned long bOpenGL;
  /* 0x0064 */ struct tagSIZE szlMicrometers;
}; /* size: 0x006c */

struct ISpecialSystemProperties
{
}; /* size: 0x0008 */

enum tagVIEWSTATUS
{
  VIEWSTATUS_OPAQUE = 1,
  VIEWSTATUS_SOLIDBKGND = 2,
  VIEWSTATUS_DVASPECTOPAQUE = 4,
  VIEWSTATUS_DVASPECTTRANSPARENT = 8,
  VIEWSTATUS_SURFACE = 16,
  VIEWSTATUS_3DSURFACE = 32,
};

class CBasedFreeBlockPtr
{
  /* 0x0000 */ unsigned __int64 _p;
}; /* size: 0x0008 */

class CFreeList
{
  /* 0x0000 */ class CBasedFreeBlockPtr _pfbHead;
}; /* size: 0x0008 */

typedef struct _NDR64_PROC_FORMAT
{
  /* 0x0000 */ unsigned int Flags;
  /* 0x0004 */ unsigned int StackSize;
  /* 0x0008 */ unsigned int ConstantClientBufferSize;
  /* 0x000c */ unsigned int ConstantServerBufferSize;
  /* 0x0010 */ unsigned short RpcFlags;
  /* 0x0012 */ unsigned short FloatDoubleMask;
  /* 0x0014 */ unsigned short NumberOfParams;
  /* 0x0016 */ unsigned short ExtensionSize;
} NDR64_PROC_FORMAT, *PNDR64_PROC_FORMAT; /* size: 0x0018 */

typedef struct _NDR64_PARAM_FLAGS
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned short MustSize : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned short MustFree : 1; /* bit position: 1 */
    /* 0x0000 */ unsigned short IsPipe : 1; /* bit position: 2 */
    /* 0x0000 */ unsigned short IsIn : 1; /* bit position: 3 */
    /* 0x0000 */ unsigned short IsOut : 1; /* bit position: 4 */
    /* 0x0000 */ unsigned short IsReturn : 1; /* bit position: 5 */
    /* 0x0000 */ unsigned short IsBasetype : 1; /* bit position: 6 */
    /* 0x0000 */ unsigned short IsByValue : 1; /* bit position: 7 */
    /* 0x0000 */ unsigned short IsSimpleRef : 1; /* bit position: 8 */
    /* 0x0000 */ unsigned short IsDontCallFreeInst : 1; /* bit position: 9 */
    /* 0x0000 */ unsigned short SaveForAsyncFinish : 1; /* bit position: 10 */
    /* 0x0000 */ unsigned short IsPartialIgnore : 1; /* bit position: 11 */
    /* 0x0000 */ unsigned short IsForceAllocate : 1; /* bit position: 12 */
    /* 0x0000 */ unsigned short Reserved : 2; /* bit position: 13 */
    /* 0x0000 */ unsigned short UseCache : 1; /* bit position: 15 */
  }; /* bitfield */
} NDR64_PARAM_FLAGS, *PNDR64_PARAM_FLAGS; /* size: 0x0002 */

typedef struct _NDR64_PARAM_FORMAT
{
  /* 0x0000 */ const void* Type;
  /* 0x0008 */ struct _NDR64_PARAM_FLAGS Attributes;
  /* 0x000a */ unsigned short Reserved;
  /* 0x000c */ unsigned int StackOffset;
} NDR64_PARAM_FORMAT, *PNDR64_PARAM_FORMAT; /* size: 0x0010 */

typedef struct __midl_frag359_t
{
  /* 0x0000 */ struct _NDR64_PROC_FORMAT frag1;
  /* 0x0018 */ struct _NDR64_PARAM_FORMAT frag2;
  /* 0x0028 */ struct _NDR64_PARAM_FORMAT frag3;
  /* 0x0038 */ struct _NDR64_PARAM_FORMAT frag4;
} _midl_frag359_t, *P_midl_frag359_t; /* size: 0x0048 */

typedef struct _FIXED
{
  /* 0x0000 */ unsigned short fract;
  /* 0x0002 */ short value;
} FIXED, *PFIXED; /* size: 0x0004 */

typedef enum _RTL_RXACT_OPERATION
{
  RtlRXactOperationDelete = 1,
  RtlRXactOperationSetValue = 2,
  RtlRXactOperationDelAttribute = 3,
  RtlRXactOperationSetAttribute = 4,
} RTL_RXACT_OPERATION, *PRTL_RXACT_OPERATION;

typedef struct _MINIDUMP_MEMORY_INFO
{
  /* 0x0000 */ unsigned __int64 BaseAddress;
  /* 0x0008 */ unsigned __int64 AllocationBase;
  /* 0x0010 */ unsigned int AllocationProtect;
  /* 0x0014 */ unsigned int __alignment1;
  /* 0x0018 */ unsigned __int64 RegionSize;
  /* 0x0020 */ unsigned int State;
  /* 0x0024 */ unsigned int Protect;
  /* 0x0028 */ unsigned int Type;
  /* 0x002c */ unsigned int __alignment2;
} MINIDUMP_MEMORY_INFO, *PMINIDUMP_MEMORY_INFO; /* size: 0x0030 */

typedef struct _MINIDUMP_CALLBACK_OUTPUT
{
  union
  {
    /* 0x0000 */ unsigned long ModuleWriteFlags;
    /* 0x0000 */ unsigned long ThreadWriteFlags;
    /* 0x0000 */ unsigned long SecondaryFlags;
    struct
    {
      /* 0x0000 */ unsigned __int64 MemoryBase;
      /* 0x0008 */ unsigned long MemorySize;
    }; /* size: 0x000c */
    struct
    {
      /* 0x0000 */ int CheckCancel;
      /* 0x0004 */ int Cancel;
    }; /* size: 0x0008 */
    /* 0x0000 */ void* Handle;
    struct
    {
      /* 0x0000 */ struct _MINIDUMP_MEMORY_INFO VmRegion;
      /* 0x0030 */ int Continue;
    }; /* size: 0x0034 */
    struct
    {
      /* 0x0000 */ HRESULT Status;
      /* 0x0004 */ long __PADDING__[12];
    }; /* size: 0x0034 */
  }; /* size: 0x0034 */
} MINIDUMP_CALLBACK_OUTPUT, *PMINIDUMP_CALLBACK_OUTPUT; /* size: 0x0034 */

typedef union _RTL_RUN_ONCE
{
  union
  {
    /* 0x0000 */ void* Ptr;
    /* 0x0000 */ unsigned __int64 Value;
    /* 0x0000 */ unsigned __int64 State : 2; /* bit position: 0 */
  }; /* size: 0x0008 */
} RTL_RUN_ONCE, *PRTL_RUN_ONCE; /* size: 0x0008 */

enum tagAPTKIND
{
  APTKIND_NEUTRALTHREADED = 1,
  APTKIND_MULTITHREADED = 2,
  APTKIND_APARTMENTTHREADED = 4,
  APTKIND_APPLICATION_STA = 8,
};

typedef struct _RTL_SRWLOCK
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned __int64 Locked : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned __int64 Waiting : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned __int64 Waking : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned __int64 MultipleShared : 1; /* bit position: 3 */
      /* 0x0000 */ unsigned __int64 Shared : 60; /* bit position: 4 */
    }; /* bitfield */
    /* 0x0000 */ unsigned __int64 Value;
    /* 0x0000 */ void* Ptr;
  }; /* size: 0x0008 */
} RTL_SRWLOCK, *PRTL_SRWLOCK; /* size: 0x0008 */

class Microsoft::WRL::ComPtr<IWeakReference>
{
  /* 0x0000 */ struct IWeakReference* ptr_;
}; /* size: 0x0008 */

typedef struct _RTL_CRITICAL_SECTION
{
  /* 0x0000 */ struct _RTL_CRITICAL_SECTION_DEBUG* DebugInfo;
  /* 0x0008 */ long LockCount;
  /* 0x000c */ long RecursionCount;
  /* 0x0010 */ void* OwningThread;
  /* 0x0018 */ void* LockSemaphore;
  /* 0x0020 */ unsigned __int64 SpinCount;
} RTL_CRITICAL_SECTION, *PRTL_CRITICAL_SECTION; /* size: 0x0028 */

class COleStaticMutexSem
{
  /* 0x0000 */ unsigned char _fInitialized;
  /* 0x0001 */ unsigned char _fUseSpincount;
  /* 0x0002 */ char Padding_77[2];
  /* 0x0004 */ unsigned long _cLocks;
  /* 0x0008 */ unsigned long _dwLine;
  /* 0x000c */ long Padding_78;
  /* 0x0010 */ const char* _pszFile;
  /* 0x0018 */ const char* _pszLockName;
  /* 0x0020 */ struct _RTL_CRITICAL_SECTION _cs;
}; /* size: 0x0048 */

class CComApartment
{
  /* 0x0000 */ long Padding_79[2];
  /* 0x0008 */ unsigned long _cRefs;
  /* 0x000c */ unsigned long _dwState;
  /* 0x0010 */ enum tagAPTKIND _AptKind;
  /* 0x0014 */ const unsigned long _AptId;
  /* 0x0018 */ class OXIDEntry* _pOXIDEntry;
  /* 0x0020 */ class CRemoteUnknown* _pRemUnk;
  /* 0x0028 */ long _cWaiters;
  /* 0x002c */ long Padding_80;
  /* 0x0030 */ void* _hEventOID;
  /* 0x0038 */ unsigned long _cPreRegOidsAvail;
  /* 0x003c */ long Padding_81;
  /* 0x0040 */ unsigned __int64 _arPreRegOids[20];
  /* 0x00e0 */ unsigned long _cOidsReturn;
  /* 0x00e4 */ long Padding_82;
  /* 0x00e8 */ unsigned __int64 _arOidsReturn[20];
  /* 0x0188 */ struct IRuntimeBroker* _pRuntimeBroker;
  /* 0x0190 */ struct _RTL_SRWLOCK _lockRuntimeBroker;
  union
  {
    /* 0x0198 */ struct ClassicSTAState* _pClassicSTAState;
    struct
    {
      /* 0x0198 */ struct ASTAState* _pASTAState;
      /* 0x01a0 */ void* _hEventASTAWake;
      /* 0x01a8 */ void* _hTimerFreeUnusedDlls;
      /* 0x01b0 */ long _cPendingGitRegistrations;
      /* 0x01b4 */ long Padding_83;
      /* 0x01b8 */ void* _hEventPendingGitRegistrations;
      /* 0x01c0 */ class Microsoft::WRL::ComPtr<IWeakReference> _spMessageDispatcher;
      /* 0x01c8 */ struct tagSOleTlsData* _pTlsSTA;
      /* 0x01d0 */ class Microsoft::WRL::ComPtr<ApartmentShutdownNode> _spFirstShutdownCallback;
      /* 0x01d8 */ class Microsoft::WRL::ComPtr<ApartmentShutdownNode> _spSentinelForNotify;
      /* 0x01e0 */ unsigned __int64 _ui64ApartmentIdentifier;
    }; /* size: 0x004c */
  }; /* size: 0x004c */
  union
  {
    /* 0x0000 */ volatile unsigned long s_ulApartmentIdentifierCounter;
    /* 0x0000 */ class COleStaticMutexSem s_ShutdownRegLock;
  }; /* size: 0x0048 */
}; /* size: 0x01e8 */

typedef enum _IRQ_PRIORITY
{
  IrqPriorityUndefined = 0,
  IrqPriorityLow = 1,
  IrqPriorityNormal = 2,
  IrqPriorityHigh = 3,
} IRQ_PRIORITY, *PIRQ_PRIORITY;

enum tagREADYSTATE
{
  READYSTATE_UNINITIALIZED = 0,
  READYSTATE_LOADING = 1,
  READYSTATE_LOADED = 2,
  READYSTATE_INTERACTIVE = 3,
  READYSTATE_COMPLETE = 4,
};

enum PO_FIXED_WAKE_SOURCE_TYPE
{
  FixedWakeSourcePowerButton = 0,
  FixedWakeSourceSleepButton = 1,
  FixedWakeSourceRtc = 2,
  FixedWakeSourceDozeToHibernate = 3,
};

typedef struct _CRYPT_AES_128_KEY_STATE
{
  /* 0x0000 */ unsigned char Key[16];
  /* 0x0010 */ unsigned char IV[16];
  /* 0x0020 */ unsigned char EncryptionState[16][11];
  /* 0x00d0 */ unsigned char DecryptionState[16][11];
  /* 0x0180 */ unsigned char Feedback[16];
} CRYPT_AES_128_KEY_STATE, *PCRYPT_AES_128_KEY_STATE; /* size: 0x0190 */

struct tagSTGMEDIUM
{
  /* 0x0000 */ unsigned long tymed;
  /* 0x0004 */ long Padding_84;
  union
  {
    /* 0x0008 */ struct HBITMAP__* hBitmap;
    /* 0x0008 */ void* hMetaFilePict;
    /* 0x0008 */ struct HENHMETAFILE__* hEnhMetaFile;
    /* 0x0008 */ void* hGlobal;
    /* 0x0008 */ wchar_t* lpszFileName;
    /* 0x0008 */ struct IStream* pstm;
    /* 0x0008 */ struct IStorage* pstg;
  }; /* size: 0x0008 */
  /* 0x0010 */ struct IUnknown* pUnkForRelease;
}; /* size: 0x0018 */

typedef struct _SECURITY_ATTRIBUTES
{
  /* 0x0000 */ unsigned long nLength;
  /* 0x0004 */ long Padding_85;
  /* 0x0008 */ void* lpSecurityDescriptor;
  /* 0x0010 */ int bInheritHandle;
  /* 0x0014 */ long __PADDING__[1];
} SECURITY_ATTRIBUTES, *PSECURITY_ATTRIBUTES; /* size: 0x0018 */

typedef struct _tagBINDINFO
{
  /* 0x0000 */ unsigned long cbSize;
  /* 0x0004 */ long Padding_86;
  /* 0x0008 */ wchar_t* szExtraInfo;
  /* 0x0010 */ struct tagSTGMEDIUM stgmedData;
  /* 0x0028 */ unsigned long grfBindInfoF;
  /* 0x002c */ unsigned long dwBindVerb;
  /* 0x0030 */ wchar_t* szCustomVerb;
  /* 0x0038 */ unsigned long cbstgmedData;
  /* 0x003c */ unsigned long dwOptions;
  /* 0x0040 */ unsigned long dwOptionsFlags;
  /* 0x0044 */ unsigned long dwCodePage;
  /* 0x0048 */ struct _SECURITY_ATTRIBUTES securityAttributes;
  /* 0x0060 */ struct _GUID iid;
  /* 0x0070 */ struct IUnknown* pUnk;
  /* 0x0078 */ unsigned long dwReserved;
  /* 0x007c */ long __PADDING__[1];
} tagBINDINFO, *PtagBINDINFO; /* size: 0x0080 */

typedef struct _MINIDUMP_LOCATION_DESCRIPTOR
{
  /* 0x0000 */ unsigned int DataSize;
  /* 0x0004 */ unsigned long Rva;
} MINIDUMP_LOCATION_DESCRIPTOR, *PMINIDUMP_LOCATION_DESCRIPTOR; /* size: 0x0008 */

typedef enum _THREADINFOCLASS
{
  ThreadBasicInformation = 0,
  ThreadTimes = 1,
  ThreadPriority = 2,
  ThreadBasePriority = 3,
  ThreadAffinityMask = 4,
  ThreadImpersonationToken = 5,
  ThreadDescriptorTableEntry = 6,
  ThreadEnableAlignmentFaultFixup = 7,
  ThreadEventPair_Reusable = 8,
  ThreadQuerySetWin32StartAddress = 9,
  ThreadZeroTlsCell = 10,
  ThreadPerformanceCount = 11,
  ThreadAmILastThread = 12,
  ThreadIdealProcessor = 13,
  ThreadPriorityBoost = 14,
  ThreadSetTlsArrayAddress = 15,
  ThreadIsIoPending = 16,
  ThreadHideFromDebugger = 17,
  ThreadBreakOnTermination = 18,
  ThreadSwitchLegacyState = 19,
  ThreadIsTerminated = 20,
  ThreadLastSystemCall = 21,
  ThreadIoPriority = 22,
  ThreadCycleTime = 23,
  ThreadPagePriority = 24,
  ThreadActualBasePriority = 25,
  ThreadTebInformation = 26,
  ThreadCSwitchMon = 27,
  ThreadCSwitchPmu = 28,
  ThreadWow64Context = 29,
  ThreadGroupInformation = 30,
  ThreadUmsInformation = 31,
  ThreadCounterProfiling = 32,
  ThreadIdealProcessorEx = 33,
  ThreadCpuAccountingInformation = 34,
  MaxThreadInfoClass = 35,
} THREADINFOCLASS, *PTHREADINFOCLASS;

struct ISynchronizeMutex
{
}; /* size: 0x0008 */

enum tagPictureAttributes
{
  PICTURE_SCALABLE = 1,
  PICTURE_TRANSPARENT = 2,
};

typedef struct _SINGLE_LIST_ENTRY32
{
  /* 0x0000 */ unsigned long Next;
} SINGLE_LIST_ENTRY32, *PSINGLE_LIST_ENTRY32; /* size: 0x0004 */

struct tagCIEXYZ
{
  /* 0x0000 */ long ciexyzX;
  /* 0x0004 */ long ciexyzY;
  /* 0x0008 */ long ciexyzZ;
}; /* size: 0x000c */

struct tagICEXYZTRIPLE
{
  /* 0x0000 */ struct tagCIEXYZ ciexyzRed;
  /* 0x000c */ struct tagCIEXYZ ciexyzGreen;
  /* 0x0018 */ struct tagCIEXYZ ciexyzBlue;
}; /* size: 0x0024 */

struct tagLOGCOLORSPACEA
{
  /* 0x0000 */ unsigned long lcsSignature;
  /* 0x0004 */ unsigned long lcsVersion;
  /* 0x0008 */ unsigned long lcsSize;
  /* 0x000c */ long lcsCSType;
  /* 0x0010 */ long lcsIntent;
  /* 0x0014 */ struct tagICEXYZTRIPLE lcsEndpoints;
  /* 0x0038 */ unsigned long lcsGammaRed;
  /* 0x003c */ unsigned long lcsGammaGreen;
  /* 0x0040 */ unsigned long lcsGammaBlue;
  /* 0x0044 */ char lcsFilename[260];
}; /* size: 0x0148 */

typedef enum _SE_AUDIT_OPERATION
{
  AuditPrivilegeObject = 0,
  AuditPrivilegeService = 1,
  AuditAccessCheck = 2,
  AuditOpenObject = 3,
  AuditOpenObjectWithTransaction = 4,
  AuditCloseObject = 5,
  AuditDeleteObject = 6,
  AuditOpenObjectForDelete = 7,
  AuditOpenObjectForDeleteWithTransaction = 8,
  AuditCloseNonObject = 9,
  AuditOpenNonObject = 10,
  AuditObjectReference = 11,
  AuditHandleCreation = 12,
} SE_AUDIT_OPERATION, *PSE_AUDIT_OPERATION;

struct _RTL_TRACE_DATABASE;

struct tagLASTINPUTINFO
{
  /* 0x0000 */ unsigned int cbSize;
  /* 0x0004 */ unsigned long dwTime;
}; /* size: 0x0008 */

typedef enum _SAFER_OBJECT_INFO_CLASS
{
  SaferObjectLevelId = 1,
  SaferObjectScopeId = 2,
  SaferObjectFriendlyName = 3,
  SaferObjectDescription = 4,
  SaferObjectBuiltin = 5,
  SaferObjectDisallowed = 6,
  SaferObjectDisableMaxPrivilege = 7,
  SaferObjectInvertDeletedPrivileges = 8,
  SaferObjectDeletedPrivileges = 9,
  SaferObjectDefaultOwner = 10,
  SaferObjectSidsToDisable = 11,
  SaferObjectRestrictedSidsInverted = 12,
  SaferObjectRestrictedSidsAdded = 13,
  SaferObjectAllIdentificationGuids = 14,
  SaferObjectSingleIdentification = 15,
  SaferObjectExtendedError = 16,
} SAFER_OBJECT_INFO_CLASS, *PSAFER_OBJECT_INFO_CLASS;

typedef enum _TOKEN_INFORMATION_CLASS
{
  TokenUser = 1,
  TokenGroups = 2,
  TokenPrivileges = 3,
  TokenOwner = 4,
  TokenPrimaryGroup = 5,
  TokenDefaultDacl = 6,
  TokenSource = 7,
  TokenType = 8,
  TokenImpersonationLevel = 9,
  TokenStatistics = 10,
  TokenRestrictedSids = 11,
  TokenSessionId = 12,
  TokenGroupsAndPrivileges = 13,
  TokenSessionReference = 14,
  TokenSandBoxInert = 15,
  TokenAuditPolicy = 16,
  TokenOrigin = 17,
  TokenElevationType = 18,
  TokenLinkedToken = 19,
  TokenElevation = 20,
  TokenHasRestrictions = 21,
  TokenAccessInformation = 22,
  TokenVirtualizationAllowed = 23,
  TokenVirtualizationEnabled = 24,
  TokenIntegrityLevel = 25,
  TokenUIAccess = 26,
  TokenMandatoryPolicy = 27,
  TokenLogonSid = 28,
  TokenIsAppContainer = 29,
  TokenCapabilities = 30,
  TokenAppContainerSid = 31,
  TokenAppContainerNumber = 32,
  TokenUserClaimAttributes = 33,
  TokenDeviceClaimAttributes = 34,
  TokenRestrictedUserClaimAttributes = 35,
  TokenRestrictedDeviceClaimAttributes = 36,
  TokenDeviceGroups = 37,
  TokenRestrictedDeviceGroups = 38,
  TokenSecurityAttributes = 39,
  TokenIsRestricted = 40,
  MaxTokenInfoClass = 41,
} TOKEN_INFORMATION_CLASS, *PTOKEN_INFORMATION_CLASS;

struct IPartitionProperty
{
}; /* size: 0x0008 */

struct tagMCI_OPEN_PARMSW
{
  /* 0x0000 */ unsigned __int64 dwCallback;
  /* 0x0008 */ unsigned int wDeviceID;
  /* 0x000c */ const wchar_t* lpstrDeviceType;
  /* 0x0014 */ const wchar_t* lpstrElementName;
  /* 0x001c */ const wchar_t* lpstrAlias;
}; /* size: 0x0024 */

enum tagMKSYS
{
  MKSYS_NONE = 0,
  MKSYS_GENERICCOMPOSITE = 1,
  MKSYS_FILEMONIKER = 2,
  MKSYS_ANTIMONIKER = 3,
  MKSYS_ITEMMONIKER = 4,
  MKSYS_POINTERMONIKER = 5,
  MKSYS_CLASSMONIKER = 7,
  MKSYS_OBJREFMONIKER = 8,
  MKSYS_SESSIONMONIKER = 9,
  MKSYS_LUAMONIKER = 10,
};

typedef struct _LIST_ENTRY
{
  /* 0x0000 */ struct _LIST_ENTRY* Flink;
  /* 0x0008 */ struct _LIST_ENTRY* Blink;
} LIST_ENTRY, *PLIST_ENTRY; /* size: 0x0010 */

typedef struct _LOADED_IMAGE
{
  /* 0x0000 */ char* ModuleName;
  /* 0x0008 */ void* hFile;
  /* 0x0010 */ unsigned char* MappedAddress;
  /* 0x0018 */ struct _IMAGE_NT_HEADERS64* FileHeader;
  /* 0x0020 */ struct _IMAGE_SECTION_HEADER* LastRvaSection;
  /* 0x0028 */ unsigned long NumberOfSections;
  /* 0x002c */ long Padding_87;
  /* 0x0030 */ struct _IMAGE_SECTION_HEADER* Sections;
  /* 0x0038 */ unsigned long Characteristics;
  /* 0x003c */ unsigned char fSystemImage;
  /* 0x003d */ unsigned char fDOSImage;
  /* 0x003e */ unsigned char fReadOnly;
  /* 0x003f */ unsigned char Version;
  /* 0x0040 */ struct _LIST_ENTRY Links;
  /* 0x0050 */ unsigned long SizeOfImage;
  /* 0x0054 */ long __PADDING__[1];
} LOADED_IMAGE, *PLOADED_IMAGE; /* size: 0x0058 */

struct tagACTCTXA
{
  /* 0x0000 */ unsigned long cbSize;
  /* 0x0004 */ unsigned long dwFlags;
  /* 0x0008 */ const char* lpSource;
  /* 0x0010 */ unsigned short wProcessorArchitecture;
  /* 0x0012 */ unsigned short wLangId;
  /* 0x0014 */ long Padding_88;
  /* 0x0018 */ const char* lpAssemblyDirectory;
  /* 0x0020 */ const char* lpResourceName;
  /* 0x0028 */ const char* lpApplicationName;
  /* 0x0030 */ struct HINSTANCE__* hModule;
}; /* size: 0x0038 */

typedef enum _BOOT_ENTROPY_SOURCE_ID
{
  BootEntropySourceNone = 0,
  BootEntropySourceSeedfile = 1,
  BootEntropySourceExternal = 2,
  BootEntropySourceTpm = 3,
  BootEntropySourceRdrand = 4,
  BootEntropySourceTime = 5,
  BootEntropySourceAcpiOem0 = 6,
  BootEntropySourceUefi = 7,
  BootMaxEntropySources = 7,
} BOOT_ENTROPY_SOURCE_ID, *PBOOT_ENTROPY_SOURCE_ID;

typedef struct _MINIDUMP_LOCATION_DESCRIPTOR64
{
  /* 0x0000 */ unsigned __int64 DataSize;
  /* 0x0008 */ unsigned __int64 Rva;
} MINIDUMP_LOCATION_DESCRIPTOR64, *PMINIDUMP_LOCATION_DESCRIPTOR64; /* size: 0x0010 */

typedef struct _NT_TIB64
{
  /* 0x0000 */ unsigned __int64 ExceptionList;
  /* 0x0008 */ unsigned __int64 StackBase;
  /* 0x0010 */ unsigned __int64 StackLimit;
  /* 0x0018 */ unsigned __int64 SubSystemTib;
  union
  {
    /* 0x0020 */ unsigned __int64 FiberData;
    /* 0x0020 */ unsigned long Version;
  }; /* size: 0x0008 */
  /* 0x0028 */ unsigned __int64 ArbitraryUserPointer;
  /* 0x0030 */ unsigned __int64 Self;
} NT_TIB64, *PNT_TIB64; /* size: 0x0038 */

typedef enum _FILE_INFO_BY_HANDLE_CLASS
{
  FileBasicInfo = 0,
  FileStandardInfo = 1,
  FileNameInfo = 2,
  FileRenameInfo = 3,
  FileDispositionInfo = 4,
  FileAllocationInfo = 5,
  FileEndOfFileInfo = 6,
  FileStreamInfo = 7,
  FileCompressionInfo = 8,
  FileAttributeTagInfo = 9,
  FileIdBothDirectoryInfo = 10,
  FileIdBothDirectoryRestartInfo = 11,
  FileIoPriorityHintInfo = 12,
  FileRemoteProtocolInfo = 13,
  FileFullDirectoryInfo = 14,
  FileFullDirectoryRestartInfo = 15,
  FileStorageInfo = 16,
  FileAlignmentInfo = 17,
  FileIdInfo = 18,
  FileIdExtdDirectoryInfo = 19,
  FileIdExtdDirectoryRestartInfo = 20,
  MaximumFileInfoByHandleClass = 21,
} FILE_INFO_BY_HANDLE_CLASS, *PFILE_INFO_BY_HANDLE_CLASS;

typedef enum _WNF_USER_DELIVERY_STATE
{
  WNF_USER_DELIVERY_STATE_READY = 0,
  WNF_USER_DELIVERY_STATE_CANCELLED = 1,
  WNF_USER_DELIVERY_STATE_IN_PROGRESS = 2,
  WNF_USER_DELIVERY_STATE_SUCCEEDED = 3,
  WNF_USER_DELIVERY_STATE_FAILED = 4,
  WNF_USER_DELIVERY_STATE_REQUIRES_RETRY = 5,
  WNF_USER_DELIVERY_STATE_COMPLETE = 6,
} WNF_USER_DELIVERY_STATE, *PWNF_USER_DELIVERY_STATE;

typedef enum _TIMER_INFORMATION_CLASS
{
  TimerBasicInformation = 0,
} TIMER_INFORMATION_CLASS, *PTIMER_INFORMATION_CLASS;

struct DISPLAYCONFIG_RATIONAL
{
  /* 0x0000 */ unsigned int Numerator;
  /* 0x0004 */ unsigned int Denominator;
}; /* size: 0x0008 */

struct DISPLAYCONFIG_2DREGION
{
  /* 0x0000 */ unsigned int cx;
  /* 0x0004 */ unsigned int cy;
}; /* size: 0x0008 */

enum DISPLAYCONFIG_SCANLINE_ORDERING
{
  DISPLAYCONFIG_SCANLINE_ORDERING_UNSPECIFIED = 0,
  DISPLAYCONFIG_SCANLINE_ORDERING_PROGRESSIVE = 1,
  DISPLAYCONFIG_SCANLINE_ORDERING_INTERLACED = 2,
  DISPLAYCONFIG_SCANLINE_ORDERING_INTERLACED_UPPERFIELDFIRST = 2,
  DISPLAYCONFIG_SCANLINE_ORDERING_INTERLACED_LOWERFIELDFIRST = 3,
  DISPLAYCONFIG_SCANLINE_ORDERING_FORCE_UINT32 = -1,
};

struct DISPLAYCONFIG_VIDEO_SIGNAL_INFO
{
  /* 0x0000 */ unsigned __int64 pixelRate;
  /* 0x0008 */ struct DISPLAYCONFIG_RATIONAL hSyncFreq;
  /* 0x0010 */ struct DISPLAYCONFIG_RATIONAL vSyncFreq;
  /* 0x0018 */ struct DISPLAYCONFIG_2DREGION activeSize;
  /* 0x0020 */ struct DISPLAYCONFIG_2DREGION totalSize;
  /* 0x0028 */ unsigned int videoStandard;
  /* 0x002c */ enum DISPLAYCONFIG_SCANLINE_ORDERING scanLineOrdering;
}; /* size: 0x0030 */

struct DISPLAYCONFIG_TARGET_MODE
{
  /* 0x0000 */ struct DISPLAYCONFIG_VIDEO_SIGNAL_INFO targetVideoSignalInfo;
}; /* size: 0x0030 */

enum tagPOINTER_DEVICE_CURSOR_TYPE
{
  POINTER_DEVICE_CURSOR_TYPE_UNKNOWN = 0,
  POINTER_DEVICE_CURSOR_TYPE_TIP = 1,
  POINTER_DEVICE_CURSOR_TYPE_ERASER = 2,
  POINTER_DEVICE_CURSOR_TYPE_MAX = -1,
};

class CDestObject
{
  /* 0x0000 */ long Padding_89[2];
  /* 0x0008 */ struct tagCOMVERSION _comversion;
  /* 0x000c */ unsigned long _dwDestCtx;
}; /* size: 0x0010 */

class CRpcChannelBuffer
{
  /* 0x0000 */ long Padding_90[8];
  /* 0x0020 */ struct _GUID _guidSignature;
  /* 0x0030 */ unsigned long _cRefs;
  /* 0x0034 */ unsigned long state;
  /* 0x0038 */ class CChannelHandle* volatile _pRpcDefault;
  /* 0x0040 */ class CChannelHandle* _pRpcCustom;
  /* 0x0048 */ class OXIDEntry* _pOXIDEntry;
  /* 0x0050 */ struct tagIPIDEntry* _pIPIDEntry;
  /* 0x0058 */ void* _pInterfaceInfo;
  /* 0x0060 */ class CStdIdentity* _pStdId;
  /* 0x0068 */ class CDestObject _destObj;
}; /* size: 0x0078 */

typedef struct _DOCINFOA
{
  /* 0x0000 */ int cbSize;
  /* 0x0004 */ long Padding_91;
  /* 0x0008 */ const char* lpszDocName;
  /* 0x0010 */ const char* lpszOutput;
  /* 0x0018 */ const char* lpszDatatype;
  /* 0x0020 */ unsigned long fwType;
  /* 0x0024 */ long __PADDING__[1];
} DOCINFOA, *PDOCINFOA; /* size: 0x0028 */

enum tagPOINTER_BUTTON_CHANGE_TYPE
{
  POINTER_CHANGE_NONE = 0,
  POINTER_CHANGE_FIRSTBUTTON_DOWN = 1,
  POINTER_CHANGE_FIRSTBUTTON_UP = 2,
  POINTER_CHANGE_SECONDBUTTON_DOWN = 3,
  POINTER_CHANGE_SECONDBUTTON_UP = 4,
  POINTER_CHANGE_THIRDBUTTON_DOWN = 5,
  POINTER_CHANGE_THIRDBUTTON_UP = 6,
  POINTER_CHANGE_FOURTHBUTTON_DOWN = 7,
  POINTER_CHANGE_FOURTHBUTTON_UP = 8,
  POINTER_CHANGE_FIFTHBUTTON_DOWN = 9,
  POINTER_CHANGE_FIFTHBUTTON_UP = 10,
};

typedef struct _SYSTEM_QUERY_TIME_ADJUST_INFORMATION
{
  /* 0x0000 */ unsigned long TimeAdjustment;
  /* 0x0004 */ unsigned long TimeIncrement;
  /* 0x0008 */ unsigned char Enable;
  /* 0x0009 */ char __PADDING__[3];
} SYSTEM_QUERY_TIME_ADJUST_INFORMATION, *PSYSTEM_QUERY_TIME_ADJUST_INFORMATION; /* size: 0x000c */

enum tagCOINIT
{
  COINIT_APARTMENTTHREADED = 2,
  COINIT_MULTITHREADED = 0,
  COINIT_DISABLE_OLE1DDE = 4,
  COINIT_SPEED_OVER_MEMORY = 8,
};

typedef struct _DEVICE_DATA_SET_LB_PROVISIONING_STATE
{
  /* 0x0000 */ unsigned long Size;
  /* 0x0004 */ unsigned long Version;
  /* 0x0008 */ unsigned __int64 SlabSizeInBytes;
  /* 0x0010 */ unsigned long SlabOffsetDeltaInBytes;
  /* 0x0014 */ unsigned long SlabAllocationBitMapBitCount;
  /* 0x0018 */ unsigned long SlabAllocationBitMapLength;
  /* 0x001c */ unsigned long SlabAllocationBitMap[1];
} DEVICE_DATA_SET_LB_PROVISIONING_STATE, *PDEVICE_DATA_SET_LB_PROVISIONING_STATE; /* size: 0x0020 */

typedef enum _PNP_VETO_TYPE
{
  PNP_VetoTypeUnknown = 0,
  PNP_VetoLegacyDevice = 1,
  PNP_VetoPendingClose = 2,
  PNP_VetoWindowsApp = 3,
  PNP_VetoWindowsService = 4,
  PNP_VetoOutstandingOpen = 5,
  PNP_VetoDevice = 6,
  PNP_VetoDriver = 7,
  PNP_VetoIllegalDeviceRequest = 8,
  PNP_VetoInsufficientPower = 9,
  PNP_VetoNonDisableable = 10,
  PNP_VetoLegacyDriver = 11,
  PNP_VetoInsufficientRights = 12,
} PNP_VETO_TYPE, *PPNP_VETO_TYPE;

struct SERVICE_STATUS_HANDLE__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

class Windows::AutoOperatorAmpersandConstHelper<Windows::Rtl::IRtlWORAStream *,Windows::Auto<Windows::Rtl::IRtlWORAStream *> >;

typedef enum _OBJECT_INFORMATION_CLASS
{
  ObjectBasicInformation = 0,
  ObjectNameInformation = 1,
  ObjectTypeInformation = 2,
  ObjectTypesInformation = 3,
  ObjectHandleFlagInformation = 4,
  ObjectSessionInformation = 5,
  MaxObjectInfoClass = 6,
} OBJECT_INFORMATION_CLASS, *POBJECT_INFORMATION_CLASS;

typedef enum _IO_SESSION_STATE
{
  IoSessionStateCreated = 1,
  IoSessionStateInitialized = 2,
  IoSessionStateConnected = 3,
  IoSessionStateDisconnected = 4,
  IoSessionStateDisconnectedLoggedOn = 5,
  IoSessionStateLoggedOn = 6,
  IoSessionStateLoggedOff = 7,
  IoSessionStateTerminated = 8,
  IoSessionStateMax = 9,
} IO_SESSION_STATE, *PIO_SESSION_STATE;

struct LIST_ENTRY32
{
  /* 0x0000 */ unsigned long Flink;
  /* 0x0004 */ unsigned long Blink;
}; /* size: 0x0008 */

typedef struct _STRING32
{
  /* 0x0000 */ unsigned short Length;
  /* 0x0002 */ unsigned short MaximumLength;
  /* 0x0004 */ unsigned long Buffer;
} STRING32, *PSTRING32; /* size: 0x0008 */

typedef struct _LDR_DATA_TABLE_ENTRY32
{
  /* 0x0000 */ struct LIST_ENTRY32 InLoadOrderLinks;
  /* 0x0008 */ struct LIST_ENTRY32 InMemoryOrderLinks;
  /* 0x0010 */ struct LIST_ENTRY32 InInitializationOrderLinks;
  /* 0x0018 */ unsigned long DllBase;
  /* 0x001c */ unsigned long EntryPoint;
  /* 0x0020 */ unsigned long SizeOfImage;
  /* 0x0024 */ struct _STRING32 FullDllName;
  /* 0x002c */ struct _STRING32 BaseDllName;
  /* 0x0034 */ unsigned long Flags;
  /* 0x0038 */ unsigned short LoadCount;
  /* 0x003a */ unsigned short TlsIndex;
  union
  {
    /* 0x003c */ struct LIST_ENTRY32 HashLinks;
    struct
    {
      /* 0x003c */ unsigned long SectionPointer;
      /* 0x0040 */ unsigned long CheckSum;
    }; /* size: 0x0008 */
  }; /* size: 0x0008 */
  union
  {
    /* 0x0044 */ unsigned long TimeDateStamp;
    /* 0x0044 */ unsigned long LoadedImports;
  }; /* size: 0x0004 */
} LDR_DATA_TABLE_ENTRY32, *PLDR_DATA_TABLE_ENTRY32; /* size: 0x0048 */

struct LIST_ENTRY64
{
  /* 0x0000 */ unsigned __int64 Flink;
  /* 0x0008 */ unsigned __int64 Blink;
}; /* size: 0x0010 */

typedef struct _RTL_CRITICAL_SECTION_DEBUG64
{
  /* 0x0000 */ unsigned short Type;
  /* 0x0002 */ unsigned short CreatorBackTraceIndex;
  /* 0x0004 */ long Padding_92;
  /* 0x0008 */ unsigned __int64 CriticalSection;
  /* 0x0010 */ struct LIST_ENTRY64 ProcessLocksList;
  /* 0x0020 */ unsigned long EntryCount;
  /* 0x0024 */ unsigned long ContentionCount;
  /* 0x0028 */ unsigned long Spare[2];
} RTL_CRITICAL_SECTION_DEBUG64, *PRTL_CRITICAL_SECTION_DEBUG64; /* size: 0x0030 */

typedef struct _DEVICEDUMP_STRUCTURE_VERSION
{
  /* 0x0000 */ unsigned long dwSignature;
  /* 0x0004 */ unsigned long dwVersion;
  /* 0x0008 */ unsigned long dwSize;
} DEVICEDUMP_STRUCTURE_VERSION, *PDEVICEDUMP_STRUCTURE_VERSION; /* size: 0x000c */

typedef struct _DEVICEDUMP_SECTION_HEADER
{
  /* 0x0000 */ struct _GUID guidDeviceDataId;
  /* 0x0010 */ unsigned char sOrganizationID[16];
  /* 0x0020 */ unsigned long dwFirmwareRevision;
  /* 0x0024 */ unsigned char sModelNumber[32];
  /* 0x0044 */ unsigned char szDeviceManufacturingID[32];
  /* 0x0064 */ unsigned long dwFlags;
  /* 0x0068 */ unsigned long bRestrictedPrivateDataVersion;
  /* 0x006c */ unsigned long dwFirmwareIssueId;
  /* 0x0070 */ unsigned char szIssueDescriptionString[132];
} DEVICEDUMP_SECTION_HEADER, *PDEVICEDUMP_SECTION_HEADER; /* size: 0x00f4 */

typedef struct _DEVICEDUMP_SUBSECTION_POINTER
{
  /* 0x0000 */ unsigned long dwSize;
  /* 0x0004 */ unsigned long dwFlags;
  /* 0x0008 */ unsigned long dwOffset;
} DEVICEDUMP_SUBSECTION_POINTER, *PDEVICEDUMP_SUBSECTION_POINTER; /* size: 0x000c */

typedef struct _DEVICEDUMP_STORAGEDEVICE_DATA
{
  /* 0x0000 */ struct _DEVICEDUMP_STRUCTURE_VERSION Descriptor;
  /* 0x000c */ struct _DEVICEDUMP_SECTION_HEADER SectionHeader;
  /* 0x0100 */ unsigned long dwBufferSize;
  /* 0x0104 */ unsigned long dwReasonForCollection;
  /* 0x0108 */ struct _DEVICEDUMP_SUBSECTION_POINTER PublicData;
  /* 0x0114 */ struct _DEVICEDUMP_SUBSECTION_POINTER RestrictedData;
  /* 0x0120 */ struct _DEVICEDUMP_SUBSECTION_POINTER PrivateData;
} DEVICEDUMP_STORAGEDEVICE_DATA, *PDEVICEDUMP_STORAGEDEVICE_DATA; /* size: 0x012c */

enum tagURLTEMPLATE
{
  URLTEMPLATE_CUSTOM = 0,
  URLTEMPLATE_PREDEFINED_MIN = 0x10000,
  URLTEMPLATE_LOW = 0x10000,
  URLTEMPLATE_MEDLOW = 0x10500,
  URLTEMPLATE_MEDIUM = 0x11000,
  URLTEMPLATE_MEDHIGH = 0x11500,
  URLTEMPLATE_HIGH = 0x12000,
  URLTEMPLATE_PREDEFINED_MAX = 0x20000,
};

struct tagEMR
{
  /* 0x0000 */ unsigned long iType;
  /* 0x0004 */ unsigned long nSize;
}; /* size: 0x0008 */

typedef struct _TRIVERTEX
{
  /* 0x0000 */ long x;
  /* 0x0004 */ long y;
  /* 0x0008 */ unsigned short Red;
  /* 0x000a */ unsigned short Green;
  /* 0x000c */ unsigned short Blue;
  /* 0x000e */ unsigned short Alpha;
} TRIVERTEX, *PTRIVERTEX; /* size: 0x0010 */

struct tagEMRGRADIENTFILL
{
  /* 0x0000 */ struct tagEMR emr;
  /* 0x0008 */ struct _RECTL rclBounds;
  /* 0x0018 */ unsigned long nVer;
  /* 0x001c */ unsigned long nTri;
  /* 0x0020 */ unsigned long ulMode;
  /* 0x0024 */ struct _TRIVERTEX Ver[1];
}; /* size: 0x0034 */

struct tagPOINT
{
  /* 0x0000 */ long x;
  /* 0x0004 */ long y;
}; /* size: 0x0008 */

typedef enum _RTL_VERIFIER_REDIRECT_TYPE
{
  VerifierGPALookup = 0,
  VerifierDelayloadLookup = 1,
  VerifierLegacyLookup = 2,
  VerifierMaxLookupType = 3,
} RTL_VERIFIER_REDIRECT_TYPE, *PRTL_VERIFIER_REDIRECT_TYPE;

typedef struct _CERT_X942_DH_PARAMETERS
{
  /* 0x0000 */ struct _CRYPTOAPI_BLOB p;
  /* 0x0010 */ struct _CRYPTOAPI_BLOB g;
  /* 0x0020 */ struct _CRYPTOAPI_BLOB q;
  /* 0x0030 */ struct _CRYPTOAPI_BLOB j;
  /* 0x0040 */ struct _CERT_X942_DH_VALIDATION_PARAMS* pValidationParams;
} CERT_X942_DH_PARAMETERS, *PCERT_X942_DH_PARAMETERS; /* size: 0x0048 */

struct IComCatalog
{
}; /* size: 0x0008 */

enum tagMSHLFLAGS
{
  MSHLFLAGS_NORMAL = 0,
  MSHLFLAGS_TABLESTRONG = 1,
  MSHLFLAGS_TABLEWEAK = 2,
  MSHLFLAGS_NOPING = 4,
  MSHLFLAGS_RESERVED1 = 8,
  MSHLFLAGS_RESERVED2 = 16,
  MSHLFLAGS_RESERVED3 = 32,
  MSHLFLAGS_RESERVED4 = 64,
};

typedef enum _PNP_QUERY_RELATION
{
  PnpQueryEjectRelations = 0,
  PnpQueryRemovalRelations = 1,
  PnpQueryPowerRelations = 2,
  PnpQueryBusRelations = 3,
  PnpQueryTransportRelations = 4,
  MaxPnpQueryRelations = 5,
} PNP_QUERY_RELATION, *PPNP_QUERY_RELATION;

typedef struct _CMC_PEND_INFO
{
  /* 0x0000 */ struct _CRYPTOAPI_BLOB PendToken;
  /* 0x0010 */ struct _FILETIME PendTime;
} CMC_PEND_INFO, *PCMC_PEND_INFO; /* size: 0x0018 */

typedef struct _SID_IDENTIFIER_AUTHORITY
{
  /* 0x0000 */ unsigned char Value[6];
} SID_IDENTIFIER_AUTHORITY, *PSID_IDENTIFIER_AUTHORITY; /* size: 0x0006 */

typedef struct _SID
{
  /* 0x0000 */ unsigned char Revision;
  /* 0x0001 */ unsigned char SubAuthorityCount;
  /* 0x0002 */ struct _SID_IDENTIFIER_AUTHORITY IdentifierAuthority;
  /* 0x0008 */ unsigned long SubAuthority[1];
} SID, *PSID; /* size: 0x000c */

typedef struct _BCRYPT_INTERFACE_VERSION
{
  /* 0x0000 */ unsigned short MajorVersion;
  /* 0x0002 */ unsigned short MinorVersion;
} BCRYPT_INTERFACE_VERSION, *PBCRYPT_INTERFACE_VERSION; /* size: 0x0004 */

typedef enum _JOBOBJECTINFOCLASS
{
  JobObjectBasicAccountingInformation = 1,
  JobObjectBasicLimitInformation = 2,
  JobObjectBasicProcessIdList = 3,
  JobObjectBasicUIRestrictions = 4,
  JobObjectSecurityLimitInformation = 5,
  JobObjectEndOfJobTimeInformation = 6,
  JobObjectAssociateCompletionPortInformation = 7,
  JobObjectBasicAndIoAccountingInformation = 8,
  JobObjectExtendedLimitInformation = 9,
  JobObjectJobSetInformation = 10,
  JobObjectGroupInformation = 11,
  JobObjectNotificationLimitInformation = 12,
  JobObjectLimitViolationInformation = 13,
  JobObjectGroupInformationEx = 14,
  JobObjectCpuRateControlInformation = 15,
  JobObjectCompletionFilter = 16,
  JobObjectCompletionCounter = 17,
  JobObjectFreezeInformation = 18,
  JobObjectExtendedAccountingInformation = 19,
  JobObjectWakeInformation = 20,
  JobObjectBackgroundInformation = 21,
  JobObjectSchedulingRankBiasInformation = 22,
  JobObjectTimerVirtualizationInformation = 23,
  JobObjectCycleTimeNotification = 24,
  JobObjectClearEvent = 25,
  JobObjectReserved1Information = 18,
  JobObjectReserved2Information = 19,
  JobObjectReserved3Information = 20,
  JobObjectReserved4Information = 21,
  JobObjectReserved5Information = 22,
  JobObjectReserved6Information = 23,
  JobObjectReserved7Information = 24,
  JobObjectReserved8Information = 25,
  MaxJobObjectInfoClass = 26,
} JOBOBJECTINFOCLASS, *PJOBOBJECTINFOCLASS;

struct tagTPMPARAMS
{
  /* 0x0000 */ unsigned int cbSize;
  /* 0x0004 */ struct tagRECT rcExclude;
}; /* size: 0x0014 */

typedef enum _COMPUTER_NAME_FORMAT
{
  ComputerNameNetBIOS = 0,
  ComputerNameDnsHostname = 1,
  ComputerNameDnsDomain = 2,
  ComputerNameDnsFullyQualified = 3,
  ComputerNamePhysicalNetBIOS = 4,
  ComputerNamePhysicalDnsHostname = 5,
  ComputerNamePhysicalDnsDomain = 6,
  ComputerNamePhysicalDnsFullyQualified = 7,
  ComputerNameMax = 8,
} COMPUTER_NAME_FORMAT, *PCOMPUTER_NAME_FORMAT;

typedef enum _IO_SESSION_EVENT
{
  IoSessionEventIgnore = 0,
  IoSessionEventCreated = 1,
  IoSessionEventTerminated = 2,
  IoSessionEventConnected = 3,
  IoSessionEventDisconnected = 4,
  IoSessionEventLogon = 5,
  IoSessionEventLogoff = 6,
  IoSessionEventMax = 7,
} IO_SESSION_EVENT, *PIO_SESSION_EVENT;

struct tagRemHPALETTE
{
  /* 0x0000 */ unsigned long cbData;
  /* 0x0004 */ unsigned char data[1];
  /* 0x0005 */ char __PADDING__[3];
}; /* size: 0x0008 */

struct waveformat_tag
{
  /* 0x0000 */ unsigned short wFormatTag;
  /* 0x0002 */ unsigned short nChannels;
  /* 0x0004 */ unsigned long nSamplesPerSec;
  /* 0x0008 */ unsigned long nAvgBytesPerSec;
  /* 0x000c */ unsigned short nBlockAlign;
}; /* size: 0x000e */

typedef enum _FILE_INFORMATION_CLASS
{
  FileDirectoryInformation = 1,
  FileFullDirectoryInformation = 2,
  FileBothDirectoryInformation = 3,
  FileBasicInformation = 4,
  FileStandardInformation = 5,
  FileInternalInformation = 6,
  FileEaInformation = 7,
  FileAccessInformation = 8,
  FileNameInformation = 9,
  FileRenameInformation = 10,
  FileLinkInformation = 11,
  FileNamesInformation = 12,
  FileDispositionInformation = 13,
  FilePositionInformation = 14,
  FileFullEaInformation = 15,
  FileModeInformation = 16,
  FileAlignmentInformation = 17,
  FileAllInformation = 18,
  FileAllocationInformation = 19,
  FileEndOfFileInformation = 20,
  FileAlternateNameInformation = 21,
  FileStreamInformation = 22,
  FilePipeInformation = 23,
  FilePipeLocalInformation = 24,
  FilePipeRemoteInformation = 25,
  FileMailslotQueryInformation = 26,
  FileMailslotSetInformation = 27,
  FileCompressionInformation = 28,
  FileObjectIdInformation = 29,
  FileCompletionInformation = 30,
  FileMoveClusterInformation = 31,
  FileQuotaInformation = 32,
  FileReparsePointInformation = 33,
  FileNetworkOpenInformation = 34,
  FileAttributeTagInformation = 35,
  FileTrackingInformation = 36,
  FileIdBothDirectoryInformation = 37,
  FileIdFullDirectoryInformation = 38,
  FileValidDataLengthInformation = 39,
  FileShortNameInformation = 40,
  FileIoCompletionNotificationInformation = 41,
  FileIoStatusBlockRangeInformation = 42,
  FileIoPriorityHintInformation = 43,
  FileSfioReserveInformation = 44,
  FileSfioVolumeInformation = 45,
  FileHardLinkInformation = 46,
  FileProcessIdsUsingFileInformation = 47,
  FileNormalizedNameInformation = 48,
  FileNetworkPhysicalNameInformation = 49,
  FileIdGlobalTxDirectoryInformation = 50,
  FileIsRemoteDeviceInformation = 51,
  FileAttributeCacheInformation = 52,
  FileNumaNodeInformation = 53,
  FileStandardLinkInformation = 54,
  FileRemoteProtocolInformation = 55,
  FileRenameInformationBypassAccessCheck = 56,
  FileLinkInformationBypassAccessCheck = 57,
  FileVolumeNameInformation = 58,
  FileIdInformation = 59,
  FileIdExtdDirectoryInformation = 60,
  FileMaximumInformation = 61,
} FILE_INFORMATION_CLASS, *PFILE_INFORMATION_CLASS;

typedef struct _QUERY_SERVICE_LOCK_STATUSA
{
  /* 0x0000 */ unsigned long fIsLocked;
  /* 0x0004 */ long Padding_93;
  /* 0x0008 */ char* lpLockOwner;
  /* 0x0010 */ unsigned long dwLockDuration;
  /* 0x0014 */ long __PADDING__[1];
} QUERY_SERVICE_LOCK_STATUSA, *PQUERY_SERVICE_LOCK_STATUSA; /* size: 0x0018 */

struct tagLC_ID
{
  /* 0x0000 */ unsigned short wLanguage;
  /* 0x0002 */ unsigned short wCountry;
  /* 0x0004 */ unsigned short wCodePage;
}; /* size: 0x0006 */

struct Windows::AutoPointerBase<Windows::Rtl::IRtlROFOStream *,Windows::Auto<Windows::Rtl::IRtlROFOStream *> >::is_pointer<Windows::Rtl::IRtlROFOStream *>
{
}; /* size: 0x0001 */

typedef enum _ALPC_PORT_INFORMATION_CLASS
{
  AlpcBasicInformation = 0,
  AlpcPortInformation = 1,
  AlpcAssociateCompletionPortInformation = 2,
  AlpcConnectedSIDInformation = 3,
  AlpcServerInformation = 4,
  AlpcMessageZoneInformation = 5,
  AlpcRegisterCompletionListInformation = 6,
  AlpcUnregisterCompletionListInformation = 7,
  AlpcAdjustCompletionListConcurrencyCountInformation = 8,
  AlpcRegisterCallbackInformation = 9,
  AlpcCompletionListRundownInformation = 10,
} ALPC_PORT_INFORMATION_CLASS, *PALPC_PORT_INFORMATION_CLASS;

enum tagVARFLAGS
{
  VARFLAG_FREADONLY = 1,
  VARFLAG_FSOURCE = 2,
  VARFLAG_FBINDABLE = 4,
  VARFLAG_FREQUESTEDIT = 8,
  VARFLAG_FDISPLAYBIND = 16,
  VARFLAG_FDEFAULTBIND = 32,
  VARFLAG_FHIDDEN = 64,
  VARFLAG_FRESTRICTED = 128,
  VARFLAG_FDEFAULTCOLLELEM = 256,
  VARFLAG_FUIDEFAULT = 512,
  VARFLAG_FNONBROWSABLE = 1024,
  VARFLAG_FREPLACEABLE = 2048,
  VARFLAG_FIMMEDIATEBIND = 4096,
};

struct IRpcChannelBufferMarshalingContext
{
}; /* size: 0x0008 */

typedef struct _CMSG_CTRL_KEY_AGREE_DECRYPT_PARA
{
  /* 0x0000 */ unsigned long cbSize;
  /* 0x0004 */ long Padding_94;
  union
  {
    /* 0x0008 */ unsigned __int64 hCryptProv;
    /* 0x0008 */ unsigned __int64 hNCryptKey;
  }; /* size: 0x0008 */
  /* 0x0010 */ unsigned long dwKeySpec;
  /* 0x0014 */ long Padding_95;
  /* 0x0018 */ struct _CMSG_KEY_AGREE_RECIPIENT_INFO* pKeyAgree;
  /* 0x0020 */ unsigned long dwRecipientIndex;
  /* 0x0024 */ unsigned long dwRecipientEncryptedKeyIndex;
  /* 0x0028 */ struct _CRYPT_BIT_BLOB OriginatorPublicKey;
} CMSG_CTRL_KEY_AGREE_DECRYPT_PARA, *PCMSG_CTRL_KEY_AGREE_DECRYPT_PARA; /* size: 0x0040 */

typedef struct _BIN_RANGE
{
  /* 0x0000 */ union _LARGE_INTEGER StartValue;
  /* 0x0008 */ union _LARGE_INTEGER Length;
} BIN_RANGE, *PBIN_RANGE; /* size: 0x0010 */

typedef struct _SYSTEM_HANDLE_TABLE_ENTRY_INFO_EX
{
  /* 0x0000 */ void* Object;
  /* 0x0008 */ unsigned __int64 UniqueProcessId;
  /* 0x0010 */ unsigned __int64 HandleValue;
  /* 0x0018 */ unsigned long GrantedAccess;
  /* 0x001c */ unsigned short CreatorBackTraceIndex;
  /* 0x001e */ unsigned short ObjectTypeIndex;
  /* 0x0020 */ unsigned long HandleAttributes;
  /* 0x0024 */ unsigned long Reserved;
} SYSTEM_HANDLE_TABLE_ENTRY_INFO_EX, *PSYSTEM_HANDLE_TABLE_ENTRY_INFO_EX; /* size: 0x0028 */

typedef enum __MIDL_IBindStatusCallback_0002
{
  BINDINFOF_URLENCODESTGMEDDATA = 1,
  BINDINFOF_URLENCODEDEXTRAINFO = 2,
} _MIDL_IBindStatusCallback_0002, *P_MIDL_IBindStatusCallback_0002;

struct _TP_POOL;

typedef struct _CRL_FIND_ISSUED_FOR_PARA
{
  /* 0x0000 */ const struct _CERT_CONTEXT* pSubjectCert;
  /* 0x0008 */ const struct _CERT_CONTEXT* pIssuerCert;
} CRL_FIND_ISSUED_FOR_PARA, *PCRL_FIND_ISSUED_FOR_PARA; /* size: 0x0010 */

class CCompositeMonikerEnum
{
  /* 0x0000 */ long Padding_96[2];
  /* 0x0008 */ unsigned long m_refs;
  /* 0x000c */ long Padding_97;
  /* 0x0010 */ class CCompositeMoniker* m_pCM;
  /* 0x0018 */ int m_fForward;
  /* 0x001c */ long Padding_98;
  /* 0x0020 */ struct CCompositeMonikerEnum::se* m_pBase;
  /* 0x0028 */ struct CCompositeMonikerEnum::se* m_pTop;
  /* 0x0030 */ struct IMoniker* m_pNext;
}; /* size: 0x0038 */

typedef enum _TAG_UNNAMED_5
{
  value = 1,
} TAG_UNNAMED_5, *PTAG_UNNAMED_5;

struct POWER_STATE_NOTIFY_HANDLER
{
  /* 0x0000 */ void* Handler /* function */;
  /* 0x0008 */ void* Context;
}; /* size: 0x0010 */

struct IOleCache2
{
}; /* size: 0x0008 */

typedef struct _PRINTER_OPTIONSW
{
  /* 0x0000 */ unsigned int cbSize;
  /* 0x0004 */ unsigned long dwFlags;
} PRINTER_OPTIONSW, *PPRINTER_OPTIONSW; /* size: 0x0008 */

typedef enum _SC_STATUS_TYPE
{
  SC_STATUS_PROCESS_INFO = 0,
} SC_STATUS_TYPE, *PSC_STATUS_TYPE;

typedef struct _KEY_EVENT_RECORD
{
  /* 0x0000 */ int bKeyDown;
  /* 0x0004 */ unsigned short wRepeatCount;
  /* 0x0006 */ unsigned short wVirtualKeyCode;
  /* 0x0008 */ unsigned short wVirtualScanCode;
  union
  {
    union
    {
      /* 0x000a */ wchar_t UnicodeChar;
      /* 0x000a */ char AsciiChar;
    }; /* size: 0x0002 */
  } /* size: 0x0002 */ uChar;
  /* 0x000c */ unsigned long dwControlKeyState;
} KEY_EVENT_RECORD, *PKEY_EVENT_RECORD; /* size: 0x0010 */

typedef struct _COORD
{
  /* 0x0000 */ short X;
  /* 0x0002 */ short Y;
} COORD, *PCOORD; /* size: 0x0004 */

typedef struct _MOUSE_EVENT_RECORD
{
  /* 0x0000 */ struct _COORD dwMousePosition;
  /* 0x0004 */ unsigned long dwButtonState;
  /* 0x0008 */ unsigned long dwControlKeyState;
  /* 0x000c */ unsigned long dwEventFlags;
} MOUSE_EVENT_RECORD, *PMOUSE_EVENT_RECORD; /* size: 0x0010 */

typedef struct _WINDOW_BUFFER_SIZE_RECORD
{
  /* 0x0000 */ struct _COORD dwSize;
} WINDOW_BUFFER_SIZE_RECORD, *PWINDOW_BUFFER_SIZE_RECORD; /* size: 0x0004 */

typedef struct _MENU_EVENT_RECORD
{
  /* 0x0000 */ unsigned int dwCommandId;
} MENU_EVENT_RECORD, *PMENU_EVENT_RECORD; /* size: 0x0004 */

typedef struct _FOCUS_EVENT_RECORD
{
  /* 0x0000 */ int bSetFocus;
} FOCUS_EVENT_RECORD, *PFOCUS_EVENT_RECORD; /* size: 0x0004 */

typedef struct _INPUT_RECORD
{
  /* 0x0000 */ unsigned short EventType;
  /* 0x0002 */ char Padding_99[2];
  union
  {
    union
    {
      /* 0x0004 */ struct _KEY_EVENT_RECORD KeyEvent;
      /* 0x0004 */ struct _MOUSE_EVENT_RECORD MouseEvent;
      /* 0x0004 */ struct _WINDOW_BUFFER_SIZE_RECORD WindowBufferSizeEvent;
      /* 0x0004 */ struct _MENU_EVENT_RECORD MenuEvent;
      /* 0x0004 */ struct _FOCUS_EVENT_RECORD FocusEvent;
    }; /* size: 0x0010 */
  } /* size: 0x0010 */ Event;
} INPUT_RECORD, *PINPUT_RECORD; /* size: 0x0014 */

typedef struct _CRYPT_OID_INFO
{
  /* 0x0000 */ unsigned long cbSize;
  /* 0x0004 */ long Padding_100;
  /* 0x0008 */ const char* pszOID;
  /* 0x0010 */ const wchar_t* pwszName;
  /* 0x0018 */ unsigned long dwGroupId;
  union
  {
    /* 0x001c */ unsigned long dwValue;
    /* 0x001c */ unsigned int Algid;
    /* 0x001c */ unsigned long dwLength;
  }; /* size: 0x0004 */
  /* 0x0020 */ struct _CRYPTOAPI_BLOB ExtraInfo;
} CRYPT_OID_INFO, *PCRYPT_OID_INFO; /* size: 0x0030 */

class Windows::AutoOperatorAmpersandHelper<Windows::Rtl::IRtlUtf8StringBuilder *,Windows::Auto<Windows::Rtl::IRtlUtf8StringBuilder *> >;

typedef enum _FP__IEEE_FORMAT
{
  FpFormatFp32 = 0,
  FpFormatFp64 = 1,
  FpFormatFp80 = 2,
  FpFormatFp128 = 3,
  FpFormatI16 = 4,
  FpFormatI32 = 5,
  FpFormatI64 = 6,
  FpFormatU16 = 7,
  FpFormatU32 = 8,
  FpFormatU64 = 9,
  FpFormatCompare = 10,
  FpFormatString = 11,
} FP__IEEE_FORMAT, *PFP__IEEE_FORMAT;

class Microsoft::WRL::Details::ComPtrRef<Microsoft::WRL::ComPtr<IStorage> >
{
}; /* size: 0x0008 */

typedef enum _TAG_UNNAMED_6
{
  Value = 0,
} TAG_UNNAMED_6, *PTAG_UNNAMED_6;

struct IDocfileAsyncConnectionPoint
{
}; /* size: 0x0008 */

typedef struct _SYSTEM_POWER_STATE_CONTEXT
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long Reserved1 : 8; /* bit position: 0 */
      /* 0x0000 */ unsigned long TargetSystemState : 4; /* bit position: 8 */
      /* 0x0000 */ unsigned long EffectiveSystemState : 4; /* bit position: 12 */
      /* 0x0000 */ unsigned long CurrentSystemState : 4; /* bit position: 16 */
      /* 0x0000 */ unsigned long IgnoreHibernationPath : 1; /* bit position: 20 */
      /* 0x0000 */ unsigned long PseudoTransition : 1; /* bit position: 21 */
      /* 0x0000 */ unsigned long Reserved2 : 10; /* bit position: 22 */
    }; /* bitfield */
    /* 0x0000 */ unsigned long ContextAsUlong;
  }; /* size: 0x0004 */
} SYSTEM_POWER_STATE_CONTEXT, *PSYSTEM_POWER_STATE_CONTEXT; /* size: 0x0004 */

typedef enum _LEARNING_MODE_LOG_LEVEL
{
  LearningModeLogLevelPassive = 0,
  LearningModeLogLevelNormalApc = 1,
  LearningModeLogLevelSpecialApc = 2,
  LearningModeLogLevelMax = 3,
} LEARNING_MODE_LOG_LEVEL, *PLEARNING_MODE_LOG_LEVEL;

struct IProvideClassInfo
{
}; /* size: 0x0008 */

typedef struct _SYSTEM_PROCESSOR_PERFORMANCE_HITCOUNT
{
  /* 0x0000 */ unsigned long Hits;
  /* 0x0004 */ unsigned char PercentFrequency;
  /* 0x0005 */ char __PADDING__[3];
} SYSTEM_PROCESSOR_PERFORMANCE_HITCOUNT, *PSYSTEM_PROCESSOR_PERFORMANCE_HITCOUNT; /* size: 0x0008 */

typedef struct _RTL_VERIFIER_HELPER_TABLE
{
  /* 0x0000 */ unsigned long Length;
  /* 0x0004 */ long Padding_101;
  /* 0x0008 */ void* VerifierEngGetStackTraceAddress /* function */;
  /* 0x0010 */ void* VerifierEngNtdllHeapFreeCallback /* function */;
  /* 0x0018 */ void* VerifierEngLogStackTrace /* function */;
  /* 0x0020 */ const struct _UNICODE_STRING* UnicodeImageName;
  /* 0x0028 */ void* VerifierEngCommitDebugInfo /* function */;
  /* 0x0030 */ void* VerifierEngSetProcessDebugInformation /* function */;
  /* 0x0038 */ void* VerifierEngQueryImageFileExecutionOptionsEx /* function */;
  /* 0x0040 */ unsigned long* AddressDphGlobalFlags;
  /* 0x0048 */ struct _RTL_VERIFIER_HEAP_TABLE* VerifierTable;
  /* 0x0050 */ struct _RTL_VERIFIER_PROVIDER_DESCRIPTOR* VerifierDescriptor;
  /* 0x0058 */ void* OptionsKey;
  /* 0x0060 */ void* VerifierEngGetStackTraceAddressEx /* function */;
  /* 0x0068 */ void* VerifierEngReleaseStackTrace /* function */;
  /* 0x0070 */ void* VerifierEngStdInitializeStackTrace /* function */;
  /* 0x0078 */ void* VerifierEngStdDeleteStackTrace /* function */;
  /* 0x0080 */ void* VerifierEngStdLogStackTrace /* function */;
  /* 0x0088 */ void* VerifierEngStdReleaseStackTrace /* function */;
} RTL_VERIFIER_HELPER_TABLE, *PRTL_VERIFIER_HELPER_TABLE; /* size: 0x0090 */

typedef enum _CM_SERVICE_NODE_TYPE
{
  DriverType = 1,
  FileSystemType = 2,
  Win32ServiceOwnProcess = 16,
  Win32ServiceShareProcess = 32,
  AdapterType = 4,
  RecognizerType = 8,
} CM_SERVICE_NODE_TYPE, *PCM_SERVICE_NODE_TYPE;

typedef enum _APTTYPE
{
  APTTYPE_CURRENT = -1,
  APTTYPE_STA = 0,
  APTTYPE_MTA = 1,
  APTTYPE_NA = 2,
  APTTYPE_MAINSTA = 3,
} APTTYPE, *PAPTTYPE;

struct IUrlMon
{
}; /* size: 0x0008 */

struct IMonikerProp
{
}; /* size: 0x0008 */

typedef enum _TAG_UNNAMED_7
{
  Minimal = 0,
  Normal = 128,
  MaximallyVerbose = 255,
} TAG_UNNAMED_7, *PTAG_UNNAMED_7;

class Microsoft::WRL::Wrappers::Details::SyncLockT<Microsoft::WRL::Wrappers::HandleTraits::SRWLockExclusiveTraits>
{
  /* 0x0000 */ struct _RTL_SRWLOCK* sync_;
}; /* size: 0x0008 */

struct ICacheRefresh
{
}; /* size: 0x0008 */

struct HDC__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

typedef enum _CM_SERVICE_LOAD_TYPE
{
  BootLoad = 0,
  SystemLoad = 1,
  AutoLoad = 2,
  DemandLoad = 3,
  DisableLoad = 4,
} CM_SERVICE_LOAD_TYPE, *PCM_SERVICE_LOAD_TYPE;

typedef struct _PROCESS_BASIC_INFORMATION
{
  /* 0x0000 */ long ExitStatus;
  /* 0x0004 */ long Padding_102;
  /* 0x0008 */ struct _PEB* PebBaseAddress;
  /* 0x0010 */ unsigned __int64 AffinityMask;
  /* 0x0018 */ long BasePriority;
  /* 0x001c */ long Padding_103;
  /* 0x0020 */ unsigned __int64 UniqueProcessId;
  /* 0x0028 */ unsigned __int64 InheritedFromUniqueProcessId;
} PROCESS_BASIC_INFORMATION, *PPROCESS_BASIC_INFORMATION; /* size: 0x0030 */

typedef struct _PROCESS_EXTENDED_BASIC_INFORMATION
{
  /* 0x0000 */ unsigned __int64 Size;
  /* 0x0008 */ struct _PROCESS_BASIC_INFORMATION BasicInfo;
  union
  {
    /* 0x0038 */ unsigned long Flags;
    struct /* bitfield */
    {
      /* 0x0038 */ unsigned long IsProtectedProcess : 1; /* bit position: 0 */
      /* 0x0038 */ unsigned long IsWow64Process : 1; /* bit position: 1 */
      /* 0x0038 */ unsigned long IsProcessDeleting : 1; /* bit position: 2 */
      /* 0x0038 */ unsigned long IsCrossSessionCreate : 1; /* bit position: 3 */
      /* 0x0038 */ unsigned long IsFrozen : 1; /* bit position: 4 */
      /* 0x0038 */ unsigned long IsBackground : 1; /* bit position: 5 */
      /* 0x0038 */ unsigned long IsStronglyNamed : 1; /* bit position: 6 */
      /* 0x0038 */ unsigned long SpareBits : 25; /* bit position: 7 */
    }; /* bitfield */
  }; /* size: 0x0004 */
  /* 0x003c */ long __PADDING__[1];
} PROCESS_EXTENDED_BASIC_INFORMATION, *PPROCESS_EXTENDED_BASIC_INFORMATION; /* size: 0x0040 */

typedef enum _THREAD_INFORMATION_CLASS
{
  ThreadMemoryPriority = 0,
  ThreadAbsoluteCpuPriority = 1,
  ThreadInformationClassMax = 2,
} THREAD_INFORMATION_CLASS, *PTHREAD_INFORMATION_CLASS;

typedef enum _TAG_UNNAMED_8
{
  value = 1,
} TAG_UNNAMED_8, *PTAG_UNNAMED_8;

struct tagProxyFileInfo
{
  /* 0x0000 */ struct tagCInterfaceProxyVtbl* const* pProxyVtblList;
  /* 0x0008 */ struct tagCInterfaceStubVtbl* const* pStubVtblList;
  /* 0x0010 */ const char* const* pNamesArray;
  /* 0x0018 */ const struct _GUID** pDelegatedIIDs;
  /* 0x0020 */ void* const pIIDLookupRtn /* function */;
  /* 0x0028 */ unsigned short TableSize;
  /* 0x002a */ unsigned short TableVersion;
  /* 0x002c */ long Padding_104;
  /* 0x0030 */ const struct _GUID** pAsyncIIDLookup;
  /* 0x0038 */ __int64 Filler2;
  /* 0x0040 */ __int64 Filler3;
  /* 0x0048 */ __int64 Filler4;
}; /* size: 0x0050 */

typedef enum _SID_NAME_USE
{
  SidTypeUser = 1,
  SidTypeGroup = 2,
  SidTypeDomain = 3,
  SidTypeAlias = 4,
  SidTypeWellKnownGroup = 5,
  SidTypeDeletedAccount = 6,
  SidTypeInvalid = 7,
  SidTypeUnknown = 8,
  SidTypeComputer = 9,
  SidTypeLabel = 10,
} SID_NAME_USE, *PSID_NAME_USE;

enum tagFUNCFLAGS
{
  FUNCFLAG_FRESTRICTED = 1,
  FUNCFLAG_FSOURCE = 2,
  FUNCFLAG_FBINDABLE = 4,
  FUNCFLAG_FREQUESTEDIT = 8,
  FUNCFLAG_FDISPLAYBIND = 16,
  FUNCFLAG_FDEFAULTBIND = 32,
  FUNCFLAG_FHIDDEN = 64,
  FUNCFLAG_FUSESGETLASTERROR = 128,
  FUNCFLAG_FDEFAULTCOLLELEM = 256,
  FUNCFLAG_FUIDEFAULT = 512,
  FUNCFLAG_FNONBROWSABLE = 1024,
  FUNCFLAG_FREPLACEABLE = 2048,
  FUNCFLAG_FIMMEDIATEBIND = 4096,
};

typedef struct _BLENDFUNCTION
{
  /* 0x0000 */ unsigned char BlendOp;
  /* 0x0001 */ unsigned char BlendFlags;
  /* 0x0002 */ unsigned char SourceConstantAlpha;
  /* 0x0003 */ unsigned char AlphaFormat;
} BLENDFUNCTION, *PBLENDFUNCTION; /* size: 0x0004 */

typedef enum _TAG_UNNAMED_9
{
  value = 1,
} TAG_UNNAMED_9, *PTAG_UNNAMED_9;

class CDirVector
{
  /* 0x0000 */ long Padding_105[12];
  /* 0x0030 */ unsigned short _cbSector;
}; /* size: 0x0038 */

class CBasedMStreamPtr
{
  /* 0x0000 */ unsigned __int64 _p;
}; /* size: 0x0008 */

class CDirectory
{
  /* 0x0000 */ class CDirVector _dv;
  /* 0x0038 */ unsigned long _cdsTable;
  /* 0x003c */ long Padding_106;
  /* 0x0040 */ class CBasedMStreamPtr _pmsParent;
  /* 0x0048 */ unsigned short _cdeEntries;
  /* 0x004a */ char Padding_107[2];
  /* 0x004c */ unsigned long _sidFirstFree;
}; /* size: 0x0050 */

struct tagLOGFONTA
{
  /* 0x0000 */ long lfHeight;
  /* 0x0004 */ long lfWidth;
  /* 0x0008 */ long lfEscapement;
  /* 0x000c */ long lfOrientation;
  /* 0x0010 */ long lfWeight;
  /* 0x0014 */ unsigned char lfItalic;
  /* 0x0015 */ unsigned char lfUnderline;
  /* 0x0016 */ unsigned char lfStrikeOut;
  /* 0x0017 */ unsigned char lfCharSet;
  /* 0x0018 */ unsigned char lfOutPrecision;
  /* 0x0019 */ unsigned char lfClipPrecision;
  /* 0x001a */ unsigned char lfQuality;
  /* 0x001b */ unsigned char lfPitchAndFamily;
  /* 0x001c */ char lfFaceName[32];
}; /* size: 0x003c */

struct tagICONMETRICSA
{
  /* 0x0000 */ unsigned int cbSize;
  /* 0x0004 */ int iHorzSpacing;
  /* 0x0008 */ int iVertSpacing;
  /* 0x000c */ int iTitleWrap;
  /* 0x0010 */ struct tagLOGFONTA lfFont;
}; /* size: 0x004c */

typedef struct _POINTL
{
  /* 0x0000 */ long x;
  /* 0x0004 */ long y;
} POINTL, *PPOINTL; /* size: 0x0008 */

struct DISPLAYCONFIG_SOURCE_MODE
{
  /* 0x0000 */ unsigned int width;
  /* 0x0004 */ unsigned int height;
  /* 0x0008 */ enum DISPLAYCONFIG_PIXELFORMAT pixelFormat;
  /* 0x000c */ struct _POINTL position;
}; /* size: 0x0014 */

typedef struct _FILE_FS_VOLUME_FLAGS_INFORMATION
{
  /* 0x0000 */ unsigned long Flags;
} FILE_FS_VOLUME_FLAGS_INFORMATION, *PFILE_FS_VOLUME_FLAGS_INFORMATION; /* size: 0x0004 */

typedef struct _LDRP_CSLIST
{
  /* 0x0000 */ struct _SINGLE_LIST_ENTRY* Tail;
} LDRP_CSLIST, *PLDRP_CSLIST; /* size: 0x0008 */

typedef struct _SINGLE_LIST_ENTRY
{
  /* 0x0000 */ struct _SINGLE_LIST_ENTRY* Next;
} SINGLE_LIST_ENTRY, *PSINGLE_LIST_ENTRY; /* size: 0x0008 */

typedef enum _LDR_DDAG_STATE
{
  LdrModulesMerged = -5,
  LdrModulesInitError = -4,
  LdrModulesSnapError = -3,
  LdrModulesUnloaded = -2,
  LdrModulesUnloading = -1,
  LdrModulesPlaceHolder = 0,
  LdrModulesMapping = 1,
  LdrModulesMapped = 2,
  LdrModulesWaitingForDependencies = 3,
  LdrModulesSnapping = 4,
  LdrModulesSnapped = 5,
  LdrModulesCondensed = 6,
  LdrModulesReadyToInit = 7,
  LdrModulesInitializing = 8,
  LdrModulesReadyToRun = 9,
} LDR_DDAG_STATE, *PLDR_DDAG_STATE;

typedef struct _LDR_DDAG_NODE
{
  /* 0x0000 */ struct _LIST_ENTRY Modules;
  /* 0x0010 */ struct _LDR_SERVICE_TAG_RECORD* ServiceTagList;
  /* 0x0018 */ unsigned long LoadCount;
  /* 0x001c */ unsigned long ReferenceCount;
  /* 0x0020 */ unsigned long DependencyCount;
  /* 0x0024 */ long Padding_108;
  union
  {
    /* 0x0028 */ struct _LDRP_CSLIST Dependencies;
    /* 0x0028 */ struct _SINGLE_LIST_ENTRY RemovalLink;
  }; /* size: 0x0008 */
  /* 0x0030 */ struct _LDRP_CSLIST IncomingDependencies;
  /* 0x0038 */ enum _LDR_DDAG_STATE State;
  /* 0x003c */ long Padding_109;
  /* 0x0040 */ struct _SINGLE_LIST_ENTRY CondenseLink;
  /* 0x0048 */ unsigned long PreorderNumber;
  /* 0x004c */ unsigned long LowestLink;
} LDR_DDAG_NODE, *PLDR_DDAG_NODE; /* size: 0x0050 */

enum tagOLEMISC
{
  OLEMISC_RECOMPOSEONRESIZE = 1,
  OLEMISC_ONLYICONIC = 2,
  OLEMISC_INSERTNOTREPLACE = 4,
  OLEMISC_STATIC = 8,
  OLEMISC_CANTLINKINSIDE = 16,
  OLEMISC_CANLINKBYOLE1 = 32,
  OLEMISC_ISLINKOBJECT = 64,
  OLEMISC_INSIDEOUT = 128,
  OLEMISC_ACTIVATEWHENVISIBLE = 256,
  OLEMISC_RENDERINGISDEVICEINDEPENDENT = 512,
  OLEMISC_INVISIBLEATRUNTIME = 1024,
  OLEMISC_ALWAYSRUN = 2048,
  OLEMISC_ACTSLIKEBUTTON = 4096,
  OLEMISC_ACTSLIKELABEL = 8192,
  OLEMISC_NOUIACTIVATE = 16384,
  OLEMISC_ALIGNABLE = 0xffff8000,
  OLEMISC_SIMPLEFRAME = 0x10000,
  OLEMISC_SETCLIENTSITEFIRST = 0x20000,
  OLEMISC_IMEMODE = 0x40000,
  OLEMISC_IGNOREACTIVATEWHENVISIBLE = 0x80000,
  OLEMISC_WANTSTOMENUMERGE = 0x100000,
  OLEMISC_SUPPORTSMULTILEVELUNDO = 0x200000,
};

typedef struct _TAPE_GET_POSITION
{
  /* 0x0000 */ unsigned long Type;
  /* 0x0004 */ unsigned long Partition;
  /* 0x0008 */ union _LARGE_INTEGER Offset;
} TAPE_GET_POSITION, *PTAPE_GET_POSITION; /* size: 0x0010 */

typedef struct _DECRYPTION_STATUS_BUFFER
{
  /* 0x0000 */ unsigned char NoEncryptedStreams;
} DECRYPTION_STATUS_BUFFER, *PDECRYPTION_STATUS_BUFFER; /* size: 0x0001 */

typedef struct _NDR64_POINTER_FORMAT
{
  /* 0x0000 */ unsigned char FormatCode;
  /* 0x0001 */ unsigned char Flags;
  /* 0x0002 */ unsigned short Reserved;
  /* 0x0004 */ long Padding_110;
  /* 0x0008 */ const void* Pointee;
} NDR64_POINTER_FORMAT, *PNDR64_POINTER_FORMAT; /* size: 0x0010 */

typedef enum _THREAD_UMS_INFORMATION_COMMAND
{
  UmsInformationCommandInvalid = 0,
  UmsInformationCommandAttach = 1,
  UmsInformationCommandDetach = 2,
  UmsInformationCommandQuery = 3,
} THREAD_UMS_INFORMATION_COMMAND, *PTHREAD_UMS_INFORMATION_COMMAND;

typedef struct _TAPE_SET_DRIVE_PARAMETERS
{
  /* 0x0000 */ unsigned char ECC;
  /* 0x0001 */ unsigned char Compression;
  /* 0x0002 */ unsigned char DataPadding;
  /* 0x0003 */ unsigned char ReportSetmarks;
  /* 0x0004 */ unsigned long EOTWarningZoneSize;
} TAPE_SET_DRIVE_PARAMETERS, *PTAPE_SET_DRIVE_PARAMETERS; /* size: 0x0008 */

typedef enum _TAG_UNNAMED_10
{
  value = 1,
} TAG_UNNAMED_10, *PTAG_UNNAMED_10;

typedef struct _JOBOBJECT_SECURITY_LIMIT_INFORMATION
{
  /* 0x0000 */ unsigned long SecurityLimitFlags;
  /* 0x0004 */ long Padding_111;
  /* 0x0008 */ void* JobToken;
  /* 0x0010 */ struct _TOKEN_GROUPS* SidsToDisable;
  /* 0x0018 */ struct _TOKEN_PRIVILEGES* PrivilegesToDelete;
  /* 0x0020 */ struct _TOKEN_GROUPS* RestrictedSids;
} JOBOBJECT_SECURITY_LIMIT_INFORMATION, *PJOBOBJECT_SECURITY_LIMIT_INFORMATION; /* size: 0x0028 */

enum tagCALLCATEGORY
{
  CALLCAT_NOCALL = 0,
  CALLCAT_SYNCHRONOUS = 1,
  CALLCAT_ASYNC = 2,
  CALLCAT_INPUTSYNC = 3,
  CALLCAT_INTERNALSYNC = 4,
  CALLCAT_INTERNALINPUTSYNC = 5,
  CALLCAT_SCMCALL = 6,
};

enum tagGLOBALOPT_EH_VALUES
{
  COMGLB_EXCEPTION_HANDLE = 0,
  COMGLB_EXCEPTION_DONOT_HANDLE_FATAL = 1,
  COMGLB_EXCEPTION_DONOT_HANDLE = 1,
  COMGLB_EXCEPTION_DONOT_HANDLE_ANY = 2,
};

typedef struct _ACL_SIZE_INFORMATION
{
  /* 0x0000 */ unsigned long AceCount;
  /* 0x0004 */ unsigned long AclBytesInUse;
  /* 0x0008 */ unsigned long AclBytesFree;
} ACL_SIZE_INFORMATION, *PACL_SIZE_INFORMATION; /* size: 0x000c */

typedef struct _MEMORY_WORKING_SET_BLOCK
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned __int64 Protection : 5; /* bit position: 0 */
    /* 0x0000 */ unsigned __int64 ShareCount : 3; /* bit position: 5 */
    /* 0x0000 */ unsigned __int64 Shared : 1; /* bit position: 8 */
    /* 0x0000 */ unsigned __int64 Node : 3; /* bit position: 9 */
    /* 0x0000 */ unsigned __int64 VirtualPage : 52; /* bit position: 12 */
  }; /* bitfield */
} MEMORY_WORKING_SET_BLOCK, *PMEMORY_WORKING_SET_BLOCK; /* size: 0x0008 */

enum tagRpcLocalAddressFormat
{
  rlafInvalid = 0,
  rlafIPv4 = 1,
  rlafIPv6 = 2,
};

typedef struct _RPC_CALL_LOCAL_ADDRESS_V1
{
  /* 0x0000 */ unsigned int Version;
  /* 0x0004 */ long Padding_112;
  /* 0x0008 */ void* Buffer;
  /* 0x0010 */ unsigned long BufferSize;
  /* 0x0014 */ enum tagRpcLocalAddressFormat AddressFormat;
} RPC_CALL_LOCAL_ADDRESS_V1, *PRPC_CALL_LOCAL_ADDRESS_V1; /* size: 0x0018 */

class CBrokeredClipDataObject::GetData::__l18::<lambda_DB08121F9B2E4167>
{
  /* 0x0000 */ class CBrokeredClipDataObject* const __this;
  /* 0x0008 */ struct tagFORMATETC*& pformatetcIn;
  /* 0x0010 */ struct tagSTGMEDIUM*& pmedium;
}; /* size: 0x0018 */

typedef enum _TAG_UNNAMED_11
{
  value = 1,
} TAG_UNNAMED_11, *PTAG_UNNAMED_11;

typedef struct _RPC_POLICY
{
  /* 0x0000 */ unsigned int Length;
  /* 0x0004 */ unsigned long EndpointFlags;
  /* 0x0008 */ unsigned long NICFlags;
} RPC_POLICY, *PRPC_POLICY; /* size: 0x000c */

struct CCompositeMonikerEnum::se
{
  /* 0x0000 */ class CCompositeMoniker* m_pCM;
  /* 0x0008 */ struct CCompositeMonikerEnum::se* m_pseNext;
  /* 0x0010 */ struct CCompositeMonikerEnum::se* m_psePrev;
}; /* size: 0x0018 */

typedef struct _NDR64_NO_REPEAT_FORMAT
{
  /* 0x0000 */ unsigned char FormatCode;
  /* 0x0001 */ unsigned char Flags;
  /* 0x0002 */ unsigned short Reserved1;
  /* 0x0004 */ unsigned int Reserved2;
} NDR64_NO_REPEAT_FORMAT, *PNDR64_NO_REPEAT_FORMAT; /* size: 0x0008 */

typedef struct _NDR64_POINTER_INSTANCE_HEADER_FORMAT
{
  /* 0x0000 */ unsigned int Offset;
  /* 0x0004 */ unsigned int Reserved;
} NDR64_POINTER_INSTANCE_HEADER_FORMAT, *PNDR64_POINTER_INSTANCE_HEADER_FORMAT; /* size: 0x0008 */

typedef struct _LUID_AND_ATTRIBUTES
{
  /* 0x0000 */ struct _LUID Luid;
  /* 0x0008 */ unsigned long Attributes;
} LUID_AND_ATTRIBUTES, *PLUID_AND_ATTRIBUTES; /* size: 0x000c */

typedef struct _PRIVILEGE_SET
{
  /* 0x0000 */ unsigned long PrivilegeCount;
  /* 0x0004 */ unsigned long Control;
  /* 0x0008 */ struct _LUID_AND_ATTRIBUTES Privilege[1];
} PRIVILEGE_SET, *PPRIVILEGE_SET; /* size: 0x0014 */

struct SStringHashNode
{
  /* 0x0000 */ struct SHashChain chain;
  /* 0x0010 */ unsigned long dwHash;
  /* 0x0014 */ long Padding_113;
  /* 0x0018 */ struct tagDUALSTRINGARRAY* psaKey;
}; /* size: 0x0020 */

enum tagXMLEMEM_TYPE
{
  XMLELEMTYPE_ELEMENT = 0,
  XMLELEMTYPE_TEXT = 1,
  XMLELEMTYPE_COMMENT = 2,
  XMLELEMTYPE_DOCUMENT = 3,
  XMLELEMTYPE_DTD = 4,
  XMLELEMTYPE_PI = 5,
  XMLELEMTYPE_OTHER = 6,
};

struct IAgileObject
{
}; /* size: 0x0008 */

typedef enum _MEMORY_INFORMATION_CLASS
{
  MemoryBasicInformation = 0,
  MemoryWorkingSetInformation = 1,
  MemoryMappedFilenameInformation = 2,
  MemoryRegionInformation = 3,
  MemoryWorkingSetExInformation = 4,
} MEMORY_INFORMATION_CLASS, *PMEMORY_INFORMATION_CLASS;

enum CO_MARSHALING_CONTEXT_ATTRIBUTES
{
  CO_MARSHALING_SOURCE_IS_APP_CONTAINER = 0,
};

struct MarshalingContextAttributeValue
{
  /* 0x0000 */ enum CO_MARSHALING_CONTEXT_ATTRIBUTES attribute;
  /* 0x0004 */ long Padding_114;
  /* 0x0008 */ unsigned __int64 value;
}; /* size: 0x0010 */

typedef struct _CMSG_KEY_AGREE_RECIPIENT_ENCODE_INFO
{
  /* 0x0000 */ unsigned long cbSize;
  /* 0x0004 */ long Padding_115;
  /* 0x0008 */ struct _CRYPT_ALGORITHM_IDENTIFIER KeyEncryptionAlgorithm;
  /* 0x0020 */ void* pvKeyEncryptionAuxInfo;
  /* 0x0028 */ struct _CRYPT_ALGORITHM_IDENTIFIER KeyWrapAlgorithm;
  /* 0x0040 */ void* pvKeyWrapAuxInfo;
  /* 0x0048 */ unsigned __int64 hCryptProv;
  /* 0x0050 */ unsigned long dwKeySpec;
  /* 0x0054 */ unsigned long dwKeyChoice;
  union
  {
    /* 0x0058 */ struct _CRYPT_ALGORITHM_IDENTIFIER* pEphemeralAlgorithm;
    /* 0x0058 */ struct _CERT_ID* pSenderId;
  }; /* size: 0x0008 */
  /* 0x0060 */ struct _CRYPTOAPI_BLOB UserKeyingMaterial;
  /* 0x0070 */ unsigned long cRecipientEncryptedKeys;
  /* 0x0074 */ long Padding_116;
  /* 0x0078 */ struct _CMSG_RECIPIENT_ENCRYPTED_KEY_ENCODE_INFO** rgpRecipientEncryptedKeys;
} CMSG_KEY_AGREE_RECIPIENT_ENCODE_INFO, *PCMSG_KEY_AGREE_RECIPIENT_ENCODE_INFO; /* size: 0x0080 */

typedef enum _tagPI_FLAGS
{
  PI_PARSE_URL = 1,
  PI_FILTER_MODE = 2,
  PI_FORCE_ASYNC = 4,
  PI_USE_WORKERTHREAD = 8,
  PI_MIMEVERIFICATION = 16,
  PI_CLSIDLOOKUP = 32,
  PI_DATAPROGRESS = 64,
  PI_SYNCHRONOUS = 128,
  PI_APARTMENTTHREADED = 256,
  PI_CLASSINSTALL = 512,
  PI_PASSONBINDCTX = 8192,
  PI_NOMIMEHANDLER = 0xffff8000,
  PI_LOADAPPDIRECT = 16384,
  PD_FORCE_SWITCH = 0x10000,
  PI_PREFERDEFAULTHANDLER = 0x20000,
} tagPI_FLAGS, *PtagPI_FLAGS;

struct INoMarshal
{
}; /* size: 0x0008 */

typedef enum _SECTION_INFORMATION_CLASS
{
  SectionBasicInformation = 0,
  SectionImageInformation = 1,
  SectionRelocationInformation = 2,
  MaxSectionInfoClass = 3,
} SECTION_INFORMATION_CLASS, *PSECTION_INFORMATION_CLASS;

typedef struct _IMAGE_TLS_DIRECTORY32
{
  /* 0x0000 */ unsigned long StartAddressOfRawData;
  /* 0x0004 */ unsigned long EndAddressOfRawData;
  /* 0x0008 */ unsigned long AddressOfIndex;
  /* 0x000c */ unsigned long AddressOfCallBacks;
  /* 0x0010 */ unsigned long SizeOfZeroFill;
  /* 0x0014 */ unsigned long Characteristics;
} IMAGE_TLS_DIRECTORY32, *PIMAGE_TLS_DIRECTORY32; /* size: 0x0018 */

typedef struct _CERT_SELECT_CRITERIA
{
  /* 0x0000 */ unsigned long dwType;
  /* 0x0004 */ unsigned long cPara;
  /* 0x0008 */ void** ppPara;
} CERT_SELECT_CRITERIA, *PCERT_SELECT_CRITERIA; /* size: 0x0010 */

typedef enum _STORAGE_PORT_CODE_SET
{
  StoragePortCodeSetReserved = 0,
  StoragePortCodeSetStorport = 1,
  StoragePortCodeSetSCSIport = 2,
  StoragePortCodeSetSpaceport = 3,
  StoragePortCodeSetATAport = 4,
  StoragePortCodeSetUSBport = 5,
  StoragePortCodeSetSBP2port = 6,
  StoragePortCodeSetSDport = 7,
} STORAGE_PORT_CODE_SET, *PSTORAGE_PORT_CODE_SET;

typedef struct _IMAGE_RUNTIME_FUNCTION_ENTRY
{
  /* 0x0000 */ unsigned long BeginAddress;
  /* 0x0004 */ unsigned long EndAddress;
  union
  {
    /* 0x0008 */ unsigned long UnwindInfoAddress;
    /* 0x0008 */ unsigned long UnwindData;
  }; /* size: 0x0004 */
} IMAGE_RUNTIME_FUNCTION_ENTRY, *PIMAGE_RUNTIME_FUNCTION_ENTRY; /* size: 0x000c */

typedef struct _LDBL12
{
  /* 0x0000 */ unsigned char ld12[12];
} LDBL12, *PLDBL12; /* size: 0x000c */

typedef struct _IDEREGS
{
  /* 0x0000 */ unsigned char bFeaturesReg;
  /* 0x0001 */ unsigned char bSectorCountReg;
  /* 0x0002 */ unsigned char bSectorNumberReg;
  /* 0x0003 */ unsigned char bCylLowReg;
  /* 0x0004 */ unsigned char bCylHighReg;
  /* 0x0005 */ unsigned char bDriveHeadReg;
  /* 0x0006 */ unsigned char bCommandReg;
  /* 0x0007 */ unsigned char bReserved;
} IDEREGS, *PIDEREGS; /* size: 0x0008 */

typedef struct _SENDCMDINPARAMS
{
  /* 0x0000 */ unsigned long cBufferSize;
  /* 0x0004 */ struct _IDEREGS irDriveRegs;
  /* 0x000c */ unsigned char bDriveNumber;
  /* 0x000d */ unsigned char bReserved[3];
  /* 0x0010 */ unsigned long dwReserved[4];
  /* 0x0020 */ unsigned char bBuffer[1];
} SENDCMDINPARAMS, *PSENDCMDINPARAMS; /* size: 0x0021 */

typedef struct _MODEMSETTINGS
{
  /* 0x0000 */ unsigned long dwActualSize;
  /* 0x0004 */ unsigned long dwRequiredSize;
  /* 0x0008 */ unsigned long dwDevSpecificOffset;
  /* 0x000c */ unsigned long dwDevSpecificSize;
  /* 0x0010 */ unsigned long dwCallSetupFailTimer;
  /* 0x0014 */ unsigned long dwInactivityTimeout;
  /* 0x0018 */ unsigned long dwSpeakerVolume;
  /* 0x001c */ unsigned long dwSpeakerMode;
  /* 0x0020 */ unsigned long dwPreferredModemOptions;
  /* 0x0024 */ unsigned long dwNegotiatedModemOptions;
  /* 0x0028 */ unsigned long dwNegotiatedDCERate;
  /* 0x002c */ unsigned char abVariablePortion[1];
  /* 0x002d */ char __PADDING__[3];
} MODEMSETTINGS, *PMODEMSETTINGS; /* size: 0x0030 */

typedef struct _PRINTPROCESSOR_CAPS_2
{
  /* 0x0000 */ unsigned long dwLevel;
  /* 0x0004 */ unsigned long dwNupOptions;
  /* 0x0008 */ unsigned long dwPageOrderFlags;
  /* 0x000c */ unsigned long dwNumberOfCopies;
  /* 0x0010 */ unsigned long dwDuplexHandlingCaps;
  /* 0x0014 */ unsigned long dwNupDirectionCaps;
  /* 0x0018 */ unsigned long dwNupBorderCaps;
  /* 0x001c */ unsigned long dwBookletHandlingCaps;
  /* 0x0020 */ unsigned long dwScalingCaps;
} PRINTPROCESSOR_CAPS_2, *PPRINTPROCESSOR_CAPS_2; /* size: 0x0024 */

enum IMPORT_OBJECT_NAME_TYPE
{
  IMPORT_OBJECT_ORDINAL = 0,
  IMPORT_OBJECT_NAME = 1,
  IMPORT_OBJECT_NAME_NO_PREFIX = 2,
  IMPORT_OBJECT_NAME_UNDECORATE = 3,
};

typedef struct _ALPC_PORT_CALLBACK_INFORMATION
{
  /* 0x0000 */ void* CallbackObject;
  /* 0x0008 */ void* Context;
} ALPC_PORT_CALLBACK_INFORMATION, *PALPC_PORT_CALLBACK_INFORMATION; /* size: 0x0010 */

class Windows::ErrorHandling::Rtl::CBaseNtStatusCarryingFrame<Windows::ErrorHandling::Rtl::CSimpleNtStatusCarryingFrame>
{
  /* 0x0000 */ long m_status;
}; /* size: 0x0004 */

enum XLAT_SIDE
{
  XLAT_SERVER = 1,
  XLAT_CLIENT = 2,
};

struct tagSTATPROPSETSTG
{
  /* 0x0000 */ struct _GUID fmtid;
  /* 0x0010 */ struct _GUID clsid;
  /* 0x0020 */ unsigned long grfFlags;
  /* 0x0024 */ struct _FILETIME mtime;
  /* 0x002c */ struct _FILETIME ctime;
  /* 0x0034 */ struct _FILETIME atime;
  /* 0x003c */ unsigned long dwOSVersion;
}; /* size: 0x0040 */

typedef struct _PRINTPROCESSOR_INFO_1A
{
  /* 0x0000 */ char* pName;
} PRINTPROCESSOR_INFO_1A, *PPRINTPROCESSOR_INFO_1A; /* size: 0x0008 */

typedef enum _TAG_UNNAMED_12
{
  value = 0,
} TAG_UNNAMED_12, *PTAG_UNNAMED_12;

typedef struct _PUBLICKEYSTRUC
{
  /* 0x0000 */ unsigned char bType;
  /* 0x0001 */ unsigned char bVersion;
  /* 0x0002 */ unsigned short reserved;
  /* 0x0004 */ unsigned int aiKeyAlg;
} PUBLICKEYSTRUC, *PPUBLICKEYSTRUC; /* size: 0x0008 */

typedef enum _DEVICE_POWER_STATE
{
  PowerDeviceUnspecified = 0,
  PowerDeviceD0 = 1,
  PowerDeviceD1 = 2,
  PowerDeviceD2 = 3,
  PowerDeviceD3 = 4,
  PowerDeviceMaximum = 5,
} DEVICE_POWER_STATE, *PDEVICE_POWER_STATE;

typedef struct _TXFS_LIST_TRANSACTION_LOCKED_FILES_ENTRY
{
  /* 0x0000 */ unsigned __int64 Offset;
  /* 0x0008 */ unsigned long NameFlags;
  /* 0x000c */ long Padding_117;
  /* 0x0010 */ __int64 FileId;
  /* 0x0018 */ unsigned long Reserved1;
  /* 0x001c */ unsigned long Reserved2;
  /* 0x0020 */ __int64 Reserved3;
  /* 0x0028 */ wchar_t FileName[1];
  /* 0x002a */ char __PADDING__[6];
} TXFS_LIST_TRANSACTION_LOCKED_FILES_ENTRY, *PTXFS_LIST_TRANSACTION_LOCKED_FILES_ENTRY; /* size: 0x0030 */

typedef struct _BCRYPT_OID_LIST
{
  /* 0x0000 */ unsigned long dwOIDCount;
  /* 0x0004 */ long Padding_118;
  /* 0x0008 */ struct _BCRYPT_OID* pOIDs;
} BCRYPT_OID_LIST, *PBCRYPT_OID_LIST; /* size: 0x0010 */

typedef struct _RTL_DEBUG_INFORMATION
{
  /* 0x0000 */ void* SectionHandleClient;
  /* 0x0008 */ void* ViewBaseClient;
  /* 0x0010 */ void* ViewBaseTarget;
  /* 0x0018 */ unsigned __int64 ViewBaseDelta;
  /* 0x0020 */ void* EventPairClient;
  /* 0x0028 */ void* EventPairTarget;
  /* 0x0030 */ void* TargetProcessId;
  /* 0x0038 */ void* TargetThreadHandle;
  /* 0x0040 */ unsigned long Flags;
  /* 0x0044 */ long Padding_119;
  /* 0x0048 */ unsigned __int64 OffsetFree;
  /* 0x0050 */ unsigned __int64 CommitSize;
  /* 0x0058 */ unsigned __int64 ViewSize;
  union
  {
    /* 0x0060 */ struct _RTL_PROCESS_MODULES* Modules;
    /* 0x0060 */ struct _RTL_PROCESS_MODULE_INFORMATION_EX* ModulesEx;
  }; /* size: 0x0008 */
  /* 0x0068 */ struct _RTL_PROCESS_BACKTRACES* BackTraces;
  /* 0x0070 */ struct _RTL_PROCESS_HEAPS* Heaps;
  /* 0x0078 */ struct _RTL_PROCESS_LOCKS* Locks;
  /* 0x0080 */ void* SpecificHeap;
  /* 0x0088 */ void* TargetProcessHandle;
  /* 0x0090 */ struct _RTL_PROCESS_VERIFIER_OPTIONS* VerifierOptions;
  /* 0x0098 */ void* ProcessHeap;
  /* 0x00a0 */ void* CriticalSectionHandle;
  /* 0x00a8 */ void* CriticalSectionOwnerThread;
  /* 0x00b0 */ void* Reserved[4];
} RTL_DEBUG_INFORMATION, *PRTL_DEBUG_INFORMATION; /* size: 0x00d0 */

typedef struct _CMSG_KEY_TRANS_RECIPIENT_ENCODE_INFO
{
  /* 0x0000 */ unsigned long cbSize;
  /* 0x0004 */ long Padding_120;
  /* 0x0008 */ struct _CRYPT_ALGORITHM_IDENTIFIER KeyEncryptionAlgorithm;
  /* 0x0020 */ void* pvKeyEncryptionAuxInfo;
  /* 0x0028 */ unsigned __int64 hCryptProv;
  /* 0x0030 */ struct _CRYPT_BIT_BLOB RecipientPublicKey;
  /* 0x0048 */ struct _CERT_ID RecipientId;
} CMSG_KEY_TRANS_RECIPIENT_ENCODE_INFO, *PCMSG_KEY_TRANS_RECIPIENT_ENCODE_INFO; /* size: 0x0070 */

typedef enum _TRANSACTIONMANAGER_INFORMATION_CLASS
{
  TransactionManagerBasicInformation = 0,
  TransactionManagerLogInformation = 1,
  TransactionManagerLogPathInformation = 2,
  TransactionManagerRecoveryInformation = 4,
  TransactionManagerOnlineProbeInformation = 3,
  TransactionManagerOldestTransactionInformation = 5,
} TRANSACTIONMANAGER_INFORMATION_CLASS, *PTRANSACTIONMANAGER_INFORMATION_CLASS;

typedef struct _JOBOBJECT_ASSOCIATE_COMPLETION_PORT
{
  /* 0x0000 */ void* CompletionKey;
  /* 0x0008 */ void* CompletionPort;
} JOBOBJECT_ASSOCIATE_COMPLETION_PORT, *PJOBOBJECT_ASSOCIATE_COMPLETION_PORT; /* size: 0x0010 */

struct tagEMRPOLYLINE
{
  /* 0x0000 */ struct tagEMR emr;
  /* 0x0008 */ struct _RECTL rclBounds;
  /* 0x0018 */ unsigned long cptl;
  /* 0x001c */ struct _POINTL aptl[1];
}; /* size: 0x0024 */

struct tagMONITORINFOEXW
{
  /* 0x0000 */ long Padding_121[10];
  /* 0x0028 */ wchar_t szDevice[32];
}; /* size: 0x0068 */

typedef enum _STORAGE_IDENTIFIER_TYPE
{
  StorageIdTypeVendorSpecific = 0,
  StorageIdTypeVendorId = 1,
  StorageIdTypeEUI64 = 2,
  StorageIdTypeFCPHName = 3,
  StorageIdTypePortRelative = 4,
  StorageIdTypeTargetPortGroup = 5,
  StorageIdTypeLogicalUnitGroup = 6,
  StorageIdTypeMD5LogicalUnitIdentifier = 7,
  StorageIdTypeScsiNameString = 8,
} STORAGE_IDENTIFIER_TYPE, *PSTORAGE_IDENTIFIER_TYPE;

typedef struct _PROCESSOR_POWER_POLICY_INFO
{
  /* 0x0000 */ unsigned long TimeCheck;
  /* 0x0004 */ unsigned long DemoteLimit;
  /* 0x0008 */ unsigned long PromoteLimit;
  /* 0x000c */ unsigned char DemotePercent;
  /* 0x000d */ unsigned char PromotePercent;
  /* 0x000e */ unsigned char Spare[2];
  struct /* bitfield */
  {
    /* 0x0010 */ unsigned long AllowDemotion : 1; /* bit position: 0 */
    /* 0x0010 */ unsigned long AllowPromotion : 1; /* bit position: 1 */
    /* 0x0010 */ unsigned long Reserved : 30; /* bit position: 2 */
  }; /* bitfield */
} PROCESSOR_POWER_POLICY_INFO, *PPROCESSOR_POWER_POLICY_INFO; /* size: 0x0014 */

typedef enum _JOBOBJECT_RATE_CONTROL_TOLERANCE
{
  ToleranceLow = 1,
  ToleranceMedium = 2,
  ToleranceHigh = 3,
} JOBOBJECT_RATE_CONTROL_TOLERANCE, *PJOBOBJECT_RATE_CONTROL_TOLERANCE;

typedef enum _JOBOBJECT_RATE_CONTROL_TOLERANCE_INTERVAL
{
  ToleranceIntervalShort = 1,
  ToleranceIntervalMedium = 2,
  ToleranceIntervalLong = 3,
} JOBOBJECT_RATE_CONTROL_TOLERANCE_INTERVAL, *PJOBOBJECT_RATE_CONTROL_TOLERANCE_INTERVAL;

typedef struct _JOBOBJECT_NOTIFICATION_LIMIT_INFORMATION
{
  /* 0x0000 */ unsigned __int64 IoReadBytesLimit;
  /* 0x0008 */ unsigned __int64 IoWriteBytesLimit;
  /* 0x0010 */ union _LARGE_INTEGER PerJobUserTimeLimit;
  /* 0x0018 */ unsigned __int64 JobMemoryLimit;
  /* 0x0020 */ enum _JOBOBJECT_RATE_CONTROL_TOLERANCE RateControlTolerance;
  /* 0x0024 */ enum _JOBOBJECT_RATE_CONTROL_TOLERANCE_INTERVAL RateControlToleranceInterval;
  /* 0x0028 */ unsigned long LimitFlags;
  /* 0x002c */ long __PADDING__[1];
} JOBOBJECT_NOTIFICATION_LIMIT_INFORMATION, *PJOBOBJECT_NOTIFICATION_LIMIT_INFORMATION; /* size: 0x0030 */

typedef enum _TAG_UNNAMED_13
{
  LdrpNoDevice = 0,
  LdrpWebDAV = 1,
  LdrpRemote = 2,
  LdrpAnyDevice = -1,
  LdrpAnyDevice2bit = 3,
} TAG_UNNAMED_13, *PTAG_UNNAMED_13;

typedef struct _SCHANNEL_ALG
{
  /* 0x0000 */ unsigned long dwUse;
  /* 0x0004 */ unsigned int Algid;
  /* 0x0008 */ unsigned long cBits;
  /* 0x000c */ unsigned long dwFlags;
  /* 0x0010 */ unsigned long dwReserved;
} SCHANNEL_ALG, *PSCHANNEL_ALG; /* size: 0x0014 */

class Windows::AutoOperatorAmpersandConstHelper<_LUTF8_STRING,Windows::Auto<_LUTF8_STRING> >;

typedef enum _NT_PRODUCT_TYPE
{
  NtProductWinNt = 1,
  NtProductLanManNt = 2,
  NtProductServer = 3,
} NT_PRODUCT_TYPE, *PNT_PRODUCT_TYPE;

struct tagMCI_OVLY_WINDOW_PARMSA
{
  /* 0x0000 */ unsigned __int64 dwCallback;
  /* 0x0008 */ struct HWND__* hWnd;
  /* 0x0010 */ unsigned int nCmdShow;
  /* 0x0014 */ const char* lpstrText;
}; /* size: 0x001c */

enum EPrintXPSJobProgress
{
  kAddingDocumentSequence = 0,
  kDocumentSequenceAdded = 1,
  kAddingFixedDocument = 2,
  kFixedDocumentAdded = 3,
  kAddingFixedPage = 4,
  kFixedPageAdded = 5,
  kResourceAdded = 6,
  kFontAdded = 7,
  kImageAdded = 8,
  kXpsDocumentCommitted = 9,
};

struct AsyncIPipeByte
{
}; /* size: 0x0008 */

typedef enum _COPYFILE2_COPY_PHASE
{
  COPYFILE2_PHASE_NONE = 0,
  COPYFILE2_PHASE_PREPARE_SOURCE = 1,
  COPYFILE2_PHASE_PREPARE_DEST = 2,
  COPYFILE2_PHASE_READ_SOURCE = 3,
  COPYFILE2_PHASE_WRITE_DESTINATION = 4,
  COPYFILE2_PHASE_SERVER_COPY = 5,
  COPYFILE2_PHASE_NAMEGRAFT_COPY = 6,
  COPYFILE2_PHASE_MAX = 7,
} COPYFILE2_COPY_PHASE, *PCOPYFILE2_COPY_PHASE;

struct IPropertyPage2
{
}; /* size: 0x0008 */

struct IEnumSTATDATA
{
}; /* size: 0x0008 */

typedef enum __MIDL_IBindStatusCallback_0003
{
  BINDF_ASYNCHRONOUS = 1,
  BINDF_ASYNCSTORAGE = 2,
  BINDF_NOPROGRESSIVERENDERING = 4,
  BINDF_OFFLINEOPERATION = 8,
  BINDF_GETNEWESTVERSION = 16,
  BINDF_NOWRITECACHE = 32,
  BINDF_NEEDFILE = 64,
  BINDF_PULLDATA = 128,
  BINDF_IGNORESECURITYPROBLEM = 256,
  BINDF_RESYNCHRONIZE = 512,
  BINDF_HYPERLINK = 1024,
  BINDF_NO_UI = 2048,
  BINDF_SILENTOPERATION = 4096,
  BINDF_PRAGMA_NO_CACHE = 8192,
  BINDF_GETCLASSOBJECT = 16384,
  BINDF_RESERVED_1 = 0xffff8000,
  BINDF_FREE_THREADED = 0x10000,
  BINDF_DIRECT_READ = 0x20000,
  BINDF_FORMS_SUBMIT = 0x40000,
  BINDF_GETFROMCACHE_IF_NET_FAIL = 0x80000,
  BINDF_FROMURLMON = 0x100000,
  BINDF_FWD_BACK = 0x200000,
  BINDF_PREFERDEFAULTHANDLER = 0x400000,
  BINDF_ENFORCERESTRICTED = 0x800000,
  BINDF_RESERVED_2 = -2147483648,
  BINDF_RESERVED_3 = 0x1000000,
  BINDF_RESERVED_4 = 0x2000000,
  BINDF_RESERVED_5 = 0x4000000,
  BINDF_RESERVED_6 = 0x8000000,
  BINDF_RESERVED_7 = 0x40000000,
  BINDF_RESERVED_8 = 0x20000000,
} _MIDL_IBindStatusCallback_0003, *P_MIDL_IBindStatusCallback_0003;

typedef struct _TOKEN_DEVICE_CLAIMS
{
  /* 0x0000 */ void* DeviceClaims;
} TOKEN_DEVICE_CLAIMS, *PTOKEN_DEVICE_CLAIMS; /* size: 0x0008 */

typedef enum _MEDIA_TYPE
{
  Unknown = 0,
  F5_1Pt2_512 = 1,
  F3_1Pt44_512 = 2,
  F3_2Pt88_512 = 3,
  F3_20Pt8_512 = 4,
  F3_720_512 = 5,
  F5_360_512 = 6,
  F5_320_512 = 7,
  F5_320_1024 = 8,
  F5_180_512 = 9,
  F5_160_512 = 10,
  RemovableMedia = 11,
  FixedMedia = 12,
  F3_120M_512 = 13,
  F3_640_512 = 14,
  F5_640_512 = 15,
  F5_720_512 = 16,
  F3_1Pt2_512 = 17,
  F3_1Pt23_1024 = 18,
  F5_1Pt23_1024 = 19,
  F3_128Mb_512 = 20,
  F3_230Mb_512 = 21,
  F8_256_128 = 22,
  F3_200Mb_512 = 23,
  F3_240M_512 = 24,
  F3_32M_512 = 25,
} MEDIA_TYPE, *PMEDIA_TYPE;

typedef struct _CERT_POLICY_ID
{
  /* 0x0000 */ unsigned long cCertPolicyElementId;
  /* 0x0004 */ long Padding_122;
  /* 0x0008 */ char** rgpszCertPolicyElementId;
} CERT_POLICY_ID, *PCERT_POLICY_ID; /* size: 0x0010 */

struct IPropertyBag
{
}; /* size: 0x0008 */

typedef struct _TEB_ACTIVE_FRAME
{
  /* 0x0000 */ unsigned long Flags;
  /* 0x0004 */ long Padding_123;
  /* 0x0008 */ struct _TEB_ACTIVE_FRAME* Previous;
  /* 0x0010 */ const struct _TEB_ACTIVE_FRAME_CONTEXT* Context;
} TEB_ACTIVE_FRAME, *PTEB_ACTIVE_FRAME; /* size: 0x0018 */

typedef struct _TEB_ACTIVE_FRAME_EX
{
  /* 0x0000 */ struct _TEB_ACTIVE_FRAME BasicFrame;
  /* 0x0018 */ void* ExtensionIdentifier;
} TEB_ACTIVE_FRAME_EX, *PTEB_ACTIVE_FRAME_EX; /* size: 0x0020 */

typedef struct _CERT_CONTEXT
{
  /* 0x0000 */ unsigned long dwCertEncodingType;
  /* 0x0004 */ long Padding_124;
  /* 0x0008 */ unsigned char* pbCertEncoded;
  /* 0x0010 */ unsigned long cbCertEncoded;
  /* 0x0014 */ long Padding_125;
  /* 0x0018 */ struct _CERT_INFO* pCertInfo;
  /* 0x0020 */ void* hCertStore;
} CERT_CONTEXT, *PCERT_CONTEXT; /* size: 0x0028 */

typedef enum _RTL_GENERIC_COMPARE_RESULTS
{
  GenericLessThan = 0,
  GenericGreaterThan = 1,
  GenericEqual = 2,
} RTL_GENERIC_COMPARE_RESULTS, *PRTL_GENERIC_COMPARE_RESULTS;

struct tagMOUSEMOVEPOINT
{
  /* 0x0000 */ int x;
  /* 0x0004 */ int y;
  /* 0x0008 */ unsigned long time;
  /* 0x000c */ long Padding_126;
  /* 0x0010 */ unsigned __int64 dwExtraInfo;
}; /* size: 0x0018 */

enum tagCOWAIT_FLAGS
{
  COWAIT_DEFAULT = 0,
  COWAIT_WAITALL = 1,
  COWAIT_ALERTABLE = 2,
  COWAIT_INPUTAVAILABLE = 4,
  COWAIT_DISPATCH_CALLS = 8,
  COWAIT_DISPATCH_WINDOW_MESSAGES = 16,
};

typedef struct _CMSG_RECIPIENT_ENCODE_INFO
{
  /* 0x0000 */ unsigned long dwRecipientChoice;
  /* 0x0004 */ long Padding_127;
  union
  {
    /* 0x0008 */ struct _CMSG_KEY_TRANS_RECIPIENT_ENCODE_INFO* pKeyTrans;
    /* 0x0008 */ struct _CMSG_KEY_AGREE_RECIPIENT_ENCODE_INFO* pKeyAgree;
    /* 0x0008 */ struct _CMSG_MAIL_LIST_RECIPIENT_ENCODE_INFO* pMailList;
  }; /* size: 0x0008 */
} CMSG_RECIPIENT_ENCODE_INFO, *PCMSG_RECIPIENT_ENCODE_INFO; /* size: 0x0010 */

typedef struct _KEY_TRUST_INFORMATION
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned long TrustedKey : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned long Reserved : 31; /* bit position: 1 */
  }; /* bitfield */
} KEY_TRUST_INFORMATION, *PKEY_TRUST_INFORMATION; /* size: 0x0004 */

struct ICreateTypeInfo2
{
}; /* size: 0x0008 */

typedef enum _STORAGE_MEDIA_TYPE
{
  DDS_4mm = 32,
  MiniQic = 33,
  Travan = 34,
  QIC = 35,
  MP_8mm = 36,
  AME_8mm = 37,
  AIT1_8mm = 38,
  DLT = 39,
  NCTP = 40,
  IBM_3480 = 41,
  IBM_3490E = 42,
  IBM_Magstar_3590 = 43,
  IBM_Magstar_MP = 44,
  STK_DATA_D3 = 45,
  SONY_DTF = 46,
  DV_6mm = 47,
  DMI = 48,
  SONY_D2 = 49,
  CLEANER_CARTRIDGE = 50,
  CD_ROM = 51,
  CD_R = 52,
  CD_RW = 53,
  DVD_ROM = 54,
  DVD_R = 55,
  DVD_RW = 56,
  MO_3_RW = 57,
  MO_5_WO = 58,
  MO_5_RW = 59,
  MO_5_LIMDOW = 60,
  PC_5_WO = 61,
  PC_5_RW = 62,
  PD_5_RW = 63,
  ABL_5_WO = 64,
  PINNACLE_APEX_5_RW = 65,
  SONY_12_WO = 66,
  PHILIPS_12_WO = 67,
  HITACHI_12_WO = 68,
  CYGNET_12_WO = 69,
  KODAK_14_WO = 70,
  MO_NFR_525 = 71,
  NIKON_12_RW = 72,
  IOMEGA_ZIP = 73,
  IOMEGA_JAZ = 74,
  SYQUEST_EZ135 = 75,
  SYQUEST_EZFLYER = 76,
  SYQUEST_SYJET = 77,
  AVATAR_F2 = 78,
  MP2_8mm = 79,
  DST_S = 80,
  DST_M = 81,
  DST_L = 82,
  VXATape_1 = 83,
  VXATape_2 = 84,
  STK_9840 = 85,
  LTO_Ultrium = 86,
  LTO_Accelis = 87,
  DVD_RAM = 88,
  AIT_8mm = 89,
  ADR_1 = 90,
  ADR_2 = 91,
  STK_9940 = 92,
  SAIT = 93,
  VXATape = 94,
} STORAGE_MEDIA_TYPE, *PSTORAGE_MEDIA_TYPE;

typedef struct _FILE_PIPE_WAIT_FOR_BUFFER
{
  /* 0x0000 */ union _LARGE_INTEGER Timeout;
  /* 0x0008 */ unsigned long NameLength;
  /* 0x000c */ unsigned char TimeoutSpecified;
  /* 0x000d */ char Padding_128;
  /* 0x000e */ wchar_t Name[1];
} FILE_PIPE_WAIT_FOR_BUFFER, *PFILE_PIPE_WAIT_FOR_BUFFER; /* size: 0x0010 */

typedef struct _RTL_PROCESS_BACKTRACE_INFORMATION
{
  /* 0x0000 */ char* SymbolicBackTrace;
  /* 0x0008 */ unsigned long TraceCount;
  /* 0x000c */ unsigned short Index;
  /* 0x000e */ unsigned short Depth;
  /* 0x0010 */ void* BackTrace[32];
} RTL_PROCESS_BACKTRACE_INFORMATION, *PRTL_PROCESS_BACKTRACE_INFORMATION; /* size: 0x0110 */

typedef struct _RTL_PROCESS_BACKTRACES
{
  /* 0x0000 */ unsigned __int64 CommittedMemory;
  /* 0x0008 */ unsigned __int64 ReservedMemory;
  /* 0x0010 */ unsigned long NumberOfBackTraceLookups;
  /* 0x0014 */ unsigned long NumberOfBackTraces;
  /* 0x0018 */ struct _RTL_PROCESS_BACKTRACE_INFORMATION BackTraces[1];
} RTL_PROCESS_BACKTRACES, *PRTL_PROCESS_BACKTRACES; /* size: 0x0128 */

struct tagMCI_WAVE_OPEN_PARMSA
{
  /* 0x0000 */ unsigned __int64 dwCallback;
  /* 0x0008 */ unsigned int wDeviceID;
  /* 0x000c */ const char* lpstrDeviceType;
  /* 0x0014 */ const char* lpstrElementName;
  /* 0x001c */ const char* lpstrAlias;
  /* 0x0024 */ unsigned long dwBufferSeconds;
}; /* size: 0x0028 */

typedef enum _AUDIT_EVENT_TYPE
{
  AuditEventObjectAccess = 0,
  AuditEventDirectoryServiceAccess = 1,
} AUDIT_EVENT_TYPE, *PAUDIT_EVENT_TYPE;

typedef struct _SHQUERYRBINFO
{
  /* 0x0000 */ unsigned long cbSize;
  /* 0x0004 */ long Padding_129;
  /* 0x0008 */ __int64 i64Size;
  /* 0x0010 */ __int64 i64NumItems;
} SHQUERYRBINFO, *PSHQUERYRBINFO; /* size: 0x0018 */

struct IDropSource
{
}; /* size: 0x0008 */

struct Windows::ErrorHandling::StatusTypeHRESULT
{
}; /* size: 0x0001 */

enum tagDOMNodeType
{
  NODE_INVALID = 0,
  NODE_ELEMENT = 1,
  NODE_ATTRIBUTE = 2,
  NODE_TEXT = 3,
  NODE_CDATA_SECTION = 4,
  NODE_ENTITY_REFERENCE = 5,
  NODE_ENTITY = 6,
  NODE_PROCESSING_INSTRUCTION = 7,
  NODE_COMMENT = 8,
  NODE_DOCUMENT = 9,
  NODE_DOCUMENT_TYPE = 10,
  NODE_DOCUMENT_FRAGMENT = 11,
  NODE_NOTATION = 12,
};

enum EPrintXPSJobOperation
{
  kJobProduction = 1,
  kJobConsumption = 2,
};

struct tagKBDLLHOOKSTRUCT
{
  /* 0x0000 */ unsigned long vkCode;
  /* 0x0004 */ unsigned long scanCode;
  /* 0x0008 */ unsigned long flags;
  /* 0x000c */ unsigned long time;
  /* 0x0010 */ unsigned __int64 dwExtraInfo;
}; /* size: 0x0018 */

typedef enum _FUNCTION_TABLE_TYPE
{
  RF_SORTED = 0,
  RF_UNSORTED = 1,
  RF_CALLBACK = 2,
  RF_KERNEL_DYNAMIC = 3,
} FUNCTION_TABLE_TYPE, *PFUNCTION_TABLE_TYPE;

typedef struct _DYNAMIC_FUNCTION_TABLE
{
  /* 0x0000 */ struct _LIST_ENTRY ListEntry;
  /* 0x0010 */ struct _IMAGE_RUNTIME_FUNCTION_ENTRY* FunctionTable;
  /* 0x0018 */ union _LARGE_INTEGER TimeStamp;
  /* 0x0020 */ unsigned __int64 MinimumAddress;
  /* 0x0028 */ unsigned __int64 MaximumAddress;
  /* 0x0030 */ unsigned __int64 BaseAddress;
  /* 0x0038 */ void* Callback /* function */;
  /* 0x0040 */ void* Context;
  /* 0x0048 */ wchar_t* OutOfProcessCallbackDll;
  /* 0x0050 */ enum _FUNCTION_TABLE_TYPE Type;
  /* 0x0054 */ unsigned long EntryCount;
} DYNAMIC_FUNCTION_TABLE, *PDYNAMIC_FUNCTION_TABLE; /* size: 0x0058 */

typedef struct _ACTIVATION_CONTEXT_BASIC_INFORMATION
{
  union
  {
    /* 0x0000 */ struct _ACTIVATION_CONTEXT* ActivationContext;
    /* 0x0000 */ void* hActCtx;
  }; /* size: 0x0008 */
  union
  {
    /* 0x0008 */ unsigned long Flags;
    /* 0x0008 */ unsigned long dwFlags;
  }; /* size: 0x0004 */
  /* 0x000c */ long __PADDING__[1];
} ACTIVATION_CONTEXT_BASIC_INFORMATION, *PACTIVATION_CONTEXT_BASIC_INFORMATION; /* size: 0x0010 */

typedef enum _TRANSACTION_INFORMATION_CLASS
{
  TransactionBasicInformation = 0,
  TransactionPropertiesInformation = 1,
  TransactionEnlistmentInformation = 2,
  TransactionSuperiorEnlistmentInformation = 3,
  TransactionBindInformation = 4,
  TransactionDTCPrivateInformation = 5,
} TRANSACTION_INFORMATION_CLASS, *PTRANSACTION_INFORMATION_CLASS;

typedef struct _QUERY_FILE_LAYOUT_OUTPUT
{
  /* 0x0000 */ unsigned long FileEntryCount;
  /* 0x0004 */ unsigned long FirstFileOffset;
  /* 0x0008 */ unsigned long Flags;
  /* 0x000c */ unsigned long Reserved;
} QUERY_FILE_LAYOUT_OUTPUT, *PQUERY_FILE_LAYOUT_OUTPUT; /* size: 0x0010 */

typedef struct _TRANSACTION_BIND_INFORMATION
{
  /* 0x0000 */ void* TmHandle;
} TRANSACTION_BIND_INFORMATION, *PTRANSACTION_BIND_INFORMATION; /* size: 0x0008 */

typedef enum _PLUGPLAY_EVENT_CATEGORY
{
  HardwareProfileChangeEvent = 0,
  TargetDeviceChangeEvent = 1,
  DeviceClassChangeEvent = 2,
  CustomDeviceEvent = 3,
  DeviceInstallEvent = 4,
  DeviceArrivalEvent = 5,
  VetoEvent = 6,
  BlockedDriverEvent = 7,
  InvalidIDEvent = 8,
  DevicePropertyChangeEvent = 9,
  DeviceInstanceRemovalEvent = 10,
  DeviceInstanceStartedEvent = 11,
  MaxPlugEventCategory = 12,
} PLUGPLAY_EVENT_CATEGORY, *PPLUGPLAY_EVENT_CATEGORY;

struct tagEMREXTESCAPE
{
  /* 0x0000 */ struct tagEMR emr;
  /* 0x0008 */ int iEscape;
  /* 0x000c */ int cbEscData;
  /* 0x0010 */ unsigned char EscData[1];
  /* 0x0011 */ char __PADDING__[3];
}; /* size: 0x0014 */

struct IThunkManager
{
}; /* size: 0x0008 */

typedef enum _PARTITION_STYLE
{
  PARTITION_STYLE_MBR = 0,
  PARTITION_STYLE_GPT = 1,
  PARTITION_STYLE_RAW = 2,
} PARTITION_STYLE, *PPARTITION_STYLE;

struct IClipboardBrokerInternal
{
}; /* size: 0x0008 */

typedef struct _API_SET_NAMESPACE_ENTRY
{
  /* 0x0000 */ unsigned long NameOffset;
  /* 0x0004 */ unsigned long NameLength;
  /* 0x0008 */ unsigned long DataOffset;
} API_SET_NAMESPACE_ENTRY, *PAPI_SET_NAMESPACE_ENTRY; /* size: 0x000c */

typedef struct _PRINTER_DEFAULTSA
{
  /* 0x0000 */ char* pDatatype;
  /* 0x0008 */ struct _devicemodeA* pDevMode;
  /* 0x0010 */ unsigned long DesiredAccess;
  /* 0x0014 */ long __PADDING__[1];
} PRINTER_DEFAULTSA, *PPRINTER_DEFAULTSA; /* size: 0x0018 */

enum tagCALLCONV
{
  CC_FASTCALL = 0,
  CC_CDECL = 1,
  CC_MSCPASCAL = 2,
  CC_PASCAL = 2,
  CC_MACPASCAL = 3,
  CC_STDCALL = 4,
  CC_FPFASTCALL = 5,
  CC_SYSCALL = 6,
  CC_MPWCDECL = 7,
  CC_MPWPASCAL = 8,
  CC_MAX = 9,
};

typedef struct _KEY_VALUE_FULL_INFORMATION
{
  /* 0x0000 */ unsigned long TitleIndex;
  /* 0x0004 */ unsigned long Type;
  /* 0x0008 */ unsigned long DataOffset;
  /* 0x000c */ unsigned long DataLength;
  /* 0x0010 */ unsigned long NameLength;
  /* 0x0014 */ wchar_t Name[1];
  /* 0x0016 */ char __PADDING__[2];
} KEY_VALUE_FULL_INFORMATION, *PKEY_VALUE_FULL_INFORMATION; /* size: 0x0018 */

typedef struct _LUTF8_STRING
{
  /* 0x0000 */ unsigned __int64 Length;
  /* 0x0008 */ unsigned __int64 MaximumLength;
  /* 0x0010 */ unsigned char* Buffer;
} LUTF8_STRING, *PLUTF8_STRING; /* size: 0x0018 */

class Windows::AutoPODBase<_LUTF8_STRING,Windows::Auto<_LUTF8_STRING> >
{
  /* 0x0000 */ struct _LUTF8_STRING m_Data;
}; /* size: 0x0018 */

enum tagSTATFLAG
{
  STATFLAG_DEFAULT = 0,
  STATFLAG_NONAME = 1,
  STATFLAG_NOOPEN = 2,
};

struct ClassMonikerData
{
  /* 0x0000 */ struct _GUID clsid;
  /* 0x0010 */ unsigned long cbExtra;
}; /* size: 0x0014 */

typedef enum _STORAGE_BUS_TYPE
{
  BusTypeUnknown = 0,
  BusTypeScsi = 1,
  BusTypeAtapi = 2,
  BusTypeAta = 3,
  BusType1394 = 4,
  BusTypeSsa = 5,
  BusTypeFibre = 6,
  BusTypeUsb = 7,
  BusTypeRAID = 8,
  BusTypeiScsi = 9,
  BusTypeSas = 10,
  BusTypeSata = 11,
  BusTypeSd = 12,
  BusTypeMmc = 13,
  BusTypeVirtual = 14,
  BusTypeFileBackedVirtual = 15,
  BusTypeSpaces = 16,
  BusTypeMax = 17,
  BusTypeMaxReserved = 127,
} STORAGE_BUS_TYPE, *PSTORAGE_BUS_TYPE;

struct tagMONERRSTRUCT
{
  /* 0x0000 */ unsigned int cb;
  /* 0x0004 */ unsigned int wLastError;
  /* 0x0008 */ unsigned long dwTime;
  /* 0x000c */ long Padding_130;
  /* 0x0010 */ void* hTask;
}; /* size: 0x0018 */

typedef struct _CERT_PRIVATE_KEY_VALIDITY
{
  /* 0x0000 */ struct _FILETIME NotBefore;
  /* 0x0008 */ struct _FILETIME NotAfter;
} CERT_PRIVATE_KEY_VALIDITY, *PCERT_PRIVATE_KEY_VALIDITY; /* size: 0x0010 */

typedef struct __midl_frag79_t
{
  /* 0x0000 */ struct _NDR64_PROC_FORMAT frag1;
  /* 0x0018 */ struct _NDR64_PARAM_FORMAT frag2;
  /* 0x0028 */ struct _NDR64_PARAM_FORMAT frag3;
  /* 0x0038 */ struct _NDR64_PARAM_FORMAT frag4;
} _midl_frag79_t, *P_midl_frag79_t; /* size: 0x0048 */

enum tagRpcCallType
{
  rctInvalid = 0,
  rctNormal = 1,
  rctTraining = 2,
  rctGuaranteed = 3,
};

struct IProvideMultipleClassInfo
{
}; /* size: 0x0008 */

typedef struct _cpinfo
{
  /* 0x0000 */ unsigned int MaxCharSize;
  /* 0x0004 */ unsigned char DefaultChar[2];
  /* 0x0006 */ unsigned char LeadByte[12];
  /* 0x0012 */ char __PADDING__[2];
} cpinfo, *Pcpinfo; /* size: 0x0014 */

struct tagSPSChain
{
  /* 0x0000 */ struct tagSPSChain* pNext;
  /* 0x0008 */ struct tagSPSChain* pPrev;
}; /* size: 0x0010 */

struct tagSPSCache
{
  /* 0x0000 */ struct tagSPSChain clientPSChain;
  /* 0x0010 */ struct tagSPSChain serverPSChain;
}; /* size: 0x0020 */

struct tagPageEntry
{
  /* 0x0000 */ struct tagPageEntry* pNext;
  /* 0x0008 */ unsigned long dwFlag;
  /* 0x000c */ long __PADDING__[1];
}; /* size: 0x0010 */

class CInternalPageAllocator
{
  /* 0x0000 */ long _cPages;
  /* 0x0004 */ long Padding_131;
  /* 0x0008 */ struct tagPageEntry** _pPageListStart;
  /* 0x0010 */ struct tagPageEntry** _pPageListEnd;
  /* 0x0018 */ unsigned long _dwFlags;
  /* 0x001c */ long Padding_132;
  /* 0x0020 */ struct tagPageEntry _ListHead;
  /* 0x0030 */ long _cEntries;
  /* 0x0034 */ long Padding_133;
  /* 0x0038 */ unsigned __int64 _cbPerEntry;
  /* 0x0040 */ unsigned short _cEntriesPerPage;
  /* 0x0042 */ char Padding_134[6];
  /* 0x0048 */ class COleStaticMutexSem* _pLock;
}; /* size: 0x0050 */

class CPageAllocator
{
  /* 0x0000 */ class CInternalPageAllocator _pgalloc;
  /* 0x0050 */ void* _hHeap;
  /* 0x0058 */ unsigned __int64 _cbPerEntry;
  /* 0x0060 */ long _lNumEntries;
}; /* size: 0x0068 */

class CPolicySet
{
  /* 0x0000 */ long Padding_135[2];
  /* 0x0008 */ struct SHashChain _chain;
  /* 0x0018 */ unsigned long _dwFlags;
  /* 0x001c */ unsigned long _cRefs;
  /* 0x0020 */ unsigned long _cPolicies;
  /* 0x0024 */ unsigned long _dwAptID;
  /* 0x0028 */ class CObjectContext* _pClientCtx;
  /* 0x0030 */ class CObjectContext* _pServerCtx;
  /* 0x0038 */ struct tagPolicyEntry* _pFirstEntry;
  /* 0x0040 */ struct tagPolicyEntry* _pLastEntry;
  /* 0x0048 */ struct tagSPSCache _PSCache;
  union
  {
    /* 0x0000 */ class CPageAllocator s_PSallocator;
    /* 0x0000 */ class CPageAllocator s_PEallocator;
    /* 0x0000 */ int s_fInitialized;
    /* 0x0000 */ unsigned long s_cObjects;
  }; /* size: 0x0068 */
}; /* size: 0x0068 */

typedef enum _IRQ_DEVICE_POLICY
{
  IrqPolicyMachineDefault = 0,
  IrqPolicyAllCloseProcessors = 1,
  IrqPolicyOneCloseProcessor = 2,
  IrqPolicyAllProcessorsInMachine = 3,
  IrqPolicySpecifiedProcessors = 4,
  IrqPolicySpreadMessagesAcrossAllProcessors = 5,
} IRQ_DEVICE_POLICY, *PIRQ_DEVICE_POLICY;

struct tagFONTDESC
{
  /* 0x0000 */ unsigned int cbSizeofstruct;
  /* 0x0004 */ long Padding_136;
  /* 0x0008 */ wchar_t* lpstrName;
  /* 0x0010 */ union tagCY cySize;
  /* 0x0018 */ short sWeight;
  /* 0x001a */ short sCharset;
  /* 0x001c */ int fItalic;
  /* 0x0020 */ int fUnderline;
  /* 0x0024 */ int fStrikethrough;
}; /* size: 0x0028 */

struct IComCatalogSettings
{
}; /* size: 0x0008 */

enum tagACTIVATION_FLAGS
{
  ACTVFLAGS_NONE = 0,
  ACTVFLAGS_DISABLE_AAA = 2,
  ACTVFLAGS_ACTIVATE_32_BIT_SERVER = 4,
  ACTVFLAGS_ACTIVATE_64_BIT_SERVER = 8,
  ACTVFLAGS_SERVERSIDE_ACTIVATION = 16,
  ACTVFLAGS_NO_FAILURE_LOG = 32,
  ACTVFLAGS_ENABLE_CLOAKING = 64,
  ACTVFLAGS_REG_CATALOG_ONLY = 256,
  ACTVFLAGS_SXS_CATALOG_ONLY = 512,
  ACTVFLAGS_WINRT_LOCAL_SERVER = 1024,
  ACTVFLAGS_WINRT_PER_USER_OK = 2048,
  ACTVFLAGS_ACTIVATE_PSCLSID_FROM_PACKAGE = 4096,
  ACTVFLAGS_APPCONTAINER = 8192,
  ACTVFLAGS_IS_SXS_CLASS = 16384,
  ACTVFLAGS_BACKGROUND_MIXED_ACTIVATION = 0xffff8000,
  ACTVFLAGS_BACKGROUND_PURE_ACTIVATION = 0x10000,
  ACTVFLAGS_BACKGROUND_SYSTEM_ACTIVATION = 0x20000,
  ACTVFLAGS_DESIGNMODE_ACTIVATION = 0x40000,
  ACTVFLAGS_ACTIVATE_AS_IU = 0x80000,
};

enum MAPPED_STREAM_OPTS
{
  MAPPED_STREAM_CREATE = 0,
  MAPPED_STREAM_QI = 1,
};

class CPropertySetStorage
{
  /* 0x0000 */ long Padding_137[2];
  /* 0x0008 */ struct IStorage* _pstg;
  /* 0x0010 */ struct IBlockingLock* _pBlockingLock;
  /* 0x0018 */ unsigned long _ulSig;
  /* 0x001c */ int _fContainingStgIsRefed : 1; /* bit position: 0 */
  /* 0x0020 */ enum MAPPED_STREAM_OPTS _MSOpts;
  /* 0x0024 */ long _cReferences;
}; /* size: 0x0028 */

typedef struct _FILE_SFIO_RESERVE_INFORMATION
{
  /* 0x0000 */ unsigned long RequestsPerPeriod;
  /* 0x0004 */ unsigned long Period;
  /* 0x0008 */ unsigned char RetryFailures;
  /* 0x0009 */ unsigned char Discardable;
  /* 0x000a */ char Padding_138[2];
  /* 0x000c */ unsigned long RequestSize;
  /* 0x0010 */ unsigned long NumOutstandingRequests;
} FILE_SFIO_RESERVE_INFORMATION, *PFILE_SFIO_RESERVE_INFORMATION; /* size: 0x0014 */

struct HCOLORSPACE__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

typedef enum _STORAGE_POWERUP_REASON_TYPE
{
  StoragePowerupUnknown = 0,
  StoragePowerupIO = 1,
  StoragePowerupDeviceAttention = 2,
} STORAGE_POWERUP_REASON_TYPE, *PSTORAGE_POWERUP_REASON_TYPE;

struct IOSTaskCompletion
{
}; /* size: 0x0008 */

typedef struct _DRIVE_LAYOUT_INFORMATION_MBR
{
  /* 0x0000 */ unsigned long Signature;
} DRIVE_LAYOUT_INFORMATION_MBR, *PDRIVE_LAYOUT_INFORMATION_MBR; /* size: 0x0004 */

typedef struct _OCSP_BASIC_REVOKED_INFO
{
  /* 0x0000 */ struct _FILETIME RevocationDate;
  /* 0x0008 */ unsigned long dwCrlReasonCode;
} OCSP_BASIC_REVOKED_INFO, *POCSP_BASIC_REVOKED_INFO; /* size: 0x000c */

typedef struct _DEVICE_DATA_SET_SCRUB_OUTPUT
{
  /* 0x0000 */ unsigned __int64 BytesProcessed;
  /* 0x0008 */ unsigned __int64 BytesRepaired;
  /* 0x0010 */ unsigned __int64 BytesFailed;
} DEVICE_DATA_SET_SCRUB_OUTPUT, *PDEVICE_DATA_SET_SCRUB_OUTPUT; /* size: 0x0018 */

struct tagBITMAP
{
  /* 0x0000 */ long bmType;
  /* 0x0004 */ long bmWidth;
  /* 0x0008 */ long bmHeight;
  /* 0x000c */ long bmWidthBytes;
