struct IAdviseSink2Vtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* OnDataChange /* function */;
  /* 0x0010 */ void* OnViewChange /* function */;
  /* 0x0014 */ void* OnRename /* function */;
  /* 0x0018 */ void* OnSave /* function */;
  /* 0x001c */ void* OnClose /* function */;
  /* 0x0020 */ void* OnLinkSrcChange /* function */;
}; /* size: 0x0024 */

