struct IOleCache2Vtbl
{
  /* 0x0000 */ void* QueryInterface /* function */;
  /* 0x0004 */ void* AddRef /* function */;
  /* 0x0008 */ void* Release /* function */;
  /* 0x000c */ void* Cache /* function */;
  /* 0x0010 */ void* Uncache /* function */;
  /* 0x0014 */ void* EnumCache /* function */;
  /* 0x0018 */ void* InitCache /* function */;
  /* 0x001c */ void* SetData /* function */;
  /* 0x0020 */ void* UpdateCache /* function */;
  /* 0x0024 */ void* DiscardCache /* function */;
}; /* size: 0x0028 */

