struct BINARY_DATA;
enum BINDING_ENABLED_OR_DISABLED;
enum BIND_SOURCE_STATE;
enum BUS_QUERY_ID_TYPE;
struct CO_ADDRESS_FAMILY;
struct CO_SAP;
enum CPU_VENDORS;
enum CallRunMode;
enum DEVICE_TEXT_TYPE;
enum DL_ADDRESS_TYPE;
enum DMA_COMPLETION_STATUS;
struct DOT11_ASSOCIATION_INFO_LIST;
struct DOT11_ASSOCIATION_PARAMS;
struct DOT11_AUTH_ALGORITHM_LIST;
struct DOT11_AUTH_CIPHER_PAIR;
struct DOT11_AUTH_CIPHER_PAIR_LIST;
struct DOT11_BSSID_LIST;
struct DOT11_BYTE_ARRAY;
struct DOT11_CIPHER_ALGORITHM_LIST;
struct DOT11_CIPHER_DEFAULT_KEY_VALUE;
struct DOT11_COUNTRY_OR_REGION_STRING_LIST;
struct DOT11_DATA_RATE_MAPPING_ENTRY;
struct DOT11_ERP_PHY_ATTRIBUTES;
struct DOT11_EXTSTA_ATTRIBUTES;
struct DOT11_EXTSTA_CAPABILITY;
struct DOT11_HRDSSS_PHY_ATTRIBUTES;
struct DOT11_IBSS_PARAMS;
struct DOT11_MAC_ADDRESS_LIST;
struct DOT11_MAC_FRAME_STATISTICS;
struct DOT11_OFDM_PHY_ATTRIBUTES;
struct DOT11_PHY_ATTRIBUTES;
struct DOT11_PHY_FRAME_STATISTICS;
struct DOT11_PHY_ID_LIST;
struct DOT11_PMKID_ENTRY;
struct DOT11_PMKID_LIST;
struct DOT11_PORT_STATE_NOTIFICATION;
struct DOT11_PRIVACY_EXEMPTION;
struct DOT11_PRIVACY_EXEMPTION_LIST;
struct DOT11_QOS_PARAMS;
struct DOT11_SSID_LIST;
struct DOT11_STATISTICS;
struct DOT11_VWIFI_ATTRIBUTES;
struct FILTERDBS;
enum INDICATE_OFFLOAD_EVENT;
enum JOB_OBJECT_IO_RATE_CONTROL_FLAGS;
enum JOB_OBJECT_NET_RATE_CONTROL_FLAGS;
struct KALLOCATION_TAG<1146307662,512>;
struct KALLOCATION_TAG<1147946562,1>;
struct KALLOCATION_TAG<1148473410,1>;

struct _VAR_STRING;
struct _VF_DISPATCH_TABLE_HEADER;
enum _VF_DISPATCH_TABLE_TYPE;
struct _VF_NDIS_DISPATCH_TABLE;
struct _VPB;
struct _VPCI_INVALIDATE_BLOCK_OUTPUT;
struct _WAIT_CONTEXT_BLOCK;
enum _WHEA_ERROR_PACKET_DATA_FORMAT;
union _WHEA_ERROR_PACKET_FLAGS;
struct _WHEA_ERROR_PACKET_V2;
struct _WHEA_ERROR_RECORD;
struct _WHEA_ERROR_RECORD_HEADER;
union _WHEA_ERROR_RECORD_HEADER_FLAGS;
union _WHEA_ERROR_RECORD_HEADER_VALIDBITS;
struct _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR;
union _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_FLAGS;
union _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_VALIDBITS;
enum _WHEA_ERROR_SEVERITY;
enum _WHEA_ERROR_SOURCE_TYPE;
enum _WHEA_ERROR_TYPE;
union _WHEA_PERSISTENCE_INFO;
union _WHEA_REVISION;
union _WHEA_TIMESTAMP;
struct _WNF_STATE_NAME;
struct _WORK_QUEUE_ITEM;
enum _WORK_QUEUE_TYPE;
enum _WWAN_ACTIVATION_COMMAND;
struct _WWAN_AUTH_AKAP_CHALLENGE;
struct _WWAN_AUTH_AKA_CHALLENGE;
struct _WWAN_AUTH_CHALLENGE;
enum _WWAN_AUTH_METHOD;
enum _WWAN_AUTH_PROTOCOL;
struct _WWAN_AUTH_SIM_CHALLENGE;
enum _WWAN_CELLULAR_CLASS;
enum _WWAN_COMPRESSION;
enum _WWAN_CONTEXT_TYPE;
struct _WWAN_DEVICE_CAPS;
enum _WWAN_DEVICE_TYPE;
struct _WWAN_DRIVER_CAPS;
enum _WWAN_EMERGENCY_MODE;
enum _WWAN_IP_TYPE;
struct _WWAN_LIST_HEADER;
enum _WWAN_PACKET_SERVICE_ACTION;
struct _WWAN_PIN_DESC;
enum _WWAN_PIN_FORMAT;
struct _WWAN_PIN_LIST;
enum _WWAN_PIN_MODE;
struct _WWAN_PROVIDER;
struct _WWAN_READY_INFO;
enum _WWAN_READY_STATE;
enum _WWAN_REGISTER_ACTION;
struct _WWAN_SERVICE_ACTIVATION;
struct _WWAN_SET_CONTEXT;
struct _WWAN_SET_CONTEXT_STATE;
struct _WWAN_SET_REGISTER_STATE;
struct _WWAN_SET_SIGNAL_INDICATION;
struct _WWAN_SET_SMS_CONFIGURATION;
enum _WWAN_SIM_CLASS;
enum _WWAN_SMS_CDMA_ENCODING;
enum _WWAN_SMS_CDMA_LANG;
struct _WWAN_SMS_FILTER;
enum _WWAN_SMS_FLAG;
enum _WWAN_SMS_FORMAT;
struct _WWAN_SMS_READ;
struct _WWAN_SMS_SEND;
struct _WWAN_SMS_SEND_CDMA;
struct _WWAN_SMS_SEND_PDU;
enum _WWAN_STRUCT_TYPE;
enum _WWAN_VOICE_CLASS;
struct _XSTATE_CONFIGURATION;
struct _XSTATE_FEATURE;
struct _X_FILTER;
union __m128;
union __m64;
struct __vc_attributes::aggregatableAttribute;
enum __vc_attributes::aggregatableAttribute::type_e;
struct __vc_attributes::event_receiverAttribute;
enum __vc_attributes::event_receiverAttribute::type_e;
struct __vc_attributes::event_sourceAttribute;
enum __vc_attributes::event_sourceAttribute::optimize_e;
enum __vc_attributes::event_sourceAttribute::type_e;
struct __vc_attributes::helper_attributes::usageAttribute;
enum __vc_attributes::helper_attributes::usageAttribute::usage_e;
struct __vc_attributes::helper_attributes::v1_alttypeAttribute;
enum __vc_attributes::helper_attributes::v1_alttypeAttribute::type_e;
struct __vc_attributes::moduleAttribute;
enum __vc_attributes::moduleAttribute::type_e;
struct __vc_attributes::threadingAttribute;
enum __vc_attributes::threadingAttribute::threading_e;
struct _flowspec;
struct close_registry_handle;
struct in6_addr;
struct in_addr;
struct sockaddr;
struct sockaddr_in;
struct sockaddr_in6;

struct BINARY_DATA
{
  /* 0x0000 */ unsigned short Length;
  /* 0x0004 */ void* Buffer;
}; /* size: 0x0008 */

enum BINDING_ENABLED_OR_DISABLED
{
  BindingEnabled = 0,
  BindingDisabled = 1,
};

enum BIND_SOURCE_STATE
{
  AddBindSource = 0,
  RemoveBindSource = 1,
};

enum BUS_QUERY_ID_TYPE
{
  BusQueryDeviceID = 0,
  BusQueryHardwareIDs = 1,
  BusQueryCompatibleIDs = 2,
  BusQueryInstanceID = 3,
  BusQueryDeviceSerialNumber = 4,
  BusQueryContainerID = 5,
};

struct CO_ADDRESS_FAMILY
{
  /* 0x0000 */ unsigned long AddressFamily;
  /* 0x0004 */ unsigned long MajorVersion;
  /* 0x0008 */ unsigned long MinorVersion;
}; /* size: 0x000c */

struct CO_SAP
{
  /* 0x0000 */ unsigned long SapType;
  /* 0x0004 */ unsigned long SapLength;
  /* 0x0008 */ unsigned char Sap[1];
  /* 0x0009 */ char __PADDING__[3];
}; /* size: 0x000c */

enum CPU_VENDORS
{
  CPU_NONE = 0,
  CPU_INTEL = 1,
  CPU_AMD = 2,
  CPU_CYRIX = 3,
  CPU_TRANSMETA = 4,
  CPU_VIA = 5,
  CPU_CENTAUR = 5,
  CPU_RISE = 6,
  CPU_UNKNOWN = 7,
};

enum CallRunMode
{
  RunSynchronous = 0,
  RunAsynchronous = 1,
  RunAsynchronousButOkayToBlock = 2,
};

enum DEVICE_TEXT_TYPE
{
  DeviceTextDescription = 0,
  DeviceTextLocationInformation = 1,
};

enum DL_ADDRESS_TYPE
{
  DlUnicast = 0,
  DlMulticast = 1,
  DlBroadcast = 2,
};

enum DMA_COMPLETION_STATUS
{
  DmaComplete = 0,
  DmaAborted = 1,
  DmaError = 2,
  DmaCancelled = 3,
};

struct DOT11_ASSOCIATION_INFO_LIST
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long uNumOfEntries;
  /* 0x0008 */ unsigned long uTotalNumOfEntries;
  /* 0x0010 */ struct _DOT11_ASSOCIATION_INFO_EX dot11AssocInfo[1];
}; /* size: 0x0158 */

struct DOT11_ASSOCIATION_PARAMS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned char BSSID[6];
  /* 0x000c */ unsigned long uAssocRequestIEsOffset;
  /* 0x0010 */ unsigned long uAssocRequestIEsLength;
}; /* size: 0x0014 */

struct DOT11_AUTH_ALGORITHM_LIST
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long uNumOfEntries;
  /* 0x0008 */ unsigned long uTotalNumOfEntries;
  /* 0x000c */ enum _DOT11_AUTH_ALGORITHM AlgorithmIds[1];
}; /* size: 0x0010 */

struct DOT11_AUTH_CIPHER_PAIR
{
  /* 0x0000 */ enum _DOT11_AUTH_ALGORITHM AuthAlgoId;
  /* 0x0004 */ enum _DOT11_CIPHER_ALGORITHM CipherAlgoId;
}; /* size: 0x0008 */

struct DOT11_AUTH_CIPHER_PAIR_LIST
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long uNumOfEntries;
  /* 0x0008 */ unsigned long uTotalNumOfEntries;
  /* 0x000c */ struct DOT11_AUTH_CIPHER_PAIR AuthCipherPairs[1];
}; /* size: 0x0014 */

struct DOT11_BSSID_LIST
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long uNumOfEntries;
  /* 0x0008 */ unsigned long uTotalNumOfEntries;
  /* 0x000c */ unsigned char BSSIDs[6][1];
  /* 0x0012 */ char __PADDING__[2];
}; /* size: 0x0014 */

struct DOT11_BYTE_ARRAY
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long uNumOfBytes;
  /* 0x0008 */ unsigned long uTotalNumOfBytes;
  /* 0x000c */ unsigned char ucBuffer[1];
  /* 0x000d */ char __PADDING__[3];
}; /* size: 0x0010 */

struct DOT11_CIPHER_ALGORITHM_LIST
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long uNumOfEntries;
  /* 0x0008 */ unsigned long uTotalNumOfEntries;
  /* 0x000c */ enum _DOT11_CIPHER_ALGORITHM AlgorithmIds[1];
}; /* size: 0x0010 */

struct DOT11_CIPHER_DEFAULT_KEY_VALUE
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long uKeyIndex;
  /* 0x0008 */ enum _DOT11_CIPHER_ALGORITHM AlgorithmId;
  /* 0x000c */ unsigned char MacAddr[6];
  /* 0x0012 */ unsigned char bDelete;
  /* 0x0013 */ unsigned char bStatic;
  /* 0x0014 */ unsigned short usKeyLength;
  /* 0x0016 */ unsigned char ucKey[1];
  /* 0x0017 */ char __PADDING__[1];
}; /* size: 0x0018 */

struct DOT11_COUNTRY_OR_REGION_STRING_LIST
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long uNumOfEntries;
  /* 0x0008 */ unsigned long uTotalNumOfEntries;
  /* 0x000c */ unsigned char CountryOrRegionStrings[3][1];
  /* 0x000f */ char __PADDING__[1];
}; /* size: 0x0010 */

struct DOT11_DATA_RATE_MAPPING_ENTRY
{
  /* 0x0000 */ unsigned char ucDataRateIndex;
  /* 0x0001 */ unsigned char ucDataRateFlag;
  /* 0x0002 */ unsigned short usDataRateValue;
}; /* size: 0x0004 */

struct DOT11_ERP_PHY_ATTRIBUTES
{
  /* 0x0000 */ struct DOT11_HRDSSS_PHY_ATTRIBUTES HRDSSSAttributes;
  /* 0x0008 */ unsigned char bERPPBCCOptionImplemented;
  /* 0x0009 */ unsigned char bDSSSOFDMOptionImplemented;
  /* 0x000a */ unsigned char bShortSlotTimeOptionImplemented;
  /* 0x000b */ char __PADDING__[1];
}; /* size: 0x000c */

struct DOT11_EXTSTA_ATTRIBUTES
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long uScanSSIDListSize;
  /* 0x0008 */ unsigned long uDesiredBSSIDListSize;
  /* 0x000c */ unsigned long uDesiredSSIDListSize;
  /* 0x0010 */ unsigned long uExcludedMacAddressListSize;
  /* 0x0014 */ unsigned long uPrivacyExemptionListSize;
  /* 0x0018 */ unsigned long uKeyMappingTableSize;
  /* 0x001c */ unsigned long uDefaultKeyTableSize;
  /* 0x0020 */ unsigned long uWEPKeyValueMaxLength;
  /* 0x0024 */ unsigned long uPMKIDCacheSize;
  /* 0x0028 */ unsigned long uMaxNumPerSTADefaultKeyTables;
  /* 0x002c */ unsigned char bStrictlyOrderedServiceClassImplemented;
  /* 0x002d */ unsigned char ucSupportedQoSProtocolFlags;
  /* 0x002e */ unsigned char bSafeModeImplemented;
  /* 0x0030 */ unsigned long uNumSupportedCountryOrRegionStrings;
  /* 0x0034 */ unsigned char* pSupportedCountryOrRegionStrings[3];
  /* 0x0038 */ unsigned long uInfraNumSupportedUcastAlgoPairs;
  /* 0x003c */ struct DOT11_AUTH_CIPHER_PAIR* pInfraSupportedUcastAlgoPairs;
  /* 0x0040 */ unsigned long uInfraNumSupportedMcastAlgoPairs;
  /* 0x0044 */ struct DOT11_AUTH_CIPHER_PAIR* pInfraSupportedMcastAlgoPairs;
  /* 0x0048 */ unsigned long uAdhocNumSupportedUcastAlgoPairs;
  /* 0x004c */ struct DOT11_AUTH_CIPHER_PAIR* pAdhocSupportedUcastAlgoPairs;
  /* 0x0050 */ unsigned long uAdhocNumSupportedMcastAlgoPairs;
  /* 0x0054 */ struct DOT11_AUTH_CIPHER_PAIR* pAdhocSupportedMcastAlgoPairs;
  /* 0x0058 */ unsigned char bAutoPowerSaveMode;
  /* 0x005c */ unsigned long uMaxNetworkOffloadListSize;
  /* 0x0060 */ unsigned char bMFPCapable;
  /* 0x0064 */ unsigned long uInfraNumSupportedMcastMgmtAlgoPairs;
  /* 0x0068 */ struct DOT11_AUTH_CIPHER_PAIR* pInfraSupportedMcastMgmtAlgoPairs;
  /* 0x006c */ unsigned char bNeighborReportSupported;
  /* 0x006d */ unsigned char bAPChannelReportSupported;
  /* 0x006e */ unsigned char bActionFramesSupported;
  /* 0x006f */ unsigned char bANQPQueryOffloadSupported;
  /* 0x0070 */ unsigned char bHESSIDConnectionSupported;
  /* 0x0071 */ char __PADDING__[3];
}; /* size: 0x0074 */

struct DOT11_EXTSTA_CAPABILITY
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long uScanSSIDListSize;
  /* 0x0008 */ unsigned long uDesiredBSSIDListSize;
  /* 0x000c */ unsigned long uDesiredSSIDListSize;
  /* 0x0010 */ unsigned long uExcludedMacAddressListSize;
  /* 0x0014 */ unsigned long uPrivacyExemptionListSize;
  /* 0x0018 */ unsigned long uKeyMappingTableSize;
  /* 0x001c */ unsigned long uDefaultKeyTableSize;
  /* 0x0020 */ unsigned long uWEPKeyValueMaxLength;
  /* 0x0024 */ unsigned long uPMKIDCacheSize;
  /* 0x0028 */ unsigned long uMaxNumPerSTADefaultKeyTables;
}; /* size: 0x002c */

struct DOT11_HRDSSS_PHY_ATTRIBUTES
{
  /* 0x0000 */ unsigned char bShortPreambleOptionImplemented;
  /* 0x0001 */ unsigned char bPBCCOptionImplemented;
  /* 0x0002 */ unsigned char bChannelAgilityPresent;
  /* 0x0004 */ unsigned long uHRCCAModeSupported;
}; /* size: 0x0008 */

struct DOT11_IBSS_PARAMS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned char bJoinOnly;
  /* 0x0008 */ unsigned long uIEsOffset;
  /* 0x000c */ unsigned long uIEsLength;
}; /* size: 0x0010 */

struct DOT11_MAC_ADDRESS_LIST
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long uNumOfEntries;
  /* 0x0008 */ unsigned long uTotalNumOfEntries;
  /* 0x000c */ unsigned char MacAddrs[6][1];
  /* 0x0012 */ char __PADDING__[2];
}; /* size: 0x0014 */

struct DOT11_MAC_FRAME_STATISTICS
{
  /* 0x0000 */ unsigned __int64 ullTransmittedFrameCount;
  /* 0x0008 */ unsigned __int64 ullReceivedFrameCount;
  /* 0x0010 */ unsigned __int64 ullTransmittedFailureFrameCount;
  /* 0x0018 */ unsigned __int64 ullReceivedFailureFrameCount;
  /* 0x0020 */ unsigned __int64 ullWEPExcludedCount;
  /* 0x0028 */ unsigned __int64 ullTKIPLocalMICFailures;
  /* 0x0030 */ unsigned __int64 ullTKIPReplays;
  /* 0x0038 */ unsigned __int64 ullTKIPICVErrorCount;
  /* 0x0040 */ unsigned __int64 ullCCMPReplays;
  /* 0x0048 */ unsigned __int64 ullCCMPDecryptErrors;
  /* 0x0050 */ unsigned __int64 ullWEPUndecryptableCount;
  /* 0x0058 */ unsigned __int64 ullWEPICVErrorCount;
  /* 0x0060 */ unsigned __int64 ullDecryptSuccessCount;
  /* 0x0068 */ unsigned __int64 ullDecryptFailureCount;
}; /* size: 0x0070 */

struct DOT11_OFDM_PHY_ATTRIBUTES
{
  /* 0x0000 */ unsigned long uFrequencyBandsSupported;
}; /* size: 0x0004 */

struct DOT11_PHY_ATTRIBUTES
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ enum _DOT11_PHY_TYPE PhyType;
  /* 0x0008 */ unsigned char bHardwarePhyState;
  /* 0x0009 */ unsigned char bSoftwarePhyState;
  /* 0x000a */ unsigned char bCFPollable;
  /* 0x000c */ unsigned long uMPDUMaxLength;
  /* 0x0010 */ enum _DOT11_TEMP_TYPE TempType;
  /* 0x0014 */ enum _DOT11_DIVERSITY_SUPPORT DiversitySupport;
  union
  {
    union
    {
      /* 0x0018 */ struct DOT11_HRDSSS_PHY_ATTRIBUTES HRDSSSAttributes;
      /* 0x0018 */ struct DOT11_OFDM_PHY_ATTRIBUTES OFDMAttributes;
      /* 0x0018 */ struct DOT11_ERP_PHY_ATTRIBUTES ERPAttributes;
    }; /* size: 0x000c */
  } /* size: 0x000c */ PhySpecificAttributes;
  /* 0x0024 */ unsigned long uNumberSupportedPowerLevels;
  /* 0x0028 */ unsigned long TxPowerLevels[8];
  /* 0x0048 */ unsigned long uNumDataRateMappingEntries;
  /* 0x004c */ struct DOT11_DATA_RATE_MAPPING_ENTRY DataRateMappingEntries[126];
  /* 0x0244 */ struct _DOT11_SUPPORTED_DATA_RATES_VALUE_V2 SupportedDataRatesValue;
  /* 0x0442 */ char __PADDING__[2];
}; /* size: 0x0444 */

struct DOT11_PHY_FRAME_STATISTICS
{
  /* 0x0000 */ unsigned __int64 ullTransmittedFrameCount;
  /* 0x0008 */ unsigned __int64 ullMulticastTransmittedFrameCount;
  /* 0x0010 */ unsigned __int64 ullFailedCount;
  /* 0x0018 */ unsigned __int64 ullRetryCount;
  /* 0x0020 */ unsigned __int64 ullMultipleRetryCount;
  /* 0x0028 */ unsigned __int64 ullMaxTXLifetimeExceededCount;
  /* 0x0030 */ unsigned __int64 ullTransmittedFragmentCount;
  /* 0x0038 */ unsigned __int64 ullRTSSuccessCount;
  /* 0x0040 */ unsigned __int64 ullRTSFailureCount;
  /* 0x0048 */ unsigned __int64 ullACKFailureCount;
  /* 0x0050 */ unsigned __int64 ullReceivedFrameCount;
  /* 0x0058 */ unsigned __int64 ullMulticastReceivedFrameCount;
  /* 0x0060 */ unsigned __int64 ullPromiscuousReceivedFrameCount;
  /* 0x0068 */ unsigned __int64 ullMaxRXLifetimeExceededCount;
  /* 0x0070 */ unsigned __int64 ullFrameDuplicateCount;
  /* 0x0078 */ unsigned __int64 ullReceivedFragmentCount;
  /* 0x0080 */ unsigned __int64 ullPromiscuousReceivedFragmentCount;
  /* 0x0088 */ unsigned __int64 ullFCSErrorCount;
}; /* size: 0x0090 */

struct DOT11_PHY_ID_LIST
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long uNumOfEntries;
  /* 0x0008 */ unsigned long uTotalNumOfEntries;
  /* 0x000c */ unsigned long dot11PhyId[1];
}; /* size: 0x0010 */

struct DOT11_PMKID_ENTRY
{
  /* 0x0000 */ unsigned char BSSID[6];
  /* 0x0006 */ unsigned char PMKID[16];
  /* 0x0018 */ unsigned long uFlags;
}; /* size: 0x001c */

struct DOT11_PMKID_LIST
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long uNumOfEntries;
  /* 0x0008 */ unsigned long uTotalNumOfEntries;
  /* 0x000c */ struct DOT11_PMKID_ENTRY PMKIDs[1];
}; /* size: 0x0028 */

struct DOT11_PORT_STATE_NOTIFICATION
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned char PeerMac[6];
  /* 0x000a */ unsigned char bOpen;
  /* 0x000b */ char __PADDING__[1];
}; /* size: 0x000c */

struct DOT11_PRIVACY_EXEMPTION
{
  /* 0x0000 */ unsigned short usEtherType;
  /* 0x0002 */ unsigned short usExemptionActionType;
  /* 0x0004 */ unsigned short usExemptionPacketType;
}; /* size: 0x0006 */

struct DOT11_PRIVACY_EXEMPTION_LIST
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long uNumOfEntries;
  /* 0x0008 */ unsigned long uTotalNumOfEntries;
  /* 0x000c */ struct DOT11_PRIVACY_EXEMPTION PrivacyExemptionEntries[1];
  /* 0x0012 */ char __PADDING__[2];
}; /* size: 0x0014 */

struct DOT11_QOS_PARAMS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned char ucEnabledQoSProtocolFlags;
  /* 0x0005 */ char __PADDING__[1];
}; /* size: 0x0006 */

struct DOT11_SSID_LIST
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long uNumOfEntries;
  /* 0x0008 */ unsigned long uTotalNumOfEntries;
  /* 0x000c */ struct _DOT11_SSID SSIDs[1];
}; /* size: 0x0030 */

struct DOT11_STATISTICS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0008 */ unsigned __int64 ullFourWayHandshakeFailures;
  /* 0x0010 */ unsigned __int64 ullTKIPCounterMeasuresInvoked;
  /* 0x0018 */ unsigned __int64 ullReserved;
  /* 0x0020 */ struct DOT11_MAC_FRAME_STATISTICS MacUcastCounters;
  /* 0x0090 */ struct DOT11_MAC_FRAME_STATISTICS MacMcastCounters;
  /* 0x0100 */ struct DOT11_PHY_FRAME_STATISTICS PhyCounters[1];
}; /* size: 0x0190 */

struct DOT11_VWIFI_ATTRIBUTES
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long uTotalNumOfEntries;
  /* 0x0008 */ struct _DOT11_VWIFI_COMBINATION Combinations[1];
}; /* size: 0x0018 */

struct FILTERDBS
{
  union
  {
    /* 0x0000 */ struct _X_FILTER* EthDB;
    /* 0x0000 */ struct _X_FILTER* NullDB;
  }; /* size: 0x0004 */
  /* 0x0004 */ struct _X_FILTER* TrDB;
  /* 0x0008 */ void* YYYDB;
  /* 0x000c */ void* XXXDB;
}; /* size: 0x0010 */

enum INDICATE_OFFLOAD_EVENT
{
  NeighborReachabilityInDoubt = 1,
  NeighborReachabilityQuery = 2,
  MaxOffloadEvent = 3,
};

enum JOB_OBJECT_IO_RATE_CONTROL_FLAGS
{
  JOB_OBJECT_IO_RATE_CONTROL_ENABLE = 1,
  JOB_OBJECT_IO_RATE_CONTROL_VALID_FLAGS = 1,
};

enum JOB_OBJECT_NET_RATE_CONTROL_FLAGS
{
  JOB_OBJECT_NET_RATE_CONTROL_ENABLE = 1,
  JOB_OBJECT_NET_RATE_CONTROL_MAX_BANDWIDTH = 2,
  JOB_OBJECT_NET_RATE_CONTROL_DSCP_TAG = 4,
  JOB_OBJECT_NET_RATE_CONTROL_VALID_FLAGS = 7,
};

struct KALLOCATION_TAG<1146307662,512>
{
  union
  {
    /* 0x0000 */ const unsigned long AllocationTag;
    /* 0x0000 */ const unsigned long AllocationArena;
  }; /* size: 0x0004 */
  /* 0x0004 */ char __PADDING__[4294967293];
}; /* size: 0x0001 */

struct KALLOCATION_TAG<1147946562,1>
{
  union
  {
    /* 0x0000 */ const unsigned long AllocationTag;
    /* 0x0000 */ const unsigned long AllocationArena;
  }; /* size: 0x0004 */
  /* 0x0004 */ char __PADDING__[4294967293];
}; /* size: 0x0001 */

struct KALLOCATION_TAG<1148473410,1>
{
  union
  {
    /* 0x0000 */ const unsigned long AllocationTag;
    /* 0x0000 */ const unsigned long AllocationArena;
  }; /* size: 0x0004 */
  /* 0x0004 */ char __PADDING__[4294967293];
}; /* size: 0x0001 */

struct KALLOCATION_TAG<1282164290,1>
{
  union
  {
    /* 0x0000 */ const unsigned long AllocationTag;
    /* 0x0000 */ const unsigned long AllocationArena;
  }; /* size: 0x0004 */
  /* 0x0004 */ char __PADDING__[4294967293];
}; /* size: 0x0001 */

struct KALLOCATION_TAG<1282691138,1>
{
  union
  {
    /* 0x0000 */ const unsigned long AllocationTag;
    /* 0x0000 */ const unsigned long AllocationArena;
  }; /* size: 0x0004 */
  /* 0x0004 */ char __PADDING__[4294967293];
}; /* size: 0x0001 */

struct KALLOCATION_TAG<1396859982,1>
{
  union
  {
    /* 0x0000 */ const unsigned long AllocationTag;
    /* 0x0000 */ const unsigned long AllocationArena;
  }; /* size: 0x0004 */
  /* 0x0004 */ char __PADDING__[4294967293];
}; /* size: 0x0001 */

struct KALLOCATION_TAG<1920090443,1>
{
  union
  {
    /* 0x0000 */ const unsigned long AllocationTag;
    /* 0x0000 */ const unsigned long AllocationArena;
  }; /* size: 0x0004 */
  /* 0x0004 */ char __PADDING__[4294967293];
}; /* size: 0x0001 */

struct KALLOCATION_TAG<1920226123,512>
{
  union
  {
    /* 0x0000 */ const unsigned long AllocationTag;
    /* 0x0000 */ const unsigned long AllocationArena;
  }; /* size: 0x0004 */
  /* 0x0004 */ char __PADDING__[4294967293];
}; /* size: 0x0001 */

struct KALLOCATION_TAG<1935819854,1>
{
  union
  {
    /* 0x0000 */ const unsigned long AllocationTag;
    /* 0x0000 */ const unsigned long AllocationArena;
  }; /* size: 0x0004 */
  /* 0x0004 */ char __PADDING__[4294967293];
}; /* size: 0x0001 */

struct KALLOCATOR<1146307662,512>
{
}; /* size: 0x0001 */

struct KALLOCATOR<1147946562,1>
{
}; /* size: 0x0001 */

struct KALLOCATOR<1148473410,1>
{
}; /* size: 0x0001 */

struct KALLOCATOR<1282164290,1>
{
}; /* size: 0x0001 */

struct KALLOCATOR<1282691138,1>
{
}; /* size: 0x0001 */

struct KALLOCATOR<1396859982,1>
{
}; /* size: 0x0001 */

struct KALLOCATOR<1920090443,1>
{
}; /* size: 0x0001 */

struct KALLOCATOR<1920226123,512>
{
}; /* size: 0x0001 */

struct KALLOCATOR<1935819854,1>
{
}; /* size: 0x0001 */

class KCoalescingWorkItem<_NDIS_PROTOCOL_BLOCK>
{
  /* 0x0018 */ long m_queued;
}; /* size: 0x001c */

class KCriticalRegion
{
  /* 0x0000 */ BOOL m_Entered;
}; /* size: 0x0001 */

struct KDefaultRegion
{
}; /* size: 0x0001 */

struct KDeletePtr<NDIS_BIND_FILTER_LINK>
{
}; /* size: 0x0001 */

struct KDeletePtr<NDIS_BIND_PROTOCOL_LINK>
{
}; /* size: 0x0001 */

struct KDeletePtr<Rtl::KString>
{
}; /* size: 0x0001 */

struct KDeletePtr<_NDIS_MINIPORT_DRIVER_CHARACTERISTICS>
{
}; /* size: 0x0001 */

struct KIrqlRegion
{
  /* 0x0000 */ unsigned char m_OldIrql;
}; /* size: 0x0001 */

class KLockHolder
{
  /* 0x0000 */ enum _TAG_UNNAMED_1 m_State;
  /* 0x0004 */ class KPushLockBase& m_Lock;
  /* 0x0008 */ class KCriticalRegion m_Region;
}; /* size: 0x000c */

typedef enum
{
  Unlocked = 0,
  Shared = 1,
  Exclusive = 2,
} TAG_UNNAMED_1, *PTAG_UNNAMED_1;

class KLockThisExclusive
{
}; /* size: 0x000c */

class KLockThisShared
{
}; /* size: 0x000c */

class KPtr<NDIS_BIND_FILTER_LINK,KDeletePtr<NDIS_BIND_FILTER_LINK> >
{
  /* 0x0000 */ struct NDIS_BIND_FILTER_LINK* _p;
}; /* size: 0x0004 */

class KPtr<NDIS_BIND_PROTOCOL_LINK,KDeletePtr<NDIS_BIND_PROTOCOL_LINK> >
{
  /* 0x0000 */ struct NDIS_BIND_PROTOCOL_LINK* _p;
}; /* size: 0x0004 */

class KPtr<Rtl::KString,KDeletePtr<Rtl::KString> >
{
  /* 0x0000 */ struct Rtl::KString* _p;
}; /* size: 0x0004 */

class KPtr<_NDIS_MINIPORT_DRIVER_CHARACTERISTICS,KDeletePtr<_NDIS_MINIPORT_DRIVER_CHARACTERISTICS> >
{
  /* 0x0000 */ struct _NDIS_MINIPORT_DRIVER_CHARACTERISTICS* _p;
}; /* size: 0x0004 */

class KPtr<void *,close_registry_handle>
{
  /* 0x0000 */ void** _p;
}; /* size: 0x0004 */

class KPushLock
{
}; /* size: 0x0004 */

class KPushLockBase
{
  /* 0x0000 */ struct _EX_PUSH_LOCK m_Lock;
}; /* size: 0x0004 */

class KRef<NDIS_BIND_FILTER_DRIVER>
{
  /* 0x0000 */ class KRef<NDIS_BIND_FILTER_DRIVER>::KRefHolder* _p;
}; /* size: 0x0004 */

class KRef<NDIS_BIND_FILTER_DRIVER>::KRefHolder
{
  /* 0x0004 */ struct NDIS_BIND_FILTER_DRIVER _t;
  /* 0x0030 */ unsigned long RefCount;
}; /* size: 0x0034 */

class KRef<NDIS_BIND_PROTOCOL_DRIVER>
{
  /* 0x0000 */ class KRef<NDIS_BIND_PROTOCOL_DRIVER>::KRefHolder* _p;
}; /* size: 0x0004 */

class KRef<NDIS_BIND_PROTOCOL_DRIVER>::KRefHolder
{
  /* 0x0004 */ struct NDIS_BIND_PROTOCOL_DRIVER _t;
  /* 0x0020 */ unsigned long RefCount;
}; /* size: 0x0024 */

class KRegKey
{
}; /* size: 0x0004 */

enum KRegKey::BooleanDisposition
{
  FailIfNotFound = 0,
  DefaultToFalse = 1,
  DefaultToTrue = 2,
};

class KRundown
{
}; /* size: 0x0004 */

class KRundownBase
{
  /* 0x0000 */ struct _EX_RUNDOWN_REF m_rundown;
}; /* size: 0x0004 */

class KRundownHolder
{
  /* 0x0000 */ class KRundown& m_rundown;
  /* 0x0004 */ unsigned long m_count;
}; /* size: 0x0008 */

class KRundownManualConstruct
{
}; /* size: 0x0004 */

struct KSALLOCATOR_FRAMING
{
  union
  {
    /* 0x0000 */ unsigned long OptionsFlags;
    /* 0x0000 */ unsigned long RequirementsFlags;
  }; /* size: 0x0004 */
  /* 0x0004 */ enum _POOL_TYPE PoolType;
  /* 0x0008 */ unsigned long Frames;
  /* 0x000c */ unsigned long FrameSize;
  /* 0x0010 */ unsigned long FileAlignment;
  /* 0x0014 */ unsigned long Reserved;
}; /* size: 0x0018 */

struct KSALLOCATOR_FRAMING_EX
{
  /* 0x0000 */ unsigned long CountItems;
  /* 0x0004 */ unsigned long PinFlags;
  /* 0x0008 */ struct KS_COMPRESSION OutputCompression;
  /* 0x0014 */ unsigned long PinWeight;
  /* 0x0018 */ struct KS_FRAMING_ITEM FramingItem[1];
}; /* size: 0x0070 */

struct KSATTRIBUTE
{
  /* 0x0000 */ unsigned long Size;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ struct _GUID Attribute;
}; /* size: 0x0018 */

struct KSATTRIBUTE_LIST
{
  /* 0x0000 */ unsigned long Count;
  /* 0x0004 */ struct KSATTRIBUTE** Attributes;
}; /* size: 0x0008 */

struct KSAUTOMATION_TABLE_
{
  /* 0x0000 */ unsigned long PropertySetsCount;
  /* 0x0004 */ unsigned long PropertyItemSize;
  /* 0x0008 */ const struct KSPROPERTY_SET* PropertySets;
  /* 0x000c */ unsigned long MethodSetsCount;
  /* 0x0010 */ unsigned long MethodItemSize;
  /* 0x0014 */ const struct KSMETHOD_SET* MethodSets;
  /* 0x0018 */ unsigned long EventSetsCount;
  /* 0x001c */ unsigned long EventItemSize;
  /* 0x0020 */ const struct KSEVENT_SET* EventSets;
  /* 0x0024 */ void* Alignment;
}; /* size: 0x0028 */

struct KSBUFFER_ITEM
{
  /* 0x0000 */ struct KSDPC_ITEM DpcItem;
  /* 0x0028 */ struct _LIST_ENTRY BufferList;
}; /* size: 0x0030 */

struct KSCOMPONENTID
{
  /* 0x0000 */ struct _GUID Manufacturer;
  /* 0x0010 */ struct _GUID Product;
  /* 0x0020 */ struct _GUID Component;
  /* 0x0030 */ struct _GUID Name;
  /* 0x0040 */ unsigned long Version;
  /* 0x0044 */ unsigned long Revision;
}; /* size: 0x0048 */

union KSDATAFORMAT
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned long FormatSize;
      /* 0x0004 */ unsigned long Flags;
      /* 0x0008 */ unsigned long SampleSize;
      /* 0x000c */ unsigned long Reserved;
      /* 0x0010 */ struct _GUID MajorFormat;
      /* 0x0020 */ struct _GUID SubFormat;
      /* 0x0030 */ struct _GUID Specifier;
    }; /* size: 0x0040 */
    /* 0x0000 */ __int64 Alignment;
  }; /* size: 0x0040 */
}; /* size: 0x0040 */

struct KSDPC_ITEM
{
  /* 0x0000 */ struct _KDPC Dpc;
  /* 0x0020 */ unsigned long ReferenceCount;
  /* 0x0024 */ unsigned long AccessLock;
}; /* size: 0x0028 */

struct KSEVENTDATA
{
  /* 0x0000 */ unsigned long NotificationType;
  union
  {
    struct
    {
      /* 0x0004 */ void* Event;
      /* 0x0008 */ unsigned long Reserved[2];
    } /* size: 0x000c */ EventHandle;
    struct
    {
      /* 0x0004 */ void* Semaphore;
      /* 0x0008 */ unsigned long Reserved;
      /* 0x000c */ long Adjustment;
    } /* size: 0x000c */ SemaphoreHandle;
    struct
    {
      /* 0x0004 */ void* Event;
      /* 0x0008 */ long Increment;
      /* 0x000c */ unsigned long Reserved;
    } /* size: 0x000c */ EventObject;
    struct
    {
      /* 0x0004 */ void* Semaphore;
      /* 0x0008 */ long Increment;
      /* 0x000c */ long Adjustment;
    } /* size: 0x000c */ SemaphoreObject;
    struct
    {
      /* 0x0004 */ struct _KDPC* Dpc;
      /* 0x0008 */ unsigned long ReferenceCount;
      /* 0x000c */ unsigned long Reserved;
    } /* size: 0x000c */ Dpc;
    struct
    {
      /* 0x0004 */ struct _WORK_QUEUE_ITEM* WorkQueueItem;
      /* 0x0008 */ enum _WORK_QUEUE_TYPE WorkQueueType;
      /* 0x000c */ unsigned long Reserved;
    } /* size: 0x000c */ WorkItem;
    struct
    {
      /* 0x0004 */ struct _WORK_QUEUE_ITEM* WorkQueueItem;
      /* 0x0008 */ void* KsWorkerObject;
      /* 0x000c */ unsigned long Reserved;
    } /* size: 0x000c */ KsWorkItem;
    struct
    {
      /* 0x0004 */ void* Unused;
      /* 0x0008 */ long Alignment[2];
    } /* size: 0x000c */ Alignment;
  }; /* size: 0x000c */
}; /* size: 0x0010 */

struct KSEVENT_ITEM
{
  /* 0x0000 */ unsigned long EventId;
  /* 0x0004 */ unsigned long DataInput;
  /* 0x0008 */ unsigned long ExtraEntryData;
  /* 0x000c */ void* AddHandler /* function */;
  /* 0x0010 */ void* RemoveHandler /* function */;
  /* 0x0014 */ void* SupportHandler /* function */;
}; /* size: 0x0018 */

struct KSEVENT_SET
{
  /* 0x0000 */ const struct _GUID* Set;
  /* 0x0004 */ unsigned long EventsCount;
  /* 0x0008 */ const struct KSEVENT_ITEM* EventItem;
}; /* size: 0x000c */

struct KSFASTMETHOD_ITEM
{
  /* 0x0000 */ unsigned long MethodId;
  union
  {
    /* 0x0004 */ void* MethodHandler /* function */;
    struct
    {
      /* 0x0004 */ unsigned char MethodSupported;
      /* 0x0005 */ char __PADDING__[3];
    }; /* size: 0x0004 */
  }; /* size: 0x0004 */
}; /* size: 0x0008 */

struct KSFASTPROPERTY_ITEM
{
  /* 0x0000 */ unsigned long PropertyId;
  union
  {
    /* 0x0004 */ void* GetPropertyHandler /* function */;
    /* 0x0004 */ unsigned char GetSupported;
  }; /* size: 0x0004 */
  union
  {
    /* 0x0008 */ void* SetPropertyHandler /* function */;
    /* 0x0008 */ unsigned char SetSupported;
  }; /* size: 0x0004 */
  /* 0x000c */ unsigned long Reserved;
}; /* size: 0x0010 */

struct KSIDENTIFIER
{
  union
  {
    struct
    {
      /* 0x0000 */ struct _GUID Set;
      /* 0x0010 */ unsigned long Id;
      /* 0x0014 */ unsigned long Flags;
    }; /* size: 0x0018 */
    struct
    {
      /* 0x0000 */ __int64 Alignment;
      /* 0x0008 */ long __PADDING__[4];
    }; /* size: 0x0018 */
  }; /* size: 0x0018 */
}; /* size: 0x0018 */

struct KSMETHOD_ITEM
{
  /* 0x0000 */ unsigned long MethodId;
  union
  {
    /* 0x0004 */ void* MethodHandler /* function */;
    /* 0x0004 */ unsigned char MethodSupported;
  }; /* size: 0x0004 */
  /* 0x0008 */ unsigned long MinMethod;
  /* 0x000c */ unsigned long MinData;
  /* 0x0010 */ void* SupportHandler /* function */;
  /* 0x0014 */ unsigned long Flags;
}; /* size: 0x0018 */

struct KSMETHOD_SET
{
  /* 0x0000 */ const struct _GUID* Set;
  /* 0x0004 */ unsigned long MethodsCount;
  /* 0x0008 */ const struct KSMETHOD_ITEM* MethodItem;
  /* 0x000c */ unsigned long FastIoCount;
  /* 0x0010 */ const struct KSFASTMETHOD_ITEM* FastIoTable;
}; /* size: 0x0014 */

struct KSMULTIPLE_ITEM
{
  /* 0x0000 */ unsigned long Size;
  /* 0x0004 */ unsigned long Count;
}; /* size: 0x0008 */

enum KSPIN_COMMUNICATION
{
  KSPIN_COMMUNICATION_NONE = 0,
  KSPIN_COMMUNICATION_SINK = 1,
  KSPIN_COMMUNICATION_SOURCE = 2,
  KSPIN_COMMUNICATION_BOTH = 3,
  KSPIN_COMMUNICATION_BRIDGE = 4,
};

enum KSPIN_DATAFLOW
{
  KSPIN_DATAFLOW_IN = 1,
  KSPIN_DATAFLOW_OUT = 2,
};

struct KSPIN_DESCRIPTOR
{
  /* 0x0000 */ unsigned long InterfacesCount;
  /* 0x0004 */ const struct KSIDENTIFIER* Interfaces;
  /* 0x0008 */ unsigned long MediumsCount;
  /* 0x000c */ const struct KSIDENTIFIER* Mediums;
  /* 0x0010 */ unsigned long DataRangesCount;
  /* 0x0014 */ union KSDATAFORMAT* const* DataRanges;
  /* 0x0018 */ enum KSPIN_DATAFLOW DataFlow;
  /* 0x001c */ enum KSPIN_COMMUNICATION Communication;
  /* 0x0020 */ const struct _GUID* Category;
  /* 0x0024 */ const struct _GUID* Name;
  union
  {
    /* 0x0028 */ __int64 Reserved;
    struct
    {
      /* 0x0028 */ unsigned long ConstrainedDataRangesCount;
      /* 0x002c */ union KSDATAFORMAT** ConstrainedDataRanges;
    }; /* size: 0x0008 */
  }; /* size: 0x0008 */
}; /* size: 0x0030 */

struct KSPRIORITY
{
  /* 0x0000 */ unsigned long PriorityClass;
  /* 0x0004 */ unsigned long PrioritySubClass;
}; /* size: 0x0008 */

struct KSPROPERTY_ITEM
{
  /* 0x0000 */ unsigned long PropertyId;
  union
  {
    /* 0x0004 */ void* GetPropertyHandler /* function */;
    /* 0x0004 */ unsigned char GetSupported;
  }; /* size: 0x0004 */
  /* 0x0008 */ unsigned long MinProperty;
  /* 0x000c */ unsigned long MinData;
  union
  {
    /* 0x0010 */ void* SetPropertyHandler /* function */;
    /* 0x0010 */ unsigned char SetSupported;
  }; /* size: 0x0004 */
  /* 0x0014 */ const struct KSPROPERTY_VALUES* Values;
  /* 0x0018 */ unsigned long RelationsCount;
  /* 0x001c */ const struct KSIDENTIFIER* Relations;
  /* 0x0020 */ void* SupportHandler /* function */;
  /* 0x0024 */ unsigned long SerializedSize;
}; /* size: 0x0028 */

struct KSPROPERTY_MEMBERSHEADER
{
  /* 0x0000 */ unsigned long MembersFlags;
  /* 0x0004 */ unsigned long MembersSize;
  /* 0x0008 */ unsigned long MembersCount;
  /* 0x000c */ unsigned long Flags;
}; /* size: 0x0010 */

struct KSPROPERTY_MEMBERSLIST
{
  /* 0x0000 */ struct KSPROPERTY_MEMBERSHEADER MembersHeader;
  /* 0x0010 */ const void* Members;
}; /* size: 0x0014 */

struct KSPROPERTY_SET
{
  /* 0x0000 */ const struct _GUID* Set;
  /* 0x0004 */ unsigned long PropertiesCount;
  /* 0x0008 */ const struct KSPROPERTY_ITEM* PropertyItem;
  /* 0x000c */ unsigned long FastIoCount;
  /* 0x0010 */ const struct KSFASTPROPERTY_ITEM* FastIoTable;
}; /* size: 0x0014 */

struct KSPROPERTY_VALUES
{
  /* 0x0000 */ struct KSIDENTIFIER PropTypeSet;
  /* 0x0018 */ unsigned long MembersListCount;
  /* 0x001c */ const struct KSPROPERTY_MEMBERSLIST* MembersList;
}; /* size: 0x0020 */

struct KSP_PIN
{
  /* 0x0000 */ struct KSIDENTIFIER Property;
  /* 0x0018 */ unsigned long PinId;
  union
  {
    /* 0x001c */ unsigned long Reserved;
    /* 0x001c */ unsigned long Flags;
  }; /* size: 0x0004 */
}; /* size: 0x0020 */

enum KSRESET
{
  KSRESET_BEGIN = 0,
  KSRESET_END = 1,
};

struct KSRESOLUTION
{
  /* 0x0000 */ __int64 Granularity;
  /* 0x0008 */ __int64 Error;
}; /* size: 0x0010 */

enum KSSTATE
{
  KSSTATE_STOP = 0,
  KSSTATE_ACQUIRE = 1,
  KSSTATE_PAUSE = 2,
  KSSTATE_RUN = 3,
};

struct KSSTREAM_HEADER
{
  /* 0x0000 */ unsigned long Size;
  /* 0x0004 */ unsigned long TypeSpecificFlags;
  /* 0x0008 */ struct KSTIME PresentationTime;
  /* 0x0018 */ __int64 Duration;
  /* 0x0020 */ unsigned long FrameExtent;
  /* 0x0024 */ unsigned long DataUsed;
  /* 0x0028 */ void* Data;
  /* 0x002c */ unsigned long OptionsFlags;
}; /* size: 0x0030 */

struct KSTIME
{
  /* 0x0000 */ __int64 Time;
  /* 0x0008 */ unsigned long Numerator;
  /* 0x000c */ unsigned long Denominator;
}; /* size: 0x0010 */

struct KSTOPOLOGY_CONNECTION
{
  /* 0x0000 */ unsigned long FromNode;
  /* 0x0004 */ unsigned long FromNodePin;
  /* 0x0008 */ unsigned long ToNode;
  /* 0x000c */ unsigned long ToNodePin;
}; /* size: 0x0010 */

struct KS_COMPRESSION
{
  /* 0x0000 */ unsigned long RatioNumerator;
  /* 0x0004 */ unsigned long RatioDenominator;
  /* 0x0008 */ unsigned long RatioConstantMargin;
}; /* size: 0x000c */

struct KS_FRAMING_ITEM
{
  /* 0x0000 */ struct _GUID MemoryType;
  /* 0x0010 */ struct _GUID BusType;
  /* 0x0020 */ unsigned long MemoryFlags;
  /* 0x0024 */ unsigned long BusFlags;
  /* 0x0028 */ unsigned long Flags;
  /* 0x002c */ unsigned long Frames;
  /* 0x0030 */ unsigned long FileAlignment;
  /* 0x0034 */ unsigned long MemoryTypeWeight;
  /* 0x0038 */ struct KS_FRAMING_RANGE PhysicalRange;
  /* 0x0044 */ struct KS_FRAMING_RANGE_WEIGHTED FramingRange;
}; /* size: 0x0058 */

struct KS_FRAMING_RANGE
{
  /* 0x0000 */ unsigned long MinFrameSize;
  /* 0x0004 */ unsigned long MaxFrameSize;
  /* 0x0008 */ unsigned long Stepping;
}; /* size: 0x000c */

struct KS_FRAMING_RANGE_WEIGHTED
{
  /* 0x0000 */ struct KS_FRAMING_RANGE Range;
  /* 0x000c */ unsigned long InPlaceWeight;
  /* 0x0010 */ unsigned long NotInPlaceWeight;
}; /* size: 0x0014 */

class KWaitEvent
{
}; /* size: 0x0010 */

class KWaitEventBase
{
  /* 0x0000 */ struct _KEVENT m_event;
}; /* size: 0x0010 */

class KWaitEventManualConstruct
{
}; /* size: 0x0010 */

class KWorkItem<Ndis::BindEngine>
{
}; /* size: 0x0018 */

class KWorkItemBase<Ndis::BindEngine,KWorkItem<Ndis::BindEngine> >
{
  /* 0x0000 */ struct _WORK_QUEUE_ITEM m_workitem;
  /* 0x0010 */ struct Ndis::BindEngine* m_context;
  /* 0x0014 */ void* m_callback /* function */;
}; /* size: 0x0018 */

class KWorkItemBase<_NDIS_PROTOCOL_BLOCK,KCoalescingWorkItem<_NDIS_PROTOCOL_BLOCK> >
{
  /* 0x0000 */ struct _WORK_QUEUE_ITEM m_workitem;
  /* 0x0010 */ struct _NDIS_PROTOCOL_BLOCK* m_context;
  /* 0x0014 */ void* m_callback /* function */;
}; /* size: 0x0018 */

struct LIST_ENTRY32
{
  /* 0x0000 */ unsigned long Flink;
  /* 0x0004 */ unsigned long Blink;
}; /* size: 0x0008 */

struct LIST_ENTRY64
{
  /* 0x0000 */ unsigned __int64 Flink;
  /* 0x0008 */ unsigned __int64 Blink;
}; /* size: 0x0010 */

struct MSIX_TABLE_POINTER
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long BaseIndexRegister : 3; /* bit position: 0 */
      /* 0x0000 */ unsigned long Reserved : 29; /* bit position: 3 */
    }; /* bitfield */
    /* 0x0000 */ unsigned long TableOffset;
  }; /* size: 0x0004 */
}; /* size: 0x0004 */

struct NDIS_ADDDEVICE_PARAMETERS
{
  /* 0x0000 */ struct _GUID InterfaceGuid;
  /* 0x0010 */ union _NET_LUID_LH NetLuid;
  /* 0x0018 */ BOOL IsPhysicalMediumAvailable;
  /* 0x001c */ enum _NDIS_PHYSICAL_MEDIUM PhysicalMedium;
  /* 0x0020 */ class KPtr<Rtl::KString,KDeletePtr<Rtl::KString> > ComponentId;
  /* 0x0024 */ class KPtr<Rtl::KString,KDeletePtr<Rtl::KString> > ExportName;
  /* 0x0028 */ class KPtr<Rtl::KString,KDeletePtr<Rtl::KString> > LegacyImFilterClass;
  /* 0x002c */ BOOL IsImMiniport;
  /* 0x0030 */ unsigned long Characteristics;
  /* 0x0034 */ void* MiniportAdapterContext;
}; /* size: 0x0038 */

struct NDIS_BIND_DRIVER_BASE
{
  /* 0x0000 */ BOOL DriverReady;
  /* 0x0001 */ BOOL NeedsBindCompleteEvent;
  /* 0x0004 */ struct _LIST_ENTRY BindLinks;
}; /* size: 0x000c */

struct NDIS_BIND_FILTER_DRIVER
{
  /* 0x0010 */ struct _GUID Guid;
  /* 0x0020 */ unsigned long FilterBindFlags;
  /* 0x0024 */ class KPtr<Rtl::KString,KDeletePtr<Rtl::KString> > FilterClass;
  /* 0x0028 */ struct _NDIS_FILTER_DRIVER_BLOCK* RunningDriver;
}; /* size: 0x002c */

struct NDIS_BIND_FILTER_LINK
{
  /* 0x0040 */ class KRef<NDIS_BIND_FILTER_DRIVER> BindDriver;
  /* 0x0044 */ unsigned long FilterIndex;
}; /* size: 0x0048 */

struct NDIS_BIND_LINK_BASE
{
  /* 0x0000 */ class Ndis::BindState BindState;
  /* 0x0034 */ struct _LIST_ENTRY DriverLinkage;
}; /* size: 0x003c */

struct NDIS_BIND_PROTOCOL_DRIVER
{
  /* 0x0010 */ class KPtr<Rtl::KString,KDeletePtr<Rtl::KString> > Name;
  /* 0x0014 */ unsigned long ProtocolBindFlags;
  /* 0x0018 */ struct _NDIS_PROTOCOL_BLOCK* RunningDriver;
}; /* size: 0x001c */

struct NDIS_BIND_PROTOCOL_LINK
{
  /* 0x0040 */ class KRef<NDIS_BIND_PROTOCOL_DRIVER> BindDriver;
}; /* size: 0x0044 */

enum NDIS_CHIMNEY_OFFLOAD_TYPE
{
  NdisTcpChimneyOffload = 1,
  NdisIpsecChimneyOffload = 2,
  NdisRdmaChimneyOffload = 3,
  NdisMaxChimneyOffload = 4,
};

enum NDIS_DO_NOT_BIND_REASON
{
  Reason_NoBindSourceWantsThisBinding = 1,
  Reason_DriverNotReady = 2,
  Reason_LastBindAttemptFailed = 4,
  Reason_LastRestartAttemptFailed = 8,
  Reason_DriverRejectedBinding = 16,
  Reason_MissingMandatoryFilter = 32,
  Reason_MissingOptionalFilter = 64,
  Reason_MissingModifyingFilter = 128,
  Reason_MandatoryMissingDuringBoot = 256,
  Reason_UnbindOnAttach = 512,
  Reason_UnbindOnDetach = 1024,
  Reason_MiniportLowPower = 2048,
  Reason_RemovingMiniport = 4096,
  Reason_RebindNeeded = 8192,
  Reason_DefaultPortNotActive = 0xffff8000,
  Reason_SecondaryMiniport = 0x10000,
  Reason_MiniportNotReady = 0x20000,
  Reason_DisabledByLegacyIoctl = 0x40000,
  Reason_MiniportDeviceNotStarted = 0x80000,
  Reason_NetEventInhibitBindsAbove = 0x100000,
  Reason_ProtocolDependsOnVBus = 0x200000,
  Reason_IncompatibleWithNotification = 0x400000,
};

struct NDIS_EVENT_LOG_HANDLE__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct NDIS_MINIPORT_ADAPTER_HANDLE__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct NDIS_MINIPORT_HOOK_ADAPTER_HANDLE__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct NDIS_MINIPORT_HOOK_DRIVER_HANDLE__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

enum NDIS_MINIPORT_POLICY_OWNER
{
  MiniportNotOwned = 0,
  MiniportOwnedByPowerManagement = 1,
  MiniportOwnedByBindEngine = 2,
};

struct NDIS_NBL_TRACKER_HANDLE__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

enum NDIS_PAUSE_REASON
{
  PauseReason_InitialPause = 1,
  PauseReason_LowPower = 2,
  PauseReason_Pnp = 4,
  PauseReason_RemovingMiniport = 8,
  PauseReason_LowerDriverPaused = 16,
  PauseReason_RestartNeeded = 32,
  PauseReason_MandatoryMissingDuringBoot = 64,
  PauseReason_Wdf = 128,
  PauseReason_NetEventRequirePause = 256,
  PauseReason_InterfaceChangeInProgress = 512,
};

struct NDIS_PCW_CONTEXT
{
  /* 0x0000 */ struct _NDIS_PCW_DATA_BLOCK* PcwBlock;
  /* 0x0004 */ unsigned long DatapathEventsMask;
  /* 0x0008 */ unsigned long DatapathCyclesMask;
  /* 0x000c */ unsigned long CurrentCpu;
}; /* size: 0x0010 */

struct NDIS_REFCOUNT_HANDLE__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct NDIS_RESTART_INFORMATION
{
  union
  {
    /* 0x0000 */ struct _NDIS_RESTART_ATTRIBUTES Attributes;
    struct
    {
      /* 0x0000 */ unsigned char Padding[16];
      /* 0x0010 */ struct _NDIS_RESTART_GENERAL_ATTRIBUTES General;
      /* 0x0060 */ struct _NDIS_RECEIVE_SCALE_CAPABILITIES RssCaps;
      /* 0x0078 */ struct _NDIS_PROTOCOL_RESTART_PARAMETERS ProtocolParameters;
      /* 0x00a0 */ unsigned long MiniportMacOptionsToPreserve;
      /* 0x00a4 */ class Rtl::KArray<unsigned char> FilterInstanceBuffer;
      /* 0x00b4 */ long __PADDING__[1];
    }; /* size: 0x00b4 */
  }; /* size: 0x00b4 */
}; /* size: 0x00b8 */

struct NDIS_SETUP_DEVICE_EXTENSION
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ struct NDIS_SETUP_DEVICE_EXTENSION* Next;
  /* 0x0008 */ BOOL IsDeviceInterfaceActive;
  /* 0x0009 */ BOOL IsSurpriseRemoved;
  /* 0x000a */ BOOL LowPowerRequested;
  /* 0x000b */ BOOL LowPowerRequestCompleted;
  /* 0x000c */ BOOL LowPowerRequestSucceeded;
  /* 0x0010 */ struct _DEVICE_OBJECT* Fdo;
  /* 0x0014 */ struct _DEVICE_OBJECT* Pdo;
  /* 0x0018 */ struct _DEVICE_OBJECT* NextDeviceObject;
  /* 0x001c */ struct _UNICODE_STRING SymbolicName;
  /* 0x0028 */ struct _KTIMER IdleTimer;
  /* 0x0050 */ struct _KDPC IdleDpc;
  /* 0x0070 */ struct _IO_REMOVE_LOCK RemoveLock;
}; /* size: 0x0088 */

struct NDIS_SFA_CLIENT_CONTEXT__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct NDIS_SFA_HANDLE__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct NDIS_WDF_CX_DRIVER_CONTEXT__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

struct NDK_VERSION
{
  /* 0x0000 */ unsigned short Major;
  /* 0x0002 */ unsigned short Minor;
}; /* size: 0x0004 */

enum NL_ADDRESS_TYPE
{
  NlatUnspecified = 0,
  NlatUnicast = 1,
  NlatAnycast = 2,
  NlatMulticast = 3,
  NlatBroadcast = 4,
  NlatInvalid = 5,
};

struct NONPAGED_OBJECT<1920226123>
{
}; /* size: 0x0001 */

struct Ndis::BindEngine
{
  union
  {
    struct
    {
      /* 0x0000 */ struct _NDIS_MINIPORT_BLOCK* m_miniport;
      /* 0x0004 */ struct _KTHREAD* m_bindThread;
      /* 0x0008 */ struct NDIS_BIND_LINK_BASE* m_currentOperation;
      /* 0x000c */ class KPushLock m_lock;
      /* 0x0010 */ class KWaitEvent m_bindCompleteEvent;
      /* 0x0020 */ class KWorkItem<Ndis::BindEngine> m_asyncBindWorkItem;
      /* 0x0038 */ BOOL m_isDirty;
      /* 0x0039 */ BOOL m_isBeingDestroyed;
      /* 0x003c */ class KWaitEvent m_backgroundWorkFinishedEvent;
    }; /* size: 0x004a */
    struct
    {
      /* 0x0000 */ unsigned long s_NumBindOperationsInProgress;
      /* 0x0004 */ long __PADDING__[18];
    }; /* size: 0x004c */
  }; /* size: 0x004c */
}; /* size: 0x004c */

enum Ndis::BindSource::Flags
{
  Registry = 1,
  UserRequested = 2,
  UnsolicitedOpen = 4,
  TapiProxy = 8,
};

struct Ndis::BindStack
{
  /* 0x0004 */ class Rtl::KArray<KPtr<NDIS_BIND_PROTOCOL_LINK,KDeletePtr<NDIS_BIND_PROTOCOL_LINK> > > Protocols;
  /* 0x0014 */ class Rtl::KArray<KPtr<NDIS_BIND_FILTER_LINK,KDeletePtr<NDIS_BIND_FILTER_LINK> > > Filters;
  /* 0x0024 */ class Ndis::BindState Miniport;
  /* 0x0058 */ unsigned long ChangeEpoch;
}; /* size: 0x005c */

class Ndis::BindState
{
  /* 0x0004 */ struct _NDIS_MINIPORT_BLOCK* Miniport;
  /* 0x0008 */ BOOL AllowBindDespiteMandatory;
  /* 0x0009 */ BOOL PretendBindingActive;
  /* 0x000a */ BOOL NeedsPauseAction;
  /* 0x000c */ void* m_AdditionalContext;
  /* 0x0010 */ int m_LastErrorCode;
  /* 0x0014 */ unsigned long m_bindSources;
  /* 0x0018 */ unsigned long m_unbindReasons;
  /* 0x001c */ unsigned long m_pauseReasons;
  /* 0x0020 */ enum PAUSE_OR_RESTART m_actualPauseState;
  /* 0x0024 */ class Rtl::KArray<void *> m_bindContext;
}; /* size: 0x0034 */

enum Ndis::ReadBindingsOptions::Flags
{
  Default = 0,
  DoNotRemoveMissingBindings = 1,
};

enum NdisIfBlockSource
{
  NdisIfBlockSourcePublicApi = 0,
  NdisIfBlockSourcePersistedNsi = 1,
  NdisIfBlockSourcePersistedNetSetup = 2,
  NdisIfBlockSourceAutomaticLwFilter = 3,
  NdisIfBlockSourceAutomaticLoopback = 4,
  NdisIfBlockSourceBootNic = 5,
};

class NdisStopwatch
{
  /* 0x0000 */ union _LARGE_INTEGER QpcStartTime;
  /* 0x0008 */ union _LARGE_INTEGER QpFrequency;
  /* 0x0010 */ union _LARGE_INTEGER QpcLastStopTime;
}; /* size: 0x0018 */

enum NetDmaEventTypes
{
  NdisMIndicateRecvEvent = 0,
  NdisPIndicateRecvEvent = 1,
  NdisPIndicateRecvCompleteEvent = 2,
  NdisPReturnPacketsExEvent = 3,
  NdisMReturnPacketsExEvent = 4,
  NdisPReturnPacketEvent = 5,
  NdisMReturnPacketEvent = 6,
  NdisMReturnPacketInRecvEvent = 7,
  DmaCopyV2VEvent = 8,
  DmaChainV2VNoCopyEvent = 9,
  DmaChainV2VCopyEvent = 10,
  DmaCopyP2VEvent = 11,
  DmaChainP2VNoCopyEvent = 12,
  DmaChainP2VCopyEvent = 13,
  DmaCopyFlushEvent = 14,
  DmaCopyAppendEvent = 15,
  DmaChainCopyAppendEvent = 16,
  DmaCopyFlushAppendEvent = 17,
  DmaCopyCheckForCompletionEvent = 18,
  DmaCopyGetPhysicalAddressEvent = 19,
  DmaCopyNullXferEvent = 20,
  DmaCopyDummyEvent = 21,
  TotalEventTypes = 22,
};

enum OFFLOAD_STATE_TYPE
{
  NeighborOffloadConstState = 1,
  NeighborOffloadCachedState = 2,
  NeighborOffloadDelegatedState = 3,
  NeighborOffloadState = 4,
  Ip4OffloadConstState = 5,
  Ip4OffloadCachedState = 6,
  Ip4OffloadDelegatedState = 7,
  Ip4OffloadState = 8,
  Ip6OffloadConstState = 9,
  Ip6OffloadCachedState = 10,
  Ip6OffloadDelegatedState = 11,
  Ip6OffloadState = 12,
  TcpOffloadConstState = 13,
  TcpOffloadCachedState = 14,
  TcpOffloadDelegatedState = 15,
  TcpOffloadResourceState = 16,
  TcpOffloadState = 17,
  FilterReservedOffloadState = 254,
  MaximumOffloadState = 255,
};

struct PAGED_OBJECT<1147946562>
{
}; /* size: 0x0001 */

struct PAGED_OBJECT<1148473410>
{
}; /* size: 0x0001 */

struct PAGED_OBJECT<1282164290>
{
}; /* size: 0x0001 */

struct PAGED_OBJECT<1282691138>
{
}; /* size: 0x0001 */

struct PAGED_OBJECT<1396859982>
{
}; /* size: 0x0001 */

struct PAGED_OBJECT<1920090443>
{
}; /* size: 0x0001 */

struct PAGED_OBJECT<1935819854>
{
}; /* size: 0x0001 */

enum PAUSE_OR_RESTART
{
  DatapathPaused = 0,
  DatapathRunning = 1,
};

struct PCI_MSIX_CAPABILITY
{
  /* 0x0000 */ struct _PCI_CAPABILITIES_HEADER Header;
  struct
  {
    struct /* bitfield */
    {
      /* 0x0002 */ unsigned short TableSize : 11; /* bit position: 0 */
      /* 0x0002 */ unsigned short Reserved : 3; /* bit position: 11 */
      /* 0x0002 */ unsigned short FunctionMask : 1; /* bit position: 14 */
      /* 0x0002 */ unsigned short MSIXEnable : 1; /* bit position: 15 */
    }; /* bitfield */
  } /* size: 0x0002 */ MessageControl;
  /* 0x0004 */ struct MSIX_TABLE_POINTER MessageTable;
  /* 0x0008 */ struct MSIX_TABLE_POINTER PBATable;
}; /* size: 0x000c */

struct PCI_MSI_CAPABILITY
{
  /* 0x0000 */ struct _PCI_CAPABILITIES_HEADER Header;
  /* 0x0002 */ struct PCI_MSI_CAPABILITY::_PCI_MSI_MESSAGE_CONTROL MessageControl;
  union
  {
    union
    {
      struct
      {
        struct /* bitfield */
        {
          /* 0x0004 */ unsigned long Reserved : 2; /* bit position: 0 */
          /* 0x0004 */ unsigned long Address : 30; /* bit position: 2 */
        }; /* bitfield */
      } /* size: 0x0004 */ Register;
      /* 0x0004 */ unsigned long Raw;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ MessageAddressLower;
  union
  {
    struct
    {
      /* 0x0008 */ unsigned short MessageData;
      /* 0x000a */ unsigned short Reserved;
      /* 0x000c */ unsigned long MaskBits;
      /* 0x0010 */ unsigned long PendingBits;
    } /* size: 0x000c */ Option32Bit;
    struct
    {
      /* 0x0008 */ unsigned long MessageAddressUpper;
      /* 0x000c */ unsigned short MessageData;
      /* 0x000e */ unsigned short Reserved;
      /* 0x0010 */ unsigned long MaskBits;
      /* 0x0014 */ unsigned long PendingBits;
    } /* size: 0x0010 */ Option64Bit;
  }; /* size: 0x0010 */
}; /* size: 0x0018 */

struct PCI_MSI_CAPABILITY::_PCI_MSI_MESSAGE_CONTROL
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned short MSIEnable : 1; /* bit position: 0 */
    /* 0x0000 */ unsigned short MultipleMessageCapable : 3; /* bit position: 1 */
    /* 0x0000 */ unsigned short MultipleMessageEnable : 3; /* bit position: 4 */
    /* 0x0000 */ unsigned short CapableOf64Bits : 1; /* bit position: 7 */
    /* 0x0000 */ unsigned short PerVectorMaskCapable : 1; /* bit position: 8 */
    /* 0x0000 */ unsigned short Reserved : 7; /* bit position: 9 */
  }; /* bitfield */
}; /* size: 0x0002 */

struct PNDIS_PER_PROCESSOR_SLOT__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

enum POWER_ACTION
{
  PowerActionNone = 0,
  PowerActionReserved = 1,
  PowerActionSleep = 2,
  PowerActionHibernate = 3,
  PowerActionShutdown = 4,
  PowerActionShutdownReset = 5,
  PowerActionShutdownOff = 6,
  PowerActionWarmEject = 7,
  PowerActionDisplayOff = 8,
};

struct RECORDER_LOG__
{
  /* 0x0000 */ int unused;
}; /* size: 0x0004 */

enum ReplacesCorHdrNumericDefines
{
  COMIMAGE_FLAGS_ILONLY = 1,
  COMIMAGE_FLAGS_32BITREQUIRED = 2,
  COMIMAGE_FLAGS_IL_LIBRARY = 4,
  COMIMAGE_FLAGS_STRONGNAMESIGNED = 8,
  COMIMAGE_FLAGS_NATIVE_ENTRYPOINT = 16,
  COMIMAGE_FLAGS_TRACKDEBUGDATA = 0x10000,
  COMIMAGE_FLAGS_32BITPREFERRED = 0x20000,
  COR_VERSION_MAJOR_V2 = 2,
  COR_VERSION_MAJOR = 2,
  COR_VERSION_MINOR = 5,
  COR_DELETED_NAME_LENGTH = 8,
  COR_VTABLEGAP_NAME_LENGTH = 8,
  NATIVE_TYPE_MAX_CB = 1,
  COR_ILMETHOD_SECT_SMALL_MAX_DATASIZE = 255,
  IMAGE_COR_MIH_METHODRVA = 1,
  IMAGE_COR_MIH_EHRVA = 2,
  IMAGE_COR_MIH_BASICBLOCK = 8,
  COR_VTABLE_32BIT = 1,
  COR_VTABLE_64BIT = 2,
  COR_VTABLE_FROM_UNMANAGED = 4,
  COR_VTABLE_FROM_UNMANAGED_RETAIN_APPDOMAIN = 8,
  COR_VTABLE_CALL_MOST_DERIVED = 16,
  IMAGE_COR_EATJ_THUNK_SIZE = 32,
  MAX_CLASS_NAME = 1024,
  MAX_PACKAGE_NAME = 1024,
};

class Rtl::KArray<KPtr<NDIS_BIND_FILTER_LINK,KDeletePtr<NDIS_BIND_FILTER_LINK> > >
{
  /* 0x0004 */ unsigned long m_bufferSize;
  /* 0x0008 */ unsigned long m_numElements;
  /* 0x000c */ class KPtr<NDIS_BIND_FILTER_LINK,KDeletePtr<NDIS_BIND_FILTER_LINK> >* _p;
}; /* size: 0x0010 */

class Rtl::KArray<KPtr<NDIS_BIND_FILTER_LINK,KDeletePtr<NDIS_BIND_FILTER_LINK> > >::iterator;

class Rtl::KArray<KPtr<NDIS_BIND_PROTOCOL_LINK,KDeletePtr<NDIS_BIND_PROTOCOL_LINK> > >
{
  /* 0x0004 */ unsigned long m_bufferSize;
  /* 0x0008 */ unsigned long m_numElements;
  /* 0x000c */ class KPtr<NDIS_BIND_PROTOCOL_LINK,KDeletePtr<NDIS_BIND_PROTOCOL_LINK> >* _p;
}; /* size: 0x0010 */

class Rtl::KArray<KPtr<NDIS_BIND_PROTOCOL_LINK,KDeletePtr<NDIS_BIND_PROTOCOL_LINK> > >::iterator;

class Rtl::KArray<unsigned char>
{
  /* 0x0004 */ unsigned long m_bufferSize;
  /* 0x0008 */ unsigned long m_numElements;
  /* 0x000c */ unsigned char* _p;
}; /* size: 0x0010 */

class Rtl::KArray<unsigned char>::iterator;

class Rtl::KArray<void *>
{
  /* 0x0004 */ unsigned long m_bufferSize;
  /* 0x0008 */ unsigned long m_numElements;
  /* 0x000c */ void** _p;
}; /* size: 0x0010 */

class Rtl::KArray<void *>::iterator;

class Rtl::KNeutralLock<enum NDIS_MINIPORT_POLICY_OWNER>
{
  union
  {
    /* 0x0000 */ enum NDIS_MINIPORT_POLICY_OWNER UnownedValue;
    /* 0x0000 */ enum NDIS_MINIPORT_POLICY_OWNER m_owner;
  }; /* size: 0x0004 */
  /* 0x0004 */ class KPushLock m_lock;
  /* 0x0008 */ class KWaitEvent m_isUnowned;
}; /* size: 0x0018 */

struct Rtl::KString
{
}; /* size: 0x000c */

struct SCOPE_ID
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long Zone : 28; /* bit position: 0 */
      /* 0x0000 */ unsigned long Level : 4; /* bit position: 28 */
    }; /* bitfield */
    /* 0x0000 */ unsigned long Value;
  }; /* size: 0x0004 */
}; /* size: 0x0004 */

enum SCOPE_LEVEL
{
  ScopeLevelInterface = 1,
  ScopeLevelLink = 2,
  ScopeLevelSubnet = 3,
  ScopeLevelAdmin = 4,
  ScopeLevelSite = 5,
  ScopeLevelOrganization = 8,
  ScopeLevelGlobal = 14,
  ScopeLevelCount = 16,
};

enum SE_WS_APPX_SIGNATURE_ORIGIN
{
  SE_WS_APPX_SIGNATURE_ORIGIN_NOT_VALIDATED = 0,
  SE_WS_APPX_SIGNATURE_ORIGIN_UNKNOWN = 1,
  SE_WS_APPX_SIGNATURE_ORIGIN_APPSTORE = 2,
  SE_WS_APPX_SIGNATURE_ORIGIN_WINDOWS = 3,
  SE_WS_APPX_SIGNATURE_ORIGIN_ENTERPRISE = 4,
};

enum TCP_OFFLOAD_CONNECTION_STATE
{
  TcpConnectionClosed = 0,
  TcpConnectionListen = 1,
  TcpConnectionSynSent = 2,
  TcpConnectionSynRcvd = 3,
  TcpConnectionEstablished = 4,
  TcpConnectionFinWait1 = 5,
  TcpConnectionFinWait2 = 6,
  TcpConnectionCloseWait = 7,
  TcpConnectionClosing = 8,
  TcpConnectionLastAck = 9,
  TcpConnectionTimeWait = 10,
  TcpConnectionMaxState = 11,
};

enum TCP_OFFLOAD_EVENT_TYPE
{
  TcpIndicateSendBacklogChange = 1,
  TcpIndicateDisconnect = 2,
  TcpIndicateRetrieve = 3,
  TcpIndicateAbort = 4,
};

enum TCP_UPLOAD_REASON
{
  LowActivity = 1,
  HighDropRate = 2,
  SmallIO = 3,
  NoBufferPreposting = 4,
  NoBufferProposting = 4,
  ReceivedUrgentData = 5,
  HighFragmentation = 6,
  HighOutOfOrderPackets = 7,
  TimeoutExpiration = 8,
  InvalidState = 9,
  UploadRequested = 10,
  HardwareFailure = 11,
  MaxUploadReason = 12,
};

typedef struct _ACCESS_REASONS
{
  /* 0x0000 */ unsigned long Data[32];
} ACCESS_REASONS, *PACCESS_REASONS; /* size: 0x0080 */

typedef struct _ACCESS_STATE
{
  /* 0x0000 */ struct _LUID OperationID;
  /* 0x0008 */ unsigned char SecurityEvaluated;
  /* 0x0009 */ unsigned char GenerateAudit;
  /* 0x000a */ unsigned char GenerateOnClose;
  /* 0x000b */ unsigned char PrivilegesAllocated;
  /* 0x000c */ unsigned long Flags;
  /* 0x0010 */ unsigned long RemainingDesiredAccess;
  /* 0x0014 */ unsigned long PreviouslyGrantedAccess;
  /* 0x0018 */ unsigned long OriginalDesiredAccess;
  /* 0x001c */ struct _SECURITY_SUBJECT_CONTEXT SubjectSecurityContext;
  /* 0x002c */ void* SecurityDescriptor;
  /* 0x0030 */ void* AuxData;
  union
  {
    union
    {
      /* 0x0034 */ struct _INITIAL_PRIVILEGE_SET InitialPrivilegeSet;
      /* 0x0034 */ struct _PRIVILEGE_SET PrivilegeSet;
    }; /* size: 0x002c */
  } /* size: 0x002c */ Privileges;
  /* 0x0060 */ unsigned char AuditPrivileges;
  /* 0x0064 */ struct _UNICODE_STRING ObjectName;
  /* 0x006c */ struct _UNICODE_STRING ObjectTypeName;
} ACCESS_STATE, *PACCESS_STATE; /* size: 0x0074 */

struct _ACTIVATION_CONTEXT;

struct _ACTIVATION_CONTEXT_DATA;

typedef struct _ACTIVATION_CONTEXT_STACK
{
  /* 0x0000 */ struct _RTL_ACTIVATION_CONTEXT_STACK_FRAME* ActiveFrame;
  /* 0x0004 */ struct _LIST_ENTRY FrameListCache;
  /* 0x000c */ unsigned long Flags;
  /* 0x0010 */ unsigned long NextCookieSequenceNumber;
  /* 0x0014 */ unsigned long StackId;
} ACTIVATION_CONTEXT_STACK, *PACTIVATION_CONTEXT_STACK; /* size: 0x0018 */

typedef enum _ALTERNATIVE_ARCHITECTURE_TYPE
{
  StandardDesign = 0,
  NEC98x86 = 1,
  EndAlternatives = 2,
} ALTERNATIVE_ARCHITECTURE_TYPE, *PALTERNATIVE_ARCHITECTURE_TYPE;

struct _ASSEMBLY_STORAGE_MAP;

typedef struct _AUX_ACCESS_DATA
{
  /* 0x0000 */ struct _PRIVILEGE_SET* PrivilegesUsed;
  /* 0x0004 */ struct _GENERIC_MAPPING GenericMapping;
  /* 0x0014 */ unsigned long AccessesToAudit;
  /* 0x0018 */ unsigned long MaximumAuditMask;
  /* 0x001c */ struct _GUID TransactionId;
  /* 0x002c */ void* NewSecurityDescriptor;
  /* 0x0030 */ void* ExistingSecurityDescriptor;
  /* 0x0034 */ void* ParentSecurityDescriptor;
  /* 0x0038 */ void* DeRefSecurityDescriptor /* function */;
  /* 0x003c */ void* SDLock;
  /* 0x0040 */ struct _ACCESS_REASONS AccessReasons;
  /* 0x00c0 */ unsigned char GenerateStagingEvents;
  /* 0x00c1 */ char __PADDING__[3];
} AUX_ACCESS_DATA, *PAUX_ACCESS_DATA; /* size: 0x00c4 */

typedef struct _CLIENT_ID
{
  /* 0x0000 */ void* UniqueProcess;
  /* 0x0004 */ void* UniqueThread;
} CLIENT_ID, *PCLIENT_ID; /* size: 0x0008 */

typedef struct _CM_FULL_RESOURCE_DESCRIPTOR
{
  /* 0x0000 */ enum _INTERFACE_TYPE InterfaceType;
  /* 0x0004 */ unsigned long BusNumber;
  /* 0x0008 */ struct _CM_PARTIAL_RESOURCE_LIST PartialResourceList;
} CM_FULL_RESOURCE_DESCRIPTOR, *PCM_FULL_RESOURCE_DESCRIPTOR; /* size: 0x0020 */

typedef struct _CM_PARTIAL_RESOURCE_DESCRIPTOR
{
  /* 0x0000 */ unsigned char Type;
  /* 0x0001 */ unsigned char ShareDisposition;
  /* 0x0002 */ unsigned short Flags;
  union
  {
    union
    {
      struct
      {
        /* 0x0004 */ union _LARGE_INTEGER Start;
        /* 0x000c */ unsigned long Length;
      } /* size: 0x000c */ Generic;
      struct
      {
        /* 0x0004 */ union _LARGE_INTEGER Start;
        /* 0x000c */ unsigned long Length;
      } /* size: 0x000c */ Port;
      struct
      {
        /* 0x0004 */ unsigned short Level;
        /* 0x0006 */ unsigned short Group;
        /* 0x0008 */ unsigned long Vector;
        /* 0x000c */ unsigned long Affinity;
      } /* size: 0x000c */ Interrupt;
      struct
      {
        union
        {
          struct
          {
            /* 0x0004 */ unsigned short Group;
            /* 0x0006 */ unsigned short MessageCount;
            /* 0x0008 */ unsigned long Vector;
            /* 0x000c */ unsigned long Affinity;
          } /* size: 0x000c */ Raw;
          struct
          {
            /* 0x0004 */ unsigned short Level;
            /* 0x0006 */ unsigned short Group;
            /* 0x0008 */ unsigned long Vector;
            /* 0x000c */ unsigned long Affinity;
          } /* size: 0x000c */ Translated;
        }; /* size: 0x000c */
      } /* size: 0x000c */ MessageInterrupt;
      struct
      {
        /* 0x0004 */ union _LARGE_INTEGER Start;
        /* 0x000c */ unsigned long Length;
      } /* size: 0x000c */ Memory;
      struct
      {
        /* 0x0004 */ unsigned long Channel;
        /* 0x0008 */ unsigned long Port;
        /* 0x000c */ unsigned long Reserved1;
      } /* size: 0x000c */ Dma;
      struct
      {
        /* 0x0004 */ unsigned long Channel;
        /* 0x0008 */ unsigned long RequestLine;
        /* 0x000c */ unsigned char TransferWidth;
        /* 0x000d */ unsigned char Reserved1;
        /* 0x000e */ unsigned char Reserved2;
        /* 0x000f */ unsigned char Reserved3;
      } /* size: 0x000c */ DmaV3;
      struct
      {
        /* 0x0004 */ unsigned long Data[3];
      } /* size: 0x000c */ DevicePrivate;
      struct
      {
        /* 0x0004 */ unsigned long Start;
        /* 0x0008 */ unsigned long Length;
        /* 0x000c */ unsigned long Reserved;
      } /* size: 0x000c */ BusNumber;
      struct
      {
        /* 0x0004 */ unsigned long DataSize;
        /* 0x0008 */ unsigned long Reserved1;
        /* 0x000c */ unsigned long Reserved2;
      } /* size: 0x000c */ DeviceSpecificData;
      struct
      {
        /* 0x0004 */ union _LARGE_INTEGER Start;
        /* 0x000c */ unsigned long Length40;
      } /* size: 0x000c */ Memory40;
      struct
      {
        /* 0x0004 */ union _LARGE_INTEGER Start;
        /* 0x000c */ unsigned long Length48;
      } /* size: 0x000c */ Memory48;
      struct
      {
        /* 0x0004 */ union _LARGE_INTEGER Start;
        /* 0x000c */ unsigned long Length64;
      } /* size: 0x000c */ Memory64;
      struct
      {
        /* 0x0004 */ unsigned char Class;
        /* 0x0005 */ unsigned char Type;
        /* 0x0006 */ unsigned char Reserved1;
        /* 0x0007 */ unsigned char Reserved2;
        /* 0x0008 */ unsigned long IdLowPart;
        /* 0x000c */ unsigned long IdHighPart;
      } /* size: 0x000c */ Connection;
    }; /* size: 0x000c */
  } /* size: 0x000c */ u;
} CM_PARTIAL_RESOURCE_DESCRIPTOR, *PCM_PARTIAL_RESOURCE_DESCRIPTOR; /* size: 0x0010 */

typedef struct _CM_PARTIAL_RESOURCE_LIST
{
  /* 0x0000 */ unsigned short Version;
  /* 0x0002 */ unsigned short Revision;
  /* 0x0004 */ unsigned long Count;
  /* 0x0008 */ struct _CM_PARTIAL_RESOURCE_DESCRIPTOR PartialDescriptors[1];
} CM_PARTIAL_RESOURCE_LIST, *PCM_PARTIAL_RESOURCE_LIST; /* size: 0x0018 */

typedef struct _CM_RESOURCE_LIST
{
  /* 0x0000 */ unsigned long Count;
  /* 0x0004 */ struct _CM_FULL_RESOURCE_DESCRIPTOR List[1];
} CM_RESOURCE_LIST, *PCM_RESOURCE_LIST; /* size: 0x0024 */

typedef struct _COMPRESSED_DATA_INFO
{
  /* 0x0000 */ unsigned short CompressionFormatAndEngine;
  /* 0x0002 */ unsigned char CompressionUnitShift;
  /* 0x0003 */ unsigned char ChunkShift;
  /* 0x0004 */ unsigned char ClusterShift;
  /* 0x0005 */ unsigned char Reserved;
  /* 0x0006 */ unsigned short NumberOfChunks;
  /* 0x0008 */ unsigned long CompressedChunkSizes[1];
} COMPRESSED_DATA_INFO, *PCOMPRESSED_DATA_INFO; /* size: 0x000c */

typedef struct _CONTEXT
{
  /* 0x0000 */ unsigned long ContextFlags;
  /* 0x0004 */ unsigned long Dr0;
  /* 0x0008 */ unsigned long Dr1;
  /* 0x000c */ unsigned long Dr2;
  /* 0x0010 */ unsigned long Dr3;
  /* 0x0014 */ unsigned long Dr6;
  /* 0x0018 */ unsigned long Dr7;
  /* 0x001c */ struct _FLOATING_SAVE_AREA FloatSave;
  /* 0x008c */ unsigned long SegGs;
  /* 0x0090 */ unsigned long SegFs;
  /* 0x0094 */ unsigned long SegEs;
  /* 0x0098 */ unsigned long SegDs;
  /* 0x009c */ unsigned long Edi;
  /* 0x00a0 */ unsigned long Esi;
  /* 0x00a4 */ unsigned long Ebx;
  /* 0x00a8 */ unsigned long Edx;
  /* 0x00ac */ unsigned long Ecx;
  /* 0x00b0 */ unsigned long Eax;
  /* 0x00b4 */ unsigned long Ebp;
  /* 0x00b8 */ unsigned long Eip;
  /* 0x00bc */ unsigned long SegCs;
  /* 0x00c0 */ unsigned long EFlags;
  /* 0x00c4 */ unsigned long Esp;
  /* 0x00c8 */ unsigned long SegSs;
  /* 0x00cc */ unsigned char ExtendedRegisters[512];
} CONTEXT, *PCONTEXT; /* size: 0x02cc */

typedef struct _CO_ADDRESS
{
  /* 0x0000 */ unsigned long AddressSize;
  /* 0x0004 */ unsigned char Address[1];
  /* 0x0005 */ char __PADDING__[3];
} CO_ADDRESS, *PCO_ADDRESS; /* size: 0x0008 */

typedef struct _CO_ADDRESS_LIST
{
  /* 0x0000 */ unsigned long NumberOfAddressesAvailable;
  /* 0x0004 */ unsigned long NumberOfAddresses;
  /* 0x0008 */ struct _CO_ADDRESS AddressList;
} CO_ADDRESS_LIST, *PCO_ADDRESS_LIST; /* size: 0x0010 */

typedef struct _CO_CALL_MANAGER_PARAMETERS
{
  /* 0x0000 */ struct _flowspec Transmit;
  /* 0x0020 */ struct _flowspec Receive;
  /* 0x0040 */ struct _CO_SPECIFIC_PARAMETERS CallMgrSpecific;
} CO_CALL_MANAGER_PARAMETERS, *PCO_CALL_MANAGER_PARAMETERS; /* size: 0x004c */

typedef struct _CO_CALL_PARAMETERS
{
  /* 0x0000 */ unsigned long Flags;
  /* 0x0004 */ struct _CO_CALL_MANAGER_PARAMETERS* CallMgrParameters;
  /* 0x0008 */ struct _CO_MEDIA_PARAMETERS* MediaParameters;
} CO_CALL_PARAMETERS, *PCO_CALL_PARAMETERS; /* size: 0x000c */

typedef struct _CO_MEDIA_PARAMETERS
{
  /* 0x0000 */ unsigned long Flags;
  /* 0x0004 */ unsigned long ReceivePriority;
  /* 0x0008 */ unsigned long ReceiveSizeHint;
  /* 0x000c */ struct _CO_SPECIFIC_PARAMETERS MediaSpecific;
} CO_MEDIA_PARAMETERS, *PCO_MEDIA_PARAMETERS; /* size: 0x0018 */

typedef struct _CO_PVC
{
  /* 0x0000 */ void* NdisAfHandle;
  /* 0x0004 */ struct _CO_SPECIFIC_PARAMETERS PvcParameters;
} CO_PVC, *PCO_PVC; /* size: 0x0010 */

typedef struct _CO_SPECIFIC_PARAMETERS
{
  /* 0x0000 */ unsigned long ParamType;
  /* 0x0004 */ unsigned long Length;
  /* 0x0008 */ unsigned char Parameters[1];
  /* 0x0009 */ char __PADDING__[3];
} CO_SPECIFIC_PARAMETERS, *PCO_SPECIFIC_PARAMETERS; /* size: 0x000c */

typedef struct _CURDIR
{
  /* 0x0000 */ struct _UNICODE_STRING DosPath;
  /* 0x0008 */ void* Handle;
} CURDIR, *PCURDIR; /* size: 0x000c */

typedef struct _DESCRIPTOR
{
  /* 0x0000 */ unsigned short Pad;
  /* 0x0002 */ unsigned short Limit;
  /* 0x0004 */ unsigned long Base;
} DESCRIPTOR, *PDESCRIPTOR; /* size: 0x0008 */

typedef struct _DEVICE_CAPABILITIES
{
  /* 0x0000 */ unsigned short Size;
  /* 0x0002 */ unsigned short Version;
  struct /* bitfield */
  {
    /* 0x0004 */ unsigned long DeviceD1 : 1; /* bit position: 0 */
    /* 0x0004 */ unsigned long DeviceD2 : 1; /* bit position: 1 */
    /* 0x0004 */ unsigned long LockSupported : 1; /* bit position: 2 */
    /* 0x0004 */ unsigned long EjectSupported : 1; /* bit position: 3 */
    /* 0x0004 */ unsigned long Removable : 1; /* bit position: 4 */
    /* 0x0004 */ unsigned long DockDevice : 1; /* bit position: 5 */
    /* 0x0004 */ unsigned long UniqueID : 1; /* bit position: 6 */
    /* 0x0004 */ unsigned long SilentInstall : 1; /* bit position: 7 */
    /* 0x0004 */ unsigned long RawDeviceOK : 1; /* bit position: 8 */
    /* 0x0004 */ unsigned long SurpriseRemovalOK : 1; /* bit position: 9 */
    /* 0x0004 */ unsigned long WakeFromD0 : 1; /* bit position: 10 */
    /* 0x0004 */ unsigned long WakeFromD1 : 1; /* bit position: 11 */
    /* 0x0004 */ unsigned long WakeFromD2 : 1; /* bit position: 12 */
    /* 0x0004 */ unsigned long WakeFromD3 : 1; /* bit position: 13 */
    /* 0x0004 */ unsigned long HardwareDisabled : 1; /* bit position: 14 */
    /* 0x0004 */ unsigned long NonDynamic : 1; /* bit position: 15 */
    /* 0x0004 */ unsigned long WarmEjectSupported : 1; /* bit position: 16 */
    /* 0x0004 */ unsigned long NoDisplayInUI : 1; /* bit position: 17 */
    /* 0x0004 */ unsigned long Reserved1 : 1; /* bit position: 18 */
    /* 0x0004 */ unsigned long WakeFromInterrupt : 1; /* bit position: 19 */
    /* 0x0004 */ unsigned long Reserved : 12; /* bit position: 20 */
  }; /* bitfield */
  /* 0x0008 */ unsigned long Address;
  /* 0x000c */ unsigned long UINumber;
  /* 0x0010 */ enum _DEVICE_POWER_STATE DeviceState[7];
  /* 0x002c */ enum _SYSTEM_POWER_STATE SystemWake;
  /* 0x0030 */ enum _DEVICE_POWER_STATE DeviceWake;
  /* 0x0034 */ unsigned long D1Latency;
  /* 0x0038 */ unsigned long D2Latency;
  /* 0x003c */ unsigned long D3Latency;
} DEVICE_CAPABILITIES, *PDEVICE_CAPABILITIES; /* size: 0x0040 */

typedef struct _DEVICE_OBJECT
{
  /* 0x0000 */ short Type;
  /* 0x0002 */ unsigned short Size;
  /* 0x0004 */ long ReferenceCount;
  /* 0x0008 */ struct _DRIVER_OBJECT* DriverObject;
  /* 0x000c */ struct _DEVICE_OBJECT* NextDevice;
  /* 0x0010 */ struct _DEVICE_OBJECT* AttachedDevice;
  /* 0x0014 */ struct _IRP* CurrentIrp;
  /* 0x0018 */ struct _IO_TIMER* Timer;
  /* 0x001c */ unsigned long Flags;
  /* 0x0020 */ unsigned long Characteristics;
  /* 0x0024 */ struct _VPB* Vpb;
  /* 0x0028 */ void* DeviceExtension;
  /* 0x002c */ unsigned long DeviceType;
  /* 0x0030 */ char StackSize;
  union
  {
    union
    {
      /* 0x0034 */ struct _LIST_ENTRY ListEntry;
      /* 0x0034 */ struct _WAIT_CONTEXT_BLOCK Wcb;
    }; /* size: 0x0028 */
  } /* size: 0x0028 */ Queue;
  /* 0x005c */ unsigned long AlignmentRequirement;
  /* 0x0060 */ struct _KDEVICE_QUEUE DeviceQueue;
  /* 0x0074 */ struct _KDPC Dpc;
  /* 0x0094 */ unsigned long ActiveThreadCount;
  /* 0x0098 */ void* SecurityDescriptor;
  /* 0x009c */ struct _KEVENT DeviceLock;
  /* 0x00ac */ unsigned short SectorSize;
  /* 0x00ae */ unsigned short Spare1;
  /* 0x00b0 */ struct _DEVOBJ_EXTENSION* DeviceObjectExtension;
  /* 0x00b4 */ void* Reserved;
} DEVICE_OBJECT, *PDEVICE_OBJECT; /* size: 0x00b8 */

struct _DEVICE_OBJECT_POWER_EXTENSION;

typedef enum _DEVICE_POWER_STATE
{
  PowerDeviceUnspecified = 0,
  PowerDeviceD0 = 1,
  PowerDeviceD1 = 2,
  PowerDeviceD2 = 3,
  PowerDeviceD3 = 4,
  PowerDeviceMaximum = 5,
} DEVICE_POWER_STATE, *PDEVICE_POWER_STATE;

typedef enum _DEVICE_RELATION_TYPE
{
  BusRelations = 0,
  EjectionRelations = 1,
  PowerRelations = 2,
  RemovalRelations = 3,
  TargetDeviceRelation = 4,
  SingleBusRelations = 5,
  TransportRelations = 6,
} DEVICE_RELATION_TYPE, *PDEVICE_RELATION_TYPE;

typedef struct _DEVICE_RESET_INTERFACE_STANDARD
{
  /* 0x0000 */ unsigned short Size;
  /* 0x0002 */ unsigned short Version;
  /* 0x0004 */ void* Context;
  /* 0x0008 */ void* InterfaceReference /* function */;
  /* 0x000c */ void* InterfaceDereference /* function */;
  /* 0x0010 */ void* DeviceReset /* function */;
  /* 0x0014 */ unsigned long SupportedResetTypes;
  /* 0x0018 */ void* Reserved;
} DEVICE_RESET_INTERFACE_STANDARD, *PDEVICE_RESET_INTERFACE_STANDARD; /* size: 0x001c */

typedef enum _DEVICE_RESET_TYPE
{
  FunctionLevelDeviceReset = 0,
  PlatformLevelDeviceReset = 1,
} DEVICE_RESET_TYPE, *PDEVICE_RESET_TYPE;

typedef enum _DEVICE_USAGE_NOTIFICATION_TYPE
{
  DeviceUsageTypeUndefined = 0,
  DeviceUsageTypePaging = 1,
  DeviceUsageTypeHibernation = 2,
  DeviceUsageTypeDumpFile = 3,
  DeviceUsageTypeBoot = 4,
  DeviceUsageTypePostDisplay = 5,
} DEVICE_USAGE_NOTIFICATION_TYPE, *PDEVICE_USAGE_NOTIFICATION_TYPE;

typedef enum _DEVICE_WAKE_DEPTH
{
  DeviceWakeDepthNotWakeable = 0,
  DeviceWakeDepthD0 = 1,
  DeviceWakeDepthD1 = 2,
  DeviceWakeDepthD2 = 3,
  DeviceWakeDepthD3hot = 4,
  DeviceWakeDepthD3cold = 5,
  DeviceWakeDepthMaximum = 6,
} DEVICE_WAKE_DEPTH, *PDEVICE_WAKE_DEPTH;

typedef struct _DEVOBJ_EXTENSION
{
  /* 0x0000 */ short Type;
  /* 0x0002 */ unsigned short Size;
  /* 0x0004 */ struct _DEVICE_OBJECT* DeviceObject;
  /* 0x0008 */ unsigned long PowerFlags;
  /* 0x000c */ struct _DEVICE_OBJECT_POWER_EXTENSION* Dope;
  /* 0x0010 */ unsigned long ExtensionFlags;
  /* 0x0014 */ void* DeviceNode;
  /* 0x0018 */ struct _DEVICE_OBJECT* AttachedTo;
  /* 0x001c */ long StartIoCount;
  /* 0x0020 */ long StartIoKey;
  /* 0x0024 */ unsigned long StartIoFlags;
  /* 0x0028 */ struct _VPB* Vpb;
  /* 0x002c */ void* DependencyNode;
  /* 0x0030 */ void* InterruptContext;
  /* 0x0034 */ void* VerifierContext;
} DEVOBJ_EXTENSION, *PDEVOBJ_EXTENSION; /* size: 0x0038 */

typedef struct _DEVPROPCOMPKEY
{
  /* 0x0000 */ struct _DEVPROPKEY Key;
  /* 0x0014 */ enum _DEVPROPSTORE Store;
  /* 0x0018 */ const wchar_t* LocaleName;
} DEVPROPCOMPKEY, *PDEVPROPCOMPKEY; /* size: 0x001c */

typedef struct _DEVPROPKEY
{
  /* 0x0000 */ struct _GUID fmtid;
  /* 0x0010 */ unsigned long pid;
} DEVPROPKEY, *PDEVPROPKEY; /* size: 0x0014 */

typedef enum _DEVPROPSTORE
{
  DEVPROP_STORE_SYSTEM = 0,
  DEVPROP_STORE_USER = 1,
} DEVPROPSTORE, *PDEVPROPSTORE;

typedef struct _DISPATCHER_HEADER
{
  union
  {
    /* 0x0000 */ volatile long Lock;
    /* 0x0000 */ long LockNV;
    struct
    {
      /* 0x0000 */ unsigned char Type;
      /* 0x0001 */ unsigned char Signalling;
      /* 0x0002 */ unsigned char Size;
      /* 0x0003 */ unsigned char Reserved1;
    }; /* size: 0x0004 */
    struct
    {
      /* 0x0000 */ unsigned char TimerType;
      union
      {
        /* 0x0001 */ unsigned char TimerControlFlags;
        struct
        {
          struct /* bitfield */
          {
            /* 0x0001 */ unsigned char Absolute : 1; /* bit position: 0 */
            /* 0x0001 */ unsigned char Wake : 1; /* bit position: 1 */
            /* 0x0001 */ unsigned char EncodedTolerableDelay : 6; /* bit position: 2 */
          }; /* bitfield */
          /* 0x0002 */ unsigned char Hand;
          union
          {
            /* 0x0003 */ unsigned char TimerMiscFlags;
            struct /* bitfield */
            {
              /* 0x0003 */ unsigned char Index : 1; /* bit position: 0 */
              /* 0x0003 */ unsigned char Processor : 5; /* bit position: 1 */
              /* 0x0003 */ unsigned char Inserted : 1; /* bit position: 6 */
              /* 0x0003 */ volatile unsigned char Expired : 1; /* bit position: 7 */
            }; /* bitfield */
          }; /* size: 0x0001 */
        }; /* size: 0x0003 */
      }; /* size: 0x0003 */
    }; /* size: 0x0004 */
    struct
    {
      /* 0x0000 */ unsigned char Timer2Type;
      union
      {
        /* 0x0001 */ unsigned char Timer2Flags;
        struct
        {
          struct /* bitfield */
          {
            /* 0x0001 */ unsigned char Timer2Inserted : 1; /* bit position: 0 */
            /* 0x0001 */ unsigned char Timer2Expiring : 1; /* bit position: 1 */
            /* 0x0001 */ unsigned char Timer2CancelPending : 1; /* bit position: 2 */
            /* 0x0001 */ unsigned char Timer2SetPending : 1; /* bit position: 3 */
            /* 0x0001 */ unsigned char Timer2Running : 1; /* bit position: 4 */
            /* 0x0001 */ unsigned char Timer2Disabled : 1; /* bit position: 5 */
            /* 0x0001 */ unsigned char Timer2ReservedFlags : 2; /* bit position: 6 */
          }; /* bitfield */
          /* 0x0002 */ unsigned char Timer2Reserved1;
          /* 0x0003 */ unsigned char Timer2Reserved2;
        }; /* size: 0x0003 */
      }; /* size: 0x0003 */
    }; /* size: 0x0004 */
    struct
    {
      /* 0x0000 */ unsigned char QueueType;
      union
      {
        /* 0x0001 */ unsigned char QueueControlFlags;
        struct
        {
          struct /* bitfield */
          {
            /* 0x0001 */ unsigned char Abandoned : 1; /* bit position: 0 */
            /* 0x0001 */ unsigned char DisableIncrement : 1; /* bit position: 1 */
            /* 0x0001 */ unsigned char QueueReservedControlFlags : 6; /* bit position: 2 */
          }; /* bitfield */
          /* 0x0002 */ unsigned char QueueSize;
          /* 0x0003 */ unsigned char QueueReserved;
        }; /* size: 0x0003 */
      }; /* size: 0x0003 */
    }; /* size: 0x0004 */
    struct
    {
      /* 0x0000 */ unsigned char ThreadType;
      /* 0x0001 */ unsigned char ThreadReserved;
      union
      {
        /* 0x0002 */ unsigned char ThreadControlFlags;
        struct
        {
          struct /* bitfield */
          {
            /* 0x0002 */ unsigned char CycleProfiling : 1; /* bit position: 0 */
            /* 0x0002 */ unsigned char CounterProfiling : 1; /* bit position: 1 */
            /* 0x0002 */ unsigned char GroupScheduling : 1; /* bit position: 2 */
            /* 0x0002 */ unsigned char AffinitySet : 1; /* bit position: 3 */
            /* 0x0002 */ unsigned char Tagged : 1; /* bit position: 4 */
            /* 0x0002 */ unsigned char EnergyProfiling : 1; /* bit position: 5 */
            /* 0x0002 */ unsigned char Instrumented : 1; /* bit position: 6 */
            /* 0x0002 */ unsigned char ThreadReservedControlFlags : 1; /* bit position: 7 */
          }; /* bitfield */
          /* 0x0003 */ unsigned char DebugActive;
        }; /* size: 0x0002 */
      }; /* size: 0x0002 */
    }; /* size: 0x0004 */
    struct
    {
      /* 0x0000 */ unsigned char MutantType;
      /* 0x0001 */ unsigned char MutantSize;
      /* 0x0002 */ unsigned char DpcActive;
      /* 0x0003 */ unsigned char MutantReserved;
    }; /* size: 0x0004 */
  }; /* size: 0x0004 */
  /* 0x0004 */ long SignalState;
  /* 0x0008 */ struct _LIST_ENTRY WaitListHead;
} DISPATCHER_HEADER, *PDISPATCHER_HEADER; /* size: 0x0010 */

typedef union _DL_EI48
{
  /* 0x0000 */ unsigned char Byte[3];
} DL_EI48, *PDL_EI48; /* size: 0x0003 */

typedef union _DL_EUI48
{
  union
  {
    /* 0x0000 */ unsigned char Byte[6];
    struct
    {
      /* 0x0000 */ union _DL_OUI Oui;
      /* 0x0003 */ union _DL_EI48 Ei48;
    }; /* size: 0x0006 */
  }; /* size: 0x0006 */
} DL_EUI48, *PDL_EUI48; /* size: 0x0006 */

typedef union _DL_OUI
{
  union
  {
    /* 0x0000 */ unsigned char Byte[3];
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned char Group : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned char Local : 1; /* bit position: 1 */
    }; /* bitfield */
  }; /* size: 0x0003 */
} DL_OUI, *PDL_OUI; /* size: 0x0003 */

typedef struct _DMA_ADAPTER
{
  /* 0x0000 */ unsigned short Version;
  /* 0x0002 */ unsigned short Size;
  /* 0x0004 */ struct _DMA_OPERATIONS* DmaOperations;
} DMA_ADAPTER, *PDMA_ADAPTER; /* size: 0x0008 */

typedef struct _DMA_ADAPTER_INFO
{
  /* 0x0000 */ unsigned long Version;
  /* 0x0004 */ struct _DMA_ADAPTER_INFO_V1 V1;
} DMA_ADAPTER_INFO, *PDMA_ADAPTER_INFO; /* size: 0x0018 */

typedef struct _DMA_ADAPTER_INFO_V1
{
  /* 0x0000 */ unsigned long ReadDmaCounterAvailable;
  /* 0x0004 */ unsigned long ScatterGatherLimit;
  /* 0x0008 */ unsigned long DmaAddressWidth;
  /* 0x000c */ unsigned long Flags;
  /* 0x0010 */ unsigned long MinimumTransferUnit;
} DMA_ADAPTER_INFO_V1, *PDMA_ADAPTER_INFO_V1; /* size: 0x0014 */

typedef struct _DMA_OPERATIONS
{
  /* 0x0000 */ unsigned long Size;
  /* 0x0004 */ void* PutDmaAdapter /* function */;
  /* 0x0008 */ void* AllocateCommonBuffer /* function */;
  /* 0x000c */ void* FreeCommonBuffer /* function */;
  /* 0x0010 */ void* AllocateAdapterChannel /* function */;
  /* 0x0014 */ void* FlushAdapterBuffers /* function */;
  /* 0x0018 */ void* FreeAdapterChannel /* function */;
  /* 0x001c */ void* FreeMapRegisters /* function */;
  /* 0x0020 */ void* MapTransfer /* function */;
  /* 0x0024 */ void* GetDmaAlignment /* function */;
  /* 0x0028 */ void* ReadDmaCounter /* function */;
  /* 0x002c */ void* GetScatterGatherList /* function */;
  /* 0x0030 */ void* PutScatterGatherList /* function */;
  /* 0x0034 */ void* CalculateScatterGatherList /* function */;
  /* 0x0038 */ void* BuildScatterGatherList /* function */;
  /* 0x003c */ void* BuildMdlFromScatterGatherList /* function */;
  /* 0x0040 */ void* GetDmaAdapterInfo /* function */;
  /* 0x0044 */ void* GetDmaTransferInfo /* function */;
  /* 0x0048 */ void* InitializeDmaTransferContext /* function */;
  /* 0x004c */ void* AllocateCommonBufferEx /* function */;
  /* 0x0050 */ void* AllocateAdapterChannelEx /* function */;
  /* 0x0054 */ void* ConfigureAdapterChannel /* function */;
  /* 0x0058 */ void* CancelAdapterChannel /* function */;
  /* 0x005c */ void* MapTransferEx /* function */;
  /* 0x0060 */ void* GetScatterGatherListEx /* function */;
  /* 0x0064 */ void* BuildScatterGatherListEx /* function */;
  /* 0x0068 */ void* FlushAdapterBuffersEx /* function */;
  /* 0x006c */ void* FreeAdapterObject /* function */;
  /* 0x0070 */ void* CancelMappedTransfer /* function */;
  /* 0x0074 */ void* AllocateDomainCommonBuffer /* function */;
  /* 0x0078 */ void* FlushDmaBuffer /* function */;
  /* 0x007c */ void* JoinDmaDomain /* function */;
  /* 0x0080 */ void* LeaveDmaDomain /* function */;
  /* 0x0084 */ void* GetDmaDomain /* function */;
} DMA_OPERATIONS, *PDMA_OPERATIONS; /* size: 0x0088 */

typedef enum _DMA_SPEED
{
  Compatible = 0,
  TypeA = 1,
  TypeB = 2,
  TypeC = 3,
  TypeF = 4,
  MaximumDmaSpeed = 5,
} DMA_SPEED, *PDMA_SPEED;

typedef struct _DMA_TRANSFER_INFO
{
  /* 0x0000 */ unsigned long Version;
  /* 0x0004 */ struct _DMA_TRANSFER_INFO_V1 V1;
} DMA_TRANSFER_INFO, *PDMA_TRANSFER_INFO; /* size: 0x0010 */

typedef struct _DMA_TRANSFER_INFO_V1
{
  /* 0x0000 */ unsigned long MapRegisterCount;
  /* 0x0004 */ unsigned long ScatterGatherElementCount;
  /* 0x0008 */ unsigned long ScatterGatherListSize;
} DMA_TRANSFER_INFO_V1, *PDMA_TRANSFER_INFO_V1; /* size: 0x000c */

typedef enum _DMA_WIDTH
{
  Width8Bits = 0,
  Width16Bits = 1,
  Width32Bits = 2,
  Width64Bits = 3,
  WidthNoWrap = 4,
  MaximumDmaWidth = 5,
} DMA_WIDTH, *PDMA_WIDTH;

typedef struct _DOT11_ADDITIONAL_IE
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long uBeaconIEsOffset;
  /* 0x0008 */ unsigned long uBeaconIEsLength;
  /* 0x000c */ unsigned long uResponseIEsOffset;
  /* 0x0010 */ unsigned long uResponseIEsLength;
} DOT11_ADDITIONAL_IE, *PDOT11_ADDITIONAL_IE; /* size: 0x0014 */

typedef struct _DOT11_ASSOCIATION_INFO_EX
{
  /* 0x0000 */ unsigned char PeerMacAddress[6];
  /* 0x0006 */ unsigned char BSSID[6];
  /* 0x000c */ unsigned short usCapabilityInformation;
  /* 0x000e */ unsigned short usListenInterval;
  /* 0x0010 */ unsigned char ucPeerSupportedRates[255];
  /* 0x0110 */ unsigned short usAssociationID;
  /* 0x0114 */ enum _DOT11_ASSOCIATION_STATE dot11AssociationState;
  /* 0x0118 */ enum _DOT11_POWER_MODE dot11PowerMode;
  /* 0x0120 */ union _LARGE_INTEGER liAssociationUpTime;
  /* 0x0128 */ unsigned __int64 ullNumOfTxPacketSuccesses;
  /* 0x0130 */ unsigned __int64 ullNumOfTxPacketFailures;
  /* 0x0138 */ unsigned __int64 ullNumOfRxPacketSuccesses;
  /* 0x0140 */ unsigned __int64 ullNumOfRxPacketFailures;
} DOT11_ASSOCIATION_INFO_EX, *PDOT11_ASSOCIATION_INFO_EX; /* size: 0x0148 */

typedef enum _DOT11_ASSOCIATION_STATE
{
  dot11_assoc_state_zero = 0,
  dot11_assoc_state_unauth_unassoc = 1,
  dot11_assoc_state_auth_unassoc = 2,
  dot11_assoc_state_auth_assoc = 3,
} DOT11_ASSOCIATION_STATE, *PDOT11_ASSOCIATION_STATE;

typedef enum _DOT11_AUTH_ALGORITHM
{
  DOT11_AUTH_ALGO_80211_OPEN = 1,
  DOT11_AUTH_ALGO_80211_SHARED_KEY = 2,
  DOT11_AUTH_ALGO_WPA = 3,
  DOT11_AUTH_ALGO_WPA_PSK = 4,
  DOT11_AUTH_ALGO_WPA_NONE = 5,
  DOT11_AUTH_ALGO_RSNA = 6,
  DOT11_AUTH_ALGO_RSNA_PSK = 7,
  DOT11_AUTH_ALGO_IHV_START = -2147483648,
  DOT11_AUTH_ALGO_IHV_END = -1,
} DOT11_AUTH_ALGORITHM, *PDOT11_AUTH_ALGORITHM;

typedef struct _DOT11_AVAILABLE_CHANNEL_LIST
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long uNumOfEntries;
  /* 0x0008 */ unsigned long uTotalNumOfEntries;
  /* 0x000c */ unsigned long uChannelNumber[1];
} DOT11_AVAILABLE_CHANNEL_LIST, *PDOT11_AVAILABLE_CHANNEL_LIST; /* size: 0x0010 */

typedef struct _DOT11_AVAILABLE_FREQUENCY_LIST
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long uNumOfEntries;
  /* 0x0008 */ unsigned long uTotalNumOfEntries;
  /* 0x000c */ unsigned long uFrequencyValue[1];
} DOT11_AVAILABLE_FREQUENCY_LIST, *PDOT11_AVAILABLE_FREQUENCY_LIST; /* size: 0x0010 */

typedef enum _DOT11_CIPHER_ALGORITHM
{
  DOT11_CIPHER_ALGO_NONE = 0,
  DOT11_CIPHER_ALGO_WEP40 = 1,
  DOT11_CIPHER_ALGO_TKIP = 2,
  DOT11_CIPHER_ALGO_CCMP = 4,
  DOT11_CIPHER_ALGO_WEP104 = 5,
  DOT11_CIPHER_ALGO_BIP = 6,
  DOT11_CIPHER_ALGO_WPA_USE_GROUP = 256,
  DOT11_CIPHER_ALGO_RSN_USE_GROUP = 256,
  DOT11_CIPHER_ALGO_WEP = 257,
  DOT11_CIPHER_ALGO_IHV_START = -2147483648,
  DOT11_CIPHER_ALGO_IHV_END = -1,
} DOT11_CIPHER_ALGORITHM, *PDOT11_CIPHER_ALGORITHM;

typedef struct _DOT11_DISASSOCIATE_PEER_REQUEST
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned char PeerMacAddr[6];
  /* 0x000a */ unsigned short usReason;
} DOT11_DISASSOCIATE_PEER_REQUEST, *PDOT11_DISASSOCIATE_PEER_REQUEST; /* size: 0x000c */

typedef enum _DOT11_DIVERSITY_SUPPORT
{
  dot11_diversity_support_unknown = 0,
  dot11_diversity_support_fixedlist = 1,
  dot11_diversity_support_notsupported = 2,
  dot11_diversity_support_dynamic = 3,
} DOT11_DIVERSITY_SUPPORT, *PDOT11_DIVERSITY_SUPPORT;

typedef struct _DOT11_EXTAP_ATTRIBUTES
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long uScanSSIDListSize;
  /* 0x0008 */ unsigned long uDesiredSSIDListSize;
  /* 0x000c */ unsigned long uPrivacyExemptionListSize;
  /* 0x0010 */ unsigned long uAssociationTableSize;
  /* 0x0014 */ unsigned long uDefaultKeyTableSize;
  /* 0x0018 */ unsigned long uWEPKeyValueMaxLength;
  /* 0x001c */ unsigned char bStrictlyOrderedServiceClassImplemented;
  /* 0x0020 */ unsigned long uNumSupportedCountryOrRegionStrings;
  /* 0x0024 */ unsigned char* pSupportedCountryOrRegionStrings[3];
  /* 0x0028 */ unsigned long uInfraNumSupportedUcastAlgoPairs;
  /* 0x002c */ struct DOT11_AUTH_CIPHER_PAIR* pInfraSupportedUcastAlgoPairs;
  /* 0x0030 */ unsigned long uInfraNumSupportedMcastAlgoPairs;
  /* 0x0034 */ struct DOT11_AUTH_CIPHER_PAIR* pInfraSupportedMcastAlgoPairs;
} DOT11_EXTAP_ATTRIBUTES, *PDOT11_EXTAP_ATTRIBUTES; /* size: 0x0038 */

typedef struct _DOT11_INCOMING_ASSOC_DECISION
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned char PeerMacAddr[6];
  /* 0x000a */ unsigned char bAccept;
  /* 0x000c */ unsigned short usReasonCode;
  /* 0x0010 */ unsigned long uAssocResponseIEsOffset;
  /* 0x0014 */ unsigned long uAssocResponseIEsLength;
} DOT11_INCOMING_ASSOC_DECISION, *PDOT11_INCOMING_ASSOC_DECISION; /* size: 0x0018 */

typedef struct _DOT11_PEER_INFO
{
  /* 0x0000 */ unsigned char MacAddress[6];
  /* 0x0006 */ unsigned short usCapabilityInformation;
  /* 0x0008 */ enum _DOT11_AUTH_ALGORITHM AuthAlgo;
  /* 0x000c */ enum _DOT11_CIPHER_ALGORITHM UnicastCipherAlgo;
  /* 0x0010 */ enum _DOT11_CIPHER_ALGORITHM MulticastCipherAlgo;
  /* 0x0014 */ unsigned char bWpsEnabled;
  /* 0x0016 */ unsigned short usListenInterval;
  /* 0x0018 */ unsigned char ucSupportedRates[255];
  /* 0x0118 */ unsigned short usAssociationID;
  /* 0x011c */ enum _DOT11_ASSOCIATION_STATE AssociationState;
  /* 0x0120 */ enum _DOT11_POWER_MODE PowerMode;
  /* 0x0128 */ union _LARGE_INTEGER liAssociationUpTime;
  /* 0x0130 */ struct _DOT11_PEER_STATISTICS Statistics;
} DOT11_PEER_INFO, *PDOT11_PEER_INFO; /* size: 0x0160 */

typedef struct _DOT11_PEER_INFO_LIST
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long uNumOfEntries;
  /* 0x0008 */ unsigned long uTotalNumOfEntries;
  /* 0x0010 */ struct _DOT11_PEER_INFO PeerInfo[1];
} DOT11_PEER_INFO_LIST, *PDOT11_PEER_INFO_LIST; /* size: 0x0170 */

typedef struct _DOT11_PEER_STATISTICS
{
  /* 0x0000 */ unsigned __int64 ullDecryptSuccessCount;
  /* 0x0008 */ unsigned __int64 ullDecryptFailureCount;
  /* 0x0010 */ unsigned __int64 ullTxPacketSuccessCount;
  /* 0x0018 */ unsigned __int64 ullTxPacketFailureCount;
  /* 0x0020 */ unsigned __int64 ullRxPacketSuccessCount;
  /* 0x0028 */ unsigned __int64 ullRxPacketFailureCount;
} DOT11_PEER_STATISTICS, *PDOT11_PEER_STATISTICS; /* size: 0x0030 */

typedef enum _DOT11_PHY_TYPE
{
  dot11_phy_type_unknown = 0,
  dot11_phy_type_any = 0,
  dot11_phy_type_fhss = 1,
  dot11_phy_type_dsss = 2,
  dot11_phy_type_irbaseband = 3,
  dot11_phy_type_ofdm = 4,
  dot11_phy_type_hrdsss = 5,
  dot11_phy_type_erp = 6,
  dot11_phy_type_ht = 7,
  dot11_phy_type_vht = 8,
  dot11_phy_type_IHV_start = -2147483648,
  dot11_phy_type_IHV_end = -1,
} DOT11_PHY_TYPE, *PDOT11_PHY_TYPE;

typedef enum _DOT11_POWER_MODE
{
  dot11_power_mode_unknown = 0,
  dot11_power_mode_active = 1,
  dot11_power_mode_powersave = 2,
} DOT11_POWER_MODE, *PDOT11_POWER_MODE;

typedef struct _DOT11_SSID
{
  /* 0x0000 */ unsigned long uSSIDLength;
  /* 0x0004 */ unsigned char ucSSID[32];
} DOT11_SSID, *PDOT11_SSID; /* size: 0x0024 */

typedef struct _DOT11_SUPPORTED_DATA_RATES_VALUE_V2
{
  /* 0x0000 */ unsigned char ucSupportedTxDataRatesValue[255];
  /* 0x00ff */ unsigned char ucSupportedRxDataRatesValue[255];
} DOT11_SUPPORTED_DATA_RATES_VALUE_V2, *PDOT11_SUPPORTED_DATA_RATES_VALUE_V2; /* size: 0x01fe */

typedef enum _DOT11_TEMP_TYPE
{
  dot11_temp_type_unknown = 0,
  dot11_temp_type_1 = 1,
  dot11_temp_type_2 = 2,
} DOT11_TEMP_TYPE, *PDOT11_TEMP_TYPE;

typedef struct _DOT11_VWIFI_COMBINATION
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long uNumInfrastructure;
  /* 0x0008 */ unsigned long uNumAdhoc;
  /* 0x000c */ unsigned long uNumSoftAP;
} DOT11_VWIFI_COMBINATION, *PDOT11_VWIFI_COMBINATION; /* size: 0x0010 */

typedef struct _DOT11_WFD_ATTRIBUTES
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long uNumConcurrentGORole;
  /* 0x0008 */ unsigned long uNumConcurrentClientRole;
  /* 0x000c */ unsigned long WPSVersionsSupported;
  /* 0x0010 */ unsigned char bServiceDiscoverySupported;
  /* 0x0011 */ unsigned char bClientDiscoverabilitySupported;
  /* 0x0012 */ unsigned char bInfrastructureManagementSupported;
  /* 0x0014 */ unsigned long uMaxSecondaryDeviceTypeListSize;
  /* 0x0018 */ unsigned char DeviceAddress[6];
  /* 0x0020 */ unsigned long uInterfaceAddressListCount;
  /* 0x0024 */ unsigned char* pInterfaceAddressList[6];
  /* 0x0028 */ unsigned long uNumSupportedCountryOrRegionStrings;
  /* 0x002c */ unsigned char* pSupportedCountryOrRegionStrings[3];
  /* 0x0030 */ unsigned long uDiscoveryFilterListSize;
  /* 0x0034 */ unsigned long uGORoleClientTableSize;
} DOT11_WFD_ATTRIBUTES, *PDOT11_WFD_ATTRIBUTES; /* size: 0x0038 */

typedef struct _DRIVER_EXTENSION
{
  /* 0x0000 */ struct _DRIVER_OBJECT* DriverObject;
  /* 0x0004 */ void* AddDevice /* function */;
  /* 0x0008 */ unsigned long Count;
  /* 0x000c */ struct _UNICODE_STRING ServiceKeyName;
} DRIVER_EXTENSION, *PDRIVER_EXTENSION; /* size: 0x0014 */

typedef struct _DRIVER_OBJECT
{
  /* 0x0000 */ short Type;
  /* 0x0002 */ short Size;
  /* 0x0004 */ struct _DEVICE_OBJECT* DeviceObject;
  /* 0x0008 */ unsigned long Flags;
  /* 0x000c */ void* DriverStart;
  /* 0x0010 */ unsigned long DriverSize;
  /* 0x0014 */ void* DriverSection;
  /* 0x0018 */ struct _DRIVER_EXTENSION* DriverExtension;
  /* 0x001c */ struct _UNICODE_STRING DriverName;
  /* 0x0024 */ struct _UNICODE_STRING* HardwareDatabase;
  /* 0x0028 */ struct _FAST_IO_DISPATCH* FastIoDispatch;
  /* 0x002c */ void* DriverInit /* function */;
  /* 0x0030 */ void* DriverStartIo /* function */;
  /* 0x0034 */ void* DriverUnload /* function */;
  /* 0x0038 */ void* MajorFunction[28] /* function */;
} DRIVER_OBJECT, *PDRIVER_OBJECT; /* size: 0x00a8 */

struct _ECP_LIST;

struct _EPROCESS;

typedef struct _ERESOURCE
{
  /* 0x0000 */ struct _LIST_ENTRY SystemResourcesList;
  /* 0x0008 */ struct _OWNER_ENTRY* OwnerTable;
  /* 0x000c */ short ActiveCount;
  union
  {
    /* 0x000e */ unsigned short Flag;
    struct
    {
      /* 0x000e */ unsigned char ReservedLowFlags;
      /* 0x000f */ unsigned char WaiterPriority;
    }; /* size: 0x0002 */
  }; /* size: 0x0002 */
  /* 0x0010 */ struct _KWAIT_CHAIN SharedWaiters;
  /* 0x0014 */ struct _KEVENT* ExclusiveWaiters;
  /* 0x0018 */ struct _OWNER_ENTRY OwnerEntry;
  /* 0x0020 */ unsigned long ActiveEntries;
  /* 0x0024 */ unsigned long ContentionCount;
  /* 0x0028 */ unsigned long NumberOfSharedWaiters;
  /* 0x002c */ unsigned long NumberOfExclusiveWaiters;
  union
  {
    /* 0x0030 */ void* Address;
    /* 0x0030 */ unsigned long CreatorBackTraceIndex;
  }; /* size: 0x0004 */
  /* 0x0034 */ unsigned long SpinLock;
} ERESOURCE, *PERESOURCE; /* size: 0x0038 */

struct _ETHREAD;

typedef struct _ETH_MULTICAST_WRAPPER
{
  /* 0x0000 */ unsigned long RefCount;
  /* 0x0004 */ unsigned char MCastAddress[6];
  /* 0x000a */ char __PADDING__[2];
} ETH_MULTICAST_WRAPPER, *PETH_MULTICAST_WRAPPER; /* size: 0x000c */

typedef struct _ETW_BUFFER_CONTEXT
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned char ProcessorNumber;
      /* 0x0001 */ unsigned char Alignment;
    }; /* size: 0x0002 */
    /* 0x0000 */ unsigned short ProcessorIndex;
  }; /* size: 0x0002 */
  /* 0x0002 */ unsigned short LoggerId;
} ETW_BUFFER_CONTEXT, *PETW_BUFFER_CONTEXT; /* size: 0x0004 */

typedef struct _EVENT_DATA_DESCRIPTOR
{
  /* 0x0000 */ unsigned __int64 Ptr;
  /* 0x0008 */ unsigned long Size;
  union
  {
    /* 0x000c */ unsigned long Reserved;
    struct
    {
      /* 0x000c */ unsigned char Type;
      /* 0x000d */ unsigned char Reserved1;
      /* 0x000e */ unsigned short Reserved2;
    }; /* size: 0x0004 */
  }; /* size: 0x0004 */
} EVENT_DATA_DESCRIPTOR, *PEVENT_DATA_DESCRIPTOR; /* size: 0x0010 */

typedef struct _EVENT_DESCRIPTOR
{
  /* 0x0000 */ unsigned short Id;
  /* 0x0002 */ unsigned char Version;
  /* 0x0003 */ unsigned char Channel;
  /* 0x0004 */ unsigned char Level;
  /* 0x0005 */ unsigned char Opcode;
  /* 0x0006 */ unsigned short Task;
  /* 0x0008 */ unsigned __int64 Keyword;
} EVENT_DESCRIPTOR, *PEVENT_DESCRIPTOR; /* size: 0x0010 */

typedef struct _EVENT_FILTER_DESCRIPTOR
{
  /* 0x0000 */ unsigned __int64 Ptr;
  /* 0x0008 */ unsigned long Size;
  /* 0x000c */ unsigned long Type;
} EVENT_FILTER_DESCRIPTOR, *PEVENT_FILTER_DESCRIPTOR; /* size: 0x0010 */

typedef struct _EVENT_HEADER
{
  /* 0x0000 */ unsigned short Size;
  /* 0x0002 */ unsigned short HeaderType;
  /* 0x0004 */ unsigned short Flags;
  /* 0x0006 */ unsigned short EventProperty;
  /* 0x0008 */ unsigned long ThreadId;
  /* 0x000c */ unsigned long ProcessId;
  /* 0x0010 */ union _LARGE_INTEGER TimeStamp;
  /* 0x0018 */ struct _GUID ProviderId;
  /* 0x0028 */ struct _EVENT_DESCRIPTOR EventDescriptor;
  union
  {
    struct
    {
      /* 0x0038 */ unsigned long KernelTime;
      /* 0x003c */ unsigned long UserTime;
    }; /* size: 0x0008 */
    /* 0x0038 */ unsigned __int64 ProcessorTime;
  }; /* size: 0x0008 */
  /* 0x0040 */ struct _GUID ActivityId;
} EVENT_HEADER, *PEVENT_HEADER; /* size: 0x0050 */

typedef struct _EVENT_HEADER_EXTENDED_DATA_ITEM
{
  /* 0x0000 */ unsigned short Reserved1;
  /* 0x0002 */ unsigned short ExtType;
  struct /* bitfield */
  {
    /* 0x0004 */ unsigned short Linkage : 1; /* bit position: 0 */
    /* 0x0004 */ unsigned short Reserved2 : 15; /* bit position: 1 */
  }; /* bitfield */
  /* 0x0006 */ unsigned short DataSize;
  /* 0x0008 */ unsigned __int64 DataPtr;
} EVENT_HEADER_EXTENDED_DATA_ITEM, *PEVENT_HEADER_EXTENDED_DATA_ITEM; /* size: 0x0010 */

typedef enum _EVENT_INFO_CLASS
{
  EventProviderBinaryTrackInfo = 0,
  EventProviderSetEnableAllKeywords = 1,
  EventProviderSetTraits = 2,
  EventProviderUseDescriptorType = 3,
  MaxEventInfo = 4,
} EVENT_INFO_CLASS, *PEVENT_INFO_CLASS;

typedef struct _EVENT_RECORD
{
  /* 0x0000 */ struct _EVENT_HEADER EventHeader;
  /* 0x0050 */ struct _ETW_BUFFER_CONTEXT BufferContext;
  /* 0x0054 */ unsigned short ExtendedDataCount;
  /* 0x0056 */ unsigned short UserDataLength;
  /* 0x0058 */ struct _EVENT_HEADER_EXTENDED_DATA_ITEM* ExtendedData;
  /* 0x005c */ void* UserData;
  /* 0x0060 */ void* UserContext;
  /* 0x0064 */ long __PADDING__[1];
} EVENT_RECORD, *PEVENT_RECORD; /* size: 0x0068 */

typedef enum _EVENT_TYPE
{
  NotificationEvent = 0,
  SynchronizationEvent = 1,
} EVENT_TYPE, *PEVENT_TYPE;

typedef enum _EXCEPTION_DISPOSITION
{
  ExceptionContinueExecution = 0,
  ExceptionContinueSearch = 1,
  ExceptionNestedException = 2,
  ExceptionCollidedUnwind = 3,
} EXCEPTION_DISPOSITION, *PEXCEPTION_DISPOSITION;

typedef struct _EXCEPTION_RECORD
{
  /* 0x0000 */ long ExceptionCode;
  /* 0x0004 */ unsigned long ExceptionFlags;
  /* 0x0008 */ struct _EXCEPTION_RECORD* ExceptionRecord;
  /* 0x000c */ void* ExceptionAddress;
  /* 0x0010 */ unsigned long NumberParameters;
  /* 0x0014 */ unsigned long ExceptionInformation[15];
} EXCEPTION_RECORD, *PEXCEPTION_RECORD; /* size: 0x0050 */

typedef struct _EXCEPTION_REGISTRATION_RECORD
{
  /* 0x0000 */ struct _EXCEPTION_REGISTRATION_RECORD* Next;
  /* 0x0004 */ void* Handler /* function */;
} EXCEPTION_REGISTRATION_RECORD, *PEXCEPTION_REGISTRATION_RECORD; /* size: 0x0008 */

typedef struct _EXT_DELETE_PARAMETERS
{
  /* 0x0000 */ unsigned long Version;
  /* 0x0004 */ unsigned long Reserved;
  /* 0x0008 */ void* DeleteCallback /* function */;
  /* 0x000c */ void* DeleteContext;
} EXT_DELETE_PARAMETERS, *PEXT_DELETE_PARAMETERS; /* size: 0x0010 */

typedef struct _EXT_SET_PARAMETERS_V0
{
  /* 0x0000 */ unsigned long Version;
  /* 0x0004 */ unsigned long Reserved;
  /* 0x0008 */ __int64 NoWakeTolerance;
} EXT_SET_PARAMETERS_V0, *PEXT_SET_PARAMETERS_V0; /* size: 0x0010 */

typedef struct _EX_PUSH_LOCK
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long Locked : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned long Waiting : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned long Waking : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned long MultipleShared : 1; /* bit position: 3 */
      /* 0x0000 */ unsigned long Shared : 28; /* bit position: 4 */
    }; /* bitfield */
    /* 0x0000 */ unsigned long Value;
    /* 0x0000 */ void* Ptr;
  }; /* size: 0x0004 */
} EX_PUSH_LOCK, *PEX_PUSH_LOCK; /* size: 0x0004 */

typedef struct _EX_RUNDOWN_REF
{
  union
  {
    /* 0x0000 */ unsigned long Count;
    /* 0x0000 */ void* Ptr;
  }; /* size: 0x0004 */
} EX_RUNDOWN_REF, *PEX_RUNDOWN_REF; /* size: 0x0004 */

typedef struct _FAST_IO_DISPATCH
{
  /* 0x0000 */ unsigned long SizeOfFastIoDispatch;
  /* 0x0004 */ void* FastIoCheckIfPossible /* function */;
  /* 0x0008 */ void* FastIoRead /* function */;
  /* 0x000c */ void* FastIoWrite /* function */;
  /* 0x0010 */ void* FastIoQueryBasicInfo /* function */;
  /* 0x0014 */ void* FastIoQueryStandardInfo /* function */;
  /* 0x0018 */ void* FastIoLock /* function */;
  /* 0x001c */ void* FastIoUnlockSingle /* function */;
  /* 0x0020 */ void* FastIoUnlockAll /* function */;
  /* 0x0024 */ void* FastIoUnlockAllByKey /* function */;
  /* 0x0028 */ void* FastIoDeviceControl /* function */;
  /* 0x002c */ void* AcquireFileForNtCreateSection /* function */;
  /* 0x0030 */ void* ReleaseFileForNtCreateSection /* function */;
  /* 0x0034 */ void* FastIoDetachDevice /* function */;
  /* 0x0038 */ void* FastIoQueryNetworkOpenInfo /* function */;
  /* 0x003c */ void* AcquireForModWrite /* function */;
  /* 0x0040 */ void* MdlRead /* function */;
  /* 0x0044 */ void* MdlReadComplete /* function */;
  /* 0x0048 */ void* PrepareMdlWrite /* function */;
  /* 0x004c */ void* MdlWriteComplete /* function */;
  /* 0x0050 */ void* FastIoReadCompressed /* function */;
  /* 0x0054 */ void* FastIoWriteCompressed /* function */;
  /* 0x0058 */ void* MdlReadCompleteCompressed /* function */;
  /* 0x005c */ void* MdlWriteCompleteCompressed /* function */;
  /* 0x0060 */ void* FastIoQueryOpen /* function */;
  /* 0x0064 */ void* ReleaseForModWrite /* function */;
  /* 0x0068 */ void* AcquireForCcFlush /* function */;
  /* 0x006c */ void* ReleaseForCcFlush /* function */;
} FAST_IO_DISPATCH, *PFAST_IO_DISPATCH; /* size: 0x0070 */

typedef struct _FAST_MUTEX
{
  /* 0x0000 */ long Count;
  /* 0x0004 */ void* Owner;
  /* 0x0008 */ unsigned long Contention;
  /* 0x000c */ struct _KEVENT Event;
  /* 0x001c */ unsigned long OldIrql;
} FAST_MUTEX, *PFAST_MUTEX; /* size: 0x0020 */

typedef struct _FILE_BASIC_INFORMATION
{
  /* 0x0000 */ union _LARGE_INTEGER CreationTime;
  /* 0x0008 */ union _LARGE_INTEGER LastAccessTime;
  /* 0x0010 */ union _LARGE_INTEGER LastWriteTime;
  /* 0x0018 */ union _LARGE_INTEGER ChangeTime;
  /* 0x0020 */ unsigned long FileAttributes;
  /* 0x0024 */ long __PADDING__[1];
} FILE_BASIC_INFORMATION, *PFILE_BASIC_INFORMATION; /* size: 0x0028 */

typedef enum _FILE_INFORMATION_CLASS
{
  FileDirectoryInformation = 1,
  FileFullDirectoryInformation = 2,
  FileBothDirectoryInformation = 3,
  FileBasicInformation = 4,
  FileStandardInformation = 5,
  FileInternalInformation = 6,
  FileEaInformation = 7,
  FileAccessInformation = 8,
  FileNameInformation = 9,
  FileRenameInformation = 10,
  FileLinkInformation = 11,
  FileNamesInformation = 12,
  FileDispositionInformation = 13,
  FilePositionInformation = 14,
  FileFullEaInformation = 15,
  FileModeInformation = 16,
  FileAlignmentInformation = 17,
  FileAllInformation = 18,
  FileAllocationInformation = 19,
  FileEndOfFileInformation = 20,
  FileAlternateNameInformation = 21,
  FileStreamInformation = 22,
  FilePipeInformation = 23,
  FilePipeLocalInformation = 24,
  FilePipeRemoteInformation = 25,
  FileMailslotQueryInformation = 26,
  FileMailslotSetInformation = 27,
  FileCompressionInformation = 28,
  FileObjectIdInformation = 29,
  FileCompletionInformation = 30,
  FileMoveClusterInformation = 31,
  FileQuotaInformation = 32,
  FileReparsePointInformation = 33,
  FileNetworkOpenInformation = 34,
  FileAttributeTagInformation = 35,
  FileTrackingInformation = 36,
  FileIdBothDirectoryInformation = 37,
  FileIdFullDirectoryInformation = 38,
  FileValidDataLengthInformation = 39,
  FileShortNameInformation = 40,
  FileIoCompletionNotificationInformation = 41,
  FileIoStatusBlockRangeInformation = 42,
  FileIoPriorityHintInformation = 43,
  FileSfioReserveInformation = 44,
  FileSfioVolumeInformation = 45,
  FileHardLinkInformation = 46,
  FileProcessIdsUsingFileInformation = 47,
  FileNormalizedNameInformation = 48,
  FileNetworkPhysicalNameInformation = 49,
  FileIdGlobalTxDirectoryInformation = 50,
  FileIsRemoteDeviceInformation = 51,
  FileUnusedInformation = 52,
  FileNumaNodeInformation = 53,
  FileStandardLinkInformation = 54,
  FileRemoteProtocolInformation = 55,
  FileRenameInformationBypassAccessCheck = 56,
  FileLinkInformationBypassAccessCheck = 57,
  FileVolumeNameInformation = 58,
  FileIdInformation = 59,
  FileIdExtdDirectoryInformation = 60,
  FileReplaceCompletionInformation = 61,
  FileHardLinkFullIdInformation = 62,
  FileIdExtdBothDirectoryInformation = 63,
  FileMaximumInformation = 64,
} FILE_INFORMATION_CLASS, *PFILE_INFORMATION_CLASS;

typedef struct _FILE_NETWORK_OPEN_INFORMATION
{
  /* 0x0000 */ union _LARGE_INTEGER CreationTime;
  /* 0x0008 */ union _LARGE_INTEGER LastAccessTime;
  /* 0x0010 */ union _LARGE_INTEGER LastWriteTime;
  /* 0x0018 */ union _LARGE_INTEGER ChangeTime;
  /* 0x0020 */ union _LARGE_INTEGER AllocationSize;
  /* 0x0028 */ union _LARGE_INTEGER EndOfFile;
  /* 0x0030 */ unsigned long FileAttributes;
  /* 0x0034 */ long __PADDING__[1];
} FILE_NETWORK_OPEN_INFORMATION, *PFILE_NETWORK_OPEN_INFORMATION; /* size: 0x0038 */

typedef struct _FILE_OBJECT
{
  /* 0x0000 */ short Type;
  /* 0x0002 */ short Size;
  /* 0x0004 */ struct _DEVICE_OBJECT* DeviceObject;
  /* 0x0008 */ struct _VPB* Vpb;
  /* 0x000c */ void* FsContext;
  /* 0x0010 */ void* FsContext2;
  /* 0x0014 */ struct _SECTION_OBJECT_POINTERS* SectionObjectPointer;
  /* 0x0018 */ void* PrivateCacheMap;
  /* 0x001c */ long FinalStatus;
  /* 0x0020 */ struct _FILE_OBJECT* RelatedFileObject;
  /* 0x0024 */ unsigned char LockOperation;
  /* 0x0025 */ unsigned char DeletePending;
  /* 0x0026 */ unsigned char ReadAccess;
  /* 0x0027 */ unsigned char WriteAccess;
  /* 0x0028 */ unsigned char DeleteAccess;
  /* 0x0029 */ unsigned char SharedRead;
  /* 0x002a */ unsigned char SharedWrite;
  /* 0x002b */ unsigned char SharedDelete;
  /* 0x002c */ unsigned long Flags;
  /* 0x0030 */ struct _UNICODE_STRING FileName;
  /* 0x0038 */ union _LARGE_INTEGER CurrentByteOffset;
  /* 0x0040 */ unsigned long Waiters;
  /* 0x0044 */ unsigned long Busy;
  /* 0x0048 */ void* LastLock;
  /* 0x004c */ struct _KEVENT Lock;
  /* 0x005c */ struct _KEVENT Event;
  /* 0x006c */ struct _IO_COMPLETION_CONTEXT* CompletionContext;
  /* 0x0070 */ unsigned long IrpListLock;
  /* 0x0074 */ struct _LIST_ENTRY IrpList;
  /* 0x007c */ void* FileObjectExtension;
} FILE_OBJECT, *PFILE_OBJECT; /* size: 0x0080 */

typedef struct _FILE_STANDARD_INFORMATION
{
  /* 0x0000 */ union _LARGE_INTEGER AllocationSize;
  /* 0x0008 */ union _LARGE_INTEGER EndOfFile;
  /* 0x0010 */ unsigned long NumberOfLinks;
  /* 0x0014 */ unsigned char DeletePending;
  /* 0x0015 */ unsigned char Directory;
  /* 0x0016 */ char __PADDING__[2];
} FILE_STANDARD_INFORMATION, *PFILE_STANDARD_INFORMATION; /* size: 0x0018 */

typedef struct _FILTER_PAUSE_RESTART_CONTEXT
{
  /* 0x0000 */ struct _NDIS_FILTER_BLOCK* Filter;
  /* 0x0004 */ int Status;
  /* 0x0008 */ struct _KEVENT Event;
} FILTER_PAUSE_RESTART_CONTEXT, *PFILTER_PAUSE_RESTART_CONTEXT; /* size: 0x0018 */

typedef struct _FLOATING_SAVE_AREA
{
  /* 0x0000 */ unsigned long ControlWord;
  /* 0x0004 */ unsigned long StatusWord;
  /* 0x0008 */ unsigned long TagWord;
  /* 0x000c */ unsigned long ErrorOffset;
  /* 0x0010 */ unsigned long ErrorSelector;
  /* 0x0014 */ unsigned long DataOffset;
  /* 0x0018 */ unsigned long DataSelector;
  /* 0x001c */ unsigned char RegisterArea[80];
  /* 0x006c */ unsigned long Spare0;
} FLOATING_SAVE_AREA, *PFLOATING_SAVE_AREA; /* size: 0x0070 */

struct _FLS_CALLBACK_INFO;

typedef enum _FSINFOCLASS
{
  FileFsVolumeInformation = 1,
  FileFsLabelInformation = 2,
  FileFsSizeInformation = 3,
  FileFsDeviceInformation = 4,
  FileFsAttributeInformation = 5,
  FileFsControlInformation = 6,
  FileFsFullSizeInformation = 7,
  FileFsObjectIdInformation = 8,
  FileFsDriverPathInformation = 9,
  FileFsVolumeFlagsInformation = 10,
  FileFsSectorSizeInformation = 11,
  FileFsDataCopyInformation = 12,
  FileFsMetadataSizeInformation = 13,
  FileFsMaximumInformation = 14,
} FSINFOCLASS, *PFSINFOCLASS;

typedef struct _GDI_TEB_BATCH
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned long Offset : 31; /* bit position: 0 */
    /* 0x0000 */ unsigned long HasRenderingCommand : 1; /* bit position: 31 */
  }; /* bitfield */
  /* 0x0004 */ unsigned long HDC;
  /* 0x0008 */ unsigned long Buffer[310];
} GDI_TEB_BATCH, *PGDI_TEB_BATCH; /* size: 0x04e0 */

typedef struct _GENERAL_LOOKASIDE
{
  union
  {
    /* 0x0000 */ union _SLIST_HEADER ListHead;
    /* 0x0000 */ struct _SINGLE_LIST_ENTRY SingleListHead;
  }; /* size: 0x0008 */
  /* 0x0008 */ unsigned short Depth;
  /* 0x000a */ unsigned short MaximumDepth;
  /* 0x000c */ unsigned long TotalAllocates;
  union
  {
    /* 0x0010 */ unsigned long AllocateMisses;
    /* 0x0010 */ unsigned long AllocateHits;
  }; /* size: 0x0004 */
  /* 0x0014 */ unsigned long TotalFrees;
  union
  {
    /* 0x0018 */ unsigned long FreeMisses;
    /* 0x0018 */ unsigned long FreeHits;
  }; /* size: 0x0004 */
  /* 0x001c */ enum _POOL_TYPE Type;
  /* 0x0020 */ unsigned long Tag;
  /* 0x0024 */ unsigned long Size;
  union
  {
    /* 0x0028 */ void* AllocateEx /* function */;
    /* 0x0028 */ void* Allocate /* function */;
  }; /* size: 0x0004 */
  union
  {
    /* 0x002c */ void* FreeEx /* function */;
    /* 0x002c */ void* Free /* function */;
  }; /* size: 0x0004 */
  /* 0x0030 */ struct _LIST_ENTRY ListEntry;
  /* 0x0038 */ unsigned long LastTotalAllocates;
  union
  {
    /* 0x003c */ unsigned long LastAllocateMisses;
    /* 0x003c */ unsigned long LastAllocateHits;
  }; /* size: 0x0004 */
  /* 0x0040 */ unsigned long Future[2];
} GENERAL_LOOKASIDE, *PGENERAL_LOOKASIDE; /* size: 0x0048 */

typedef struct _GENERAL_LOOKASIDE_POOL
{
  union
  {
    /* 0x0000 */ union _SLIST_HEADER ListHead;
    /* 0x0000 */ struct _SINGLE_LIST_ENTRY SingleListHead;
  }; /* size: 0x0008 */
  /* 0x0008 */ unsigned short Depth;
  /* 0x000a */ unsigned short MaximumDepth;
  /* 0x000c */ unsigned long TotalAllocates;
  union
  {
    /* 0x0010 */ unsigned long AllocateMisses;
    /* 0x0010 */ unsigned long AllocateHits;
  }; /* size: 0x0004 */
  /* 0x0014 */ unsigned long TotalFrees;
  union
  {
    /* 0x0018 */ unsigned long FreeMisses;
    /* 0x0018 */ unsigned long FreeHits;
  }; /* size: 0x0004 */
  /* 0x001c */ enum _POOL_TYPE Type;
  /* 0x0020 */ unsigned long Tag;
  /* 0x0024 */ unsigned long Size;
  union
  {
    /* 0x0028 */ void* AllocateEx /* function */;
    /* 0x0028 */ void* Allocate /* function */;
  }; /* size: 0x0004 */
  union
  {
    /* 0x002c */ void* FreeEx /* function */;
    /* 0x002c */ void* Free /* function */;
  }; /* size: 0x0004 */
  /* 0x0030 */ struct _LIST_ENTRY ListEntry;
  /* 0x0038 */ unsigned long LastTotalAllocates;
  union
  {
    /* 0x003c */ unsigned long LastAllocateMisses;
    /* 0x003c */ unsigned long LastAllocateHits;
  }; /* size: 0x0004 */
  /* 0x0040 */ unsigned long Future[2];
} GENERAL_LOOKASIDE_POOL, *PGENERAL_LOOKASIDE_POOL; /* size: 0x0048 */

typedef struct _GENERIC_MAPPING
{
  /* 0x0000 */ unsigned long GenericRead;
  /* 0x0004 */ unsigned long GenericWrite;
  /* 0x0008 */ unsigned long GenericExecute;
  /* 0x000c */ unsigned long GenericAll;
} GENERIC_MAPPING, *PGENERIC_MAPPING; /* size: 0x0010 */

typedef struct _GEN_GET_NETCARD_TIME
{
  /* 0x0000 */ unsigned __int64 ReadTime;
} GEN_GET_NETCARD_TIME, *PGEN_GET_NETCARD_TIME; /* size: 0x0008 */

typedef struct _GEN_GET_TIME_CAPS
{
  /* 0x0000 */ unsigned long Flags;
  /* 0x0004 */ unsigned long ClockPrecision;
} GEN_GET_TIME_CAPS, *PGEN_GET_TIME_CAPS; /* size: 0x0008 */

typedef struct _GROUP_AFFINITY
{
  /* 0x0000 */ unsigned long Mask;
  /* 0x0004 */ unsigned short Group;
  /* 0x0006 */ unsigned short Reserved[3];
} GROUP_AFFINITY, *PGROUP_AFFINITY; /* size: 0x000c */

typedef struct _GUID
{
  /* 0x0000 */ unsigned long Data1;
  /* 0x0004 */ unsigned short Data2;
  /* 0x0006 */ unsigned short Data3;
  /* 0x0008 */ unsigned char Data4[8];
} GUID, *PGUID; /* size: 0x0010 */

typedef struct _IF_COUNTED_STRING_LH
{
  /* 0x0000 */ unsigned short Length;
  /* 0x0002 */ wchar_t String[257];
} IF_COUNTED_STRING_LH, *PIF_COUNTED_STRING_LH; /* size: 0x0204 */

typedef struct _IF_PHYSICAL_ADDRESS_LH
{
  /* 0x0000 */ unsigned short Length;
  /* 0x0002 */ unsigned char Address[32];
} IF_PHYSICAL_ADDRESS_LH, *PIF_PHYSICAL_ADDRESS_LH; /* size: 0x0022 */

typedef struct _IMAGE_DATA_DIRECTORY
{
  /* 0x0000 */ unsigned long VirtualAddress;
  /* 0x0004 */ unsigned long Size;
} IMAGE_DATA_DIRECTORY, *PIMAGE_DATA_DIRECTORY; /* size: 0x0008 */

typedef struct _IMAGE_DOS_HEADER
{
  /* 0x0000 */ unsigned short e_magic;
  /* 0x0002 */ unsigned short e_cblp;
  /* 0x0004 */ unsigned short e_cp;
  /* 0x0006 */ unsigned short e_crlc;
  /* 0x0008 */ unsigned short e_cparhdr;
  /* 0x000a */ unsigned short e_minalloc;
  /* 0x000c */ unsigned short e_maxalloc;
  /* 0x000e */ unsigned short e_ss;
  /* 0x0010 */ unsigned short e_sp;
  /* 0x0012 */ unsigned short e_csum;
  /* 0x0014 */ unsigned short e_ip;
  /* 0x0016 */ unsigned short e_cs;
  /* 0x0018 */ unsigned short e_lfarlc;
  /* 0x001a */ unsigned short e_ovno;
  /* 0x001c */ unsigned short e_res[4];
  /* 0x0024 */ unsigned short e_oemid;
  /* 0x0026 */ unsigned short e_oeminfo;
  /* 0x0028 */ unsigned short e_res2[10];
  /* 0x003c */ long e_lfanew;
} IMAGE_DOS_HEADER, *PIMAGE_DOS_HEADER; /* size: 0x0040 */

typedef struct _IMAGE_FILE_HEADER
{
  /* 0x0000 */ unsigned short Machine;
  /* 0x0002 */ unsigned short NumberOfSections;
  /* 0x0004 */ unsigned long TimeDateStamp;
  /* 0x0008 */ unsigned long PointerToSymbolTable;
  /* 0x000c */ unsigned long NumberOfSymbols;
  /* 0x0010 */ unsigned short SizeOfOptionalHeader;
  /* 0x0012 */ unsigned short Characteristics;
} IMAGE_FILE_HEADER, *PIMAGE_FILE_HEADER; /* size: 0x0014 */

typedef struct _IMAGE_NT_HEADERS
{
  /* 0x0000 */ unsigned long Signature;
  /* 0x0004 */ struct _IMAGE_FILE_HEADER FileHeader;
  /* 0x0018 */ struct _IMAGE_OPTIONAL_HEADER OptionalHeader;
} IMAGE_NT_HEADERS, *PIMAGE_NT_HEADERS; /* size: 0x00f8 */

typedef struct _IMAGE_OPTIONAL_HEADER
{
  /* 0x0000 */ unsigned short Magic;
  /* 0x0002 */ unsigned char MajorLinkerVersion;
  /* 0x0003 */ unsigned char MinorLinkerVersion;
  /* 0x0004 */ unsigned long SizeOfCode;
  /* 0x0008 */ unsigned long SizeOfInitializedData;
  /* 0x000c */ unsigned long SizeOfUninitializedData;
  /* 0x0010 */ unsigned long AddressOfEntryPoint;
  /* 0x0014 */ unsigned long BaseOfCode;
  /* 0x0018 */ unsigned long BaseOfData;
  /* 0x001c */ unsigned long ImageBase;
  /* 0x0020 */ unsigned long SectionAlignment;
  /* 0x0024 */ unsigned long FileAlignment;
  /* 0x0028 */ unsigned short MajorOperatingSystemVersion;
  /* 0x002a */ unsigned short MinorOperatingSystemVersion;
  /* 0x002c */ unsigned short MajorImageVersion;
  /* 0x002e */ unsigned short MinorImageVersion;
  /* 0x0030 */ unsigned short MajorSubsystemVersion;
  /* 0x0032 */ unsigned short MinorSubsystemVersion;
  /* 0x0034 */ unsigned long Win32VersionValue;
  /* 0x0038 */ unsigned long SizeOfImage;
  /* 0x003c */ unsigned long SizeOfHeaders;
  /* 0x0040 */ unsigned long CheckSum;
  /* 0x0044 */ unsigned short Subsystem;
  /* 0x0046 */ unsigned short DllCharacteristics;
  /* 0x0048 */ unsigned long SizeOfStackReserve;
  /* 0x004c */ unsigned long SizeOfStackCommit;
  /* 0x0050 */ unsigned long SizeOfHeapReserve;
  /* 0x0054 */ unsigned long SizeOfHeapCommit;
  /* 0x0058 */ unsigned long LoaderFlags;
  /* 0x005c */ unsigned long NumberOfRvaAndSizes;
  /* 0x0060 */ struct _IMAGE_DATA_DIRECTORY DataDirectory[16];
} IMAGE_OPTIONAL_HEADER, *PIMAGE_OPTIONAL_HEADER; /* size: 0x00e0 */

typedef struct _INITIAL_PRIVILEGE_SET
{
  /* 0x0000 */ unsigned long PrivilegeCount;
  /* 0x0004 */ unsigned long Control;
  /* 0x0008 */ struct _LUID_AND_ATTRIBUTES Privilege[3];
} INITIAL_PRIVILEGE_SET, *PINITIAL_PRIVILEGE_SET; /* size: 0x002c */

typedef struct _INTERFACE
{
  /* 0x0000 */ unsigned short Size;
  /* 0x0002 */ unsigned short Version;
  /* 0x0004 */ void* Context;
  /* 0x0008 */ void* InterfaceReference /* function */;
  /* 0x000c */ void* InterfaceDereference /* function */;
} INTERFACE, *PINTERFACE; /* size: 0x0010 */

typedef enum _INTERFACE_TYPE
{
  InterfaceTypeUndefined = -1,
  Internal = 0,
  Isa = 1,
  Eisa = 2,
  MicroChannel = 3,
  TurboChannel = 4,
  PCIBus = 5,
  VMEBus = 6,
  NuBus = 7,
  PCMCIABus = 8,
  CBus = 9,
  MPIBus = 10,
  MPSABus = 11,
  ProcessorInternal = 12,
  InternalPowerBus = 13,
  PNPISABus = 14,
  PNPBus = 15,
  Vmcs = 16,
  ACPIBus = 17,
  MaximumInterfaceType = 18,
} INTERFACE_TYPE, *PINTERFACE_TYPE;

typedef enum _IO_ALLOCATION_ACTION
{
  KeepObject = 1,
  DeallocateObject = 2,
  DeallocateObjectKeepRegisters = 3,
} IO_ALLOCATION_ACTION, *PIO_ALLOCATION_ACTION;

typedef struct _IO_COMPLETION_CONTEXT
{
  /* 0x0000 */ void* Port;
  /* 0x0004 */ void* Key;
} IO_COMPLETION_CONTEXT, *PIO_COMPLETION_CONTEXT; /* size: 0x0008 */

typedef struct _IO_DRIVER_CREATE_CONTEXT
{
  /* 0x0000 */ short Size;
  /* 0x0004 */ struct _ECP_LIST* ExtraCreateParameter;
  /* 0x0008 */ void* DeviceObjectHint;
  /* 0x000c */ struct _TXN_PARAMETER_BLOCK* TxnParameters;
} IO_DRIVER_CREATE_CONTEXT, *PIO_DRIVER_CREATE_CONTEXT; /* size: 0x0010 */

typedef struct _IO_INTERRUPT_MESSAGE_INFO
{
  /* 0x0000 */ unsigned char UnifiedIrql;
  /* 0x0004 */ unsigned long MessageCount;
  /* 0x0008 */ struct _IO_INTERRUPT_MESSAGE_INFO_ENTRY MessageInfo[1];
} IO_INTERRUPT_MESSAGE_INFO, *PIO_INTERRUPT_MESSAGE_INFO; /* size: 0x0030 */

typedef struct _IO_INTERRUPT_MESSAGE_INFO_ENTRY
{
  /* 0x0000 */ union _LARGE_INTEGER MessageAddress;
  /* 0x0008 */ unsigned long TargetProcessorSet;
  /* 0x000c */ struct _KINTERRUPT* InterruptObject;
  /* 0x0010 */ unsigned long MessageData;
  /* 0x0014 */ unsigned long Vector;
  /* 0x0018 */ unsigned char Irql;
  /* 0x001c */ enum _KINTERRUPT_MODE Mode;
  /* 0x0020 */ enum _KINTERRUPT_POLARITY Polarity;
  /* 0x0024 */ long __PADDING__[1];
} IO_INTERRUPT_MESSAGE_INFO_ENTRY, *PIO_INTERRUPT_MESSAGE_INFO_ENTRY; /* size: 0x0028 */

typedef enum _IO_PRIORITY_HINT
{
  IoPriorityVeryLow = 0,
  IoPriorityLow = 1,
  IoPriorityNormal = 2,
  IoPriorityHigh = 3,
  IoPriorityCritical = 4,
  MaxIoPriorityTypes = 5,
} IO_PRIORITY_HINT, *PIO_PRIORITY_HINT;

typedef struct _IO_PRIORITY_INFO
{
  /* 0x0000 */ unsigned long Size;
  /* 0x0004 */ unsigned long ThreadPriority;
  /* 0x0008 */ unsigned long PagePriority;
  /* 0x000c */ enum _IO_PRIORITY_HINT IoPriority;
} IO_PRIORITY_INFO, *PIO_PRIORITY_INFO; /* size: 0x0010 */

typedef struct _IO_REMOVE_LOCK
{
  /* 0x0000 */ struct _IO_REMOVE_LOCK_COMMON_BLOCK Common;
} IO_REMOVE_LOCK, *PIO_REMOVE_LOCK; /* size: 0x0018 */

typedef struct _IO_REMOVE_LOCK_COMMON_BLOCK
{
  /* 0x0000 */ unsigned char Removed;
  /* 0x0001 */ unsigned char Reserved[3];
  /* 0x0004 */ long IoCount;
  /* 0x0008 */ struct _KEVENT RemoveEvent;
} IO_REMOVE_LOCK_COMMON_BLOCK, *PIO_REMOVE_LOCK_COMMON_BLOCK; /* size: 0x0018 */

typedef struct _IO_RESOURCE_DESCRIPTOR
{
  /* 0x0000 */ unsigned char Option;
  /* 0x0001 */ unsigned char Type;
  /* 0x0002 */ unsigned char ShareDisposition;
  /* 0x0003 */ unsigned char Spare1;
  /* 0x0004 */ unsigned short Flags;
  /* 0x0006 */ unsigned short Spare2;
  union
  {
    union
    {
      struct
      {
        /* 0x0008 */ unsigned long Length;
        /* 0x000c */ unsigned long Alignment;
        /* 0x0010 */ union _LARGE_INTEGER MinimumAddress;
        /* 0x0018 */ union _LARGE_INTEGER MaximumAddress;
      } /* size: 0x0018 */ Port;
      struct
      {
        /* 0x0008 */ unsigned long Length;
        /* 0x000c */ unsigned long Alignment;
        /* 0x0010 */ union _LARGE_INTEGER MinimumAddress;
        /* 0x0018 */ union _LARGE_INTEGER MaximumAddress;
      } /* size: 0x0018 */ Memory;
      struct
      {
        /* 0x0008 */ unsigned long MinimumVector;
        /* 0x000c */ unsigned long MaximumVector;
        /* 0x0010 */ unsigned short AffinityPolicy;
        /* 0x0012 */ unsigned short Group;
        /* 0x0014 */ enum _IRQ_PRIORITY PriorityPolicy;
        /* 0x0018 */ unsigned long TargetedProcessors;
      } /* size: 0x0014 */ Interrupt;
      struct
      {
        /* 0x0008 */ unsigned long MinimumChannel;
        /* 0x000c */ unsigned long MaximumChannel;
      } /* size: 0x0008 */ Dma;
      struct
      {
        /* 0x0008 */ unsigned long RequestLine;
        /* 0x000c */ unsigned long Reserved;
        /* 0x0010 */ unsigned long Channel;
        /* 0x0014 */ unsigned long TransferWidth;
      } /* size: 0x0010 */ DmaV3;
      struct
      {
        /* 0x0008 */ unsigned long Length;
        /* 0x000c */ unsigned long Alignment;
        /* 0x0010 */ union _LARGE_INTEGER MinimumAddress;
        /* 0x0018 */ union _LARGE_INTEGER MaximumAddress;
      } /* size: 0x0018 */ Generic;
      struct
      {
        /* 0x0008 */ unsigned long Data[3];
      } /* size: 0x000c */ DevicePrivate;
      struct
      {
        /* 0x0008 */ unsigned long Length;
        /* 0x000c */ unsigned long MinBusNumber;
        /* 0x0010 */ unsigned long MaxBusNumber;
        /* 0x0014 */ unsigned long Reserved;
      } /* size: 0x0010 */ BusNumber;
      struct
      {
        /* 0x0008 */ unsigned long Priority;
        /* 0x000c */ unsigned long Reserved1;
        /* 0x0010 */ unsigned long Reserved2;
      } /* size: 0x000c */ ConfigData;
      struct
      {
        /* 0x0008 */ unsigned long Length40;
        /* 0x000c */ unsigned long Alignment40;
        /* 0x0010 */ union _LARGE_INTEGER MinimumAddress;
        /* 0x0018 */ union _LARGE_INTEGER MaximumAddress;
      } /* size: 0x0018 */ Memory40;
      struct
      {
        /* 0x0008 */ unsigned long Length48;
        /* 0x000c */ unsigned long Alignment48;
        /* 0x0010 */ union _LARGE_INTEGER MinimumAddress;
        /* 0x0018 */ union _LARGE_INTEGER MaximumAddress;
      } /* size: 0x0018 */ Memory48;
      struct
      {
        /* 0x0008 */ unsigned long Length64;
        /* 0x000c */ unsigned long Alignment64;
        /* 0x0010 */ union _LARGE_INTEGER MinimumAddress;
        /* 0x0018 */ union _LARGE_INTEGER MaximumAddress;
      } /* size: 0x0018 */ Memory64;
      struct
      {
        /* 0x0008 */ unsigned char Class;
        /* 0x0009 */ unsigned char Type;
        /* 0x000a */ unsigned char Reserved1;
        /* 0x000b */ unsigned char Reserved2;
        /* 0x000c */ unsigned long IdLowPart;
        /* 0x0010 */ unsigned long IdHighPart;
      } /* size: 0x000c */ Connection;
    }; /* size: 0x0018 */
  } /* size: 0x0018 */ u;
} IO_RESOURCE_DESCRIPTOR, *PIO_RESOURCE_DESCRIPTOR; /* size: 0x0020 */

typedef struct _IO_RESOURCE_LIST
{
  /* 0x0000 */ unsigned short Version;
  /* 0x0002 */ unsigned short Revision;
  /* 0x0004 */ unsigned long Count;
  /* 0x0008 */ struct _IO_RESOURCE_DESCRIPTOR Descriptors[1];
} IO_RESOURCE_LIST, *PIO_RESOURCE_LIST; /* size: 0x0028 */

typedef struct _IO_RESOURCE_REQUIREMENTS_LIST
{
  /* 0x0000 */ unsigned long ListSize;
  /* 0x0004 */ enum _INTERFACE_TYPE InterfaceType;
  /* 0x0008 */ unsigned long BusNumber;
  /* 0x000c */ unsigned long SlotNumber;
  /* 0x0010 */ unsigned long Reserved[3];
  /* 0x001c */ unsigned long AlternativeLists;
  /* 0x0020 */ struct _IO_RESOURCE_LIST List[1];
} IO_RESOURCE_REQUIREMENTS_LIST, *PIO_RESOURCE_REQUIREMENTS_LIST; /* size: 0x0048 */

typedef struct _IO_SECURITY_CONTEXT
{
  /* 0x0000 */ struct _SECURITY_QUALITY_OF_SERVICE* SecurityQos;
  /* 0x0004 */ struct _ACCESS_STATE* AccessState;
  /* 0x0008 */ unsigned long DesiredAccess;
  /* 0x000c */ unsigned long FullCreateOptions;
} IO_SECURITY_CONTEXT, *PIO_SECURITY_CONTEXT; /* size: 0x0010 */

typedef struct _IO_STACK_LOCATION
{
  /* 0x0000 */ unsigned char MajorFunction;
  /* 0x0001 */ unsigned char MinorFunction;
  /* 0x0002 */ unsigned char Flags;
  /* 0x0003 */ unsigned char Control;
  union
  {
    union
    {
      struct
      {
        /* 0x0004 */ struct _IO_SECURITY_CONTEXT* SecurityContext;
        /* 0x0008 */ unsigned long Options;
        /* 0x000c */ unsigned short FileAttributes;
        /* 0x000e */ unsigned short ShareAccess;
        /* 0x0010 */ unsigned long EaLength;
      } /* size: 0x0010 */ Create;
      struct
      {
        /* 0x0004 */ struct _IO_SECURITY_CONTEXT* SecurityContext;
        /* 0x0008 */ unsigned long Options;
        /* 0x000c */ unsigned short Reserved;
        /* 0x000e */ unsigned short ShareAccess;
        /* 0x0010 */ struct _NAMED_PIPE_CREATE_PARAMETERS* Parameters;
      } /* size: 0x0010 */ CreatePipe;
      struct
      {
        /* 0x0004 */ struct _IO_SECURITY_CONTEXT* SecurityContext;
        /* 0x0008 */ unsigned long Options;
        /* 0x000c */ unsigned short Reserved;
        /* 0x000e */ unsigned short ShareAccess;
        /* 0x0010 */ struct _MAILSLOT_CREATE_PARAMETERS* Parameters;
      } /* size: 0x0010 */ CreateMailslot;
      struct
      {
        /* 0x0004 */ unsigned long Length;
        /* 0x0008 */ unsigned long Key;
        /* 0x000c */ union _LARGE_INTEGER ByteOffset;
      } /* size: 0x0010 */ Read;
      struct
      {
        /* 0x0004 */ unsigned long Length;
        /* 0x0008 */ unsigned long Key;
        /* 0x000c */ union _LARGE_INTEGER ByteOffset;
      } /* size: 0x0010 */ Write;
      struct
      {
        /* 0x0004 */ unsigned long Length;
        /* 0x0008 */ struct _UNICODE_STRING* FileName;
        /* 0x000c */ enum _FILE_INFORMATION_CLASS FileInformationClass;
        /* 0x0010 */ unsigned long FileIndex;
      } /* size: 0x0010 */ QueryDirectory;
      struct
      {
        /* 0x0004 */ unsigned long Length;
        /* 0x0008 */ unsigned long CompletionFilter;
      } /* size: 0x0008 */ NotifyDirectory;
      struct
      {
        /* 0x0004 */ unsigned long Length;
        /* 0x0008 */ enum _FILE_INFORMATION_CLASS FileInformationClass;
      } /* size: 0x0008 */ QueryFile;
      struct
      {
        /* 0x0004 */ unsigned long Length;
        /* 0x0008 */ enum _FILE_INFORMATION_CLASS FileInformationClass;
        /* 0x000c */ struct _FILE_OBJECT* FileObject;
        union
        {
          struct
          {
            /* 0x0010 */ unsigned char ReplaceIfExists;
            /* 0x0011 */ unsigned char AdvanceOnly;
          }; /* size: 0x0002 */
          /* 0x0010 */ unsigned long ClusterCount;
          /* 0x0010 */ void* DeleteHandle;
        }; /* size: 0x0004 */
      } /* size: 0x0010 */ SetFile;
      struct
      {
        /* 0x0004 */ unsigned long Length;
        /* 0x0008 */ enum _FSINFOCLASS FsInformationClass;
      } /* size: 0x0008 */ QueryVolume;
      struct
      {
        /* 0x0004 */ unsigned long OutputBufferLength;
        /* 0x0008 */ unsigned long InputBufferLength;
        /* 0x000c */ unsigned long FsControlCode;
        /* 0x0010 */ void* Type3InputBuffer;
      } /* size: 0x0010 */ FileSystemControl;
      struct
      {
        /* 0x0004 */ union _LARGE_INTEGER* Length;
        /* 0x0008 */ unsigned long Key;
        /* 0x000c */ union _LARGE_INTEGER ByteOffset;
      } /* size: 0x0010 */ LockControl;
      struct
      {
        /* 0x0004 */ unsigned long OutputBufferLength;
        /* 0x0008 */ unsigned long InputBufferLength;
        /* 0x000c */ unsigned long IoControlCode;
        /* 0x0010 */ void* Type3InputBuffer;
      } /* size: 0x0010 */ DeviceIoControl;
      struct
      {
        /* 0x0004 */ unsigned long SecurityInformation;
        /* 0x0008 */ unsigned long Length;
      } /* size: 0x0008 */ QuerySecurity;
      struct
      {
        /* 0x0004 */ unsigned long SecurityInformation;
        /* 0x0008 */ void* SecurityDescriptor;
      } /* size: 0x0008 */ SetSecurity;
      struct
      {
        /* 0x0004 */ struct _VPB* Vpb;
        /* 0x0008 */ struct _DEVICE_OBJECT* DeviceObject;
      } /* size: 0x0008 */ MountVolume;
      struct
      {
        /* 0x0004 */ struct _VPB* Vpb;
        /* 0x0008 */ struct _DEVICE_OBJECT* DeviceObject;
      } /* size: 0x0008 */ VerifyVolume;
      struct
      {
        /* 0x0004 */ struct _SCSI_REQUEST_BLOCK* Srb;
      } /* size: 0x0004 */ Scsi;
      struct
      {
        /* 0x0004 */ enum _DEVICE_RELATION_TYPE Type;
      } /* size: 0x0004 */ QueryDeviceRelations;
      struct
      {
        /* 0x0004 */ const struct _GUID* InterfaceType;
        /* 0x0008 */ unsigned short Size;
        /* 0x000a */ unsigned short Version;
        /* 0x000c */ struct _INTERFACE* Interface;
        /* 0x0010 */ void* InterfaceSpecificData;
      } /* size: 0x0010 */ QueryInterface;
      struct
      {
        /* 0x0004 */ struct _DEVICE_CAPABILITIES* Capabilities;
      } /* size: 0x0004 */ DeviceCapabilities;
      struct
      {
        /* 0x0004 */ struct _IO_RESOURCE_REQUIREMENTS_LIST* IoResourceRequirementList;
      } /* size: 0x0004 */ FilterResourceRequirements;
      struct
      {
        /* 0x0004 */ unsigned long WhichSpace;
        /* 0x0008 */ void* Buffer;
        /* 0x000c */ unsigned long Offset;
        /* 0x0010 */ unsigned long Length;
      } /* size: 0x0010 */ ReadWriteConfig;
      struct
      {
        /* 0x0004 */ unsigned char Lock;
      } /* size: 0x0001 */ SetLock;
      struct
      {
        /* 0x0004 */ enum BUS_QUERY_ID_TYPE IdType;
      } /* size: 0x0004 */ QueryId;
      struct
      {
        /* 0x0004 */ enum DEVICE_TEXT_TYPE DeviceTextType;
        /* 0x0008 */ unsigned long LocaleId;
      } /* size: 0x0008 */ QueryDeviceText;
      struct
      {
        /* 0x0004 */ unsigned char InPath;
        /* 0x0005 */ unsigned char Reserved[3];
        /* 0x0008 */ enum _DEVICE_USAGE_NOTIFICATION_TYPE Type;
      } /* size: 0x0008 */ UsageNotification;
      struct
      {
        /* 0x0004 */ enum _SYSTEM_POWER_STATE PowerState;
      } /* size: 0x0004 */ WaitWake;
      struct
      {
        /* 0x0004 */ struct _POWER_SEQUENCE* PowerSequence;
      } /* size: 0x0004 */ PowerSequence;
      struct
      {
        union
        {
          /* 0x0004 */ unsigned long SystemContext;
          /* 0x0004 */ struct _SYSTEM_POWER_STATE_CONTEXT SystemPowerStateContext;
        }; /* size: 0x0004 */
        /* 0x0008 */ enum _POWER_STATE_TYPE Type;
        /* 0x000c */ union _POWER_STATE State;
        /* 0x0010 */ enum POWER_ACTION ShutdownType;
      } /* size: 0x0010 */ Power;
      struct
      {
        /* 0x0004 */ struct _CM_RESOURCE_LIST* AllocatedResources;
        /* 0x0008 */ struct _CM_RESOURCE_LIST* AllocatedResourcesTranslated;
      } /* size: 0x0008 */ StartDevice;
      struct
      {
        /* 0x0004 */ unsigned long ProviderId;
        /* 0x0008 */ void* DataPath;
        /* 0x000c */ unsigned long BufferSize;
        /* 0x0010 */ void* Buffer;
      } /* size: 0x0010 */ WMI;
      struct
      {
        /* 0x0004 */ void* Argument1;
        /* 0x0008 */ void* Argument2;
        /* 0x000c */ void* Argument3;
        /* 0x0010 */ void* Argument4;
      } /* size: 0x0010 */ Others;
    }; /* size: 0x0010 */
  } /* size: 0x0010 */ Parameters;
  /* 0x0014 */ struct _DEVICE_OBJECT* DeviceObject;
  /* 0x0018 */ struct _FILE_OBJECT* FileObject;
  /* 0x001c */ void* CompletionRoutine /* function */;
  /* 0x0020 */ void* Context;
} IO_STACK_LOCATION, *PIO_STACK_LOCATION; /* size: 0x0024 */

typedef struct _IO_STATUS_BLOCK
{
  union
  {
    /* 0x0000 */ long Status;
    /* 0x0000 */ void* Pointer;
  }; /* size: 0x0004 */
  /* 0x0004 */ unsigned long Information;
} IO_STATUS_BLOCK, *PIO_STATUS_BLOCK; /* size: 0x0008 */

struct _IO_TIMER;

typedef struct _IPSEC_OFFLOAD_V2_ADD_SA
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ struct _IPSEC_OFFLOAD_V2_ADD_SA* Next;
  /* 0x0008 */ unsigned long NumExtHdrs;
  /* 0x000c */ unsigned long Flags;
  union
  {
    struct
    {
      /* 0x0010 */ unsigned long SrcAddr;
      /* 0x0014 */ unsigned long DestAddr;
    } /* size: 0x0008 */ IPv4Endpoints;
    struct
    {
      /* 0x0010 */ unsigned char SrcAddr[16];
      /* 0x0020 */ unsigned char DestAddr[16];
    } /* size: 0x0020 */ IPv6Endpoints;
  }; /* size: 0x0020 */
  /* 0x0030 */ void* OffloadHandle;
  /* 0x0034 */ unsigned long UdpEspEncapsulation;
  /* 0x0038 */ struct _IPSEC_OFFLOAD_V2_SECURITY_ASSOCIATION SecAssoc[2];
  /* 0x0098 */ unsigned long KeyLength;
  /* 0x009c */ unsigned char KeyData[1];
  /* 0x009d */ char __PADDING__[3];
} IPSEC_OFFLOAD_V2_ADD_SA, *PIPSEC_OFFLOAD_V2_ADD_SA; /* size: 0x00a0 */

typedef struct _IPSEC_OFFLOAD_V2_ALGORITHM_INFO
{
  /* 0x0000 */ unsigned long Identifier;
  /* 0x0004 */ unsigned long KeyLength;
  /* 0x0008 */ unsigned long KeyOffsetBytes;
  /* 0x000c */ unsigned long AdditionalInfo;
} IPSEC_OFFLOAD_V2_ALGORITHM_INFO, *PIPSEC_OFFLOAD_V2_ALGORITHM_INFO; /* size: 0x0010 */

typedef struct _IPSEC_OFFLOAD_V2_DELETE_SA
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ struct _IPSEC_OFFLOAD_V2_DELETE_SA* Next;
  /* 0x0008 */ void* OffloadHandle;
} IPSEC_OFFLOAD_V2_DELETE_SA, *PIPSEC_OFFLOAD_V2_DELETE_SA; /* size: 0x000c */

typedef enum _IPSEC_OFFLOAD_V2_OPERATION
{
  IPsecOffloadV2Ah = 1,
  IPsecOffloadV2Esp = 2,
  IPsecOffloadV2Max = 3,
} IPSEC_OFFLOAD_V2_OPERATION, *PIPSEC_OFFLOAD_V2_OPERATION;

typedef struct _IPSEC_OFFLOAD_V2_SECURITY_ASSOCIATION
{
  /* 0x0000 */ unsigned long Flags;
  /* 0x0004 */ enum _IPSEC_OFFLOAD_V2_OPERATION Operation;
  /* 0x0008 */ unsigned long Spi;
  /* 0x000c */ struct _IPSEC_OFFLOAD_V2_ALGORITHM_INFO AuthenticationAlgorithm;
  /* 0x001c */ struct _IPSEC_OFFLOAD_V2_ALGORITHM_INFO EncryptionAlgorithm;
  /* 0x002c */ unsigned long SequenceNumberHighOrder;
} IPSEC_OFFLOAD_V2_SECURITY_ASSOCIATION, *PIPSEC_OFFLOAD_V2_SECURITY_ASSOCIATION; /* size: 0x0030 */

typedef struct _IPSEC_OFFLOAD_V2_UPDATE_SA
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ void* OffloadHandle;
  /* 0x0008 */ enum _IPSEC_OFFLOAD_V2_OPERATION Operation;
  /* 0x000c */ unsigned long Spi;
  /* 0x0010 */ unsigned long SequenceNumberHighOrder;
} IPSEC_OFFLOAD_V2_UPDATE_SA, *PIPSEC_OFFLOAD_V2_UPDATE_SA; /* size: 0x0014 */

typedef struct _IPV4_HEADER
{
  union
  {
    /* 0x0000 */ unsigned char VersionAndHeaderLength;
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned char HeaderLength : 4; /* bit position: 0 */
      /* 0x0000 */ unsigned char Version : 4; /* bit position: 4 */
    }; /* bitfield */
  }; /* size: 0x0001 */
  union
  {
    /* 0x0001 */ unsigned char TypeOfServiceAndEcnField;
    struct /* bitfield */
    {
      /* 0x0001 */ unsigned char EcnField : 2; /* bit position: 0 */
      /* 0x0001 */ unsigned char TypeOfService : 6; /* bit position: 2 */
    }; /* bitfield */
  }; /* size: 0x0001 */
  /* 0x0002 */ unsigned short TotalLength;
  /* 0x0004 */ unsigned short Identification;
  union
  {
    /* 0x0006 */ unsigned short FlagsAndOffset;
    struct /* bitfield */
    {
      /* 0x0006 */ unsigned short DontUse1 : 5; /* bit position: 0 */
      /* 0x0006 */ unsigned short MoreFragments : 1; /* bit position: 5 */
      /* 0x0006 */ unsigned short DontFragment : 1; /* bit position: 6 */
      /* 0x0006 */ unsigned short Reserved : 1; /* bit position: 7 */
      /* 0x0006 */ unsigned short DontUse2 : 8; /* bit position: 8 */
    }; /* bitfield */
  }; /* size: 0x0002 */
  /* 0x0008 */ unsigned char TimeToLive;
  /* 0x0009 */ unsigned char Protocol;
  /* 0x000a */ unsigned short HeaderChecksum;
  /* 0x000c */ struct in_addr SourceAddress;
  /* 0x0010 */ struct in_addr DestinationAddress;
} IPV4_HEADER, *PIPV4_HEADER; /* size: 0x0014 */

typedef struct _IPV6_FRAGMENT_HEADER
{
  /* 0x0000 */ unsigned char NextHeader;
  /* 0x0001 */ unsigned char Reserved;
  union
  {
    struct /* bitfield */
    {
      /* 0x0002 */ unsigned short DontUse1 : 8; /* bit position: 0 */
      /* 0x0002 */ unsigned short MoreFragments : 1; /* bit position: 8 */
      /* 0x0002 */ unsigned short ReservedBits : 2; /* bit position: 9 */
      /* 0x0002 */ unsigned short DontUse2 : 5; /* bit position: 11 */
    }; /* bitfield */
    /* 0x0002 */ unsigned short OffsetAndFlags;
  }; /* size: 0x0002 */
  /* 0x0004 */ unsigned int Id;
} IPV6_FRAGMENT_HEADER, *PIPV6_FRAGMENT_HEADER; /* size: 0x0008 */

typedef struct _IP_OFFLOAD_STATS
{
  /* 0x0000 */ unsigned __int64 InReceives;
  /* 0x0008 */ unsigned __int64 InOctets;
  /* 0x0010 */ unsigned __int64 InDelivers;
  /* 0x0018 */ unsigned __int64 OutRequests;
  /* 0x0020 */ unsigned __int64 OutOctets;
  /* 0x0028 */ unsigned long InHeaderErrors;
  /* 0x002c */ unsigned long InTruncatedPackets;
  /* 0x0030 */ unsigned long InDiscards;
  /* 0x0034 */ unsigned long OutDiscards;
  /* 0x0038 */ unsigned long OutNoRoutes;
  /* 0x003c */ long __PADDING__[1];
} IP_OFFLOAD_STATS, *PIP_OFFLOAD_STATS; /* size: 0x0040 */

typedef struct _IRP
{
  /* 0x0000 */ short Type;
  /* 0x0002 */ unsigned short Size;
  /* 0x0004 */ struct _MDL* MdlAddress;
  /* 0x0008 */ unsigned long Flags;
  union
  {
    union
    {
      /* 0x000c */ struct _IRP* MasterIrp;
      /* 0x000c */ long IrpCount;
      /* 0x000c */ void* SystemBuffer;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ AssociatedIrp;
  /* 0x0010 */ struct _LIST_ENTRY ThreadListEntry;
  /* 0x0018 */ struct _IO_STATUS_BLOCK IoStatus;
  /* 0x0020 */ char RequestorMode;
  /* 0x0021 */ unsigned char PendingReturned;
  /* 0x0022 */ char StackCount;
  /* 0x0023 */ char CurrentLocation;
  /* 0x0024 */ unsigned char Cancel;
  /* 0x0025 */ unsigned char CancelIrql;
  /* 0x0026 */ char ApcEnvironment;
  /* 0x0027 */ unsigned char AllocationFlags;
  /* 0x0028 */ struct _IO_STATUS_BLOCK* UserIosb;
  /* 0x002c */ struct _KEVENT* UserEvent;
  union
  {
    union
    {
      struct
      {
        union
        {
          /* 0x0030 */ void* UserApcRoutine /* function */;
          /* 0x0030 */ void* IssuingProcess;
        }; /* size: 0x0004 */
        /* 0x0034 */ void* UserApcContext;
      } /* size: 0x0008 */ AsynchronousParameters;
      /* 0x0030 */ union _LARGE_INTEGER AllocationSize;
    }; /* size: 0x0008 */
  } /* size: 0x0008 */ Overlay;
  /* 0x0038 */ void* CancelRoutine /* function */;
  /* 0x003c */ void* UserBuffer;
  union
  {
    union
    {
      struct
      {
        union
        {
          /* 0x0040 */ struct _KDEVICE_QUEUE_ENTRY DeviceQueueEntry;
          /* 0x0040 */ void* DriverContext[4];
        }; /* size: 0x0010 */
        /* 0x0050 */ struct _ETHREAD* Thread;
        /* 0x0054 */ char* AuxiliaryBuffer;
        /* 0x0058 */ struct _LIST_ENTRY ListEntry;
        union
        {
          /* 0x0060 */ struct _IO_STACK_LOCATION* CurrentStackLocation;
          /* 0x0060 */ unsigned long PacketType;
        }; /* size: 0x0004 */
        /* 0x0064 */ struct _FILE_OBJECT* OriginalFileObject;
        /* 0x0068 */ void* IrpExtension;
      } /* size: 0x002c */ Overlay;
      /* 0x0040 */ struct _KAPC Apc;
      /* 0x0040 */ void* CompletionKey;
    }; /* size: 0x0030 */
  } /* size: 0x0030 */ Tail;
} IRP, *PIRP; /* size: 0x0070 */

typedef enum _IRQ_PRIORITY
{
  IrqPriorityUndefined = 0,
  IrqPriorityLow = 1,
  IrqPriorityNormal = 2,
  IrqPriorityHigh = 3,
} IRQ_PRIORITY, *PIRQ_PRIORITY;

typedef enum _JOBOBJECTINFOCLASS
{
  JobObjectBasicAccountingInformation = 1,
  JobObjectBasicLimitInformation = 2,
  JobObjectBasicProcessIdList = 3,
  JobObjectBasicUIRestrictions = 4,
  JobObjectSecurityLimitInformation = 5,
  JobObjectEndOfJobTimeInformation = 6,
  JobObjectAssociateCompletionPortInformation = 7,
  JobObjectBasicAndIoAccountingInformation = 8,
  JobObjectExtendedLimitInformation = 9,
  JobObjectJobSetInformation = 10,
  JobObjectGroupInformation = 11,
  JobObjectNotificationLimitInformation = 12,
  JobObjectLimitViolationInformation = 13,
  JobObjectGroupInformationEx = 14,
  JobObjectCpuRateControlInformation = 15,
  JobObjectCompletionFilter = 16,
  JobObjectCompletionCounter = 17,
  JobObjectFreezeInformation = 18,
  JobObjectExtendedAccountingInformation = 19,
  JobObjectWakeInformation = 20,
  JobObjectBackgroundInformation = 21,
  JobObjectSchedulingRankBiasInformation = 22,
  JobObjectTimerVirtualizationInformation = 23,
  JobObjectCycleTimeNotification = 24,
  JobObjectClearEvent = 25,
  JobObjectInterferenceInformation = 26,
  JobObjectClearPeakJobMemoryUsed = 27,
  JobObjectMemoryUsageInformation = 28,
  JobObjectSharedCommit = 29,
  JobObjectContainerId = 30,
  JobObjectIoRateControlInformation = 31,
  JobObjectReserved1Information = 18,
  JobObjectReserved2Information = 19,
  JobObjectReserved3Information = 20,
  JobObjectReserved4Information = 21,
  JobObjectReserved5Information = 22,
  JobObjectReserved6Information = 23,
  JobObjectReserved7Information = 24,
  JobObjectReserved8Information = 25,
  JobObjectReserved9Information = 26,
  JobObjectReserved10Information = 27,
  JobObjectReserved11Information = 28,
  JobObjectReserved12Information = 29,
  JobObjectReserved13Information = 30,
  JobObjectReserved14Information = 31,
  JobObjectNetRateControlInformation = 32,
  JobObjectNotificationLimitInformation2 = 33,
  JobObjectLimitViolationInformation2 = 34,
  JobObjectCreateSilo = 35,
  JobObjectSiloBasicInformation = 36,
  JobObjectSiloRootDirectory = 37,
  JobObjectServerSiloBasicInformation = 38,
  JobObjectServerSiloServiceSessionId = 39,
  JobObjectServerSiloInitialize = 40,
  JobObjectServerSiloDefaultCompartmentId = 41,
  MaxJobObjectInfoClass = 42,
} JOBOBJECTINFOCLASS, *PJOBOBJECTINFOCLASS;

typedef struct _KAPC
{
  /* 0x0000 */ unsigned char Type;
  /* 0x0001 */ unsigned char SpareByte0;
  /* 0x0002 */ unsigned char Size;
  /* 0x0003 */ unsigned char SpareByte1;
  /* 0x0004 */ unsigned long SpareLong0;
  /* 0x0008 */ struct _KTHREAD* Thread;
  /* 0x000c */ struct _LIST_ENTRY ApcListEntry;
  union
  {
    struct
    {
      /* 0x0014 */ void* KernelRoutine /* function */;
      /* 0x0018 */ void* RundownRoutine /* function */;
      /* 0x001c */ void* NormalRoutine /* function */;
    }; /* size: 0x000c */
    /* 0x0014 */ void* Reserved[3];
  }; /* size: 0x000c */
  /* 0x0020 */ void* NormalContext;
  /* 0x0024 */ void* SystemArgument1;
  /* 0x0028 */ void* SystemArgument2;
  /* 0x002c */ char ApcStateIndex;
  /* 0x002d */ char ApcMode;
  /* 0x002e */ unsigned char Inserted;
  /* 0x002f */ char __PADDING__[1];
} KAPC, *PKAPC; /* size: 0x0030 */

typedef struct _KBUGCHECK_CALLBACK_RECORD
{
  /* 0x0000 */ struct _LIST_ENTRY Entry;
  /* 0x0008 */ void* CallbackRoutine /* function */;
  /* 0x000c */ void* Buffer;
  /* 0x0010 */ unsigned long Length;
  /* 0x0014 */ unsigned char* Component;
  /* 0x0018 */ unsigned long Checksum;
  /* 0x001c */ unsigned char State;
  /* 0x001d */ char __PADDING__[3];
} KBUGCHECK_CALLBACK_RECORD, *PKBUGCHECK_CALLBACK_RECORD; /* size: 0x0020 */

typedef struct _KDEVICE_QUEUE
{
  /* 0x0000 */ short Type;
  /* 0x0002 */ short Size;
  /* 0x0004 */ struct _LIST_ENTRY DeviceListHead;
  /* 0x000c */ unsigned long Lock;
  /* 0x0010 */ unsigned char Busy;
  /* 0x0011 */ char __PADDING__[3];
} KDEVICE_QUEUE, *PKDEVICE_QUEUE; /* size: 0x0014 */

typedef struct _KDEVICE_QUEUE_ENTRY
{
  /* 0x0000 */ struct _LIST_ENTRY DeviceListEntry;
  /* 0x0008 */ unsigned long SortKey;
  /* 0x000c */ unsigned char Inserted;
  /* 0x000d */ char __PADDING__[3];
} KDEVICE_QUEUE_ENTRY, *PKDEVICE_QUEUE_ENTRY; /* size: 0x0010 */

typedef struct _KDPC
{
  union
  {
    /* 0x0000 */ unsigned long TargetInfoAsUlong;
    struct
    {
      /* 0x0000 */ unsigned char Type;
      /* 0x0001 */ unsigned char Importance;
      /* 0x0002 */ volatile unsigned short Number;
    }; /* size: 0x0004 */
  }; /* size: 0x0004 */
  /* 0x0004 */ struct _SINGLE_LIST_ENTRY DpcListEntry;
  /* 0x0008 */ unsigned long ProcessorHistory;
  /* 0x000c */ void* DeferredRoutine /* function */;
  /* 0x0010 */ void* DeferredContext;
  /* 0x0014 */ void* SystemArgument1;
  /* 0x0018 */ void* SystemArgument2;
  /* 0x001c */ void* DpcData;
} KDPC, *PKDPC; /* size: 0x0020 */

typedef struct _KEVENT
{
  /* 0x0000 */ struct _DISPATCHER_HEADER Header;
} KEVENT, *PKEVENT; /* size: 0x0010 */

struct _KINTERRUPT;

typedef enum _KINTERRUPT_MODE
{
  LevelSensitive = 0,
  Latched = 1,
} KINTERRUPT_MODE, *PKINTERRUPT_MODE;

typedef enum _KINTERRUPT_POLARITY
{
  InterruptPolarityUnknown = 0,
  InterruptActiveHigh = 1,
  InterruptRisingEdge = 1,
  InterruptActiveLow = 2,
  InterruptFallingEdge = 2,
  InterruptActiveBoth = 3,
  InterruptActiveBothTriggerLow = 3,
  InterruptActiveBothTriggerHigh = 4,
} KINTERRUPT_POLARITY, *PKINTERRUPT_POLARITY;

typedef struct _KMUTANT
{
  /* 0x0000 */ struct _DISPATCHER_HEADER Header;
  /* 0x0010 */ struct _LIST_ENTRY MutantListEntry;
  /* 0x0018 */ struct _KTHREAD* OwnerThread;
  /* 0x001c */ unsigned char Abandoned;
  /* 0x001d */ unsigned char ApcDisable;
  /* 0x001e */ char __PADDING__[2];
} KMUTANT, *PKMUTANT; /* size: 0x0020 */

struct _KNODE;

typedef struct _KPRCB
{
  /* 0x0000 */ unsigned short MinorVersion;
  /* 0x0002 */ unsigned short MajorVersion;
  /* 0x0004 */ struct _KTHREAD* CurrentThread;
  /* 0x0008 */ struct _KTHREAD* NextThread;
  /* 0x000c */ struct _KTHREAD* IdleThread;
  /* 0x0010 */ unsigned char LegacyNumber;
  /* 0x0011 */ unsigned char NestingLevel;
  /* 0x0012 */ unsigned short BuildType;
  /* 0x0014 */ char CpuType;
  /* 0x0015 */ char CpuID;
  union
  {
    /* 0x0016 */ unsigned short CpuStep;
    struct
    {
      /* 0x0016 */ unsigned char CpuStepping;
      /* 0x0017 */ unsigned char CpuModel;
    }; /* size: 0x0002 */
  }; /* size: 0x0002 */
  /* 0x0018 */ struct _KPROCESSOR_STATE ProcessorState;
  /* 0x0338 */ struct _KNODE* ParentNode;
  /* 0x033c */ char* PriorityState;
  /* 0x0340 */ unsigned long KernelReserved[14];
  /* 0x0378 */ unsigned long HalReserved[16];
  /* 0x03b8 */ unsigned long CFlushSize;
  /* 0x03bc */ unsigned char CoresPerPhysicalProcessor;
  /* 0x03bd */ unsigned char LogicalProcessorsPerCore;
  /* 0x03be */ unsigned char CpuVendor;
  /* 0x03bf */ unsigned char PrcbPad0[1];
  /* 0x03c0 */ unsigned long MHz;
  /* 0x03c4 */ unsigned char GroupIndex;
  /* 0x03c5 */ unsigned char Group;
  /* 0x03c6 */ unsigned char PrcbPad05[2];
  /* 0x03c8 */ unsigned long GroupSetMember;
  /* 0x03cc */ unsigned long Number;
  /* 0x03d0 */ unsigned char ClockOwner;
  union
  {
    /* 0x03d1 */ unsigned char PendingTickFlags;
    struct /* bitfield */
    {
      /* 0x03d1 */ unsigned char PendingTick : 1; /* bit position: 0 */
      /* 0x03d1 */ unsigned char PendingBackupTick : 1; /* bit position: 1 */
    }; /* bitfield */
  }; /* size: 0x0001 */
  /* 0x03d2 */ unsigned char PrcbPad10[70];
  /* 0x0418 */ struct _KSPIN_LOCK_QUEUE LockQueue[17];
} KPRCB, *PKPRCB; /* size: 0x04a0 */

struct _KPROCESS;

typedef struct _KPROCESSOR_STATE
{
  /* 0x0000 */ struct _CONTEXT ContextFrame;
  /* 0x02cc */ struct _KSPECIAL_REGISTERS SpecialRegisters;
} KPROCESSOR_STATE, *PKPROCESSOR_STATE; /* size: 0x0320 */

typedef struct _KSALLOCATOR_DISPATCH
{
  /* 0x0000 */ void* InitializeAllocator /* function */;
  /* 0x0004 */ void* DeleteAllocator /* function */;
  /* 0x0008 */ void* Allocate /* function */;
  /* 0x000c */ void* Free /* function */;
} KSALLOCATOR_DISPATCH, *PKSALLOCATOR_DISPATCH; /* size: 0x0010 */

typedef struct _KSCLOCK_DISPATCH
{
  /* 0x0000 */ void* SetTimer /* function */;
  /* 0x0004 */ void* CancelTimer /* function */;
  /* 0x0008 */ void* CorrelatedTime /* function */;
  /* 0x000c */ void* Resolution /* function */;
} KSCLOCK_DISPATCH, *PKSCLOCK_DISPATCH; /* size: 0x0010 */

typedef struct _KSDEVICE
{
  /* 0x0000 */ const struct _KSDEVICE_DESCRIPTOR* Descriptor;
  /* 0x0004 */ void* Bag;
  /* 0x0008 */ void* Context;
  /* 0x000c */ struct _DEVICE_OBJECT* FunctionalDeviceObject;
  /* 0x0010 */ struct _DEVICE_OBJECT* PhysicalDeviceObject;
  /* 0x0014 */ struct _DEVICE_OBJECT* NextDeviceObject;
  /* 0x0018 */ unsigned char Started;
  /* 0x001c */ enum _SYSTEM_POWER_STATE SystemPowerState;
  /* 0x0020 */ enum _DEVICE_POWER_STATE DevicePowerState;
} KSDEVICE, *PKSDEVICE; /* size: 0x0024 */

typedef struct _KSDEVICE_DESCRIPTOR
{
  /* 0x0000 */ const struct _KSDEVICE_DISPATCH* Dispatch;
  /* 0x0004 */ unsigned long FilterDescriptorsCount;
  /* 0x0008 */ const struct _KSFILTER_DESCRIPTOR* const* FilterDescriptors;
  /* 0x000c */ unsigned long Version;
  /* 0x0010 */ unsigned long Flags;
  /* 0x0014 */ void* Alignment;
} KSDEVICE_DESCRIPTOR, *PKSDEVICE_DESCRIPTOR; /* size: 0x0018 */

typedef struct _KSDEVICE_DISPATCH
{
  /* 0x0000 */ void* Add /* function */;
  /* 0x0004 */ void* Start /* function */;
  /* 0x0008 */ void* PostStart /* function */;
  /* 0x000c */ void* QueryStop /* function */;
  /* 0x0010 */ void* CancelStop /* function */;
  /* 0x0014 */ void* Stop /* function */;
  /* 0x0018 */ void* QueryRemove /* function */;
  /* 0x001c */ void* CancelRemove /* function */;
  /* 0x0020 */ void* Remove /* function */;
  /* 0x0024 */ void* QueryCapabilities /* function */;
  /* 0x0028 */ void* SurpriseRemoval /* function */;
  /* 0x002c */ void* QueryPower /* function */;
  /* 0x0030 */ void* SetPower /* function */;
  /* 0x0034 */ void* QueryInterface /* function */;
} KSDEVICE_DISPATCH, *PKSDEVICE_DISPATCH; /* size: 0x0038 */

typedef struct _KSEMAPHORE
{
  /* 0x0000 */ struct _DISPATCHER_HEADER Header;
  /* 0x0010 */ long Limit;
} KSEMAPHORE, *PKSEMAPHORE; /* size: 0x0014 */

typedef struct _KSEVENT_ENTRY
{
  /* 0x0000 */ struct _LIST_ENTRY ListEntry;
  /* 0x0008 */ void* Object;
  union
  {
    /* 0x000c */ struct KSDPC_ITEM* DpcItem;
    /* 0x000c */ struct KSBUFFER_ITEM* BufferItem;
  }; /* size: 0x0004 */
  /* 0x0010 */ struct KSEVENTDATA* EventData;
  /* 0x0014 */ unsigned long NotificationType;
  /* 0x0018 */ const struct KSEVENT_SET* EventSet;
  /* 0x001c */ const struct KSEVENT_ITEM* EventItem;
  /* 0x0020 */ struct _FILE_OBJECT* FileObject;
  /* 0x0024 */ unsigned long SemaphoreAdjustment;
  /* 0x0028 */ unsigned long Reserved;
  /* 0x002c */ unsigned long Flags;
} KSEVENT_ENTRY, *PKSEVENT_ENTRY; /* size: 0x0030 */

typedef struct _KSFILTER
{
  /* 0x0000 */ const struct _KSFILTER_DESCRIPTOR* Descriptor;
  /* 0x0004 */ void* Bag;
  /* 0x0008 */ void* Context;
} KSFILTER, *PKSFILTER; /* size: 0x000c */

typedef struct _KSFILTERFACTORY
{
  /* 0x0000 */ const struct _KSFILTER_DESCRIPTOR* FilterDescriptor;
  /* 0x0004 */ void* Bag;
  /* 0x0008 */ void* Context;
} KSFILTERFACTORY, *PKSFILTERFACTORY; /* size: 0x000c */

typedef struct _KSFILTER_DESCRIPTOR
{
  /* 0x0000 */ const struct _KSFILTER_DISPATCH* Dispatch;
  /* 0x0004 */ const struct KSAUTOMATION_TABLE_* AutomationTable;
  /* 0x0008 */ unsigned long Version;
  /* 0x000c */ unsigned long Flags;
  /* 0x0010 */ const struct _GUID* ReferenceGuid;
  /* 0x0014 */ unsigned long PinDescriptorsCount;
  /* 0x0018 */ unsigned long PinDescriptorSize;
  /* 0x001c */ const struct _KSPIN_DESCRIPTOR_EX* PinDescriptors;
  /* 0x0020 */ unsigned long CategoriesCount;
  /* 0x0024 */ const struct _GUID* Categories;
  /* 0x0028 */ unsigned long NodeDescriptorsCount;
  /* 0x002c */ unsigned long NodeDescriptorSize;
  /* 0x0030 */ const struct _KSNODE_DESCRIPTOR* NodeDescriptors;
  /* 0x0034 */ unsigned long ConnectionsCount;
  /* 0x0038 */ const struct KSTOPOLOGY_CONNECTION* Connections;
  /* 0x003c */ const struct KSCOMPONENTID* ComponentId;
} KSFILTER_DESCRIPTOR, *PKSFILTER_DESCRIPTOR; /* size: 0x0040 */

typedef struct _KSFILTER_DISPATCH
{
  /* 0x0000 */ void* Create /* function */;
  /* 0x0004 */ void* Close /* function */;
  /* 0x0008 */ void* Process /* function */;
  /* 0x000c */ void* Reset /* function */;
} KSFILTER_DISPATCH, *PKSFILTER_DISPATCH; /* size: 0x0010 */

typedef struct _KSGATE
{
  /* 0x0000 */ long Count;
  /* 0x0004 */ struct _KSGATE* NextGate;
} KSGATE, *PKSGATE; /* size: 0x0008 */

typedef struct _KSMAPPING
{
  /* 0x0000 */ union _LARGE_INTEGER PhysicalAddress;
  /* 0x0008 */ unsigned long ByteCount;
  /* 0x000c */ unsigned long Alignment;
} KSMAPPING, *PKSMAPPING; /* size: 0x0010 */

typedef struct _KSNODE_DESCRIPTOR
{
  /* 0x0000 */ const struct KSAUTOMATION_TABLE_* AutomationTable;
  /* 0x0004 */ const struct _GUID* Type;
  /* 0x0008 */ const struct _GUID* Name;
  /* 0x000c */ void* Alignment;
} KSNODE_DESCRIPTOR, *PKSNODE_DESCRIPTOR; /* size: 0x0010 */

typedef struct _KSPECIAL_REGISTERS
{
  /* 0x0000 */ unsigned long Cr0;
  /* 0x0004 */ unsigned long Cr2;
  /* 0x0008 */ unsigned long Cr3;
  /* 0x000c */ unsigned long Cr4;
  /* 0x0010 */ unsigned long KernelDr0;
  /* 0x0014 */ unsigned long KernelDr1;
  /* 0x0018 */ unsigned long KernelDr2;
  /* 0x001c */ unsigned long KernelDr3;
  /* 0x0020 */ unsigned long KernelDr6;
  /* 0x0024 */ unsigned long KernelDr7;
  /* 0x0028 */ struct _DESCRIPTOR Gdtr;
  /* 0x0030 */ struct _DESCRIPTOR Idtr;
  /* 0x0038 */ unsigned short Tr;
  /* 0x003a */ unsigned short Ldtr;
  /* 0x003c */ unsigned __int64 Xcr0;
  /* 0x0044 */ unsigned long ExceptionList;
  /* 0x0048 */ unsigned long Reserved[3];
} KSPECIAL_REGISTERS, *PKSPECIAL_REGISTERS; /* size: 0x0054 */

typedef struct _KSPIN
{
  /* 0x0000 */ const struct _KSPIN_DESCRIPTOR_EX* Descriptor;
  /* 0x0004 */ void* Bag;
  /* 0x0008 */ void* Context;
  /* 0x000c */ unsigned long Id;
  /* 0x0010 */ enum KSPIN_COMMUNICATION Communication;
  /* 0x0014 */ unsigned char ConnectionIsExternal;
  /* 0x0018 */ struct KSIDENTIFIER ConnectionInterface;
  /* 0x0030 */ struct KSIDENTIFIER ConnectionMedium;
  /* 0x0048 */ struct KSPRIORITY ConnectionPriority;
  /* 0x0050 */ union KSDATAFORMAT* ConnectionFormat;
  /* 0x0054 */ struct KSMULTIPLE_ITEM* AttributeList;
  /* 0x0058 */ unsigned long StreamHeaderSize;
  /* 0x005c */ enum KSPIN_DATAFLOW DataFlow;
  /* 0x0060 */ enum KSSTATE DeviceState;
  /* 0x0064 */ enum KSRESET ResetState;
  /* 0x0068 */ enum KSSTATE ClientState;
  /* 0x006c */ long __PADDING__[1];
} KSPIN, *PKSPIN; /* size: 0x0070 */

typedef struct _KSPIN_DESCRIPTOR_EX
{
  /* 0x0000 */ const struct _KSPIN_DISPATCH* Dispatch;
  /* 0x0004 */ const struct KSAUTOMATION_TABLE_* AutomationTable;
  /* 0x0008 */ struct KSPIN_DESCRIPTOR PinDescriptor;
  /* 0x0038 */ unsigned long Flags;
  /* 0x003c */ unsigned long InstancesPossible;
  /* 0x0040 */ unsigned long InstancesNecessary;
  /* 0x0044 */ const struct KSALLOCATOR_FRAMING_EX* AllocatorFraming;
  /* 0x0048 */ void* IntersectHandler /* function */;
  /* 0x004c */ long __PADDING__[1];
} KSPIN_DESCRIPTOR_EX, *PKSPIN_DESCRIPTOR_EX; /* size: 0x0050 */

typedef struct _KSPIN_DISPATCH
{
  /* 0x0000 */ void* Create /* function */;
  /* 0x0004 */ void* Close /* function */;
  /* 0x0008 */ void* Process /* function */;
  /* 0x000c */ void* Reset /* function */;
  /* 0x0010 */ void* SetDataFormat /* function */;
  /* 0x0014 */ void* SetDeviceState /* function */;
  /* 0x0018 */ void* Connect /* function */;
  /* 0x001c */ void* Disconnect /* function */;
  /* 0x0020 */ const struct _KSCLOCK_DISPATCH* Clock;
  /* 0x0024 */ const struct _KSALLOCATOR_DISPATCH* Allocator;
} KSPIN_DISPATCH, *PKSPIN_DISPATCH; /* size: 0x0028 */

typedef struct _KSPIN_LOCK_QUEUE
{
  /* 0x0000 */ struct _KSPIN_LOCK_QUEUE* volatile Next;
  /* 0x0004 */ unsigned long* volatile Lock;
} KSPIN_LOCK_QUEUE, *PKSPIN_LOCK_QUEUE; /* size: 0x0008 */

typedef enum _KSPIN_LOCK_QUEUE_NUMBER
{
  LockQueueUnusedSpare0 = 0,
  LockQueueUnusedSpare1 = 1,
  LockQueueUnusedSpare2 = 2,
  LockQueueUnusedSpare3 = 3,
  LockQueueVacbLock = 4,
  LockQueueMasterLock = 5,
  LockQueueNonPagedPoolLock = 6,
  LockQueueIoCancelLock = 7,
  LockQueueWorkQueueLock = 8,
  LockQueueIoVpbLock = 9,
  LockQueueIoDatabaseLock = 10,
  LockQueueIoCompletionLock = 11,
  LockQueueNtfsStructLock = 12,
  LockQueueAfdWorkQueueLock = 13,
  LockQueueBcbLock = 14,
  LockQueueUnusedSpare15 = 15,
  LockQueueUnusedSpare16 = 16,
  LockQueueMaximumLock = 17,
} KSPIN_LOCK_QUEUE_NUMBER, *PKSPIN_LOCK_QUEUE_NUMBER;

typedef struct _KSPROCESSPIN
{
  /* 0x0000 */ struct _KSPIN* Pin;
  /* 0x0004 */ struct _KSSTREAM_POINTER* StreamPointer;
  /* 0x0008 */ struct _KSPROCESSPIN* InPlaceCounterpart;
  /* 0x000c */ struct _KSPROCESSPIN* DelegateBranch;
  /* 0x0010 */ struct _KSPROCESSPIN* CopySource;
  /* 0x0014 */ void* Data;
  /* 0x0018 */ unsigned long BytesAvailable;
  /* 0x001c */ unsigned long BytesUsed;
  /* 0x0020 */ unsigned long Flags;
  /* 0x0024 */ unsigned char Terminate;
  /* 0x0025 */ char __PADDING__[3];
} KSPROCESSPIN, *PKSPROCESSPIN; /* size: 0x0028 */

typedef struct _KSPROCESSPIN_INDEXENTRY
{
  /* 0x0000 */ struct _KSPROCESSPIN** Pins;
  /* 0x0004 */ unsigned long Count;
} KSPROCESSPIN_INDEXENTRY, *PKSPROCESSPIN_INDEXENTRY; /* size: 0x0008 */

typedef struct _KSSTREAM_POINTER
{
  /* 0x0000 */ void* Context;
  /* 0x0004 */ struct _KSPIN* Pin;
  /* 0x0008 */ struct KSSTREAM_HEADER* StreamHeader;
  /* 0x000c */ struct _KSSTREAM_POINTER_OFFSET* Offset;
  /* 0x0010 */ struct _KSSTREAM_POINTER_OFFSET OffsetIn;
  /* 0x0020 */ struct _KSSTREAM_POINTER_OFFSET OffsetOut;
} KSSTREAM_POINTER, *PKSSTREAM_POINTER; /* size: 0x0030 */

typedef struct _KSSTREAM_POINTER_OFFSET
{
  union
  {
    /* 0x0000 */ unsigned char* Data;
    /* 0x0000 */ struct _KSMAPPING* Mappings;
  }; /* size: 0x0004 */
  /* 0x0004 */ void* Alignment;
  /* 0x0008 */ unsigned long Count;
  /* 0x000c */ unsigned long Remaining;
} KSSTREAM_POINTER_OFFSET, *PKSSTREAM_POINTER_OFFSET; /* size: 0x0010 */

typedef struct _KSYSTEM_TIME
{
  /* 0x0000 */ unsigned long LowPart;
  /* 0x0004 */ long High1Time;
  /* 0x0008 */ long High2Time;
} KSYSTEM_TIME, *PKSYSTEM_TIME; /* size: 0x000c */

struct _KTHREAD;

typedef struct _KTIMER
{
  /* 0x0000 */ struct _DISPATCHER_HEADER Header;
  /* 0x0010 */ union _ULARGE_INTEGER DueTime;
  /* 0x0018 */ struct _LIST_ENTRY TimerListEntry;
  /* 0x0020 */ struct _KDPC* Dpc;
  /* 0x0024 */ unsigned long Period;
} KTIMER, *PKTIMER; /* size: 0x0028 */

typedef struct _KUSER_SHARED_DATA
{
  /* 0x0000 */ unsigned long TickCountLowDeprecated;
  /* 0x0004 */ unsigned long TickCountMultiplier;
  /* 0x0008 */ volatile struct _KSYSTEM_TIME InterruptTime;
  /* 0x0014 */ volatile struct _KSYSTEM_TIME SystemTime;
  /* 0x0020 */ volatile struct _KSYSTEM_TIME TimeZoneBias;
  /* 0x002c */ unsigned short ImageNumberLow;
  /* 0x002e */ unsigned short ImageNumberHigh;
  /* 0x0030 */ wchar_t NtSystemRoot[260];
  /* 0x0238 */ unsigned long MaxStackTraceDepth;
  /* 0x023c */ unsigned long CryptoExponent;
  /* 0x0240 */ unsigned long TimeZoneId;
  /* 0x0244 */ unsigned long LargePageMinimum;
  /* 0x0248 */ unsigned long AitSamplingValue;
  /* 0x024c */ unsigned long AppCompatFlag;
  /* 0x0250 */ unsigned __int64 RNGSeedVersion;
  /* 0x0258 */ unsigned long GlobalValidationRunlevel;
  /* 0x025c */ volatile long TimeZoneBiasStamp;
  /* 0x0260 */ unsigned long NtBuildNumber;
  /* 0x0264 */ enum _NT_PRODUCT_TYPE NtProductType;
  /* 0x0268 */ unsigned char ProductTypeIsValid;
  /* 0x0269 */ unsigned char Reserved0[1];
  /* 0x026a */ unsigned short NativeProcessorArchitecture;
  /* 0x026c */ unsigned long NtMajorVersion;
  /* 0x0270 */ unsigned long NtMinorVersion;
  /* 0x0274 */ unsigned char ProcessorFeatures[64];
  /* 0x02b4 */ unsigned long Reserved1;
  /* 0x02b8 */ unsigned long Reserved3;
  /* 0x02bc */ volatile unsigned long TimeSlip;
  /* 0x02c0 */ enum _ALTERNATIVE_ARCHITECTURE_TYPE AlternativeArchitecture;
  /* 0x02c4 */ unsigned long BootId;
  /* 0x02c8 */ union _LARGE_INTEGER SystemExpirationDate;
  /* 0x02d0 */ unsigned long SuiteMask;
  /* 0x02d4 */ unsigned char KdDebuggerEnabled;
  union
  {
    /* 0x02d5 */ unsigned char MitigationPolicies;
    struct /* bitfield */
    {
      /* 0x02d5 */ unsigned char NXSupportPolicy : 2; /* bit position: 0 */
      /* 0x02d5 */ unsigned char SEHValidationPolicy : 2; /* bit position: 2 */
      /* 0x02d5 */ unsigned char CurDirDevicesSkippedForDlls : 2; /* bit position: 4 */
      /* 0x02d5 */ unsigned char Reserved : 2; /* bit position: 6 */
    }; /* bitfield */
  }; /* size: 0x0001 */
  /* 0x02d6 */ unsigned char Reserved6[2];
  /* 0x02d8 */ volatile unsigned long ActiveConsoleId;
  /* 0x02dc */ volatile unsigned long DismountCount;
  /* 0x02e0 */ unsigned long ComPlusPackage;
  /* 0x02e4 */ unsigned long LastSystemRITEventTickCount;
  /* 0x02e8 */ unsigned long NumberOfPhysicalPages;
  /* 0x02ec */ unsigned char SafeBootMode;
  /* 0x02ed */ unsigned char Reserved12[3];
  union
  {
    /* 0x02f0 */ unsigned long SharedDataFlags;
    struct /* bitfield */
    {
      /* 0x02f0 */ unsigned long DbgErrorPortPresent : 1; /* bit position: 0 */
      /* 0x02f0 */ unsigned long DbgElevationEnabled : 1; /* bit position: 1 */
      /* 0x02f0 */ unsigned long DbgVirtEnabled : 1; /* bit position: 2 */
      /* 0x02f0 */ unsigned long DbgInstallerDetectEnabled : 1; /* bit position: 3 */
      /* 0x02f0 */ unsigned long DbgLkgEnabled : 1; /* bit position: 4 */
      /* 0x02f0 */ unsigned long DbgDynProcessorEnabled : 1; /* bit position: 5 */
      /* 0x02f0 */ unsigned long DbgConsoleBrokerEnabled : 1; /* bit position: 6 */
      /* 0x02f0 */ unsigned long DbgSecureBootEnabled : 1; /* bit position: 7 */
      /* 0x02f0 */ unsigned long DbgMultiSessionSku : 1; /* bit position: 8 */
      /* 0x02f0 */ unsigned long SpareBits : 23; /* bit position: 9 */
    }; /* bitfield */
  }; /* size: 0x0004 */
  /* 0x02f4 */ unsigned long DataFlagsPad[1];
  /* 0x02f8 */ unsigned __int64 TestRetInstruction;
  /* 0x0300 */ __int64 QpcFrequency;
  /* 0x0308 */ unsigned __int64 SystemCallPad[3];
  union
  {
    /* 0x0320 */ volatile struct _KSYSTEM_TIME TickCount;
    /* 0x0320 */ volatile unsigned __int64 TickCountQuad;
    /* 0x0320 */ unsigned long ReservedTickCountOverlay[3];
  }; /* size: 0x000c */
  /* 0x032c */ unsigned long TickCountPad[1];
  /* 0x0330 */ unsigned long Cookie;
  /* 0x0334 */ unsigned long CookiePad[1];
  /* 0x0338 */ __int64 ConsoleSessionForegroundProcessId;
  /* 0x0340 */ unsigned __int64 TimeUpdateLock;
  /* 0x0348 */ unsigned __int64 BaselineSystemTimeQpc;
  /* 0x0350 */ unsigned __int64 BaselineInterruptTimeQpc;
  /* 0x0358 */ unsigned __int64 QpcSystemTimeIncrement;
  /* 0x0360 */ unsigned __int64 QpcInterruptTimeIncrement;
  /* 0x0368 */ unsigned char QpcSystemTimeIncrementShift;
  /* 0x0369 */ unsigned char QpcInterruptTimeIncrementShift;
  /* 0x036a */ unsigned short UnparkedProcessorCount;
  /* 0x036c */ unsigned char Reserved8[20];
  /* 0x0380 */ unsigned short UserModeGlobalLogger[16];
  /* 0x03a0 */ unsigned long ImageFileExecutionOptions;
  /* 0x03a4 */ unsigned long LangGenerationCount;
  /* 0x03a8 */ unsigned __int64 Reserved4;
  /* 0x03b0 */ volatile unsigned __int64 InterruptTimeBias;
  /* 0x03b8 */ volatile unsigned __int64 QpcBias;
  /* 0x03c0 */ unsigned long ActiveProcessorCount;
  /* 0x03c4 */ volatile unsigned char ActiveGroupCount;
  /* 0x03c5 */ unsigned char Reserved9;
  union
  {
    /* 0x03c6 */ unsigned short QpcData;
    struct
    {
      /* 0x03c6 */ volatile unsigned char QpcBypassEnabled;
      /* 0x03c7 */ unsigned char QpcShift;
    }; /* size: 0x0002 */
  }; /* size: 0x0002 */
  /* 0x03c8 */ union _LARGE_INTEGER TimeZoneBiasEffectiveStart;
  /* 0x03d0 */ union _LARGE_INTEGER TimeZoneBiasEffectiveEnd;
  /* 0x03d8 */ struct _XSTATE_CONFIGURATION XState;
} KUSER_SHARED_DATA, *PKUSER_SHARED_DATA; /* size: 0x0708 */

typedef struct _KWAIT_CHAIN
{
  /* 0x0000 */ struct _SINGLE_LIST_ENTRY Head;
} KWAIT_CHAIN, *PKWAIT_CHAIN; /* size: 0x0004 */

typedef enum _KWAIT_REASON
{
  Executive = 0,
  FreePage = 1,
  PageIn = 2,
  PoolAllocation = 3,
  DelayExecution = 4,
  Suspended = 5,
  UserRequest = 6,
  WrExecutive = 7,
  WrFreePage = 8,
  WrPageIn = 9,
  WrPoolAllocation = 10,
  WrDelayExecution = 11,
  WrSuspended = 12,
  WrUserRequest = 13,
  WrSpare0 = 14,
  WrQueue = 15,
  WrLpcReceive = 16,
  WrLpcReply = 17,
  WrVirtualMemory = 18,
  WrPageOut = 19,
  WrRendezvous = 20,
  WrKeyedEvent = 21,
  WrTerminated = 22,
  WrProcessInSwap = 23,
  WrCpuRateControl = 24,
  WrCalloutStack = 25,
  WrKernel = 26,
  WrResource = 27,
  WrPushLock = 28,
  WrMutex = 29,
  WrQuantumEnd = 30,
  WrDispatchInt = 31,
  WrPreempted = 32,
  WrYieldExecution = 33,
  WrFastMutex = 34,
  WrGuardedMutex = 35,
  WrRundown = 36,
  WrAlertByThreadId = 37,
  WrDeferredPreempt = 38,
  MaximumWaitReason = 39,
} KWAIT_REASON, *PKWAIT_REASON;

typedef union _LARGE_INTEGER
{
  union
  {
    struct
    {
      /* 0x0000 */ unsigned long LowPart;
      /* 0x0004 */ long HighPart;
    }; /* size: 0x0008 */
    struct
    {
      /* 0x0000 */ unsigned long LowPart;
      /* 0x0004 */ long HighPart;
    } /* size: 0x0008 */ u;
    /* 0x0000 */ __int64 QuadPart;
  }; /* size: 0x0008 */
} LARGE_INTEGER, *PLARGE_INTEGER; /* size: 0x0008 */

typedef struct _LIST_ENTRY
{
  /* 0x0000 */ struct _LIST_ENTRY* Flink;
  /* 0x0004 */ struct _LIST_ENTRY* Blink;
} LIST_ENTRY, *PLIST_ENTRY; /* size: 0x0008 */

typedef struct _LOCK_STATE
{
  /* 0x0000 */ unsigned short LockState;
  /* 0x0002 */ unsigned char OldIrql;
  /* 0x0003 */ char __PADDING__[1];
} LOCK_STATE, *PLOCK_STATE; /* size: 0x0004 */

typedef struct _LOCK_STATE_EX
{
  /* 0x0000 */ unsigned char OldIrql;
  /* 0x0001 */ unsigned char LockState;
  /* 0x0002 */ unsigned char Flags;
} LOCK_STATE_EX, *PLOCK_STATE_EX; /* size: 0x0003 */

typedef struct _LOOKASIDE_LIST_EX
{
  /* 0x0000 */ struct _GENERAL_LOOKASIDE_POOL L;
} LOOKASIDE_LIST_EX, *PLOOKASIDE_LIST_EX; /* size: 0x0048 */

typedef struct _LUID
{
  /* 0x0000 */ unsigned long LowPart;
  /* 0x0004 */ long HighPart;
} LUID, *PLUID; /* size: 0x0008 */

typedef struct _LUID_AND_ATTRIBUTES
{
  /* 0x0000 */ struct _LUID Luid;
  /* 0x0008 */ unsigned long Attributes;
} LUID_AND_ATTRIBUTES, *PLUID_AND_ATTRIBUTES; /* size: 0x000c */

typedef struct _MAILSLOT_CREATE_PARAMETERS
{
  /* 0x0000 */ unsigned long MailslotQuota;
  /* 0x0004 */ unsigned long MaximumMessageSize;
  /* 0x0008 */ union _LARGE_INTEGER ReadTimeout;
  /* 0x0010 */ unsigned char TimeoutSpecified;
  /* 0x0011 */ char __PADDING__[7];
} MAILSLOT_CREATE_PARAMETERS, *PMAILSLOT_CREATE_PARAMETERS; /* size: 0x0018 */

typedef struct _MAP_REGISTER_ENTRY
{
  /* 0x0000 */ void* MapRegister;
  /* 0x0004 */ unsigned char WriteToDevice;
  /* 0x0005 */ char __PADDING__[3];
} MAP_REGISTER_ENTRY, *PMAP_REGISTER_ENTRY; /* size: 0x0008 */

typedef struct _MCGEN_TRACE_CONTEXT
{
  /* 0x0000 */ unsigned __int64 RegistrationHandle;
  /* 0x0008 */ unsigned __int64 Logger;
  /* 0x0010 */ unsigned __int64 MatchAnyKeyword;
  /* 0x0018 */ unsigned __int64 MatchAllKeyword;
  /* 0x0020 */ unsigned long Flags;
  /* 0x0024 */ unsigned long IsEnabled;
  /* 0x0028 */ unsigned char Level;
  /* 0x0029 */ unsigned char Reserve;
  /* 0x002a */ unsigned short EnableBitsCount;
  /* 0x002c */ unsigned long* EnableBitMask;
  /* 0x0030 */ const unsigned __int64* EnableKeyWords;
  /* 0x0034 */ const unsigned char* EnableLevel;
} MCGEN_TRACE_CONTEXT, *PMCGEN_TRACE_CONTEXT; /* size: 0x0038 */

typedef struct _MDL
{
  /* 0x0000 */ struct _MDL* Next;
  /* 0x0004 */ short Size;
  /* 0x0006 */ short MdlFlags;
  /* 0x0008 */ struct _EPROCESS* Process;
  /* 0x000c */ void* MappedSystemVa;
  /* 0x0010 */ void* StartVa;
  /* 0x0014 */ unsigned long ByteCount;
  /* 0x0018 */ unsigned long ByteOffset;
} MDL, *PMDL; /* size: 0x001c */

typedef struct _MEDIA_SPECIFIC_INFORMATION
{
  /* 0x0000 */ unsigned int NextEntryOffset;
  /* 0x0004 */ enum _NDIS_CLASS_ID ClassId;
  /* 0x0008 */ unsigned int Size;
  /* 0x000c */ unsigned char ClassInformation[1];
  /* 0x000d */ char __PADDING__[3];
} MEDIA_SPECIFIC_INFORMATION, *PMEDIA_SPECIFIC_INFORMATION; /* size: 0x0010 */

typedef enum _MEMORY_CACHING_TYPE
{
  MmNonCached = 0,
  MmCached = 1,
  MmWriteCombined = 2,
  MmHardwareCoherentCached = 3,
  MmNonCachedUnordered = 4,
  MmUSWCCached = 5,
  MmMaximumCacheType = 6,
  MmNotMapped = -1,
} MEMORY_CACHING_TYPE, *PMEMORY_CACHING_TYPE;

typedef enum _MEMORY_CACHING_TYPE_ORIG
{
  MmFrameBufferCached = 2,
} MEMORY_CACHING_TYPE_ORIG, *PMEMORY_CACHING_TYPE_ORIG;

typedef enum _MM_PAGE_PRIORITY
{
  LowPagePriority = 0,
  NormalPagePriority = 16,
  HighPagePriority = 32,
} MM_PAGE_PRIORITY, *PMM_PAGE_PRIORITY;

typedef enum _MODE
{
  KernelMode = 0,
  UserMode = 1,
  MaximumMode = 2,
} MODE, *PMODE;

typedef struct _NAMED_PIPE_CREATE_PARAMETERS
{
  /* 0x0000 */ unsigned long NamedPipeType;
  /* 0x0004 */ unsigned long ReadMode;
  /* 0x0008 */ unsigned long CompletionMode;
  /* 0x000c */ unsigned long MaximumInstances;
  /* 0x0010 */ unsigned long InboundQuota;
  /* 0x0014 */ unsigned long OutboundQuota;
  /* 0x0018 */ union _LARGE_INTEGER DefaultTimeout;
  /* 0x0020 */ unsigned char TimeoutSpecified;
  /* 0x0021 */ char __PADDING__[7];
} NAMED_PIPE_CREATE_PARAMETERS, *PNAMED_PIPE_CREATE_PARAMETERS; /* size: 0x0028 */

typedef struct _NBL_QUEUE
{
  /* 0x0000 */ struct _NET_BUFFER_LIST* First;
  /* 0x0004 */ struct _NET_BUFFER_LIST** Last;
} NBL_QUEUE, *PNBL_QUEUE; /* size: 0x0008 */

typedef struct _NDIS40_PROTOCOL_CHARACTERISTICS
{
  /* 0x0000 */ unsigned char MajorNdisVersion;
  /* 0x0001 */ unsigned char MinorNdisVersion;
  /* 0x0002 */ unsigned short Filler;
  union
  {
    /* 0x0004 */ unsigned int Reserved;
    /* 0x0004 */ unsigned int Flags;
  }; /* size: 0x0004 */
  /* 0x0008 */ void* OpenAdapterCompleteHandler /* function */;
  /* 0x000c */ void* CloseAdapterCompleteHandler /* function */;
  union
  {
    /* 0x0010 */ void* SendCompleteHandler /* function */;
    /* 0x0010 */ void* WanSendCompleteHandler /* function */;
  }; /* size: 0x0004 */
  union
  {
    /* 0x0014 */ void* TransferDataCompleteHandler /* function */;
    /* 0x0014 */ void* WanTransferDataCompleteHandler /* function */;
  }; /* size: 0x0004 */
  /* 0x0018 */ void* ResetCompleteHandler /* function */;
  /* 0x001c */ void* RequestCompleteHandler /* function */;
  union
  {
    /* 0x0020 */ void* ReceiveHandler /* function */;
    /* 0x0020 */ void* WanReceiveHandler /* function */;
  }; /* size: 0x0004 */
  /* 0x0024 */ void* ReceiveCompleteHandler /* function */;
  /* 0x0028 */ void* StatusHandler /* function */;
  /* 0x002c */ void* StatusCompleteHandler /* function */;
  /* 0x0030 */ struct _UNICODE_STRING Name;
  /* 0x0038 */ void* ReceivePacketHandler /* function */;
  /* 0x003c */ void* BindAdapterHandler /* function */;
  /* 0x0040 */ void* UnbindAdapterHandler /* function */;
  /* 0x0044 */ void* PnPEventHandler /* function */;
  /* 0x0048 */ void* UnloadHandler /* function */;
} NDIS40_PROTOCOL_CHARACTERISTICS, *PNDIS40_PROTOCOL_CHARACTERISTICS; /* size: 0x004c */

typedef struct _NDIS50_MINIPORT_CHARACTERISTICS
{
  /* 0x0000 */ unsigned char MajorNdisVersion;
  /* 0x0001 */ unsigned char MinorNdisVersion;
  /* 0x0002 */ unsigned short Filler;
  /* 0x0004 */ unsigned int Reserved;
  /* 0x0008 */ void* CheckForHangHandler /* function */;
  /* 0x000c */ void* DisableInterruptHandler /* function */;
  /* 0x0010 */ void* EnableInterruptHandler /* function */;
  /* 0x0014 */ void* HaltHandler /* function */;
  /* 0x0018 */ void* HandleInterruptHandler /* function */;
  /* 0x001c */ void* InitializeHandler /* function */;
  /* 0x0020 */ void* ISRHandler /* function */;
  /* 0x0024 */ void* QueryInformationHandler /* function */;
  /* 0x0028 */ void* ReconfigureHandler /* function */;
  /* 0x002c */ void* ResetHandler /* function */;
  union
  {
    /* 0x0030 */ void* SendHandler /* function */;
    /* 0x0030 */ void* WanSendHandler /* function */;
  }; /* size: 0x0004 */
  /* 0x0034 */ void* SetInformationHandler /* function */;
  union
  {
    /* 0x0038 */ void* TransferDataHandler /* function */;
    /* 0x0038 */ void* WanTransferDataHandler /* function */;
  }; /* size: 0x0004 */
  /* 0x003c */ void* ReturnPacketHandler /* function */;
  /* 0x0040 */ void* SendPacketsHandler /* function */;
  /* 0x0044 */ void* AllocateCompleteHandler /* function */;
  /* 0x0048 */ void* CoCreateVcHandler /* function */;
  /* 0x004c */ void* CoDeleteVcHandler /* function */;
  /* 0x0050 */ void* CoActivateVcHandler /* function */;
  /* 0x0054 */ void* CoDeactivateVcHandler /* function */;
  /* 0x0058 */ void* CoSendPacketsHandler /* function */;
  /* 0x005c */ void* CoRequestHandler /* function */;
} NDIS50_MINIPORT_CHARACTERISTICS, *PNDIS50_MINIPORT_CHARACTERISTICS; /* size: 0x0060 */

typedef struct _NDIS50_PROTOCOL_CHARACTERISTICS
{
  union
  {
    /* 0x0000 */ struct _NDIS40_PROTOCOL_CHARACTERISTICS Ndis40Chars;
    struct
    {
      /* 0x0000 */ unsigned char MajorNdisVersion;
      /* 0x0001 */ unsigned char MinorNdisVersion;
      /* 0x0002 */ unsigned short Filler;
      union
      {
        /* 0x0004 */ unsigned int Reserved;
        /* 0x0004 */ unsigned int Flags;
      }; /* size: 0x0004 */
      /* 0x0008 */ void* OpenAdapterCompleteHandler /* function */;
      /* 0x000c */ void* CloseAdapterCompleteHandler /* function */;
      union
      {
        /* 0x0010 */ void* SendCompleteHandler /* function */;
        /* 0x0010 */ void* WanSendCompleteHandler /* function */;
      }; /* size: 0x0004 */
      union
      {
        /* 0x0014 */ void* TransferDataCompleteHandler /* function */;
        /* 0x0014 */ void* WanTransferDataCompleteHandler /* function */;
      }; /* size: 0x0004 */
      /* 0x0018 */ void* ResetCompleteHandler /* function */;
      /* 0x001c */ void* RequestCompleteHandler /* function */;
      union
      {
        /* 0x0020 */ void* ReceiveHandler /* function */;
        /* 0x0020 */ void* WanReceiveHandler /* function */;
      }; /* size: 0x0004 */
      /* 0x0024 */ void* ReceiveCompleteHandler /* function */;
      /* 0x0028 */ void* StatusHandler /* function */;
      /* 0x002c */ void* StatusCompleteHandler /* function */;
      /* 0x0030 */ struct _UNICODE_STRING Name;
      /* 0x0038 */ void* ReceivePacketHandler /* function */;
      /* 0x003c */ void* BindAdapterHandler /* function */;
      /* 0x0040 */ void* UnbindAdapterHandler /* function */;
      /* 0x0044 */ void* PnPEventHandler /* function */;
      /* 0x0048 */ void* UnloadHandler /* function */;
    }; /* size: 0x004c */
  }; /* size: 0x004c */
  /* 0x004c */ void* ReservedHandlers[4];
  /* 0x005c */ void* CoSendCompleteHandler /* function */;
  /* 0x0060 */ void* CoStatusHandler /* function */;
  /* 0x0064 */ void* CoReceivePacketHandler /* function */;
  /* 0x0068 */ void* CoAfRegisterNotifyHandler /* function */;
} NDIS50_PROTOCOL_CHARACTERISTICS, *PNDIS50_PROTOCOL_CHARACTERISTICS; /* size: 0x006c */

typedef struct _NDIS51_MINIPORT_CHARACTERISTICS
{
  union
  {
    /* 0x0000 */ struct _NDIS50_MINIPORT_CHARACTERISTICS Ndis50Chars;
    struct
    {
      /* 0x0000 */ unsigned char MajorNdisVersion;
      /* 0x0001 */ unsigned char MinorNdisVersion;
      /* 0x0002 */ unsigned short Filler;
      /* 0x0004 */ unsigned int Reserved;
      /* 0x0008 */ void* CheckForHangHandler /* function */;
      /* 0x000c */ void* DisableInterruptHandler /* function */;
      /* 0x0010 */ void* EnableInterruptHandler /* function */;
      /* 0x0014 */ void* HaltHandler /* function */;
      /* 0x0018 */ void* HandleInterruptHandler /* function */;
      /* 0x001c */ void* InitializeHandler /* function */;
      /* 0x0020 */ void* ISRHandler /* function */;
      /* 0x0024 */ void* QueryInformationHandler /* function */;
      /* 0x0028 */ void* ReconfigureHandler /* function */;
      /* 0x002c */ void* ResetHandler /* function */;
      union
      {
        /* 0x0030 */ void* SendHandler /* function */;
        /* 0x0030 */ void* WanSendHandler /* function */;
      }; /* size: 0x0004 */
      /* 0x0034 */ void* SetInformationHandler /* function */;
      union
      {
        /* 0x0038 */ void* TransferDataHandler /* function */;
        /* 0x0038 */ void* WanTransferDataHandler /* function */;
      }; /* size: 0x0004 */
      /* 0x003c */ void* ReturnPacketHandler /* function */;
      /* 0x0040 */ void* SendPacketsHandler /* function */;
      /* 0x0044 */ void* AllocateCompleteHandler /* function */;
      /* 0x0048 */ void* CoCreateVcHandler /* function */;
      /* 0x004c */ void* CoDeleteVcHandler /* function */;
      /* 0x0050 */ void* CoActivateVcHandler /* function */;
      /* 0x0054 */ void* CoDeactivateVcHandler /* function */;
      /* 0x0058 */ void* CoSendPacketsHandler /* function */;
      /* 0x005c */ void* CoRequestHandler /* function */;
    }; /* size: 0x0060 */
  }; /* size: 0x0060 */
  /* 0x0060 */ void* CancelSendPacketsHandler /* function */;
  /* 0x0064 */ void* PnPEventNotifyHandler /* function */;
  /* 0x0068 */ void* AdapterShutdownHandler /* function */;
  /* 0x006c */ void* Reserved1;
  /* 0x0070 */ void* Reserved2;
  /* 0x0074 */ void* Reserved3;
  /* 0x0078 */ void* Reserved4;
} NDIS51_MINIPORT_CHARACTERISTICS, *PNDIS51_MINIPORT_CHARACTERISTICS; /* size: 0x007c */

typedef enum _NDIS_802_11_WEP_STATUS
{
  Ndis802_11WEPEnabled = 0,
  Ndis802_11Encryption1Enabled = 0,
  Ndis802_11WEPDisabled = 1,
  Ndis802_11EncryptionDisabled = 1,
  Ndis802_11WEPKeyAbsent = 2,
  Ndis802_11Encryption1KeyAbsent = 2,
  Ndis802_11WEPNotSupported = 3,
  Ndis802_11EncryptionNotSupported = 3,
  Ndis802_11Encryption2Enabled = 4,
  Ndis802_11Encryption2KeyAbsent = 5,
  Ndis802_11Encryption3Enabled = 6,
  Ndis802_11Encryption3KeyAbsent = 7,
} NDIS_802_11_WEP_STATUS, *PNDIS_802_11_WEP_STATUS;

typedef struct _NDIS_AF_LIST
{
  /* 0x0000 */ struct _NDIS_AF_LIST* NextAf;
  /* 0x0004 */ struct _NDIS_OPEN_BLOCK* Open;
  /* 0x0008 */ struct CO_ADDRESS_FAMILY AddressFamily;
  /* 0x0014 */ struct _NDIS_CALL_MANAGER_CHARACTERISTICS CmChars;
  /* 0x005c */ struct _NDIS_CO_CALL_MANAGER_OPTIONAL_HANDLERS CallMgrChars;
  /* 0x00a8 */ unsigned long NdisMajorVersion;
} NDIS_AF_LIST, *PNDIS_AF_LIST; /* size: 0x00ac */

typedef struct _NDIS_AOAC_COMPONENT_REF_TIME
{
  /* 0x0000 */ unsigned __int64 TotalRefTime;
  /* 0x0008 */ unsigned __int64 CurrentRefStartTime;
} NDIS_AOAC_COMPONENT_REF_TIME, *PNDIS_AOAC_COMPONENT_REF_TIME; /* size: 0x0010 */

typedef enum _NDIS_ARP_HEADER_FIELD
{
  NdisARPHeaderFieldUndefined = 0,
  NdisARPHeaderFieldOperation = 1,
  NdisARPHeaderFieldSPA = 2,
  NdisARPHeaderFieldTPA = 3,
  NdisARPHeaderFieldMaximum = 4,
} NDIS_ARP_HEADER_FIELD, *PNDIS_ARP_HEADER_FIELD;

typedef struct _NDIS_BIND_PARAMETERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ struct _UNICODE_STRING* ProtocolSection;
  /* 0x0008 */ struct _UNICODE_STRING* AdapterName;
  /* 0x000c */ struct _DEVICE_OBJECT* PhysicalDeviceObject;
  /* 0x0010 */ enum _NDIS_MEDIUM MediaType;
  /* 0x0014 */ unsigned long MtuSize;
  /* 0x0018 */ unsigned __int64 MaxXmitLinkSpeed;
  /* 0x0020 */ unsigned __int64 XmitLinkSpeed;
  /* 0x0028 */ unsigned __int64 MaxRcvLinkSpeed;
  /* 0x0030 */ unsigned __int64 RcvLinkSpeed;
  /* 0x0038 */ enum _NET_IF_MEDIA_CONNECT_STATE MediaConnectState;
  /* 0x003c */ enum _NET_IF_MEDIA_DUPLEX_STATE MediaDuplexState;
  /* 0x0040 */ unsigned long LookaheadSize;
  /* 0x0044 */ struct _NDIS_PNP_CAPABILITIES* PowerManagementCapabilities;
  /* 0x0048 */ unsigned long SupportedPacketFilters;
  /* 0x004c */ unsigned long MaxMulticastListSize;
  /* 0x0050 */ unsigned short MacAddressLength;
  /* 0x0052 */ unsigned char CurrentMacAddress[32];
  /* 0x0074 */ enum _NDIS_PHYSICAL_MEDIUM PhysicalMediumType;
  /* 0x0078 */ struct _NDIS_RECEIVE_SCALE_CAPABILITIES* RcvScaleCapabilities;
  /* 0x0080 */ union _NET_LUID_LH BoundIfNetluid;
  /* 0x0088 */ unsigned long BoundIfIndex;
  /* 0x0090 */ union _NET_LUID_LH LowestIfNetluid;
  /* 0x0098 */ unsigned long LowestIfIndex;
  /* 0x009c */ enum _NET_IF_ACCESS_TYPE AccessType;
  /* 0x00a0 */ enum _NET_IF_DIRECTION_TYPE DirectionType;
  /* 0x00a4 */ enum _NET_IF_CONNECTION_TYPE ConnectionType;
  /* 0x00a8 */ unsigned short IfType;
  /* 0x00aa */ unsigned char IfConnectorPresent;
  /* 0x00ac */ struct _NDIS_PORT* ActivePorts;
  /* 0x00b0 */ unsigned long DataBackFillSize;
  /* 0x00b4 */ unsigned long ContextBackFillSize;
  /* 0x00b8 */ unsigned long MacOptions;
  /* 0x00bc */ unsigned int CompartmentId;
  /* 0x00c0 */ struct _NDIS_OFFLOAD* DefaultOffloadConfiguration;
  /* 0x00c4 */ struct _NDIS_TCP_CONNECTION_OFFLOAD* TcpConnectionOffloadCapabilities;
  /* 0x00c8 */ struct _UNICODE_STRING* BoundAdapterName;
  /* 0x00cc */ struct _NDIS_HD_SPLIT_CURRENT_CONFIG* HDSplitCurrentConfig;
  /* 0x00d0 */ struct _NDIS_RECEIVE_FILTER_CAPABILITIES* ReceiveFilterCapabilities;
  /* 0x00d4 */ struct _NDIS_PM_CAPABILITIES* PowerManagementCapabilitiesEx;
  /* 0x00d8 */ struct _NDIS_NIC_SWITCH_CAPABILITIES* NicSwitchCapabilities;
  /* 0x00dc */ unsigned char NDKEnabled;
  /* 0x00e0 */ struct _NDIS_NDK_CAPABILITIES* NDKCapabilities;
  /* 0x00e4 */ struct _NDIS_SRIOV_CAPABILITIES* SriovCapabilities;
  /* 0x00e8 */ struct _NDIS_NIC_SWITCH_INFO_ARRAY* NicSwitchArray;
  /* 0x00ec */ long __PADDING__[1];
} NDIS_BIND_PARAMETERS, *PNDIS_BIND_PARAMETERS; /* size: 0x00f0 */

typedef struct _NDIS_BIND_PATHS
{
  /* 0x0000 */ unsigned int Number;
  /* 0x0004 */ struct _UNICODE_STRING Paths[1];
} NDIS_BIND_PATHS, *PNDIS_BIND_PATHS; /* size: 0x000c */

typedef struct _NDIS_CALL_MANAGER_CHARACTERISTICS
{
  /* 0x0000 */ unsigned char MajorVersion;
  /* 0x0001 */ unsigned char MinorVersion;
  /* 0x0002 */ unsigned short Filler;
  /* 0x0004 */ unsigned int Reserved;
  /* 0x0008 */ void* CmCreateVcHandler /* function */;
  /* 0x000c */ void* CmDeleteVcHandler /* function */;
  /* 0x0010 */ void* CmOpenAfHandler /* function */;
  /* 0x0014 */ void* CmCloseAfHandler /* function */;
  /* 0x0018 */ void* CmRegisterSapHandler /* function */;
  /* 0x001c */ void* CmDeregisterSapHandler /* function */;
  /* 0x0020 */ void* CmMakeCallHandler /* function */;
  /* 0x0024 */ void* CmCloseCallHandler /* function */;
  /* 0x0028 */ void* CmIncomingCallCompleteHandler /* function */;
  /* 0x002c */ void* CmAddPartyHandler /* function */;
  /* 0x0030 */ void* CmDropPartyHandler /* function */;
  /* 0x0034 */ void* CmActivateVcCompleteHandler /* function */;
  /* 0x0038 */ void* CmDeactivateVcCompleteHandler /* function */;
  /* 0x003c */ void* CmModifyCallQoSHandler /* function */;
  /* 0x0040 */ void* CmRequestHandler /* function */;
  /* 0x0044 */ void* CmRequestCompleteHandler /* function */;
} NDIS_CALL_MANAGER_CHARACTERISTICS, *PNDIS_CALL_MANAGER_CHARACTERISTICS; /* size: 0x0048 */

typedef enum _NDIS_CLASS_ID
{
  NdisClass802_3Priority = 0,
  NdisClassWirelessWanMbxMailbox = 1,
  NdisClassIrdaPacketInfo = 2,
  NdisClassAtmAALInfo = 3,
} NDIS_CLASS_ID, *PNDIS_CLASS_ID;

typedef struct _NDIS_CLIENT_CHARACTERISTICS
{
  /* 0x0000 */ unsigned char MajorVersion;
  /* 0x0001 */ unsigned char MinorVersion;
  /* 0x0002 */ unsigned short Filler;
  /* 0x0004 */ unsigned int Reserved;
  /* 0x0008 */ void* ClCreateVcHandler /* function */;
  /* 0x000c */ void* ClDeleteVcHandler /* function */;
  /* 0x0010 */ void* ClRequestHandler /* function */;
  /* 0x0014 */ void* ClRequestCompleteHandler /* function */;
  /* 0x0018 */ void* ClOpenAfCompleteHandler /* function */;
  /* 0x001c */ void* ClCloseAfCompleteHandler /* function */;
  /* 0x0020 */ void* ClRegisterSapCompleteHandler /* function */;
  /* 0x0024 */ void* ClDeregisterSapCompleteHandler /* function */;
  /* 0x0028 */ void* ClMakeCallCompleteHandler /* function */;
  /* 0x002c */ void* ClModifyCallQoSCompleteHandler /* function */;
  /* 0x0030 */ void* ClCloseCallCompleteHandler /* function */;
  /* 0x0034 */ void* ClAddPartyCompleteHandler /* function */;
  /* 0x0038 */ void* ClDropPartyCompleteHandler /* function */;
  /* 0x003c */ void* ClIncomingCallHandler /* function */;
  /* 0x0040 */ void* ClIncomingCallQoSChangeHandler /* function */;
  /* 0x0044 */ void* ClIncomingCloseCallHandler /* function */;
  /* 0x0048 */ void* ClIncomingDropPartyHandler /* function */;
  /* 0x004c */ void* ClCallConnectedHandler /* function */;
} NDIS_CLIENT_CHARACTERISTICS, *PNDIS_CLIENT_CHARACTERISTICS; /* size: 0x0050 */

typedef struct _NDIS_CLIENT_CHIMNEY_OFFLOAD_GENERIC_CHARACTERISTICS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ void* InitiateOffloadCompleteHandler /* function */;
  /* 0x000c */ void* TerminateOffloadCompleteHandler /* function */;
  /* 0x0010 */ void* UpdateOffloadCompleteHandler /* function */;
  /* 0x0014 */ void* InvalidateOffloadCompleteHandler /* function */;
  /* 0x0018 */ void* QueryOffloadCompleteHandler /* function */;
  /* 0x001c */ void* IndicateOffloadEventHandler /* function */;
} NDIS_CLIENT_CHIMNEY_OFFLOAD_GENERIC_CHARACTERISTICS, *PNDIS_CLIENT_CHIMNEY_OFFLOAD_GENERIC_CHARACTERISTICS; /* size: 0x0020 */

typedef struct _NDIS_CLIENT_CHIMNEY_OFFLOAD_TCP_CHARACTERISTICS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ enum NDIS_CHIMNEY_OFFLOAD_TYPE OffloadType;
  /* 0x000c */ void* TcpOffloadSendCompleteHandler /* function */;
  /* 0x0010 */ void* TcpOffloadReceiveCompleteHandler /* function */;
  /* 0x0014 */ void* TcpOffloadDisconnectCompleteHandler /* function */;
  /* 0x0018 */ void* TcpOffloadForwardCompleteHandler /* function */;
  /* 0x001c */ void* TcpOffloadEventHandler /* function */;
  /* 0x0020 */ void* TcpOffloadReceiveIndicateHandler /* function */;
} NDIS_CLIENT_CHIMNEY_OFFLOAD_TCP_CHARACTERISTICS, *PNDIS_CLIENT_CHIMNEY_OFFLOAD_TCP_CHARACTERISTICS; /* size: 0x0024 */

typedef struct _NDIS_COMMON_OPEN_BLOCK
{
  union
  {
    /* 0x0000 */ void* MacHandle;
    /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  }; /* size: 0x0004 */
  /* 0x0004 */ void* BindingHandle;
  /* 0x0008 */ struct _NDIS_MINIPORT_BLOCK* MiniportHandle;
  /* 0x000c */ struct _NDIS_PROTOCOL_BLOCK* ProtocolHandle;
  /* 0x0010 */ void* ProtocolBindingContext;
  /* 0x0014 */ void* NextSendHandler /* function */;
  /* 0x0018 */ void* NextSendContext;
  /* 0x001c */ void* MiniportAdapterContext;
  /* 0x0020 */ unsigned char Reserved1;
  /* 0x0021 */ unsigned char CallingFromNdis6Protocol;
  /* 0x0022 */ unsigned char Reserved3;
  /* 0x0023 */ unsigned char Reserved4;
  /* 0x0024 */ void* NextReturnNetBufferListsHandler /* function */;
  /* 0x0028 */ unsigned long Reserved5;
  /* 0x002c */ void* NextReturnNetBufferListsContext;
  union
  {
    /* 0x0030 */ void* SendHandler /* function */;
    /* 0x0030 */ void* WanSendHandler /* function */;
  }; /* size: 0x0004 */
  /* 0x0034 */ void* TransferDataHandler /* function */;
  /* 0x0038 */ void* SendCompleteHandler /* function */;
  /* 0x003c */ void* TransferDataCompleteHandler /* function */;
  /* 0x0040 */ void* ReceiveHandler /* function */;
  /* 0x0044 */ void* ReceiveCompleteHandler /* function */;
  /* 0x0048 */ void* WanReceiveHandler /* function */;
  /* 0x004c */ void* RequestCompleteHandler /* function */;
  /* 0x0050 */ void* ReceivePacketHandler /* function */;
  /* 0x0054 */ void* SendPacketsHandler /* function */;
  /* 0x0058 */ void* ResetHandler /* function */;
  /* 0x005c */ void* RequestHandler /* function */;
  /* 0x0060 */ void* OidRequestHandler /* function */;
  /* 0x0064 */ void* ResetCompleteHandler /* function */;
  union
  {
    /* 0x0068 */ void* StatusHandler /* function */;
    /* 0x0068 */ void* StatusHandlerEx /* function */;
  }; /* size: 0x0004 */
  /* 0x006c */ void* StatusCompleteHandler /* function */;
  /* 0x0070 */ volatile unsigned long OpenFlags;
  /* 0x0074 */ long References;
  /* 0x0078 */ unsigned long SpinLock;
  /* 0x007c */ void* FilterHandle;
  /* 0x0080 */ unsigned int FrameTypeArraySize;
  /* 0x0084 */ unsigned short FrameTypeArray[4];
  /* 0x008c */ unsigned long ProtocolOptions;
  /* 0x0090 */ unsigned long CurrentLookahead;
  /* 0x0094 */ void* WSendHandler /* function */;
  /* 0x0098 */ void* WTransferDataHandler /* function */;
  /* 0x009c */ void* WSendPacketsHandler /* function */;
  /* 0x00a0 */ void* CancelSendPacketsHandler /* function */;
  /* 0x00a4 */ unsigned long WakeUpEnable;
  /* 0x00a8 */ struct _NDIS_PM_PARAMETERS PMCurrentParameters;
  /* 0x00bc */ struct _KEVENT* CloseCompleteEvent;
  /* 0x00c0 */ struct _QUEUED_CLOSE QC;
  /* 0x00d4 */ long AfReferences;
  /* 0x00d8 */ struct _NDIS_OPEN_BLOCK* NextGlobalOpen;
  /* 0x00dc */ struct _NDIS_OPEN_BLOCK* MiniportNextOpen;
  /* 0x00e0 */ struct _NDIS_OPEN_BLOCK* ProtocolNextOpen;
  /* 0x00e4 */ struct _UNICODE_STRING* BindDeviceName;
  /* 0x00e8 */ struct _UNICODE_STRING* RootDeviceName;
  /* 0x00ec */ struct _NDIS_OPEN_BLOCK* FilterNextOpen;
  /* 0x00f0 */ unsigned int PacketFilters;
  /* 0x00f4 */ unsigned int OldPacketFilters;
  /* 0x00f8 */ unsigned int MaxMulticastAddresses;
  /* 0x00fc */ struct _ETH_MULTICAST_WRAPPER* MCastAddressBuf;
  /* 0x0100 */ unsigned int NumAddresses;
  /* 0x0104 */ struct _ETH_MULTICAST_WRAPPER* OldMCastAddressBuf;
  /* 0x0108 */ unsigned int OldNumAddresses;
  /* 0x010c */ unsigned char* RssParametersBuffer;
  /* 0x0110 */ struct _NDIS_RECEIVE_SCALE_PARAMETERS* NdisRSSParameters;
  /* 0x0114 */ struct _SINGLE_LIST_ENTRY PatternList;
  /* 0x0118 */ struct _SINGLE_LIST_ENTRY WOLPatternList;
  /* 0x011c */ struct _SINGLE_LIST_ENTRY PMProtocolOffloadList;
  /* 0x0120 */ void* ProtSendNetBufferListsComplete /* function */;
  /* 0x0124 */ void* SendCompleteNdisPacketContext;
  /* 0x0128 */ void* SendCompleteNetBufferListsContext;
  /* 0x012c */ void* ReceiveNetBufferLists /* function */;
  /* 0x0130 */ void* ReceiveNetBufferListsContext;
  /* 0x0134 */ void* SavedSendPacketsHandler /* function */;
  /* 0x0138 */ void* SavedCancelSendPacketsHandler /* function */;
  /* 0x013c */ void* SavedSendHandler /* function */;
  /* 0x0140 */ void* InitiateOffloadCompleteHandler /* function */;
  /* 0x0144 */ void* TerminateOffloadCompleteHandler /* function */;
  /* 0x0148 */ void* UpdateOffloadCompleteHandler /* function */;
  /* 0x014c */ void* InvalidateOffloadCompleteHandler /* function */;
  /* 0x0150 */ void* QueryOffloadCompleteHandler /* function */;
  /* 0x0154 */ void* IndicateOffloadEventHandler /* function */;
  /* 0x0158 */ void* TcpOffloadSendCompleteHandler /* function */;
  /* 0x015c */ void* TcpOffloadReceiveCompleteHandler /* function */;
  /* 0x0160 */ void* TcpOffloadDisconnectCompleteHandler /* function */;
  /* 0x0164 */ void* TcpOffloadForwardCompleteHandler /* function */;
  /* 0x0168 */ void* TcpOffloadEventHandler /* function */;
  /* 0x016c */ void* TcpOffloadReceiveIndicateHandler /* function */;
  /* 0x0170 */ struct NDIS_NBL_TRACKER_HANDLE__* NblTracker;
  /* 0x0174 */ struct NDIS_REFCOUNT_HANDLE__* RefCountTracker;
  /* 0x0178 */ unsigned long RefCountLock;
  /* 0x017c */ unsigned long ProtocolMajorVersion;
  /* 0x0180 */ void** IfBlock;
  /* 0x0184 */ struct _NDIS_SPIN_LOCK PnPStateLock;
  /* 0x018c */ enum _NDIS_NDIS5_DRIVER_STATE PnPState;
  /* 0x0190 */ int OutstandingSends;
  /* 0x0194 */ struct _NDIS_EVENT PauseEvent;
  /* 0x01a4 */ void* Ndis5WanSendHandler /* function */;
  /* 0x01a8 */ void* ProtSendCompleteHandler /* function */;
  /* 0x01ac */ void* OidRequestCompleteHandler /* function */;
  /* 0x01b0 */ struct _NDIS_OPEN_OFFLOAD* Offload;
  /* 0x01b4 */ struct _NDIS_STATUS_UNBIND_WORKITEM* StatusUnbindWorkItem;
  /* 0x01b8 */ unsigned __int64 DpcStartCycle;
  /* 0x01c0 */ struct PNDIS_PER_PROCESSOR_SLOT__* ReceivedAPacketSlot;
  /* 0x01c4 */ void* DirectOidRequestHandler /* function */;
  /* 0x01c8 */ struct _LIST_ENTRY ReceiveQueueList;
  /* 0x01d0 */ unsigned long NumReceiveQueues;
  /* 0x01d4 */ struct _LIST_ENTRY SharedMemoryBlockList;
  /* 0x01dc */ void* AllocateSharedMemoryHandler /* function */;
  /* 0x01e0 */ void* FreeSharedMemoryHandler /* function */;
  /* 0x01e4 */ void* AllocateSharedMemoryContext;
  /* 0x01e8 */ unsigned long NumAllocatedVFs;
  /* 0x01ec */ struct _LIST_ENTRY VFList;
  /* 0x01f4 */ unsigned long NumActiveVPorts;
  /* 0x01f8 */ struct _LIST_ENTRY VPortList;
  /* 0x0200 */ unsigned long AoAcReferences;
  /* 0x0204 */ struct NDIS_BIND_PROTOCOL_LINK* Bind;
  /* 0x0208 */ struct _WORK_QUEUE_ITEM UnsolicitedUnbindComplete;
  /* 0x0218 */ struct _KEVENT* UnsolicitedUnbindEvent;
  /* 0x021c */ BOOL PendingLegacyUnbind;
  /* 0x021d */ char __PADDING__[3];
} NDIS_COMMON_OPEN_BLOCK, *PNDIS_COMMON_OPEN_BLOCK; /* size: 0x0220 */

typedef struct _NDIS_CONFIGURATION_OBJECT
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ void* NdisHandle;
  /* 0x0008 */ unsigned long Flags;
} NDIS_CONFIGURATION_OBJECT, *PNDIS_CONFIGURATION_OBJECT; /* size: 0x000c */

typedef struct _NDIS_CONFIGURATION_PARAMETER
{
  /* 0x0000 */ enum _NDIS_PARAMETER_TYPE ParameterType;
  union
  {
    union
    {
      /* 0x0004 */ unsigned long IntegerData;
      /* 0x0004 */ struct _UNICODE_STRING StringData;
      /* 0x0004 */ struct BINARY_DATA BinaryData;
    }; /* size: 0x0008 */
  } /* size: 0x0008 */ ParameterData;
} NDIS_CONFIGURATION_PARAMETER, *PNDIS_CONFIGURATION_PARAMETER; /* size: 0x000c */

typedef struct _NDIS_CONNECTION_INFO
{
  /* 0x0000 */ unsigned char MacAddress[6];
  union
  {
    struct
    {
      /* 0x0008 */ unsigned long SourceIPv4Address;
      /* 0x000c */ unsigned long DestinationIPv4Address;
      /* 0x0010 */ unsigned char Protocol;
      /* 0x0011 */ char __PADDING__[3];
    } /* size: 0x000c */ IPv4Info;
    struct
    {
      /* 0x0008 */ unsigned char SourceIPv6Address[16];
      /* 0x0018 */ unsigned char DestinationIPv6Address[16];
      /* 0x0028 */ unsigned char Protocol;
    } /* size: 0x0021 */ IPv6Info;
  }; /* size: 0x0021 */
  union
  {
    struct
    {
      /* 0x002c */ unsigned short SourceTcpPort;
      /* 0x002e */ unsigned short DestinationTcpPort;
    } /* size: 0x0004 */ TcpPortInfo;
    struct
    {
      /* 0x002c */ unsigned short SourceUdpPort;
      /* 0x002e */ unsigned short DestinationUdpPort;
    } /* size: 0x0004 */ UdpPortInfo;
  }; /* size: 0x0004 */
} NDIS_CONNECTION_INFO, *PNDIS_CONNECTION_INFO; /* size: 0x0030 */

typedef struct _NDIS_CO_AF_BLOCK
{
  /* 0x0000 */ struct _NDIS_CO_AF_BLOCK* NextAf;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ long References;
  /* 0x000c */ struct _NDIS_MINIPORT_BLOCK* Miniport;
  /* 0x0010 */ struct _NDIS_CALL_MANAGER_CHARACTERISTICS* CallMgrEntries;
  /* 0x0014 */ struct _NDIS_CO_CALL_MANAGER_OPTIONAL_HANDLERS* CallMgrChars;
  /* 0x0018 */ struct _NDIS_OPEN_BLOCK* CallMgrOpen;
  /* 0x001c */ void* CallMgrContext;
  /* 0x0020 */ struct _NDIS_CLIENT_CHARACTERISTICS ClientEntries;
  /* 0x0070 */ struct _NDIS_CO_CLIENT_OPTIONAL_HANDLERS ClientChars;
  /* 0x00c4 */ struct _NDIS_OPEN_BLOCK* ClientOpen;
  /* 0x00c8 */ void* ClientContext;
  /* 0x00cc */ unsigned long Lock;
  /* 0x00d0 */ unsigned long CmMajorNdisVersion;
  /* 0x00d4 */ unsigned long ClMajorNdisVersion;
  /* 0x00d8 */ struct _NDIS_REQUEST* Ndis5CmRequest;
  /* 0x00dc */ struct _NDIS_REQUEST Request;
  /* 0x0138 */ struct _NDIS_REQUEST* CloseAfNdisRequest;
  /* 0x013c */ unsigned char CloseAfRequested;
  /* 0x013d */ char __PADDING__[3];
} NDIS_CO_AF_BLOCK, *PNDIS_CO_AF_BLOCK; /* size: 0x0140 */

typedef struct _NDIS_CO_CALL_MANAGER_OPTIONAL_HANDLERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Reserved;
  /* 0x0008 */ void* CmCreateVcHandler /* function */;
  /* 0x000c */ void* CmDeleteVcHandler /* function */;
  /* 0x0010 */ void* CmOpenAfHandler /* function */;
  /* 0x0014 */ void* CmCloseAfHandler /* function */;
  /* 0x0018 */ void* CmRegisterSapHandler /* function */;
  /* 0x001c */ void* CmDeregisterSapHandler /* function */;
  /* 0x0020 */ void* CmMakeCallHandler /* function */;
  /* 0x0024 */ void* CmCloseCallHandler /* function */;
  /* 0x0028 */ void* CmIncomingCallCompleteHandler /* function */;
  /* 0x002c */ void* CmAddPartyHandler /* function */;
  /* 0x0030 */ void* CmDropPartyHandler /* function */;
  /* 0x0034 */ void* CmActivateVcCompleteHandler /* function */;
  /* 0x0038 */ void* CmDeactivateVcCompleteHandler /* function */;
  /* 0x003c */ void* CmModifyCallQoSHandler /* function */;
  /* 0x0040 */ void* CmOidRequestHandler /* function */;
  /* 0x0044 */ void* CmOidRequestCompleteHandler /* function */;
  /* 0x0048 */ void* CmNotifyCloseAfCompleteHandler /* function */;
} NDIS_CO_CALL_MANAGER_OPTIONAL_HANDLERS, *PNDIS_CO_CALL_MANAGER_OPTIONAL_HANDLERS; /* size: 0x004c */

typedef struct _NDIS_CO_CLIENT_OPTIONAL_HANDLERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Reserved;
  /* 0x0008 */ void* ClCreateVcHandler /* function */;
  /* 0x000c */ void* ClDeleteVcHandler /* function */;
  /* 0x0010 */ void* ClOidRequestHandler /* function */;
  /* 0x0014 */ void* ClOidRequestCompleteHandler /* function */;
  /* 0x0018 */ void* ClOpenAfCompleteHandlerEx /* function */;
  /* 0x001c */ void* ClCloseAfCompleteHandler /* function */;
  /* 0x0020 */ void* ClRegisterSapCompleteHandler /* function */;
  /* 0x0024 */ void* ClDeregisterSapCompleteHandler /* function */;
  /* 0x0028 */ void* ClMakeCallCompleteHandler /* function */;
  /* 0x002c */ void* ClModifyCallQoSCompleteHandler /* function */;
  /* 0x0030 */ void* ClCloseCallCompleteHandler /* function */;
  /* 0x0034 */ void* ClAddPartyCompleteHandler /* function */;
  /* 0x0038 */ void* ClDropPartyCompleteHandler /* function */;
  /* 0x003c */ void* ClIncomingCallHandler /* function */;
  /* 0x0040 */ void* ClIncomingCallQoSChangeHandler /* function */;
  /* 0x0044 */ void* ClIncomingCloseCallHandler /* function */;
  /* 0x0048 */ void* ClIncomingDropPartyHandler /* function */;
  /* 0x004c */ void* ClCallConnectedHandler /* function */;
  /* 0x0050 */ void* ClNotifyCloseAfHandler /* function */;
} NDIS_CO_CLIENT_OPTIONAL_HANDLERS, *PNDIS_CO_CLIENT_OPTIONAL_HANDLERS; /* size: 0x0054 */

typedef struct _NDIS_CO_PARTY_BLOCK
{
  /* 0x0000 */ struct _NDIS_CO_VC_PTR_BLOCK* VcPtr;
  /* 0x0004 */ void* CallMgrContext;
  /* 0x0008 */ void* ClientContext;
  /* 0x000c */ void* ClIncomingDropPartyHandler /* function */;
  /* 0x0010 */ void* ClDropPartyCompleteHandler /* function */;
} NDIS_CO_PARTY_BLOCK, *PNDIS_CO_PARTY_BLOCK; /* size: 0x0014 */

typedef struct _NDIS_CO_SAP_BLOCK
{
  /* 0x0000 */ void* CallMgrContext;
  /* 0x0004 */ void* ClientContext;
  /* 0x0008 */ struct _NDIS_CO_AF_BLOCK* AfBlock;
  /* 0x000c */ struct CO_SAP* Sap;
  /* 0x0010 */ unsigned long Flags;
  /* 0x0014 */ long References;
  /* 0x0018 */ unsigned long Lock;
} NDIS_CO_SAP_BLOCK, *PNDIS_CO_SAP_BLOCK; /* size: 0x001c */

typedef struct _NDIS_CO_VC_BLOCK
{
  /* 0x0000 */ unsigned long References;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ unsigned long Lock;
  /* 0x000c */ struct _NDIS_OPEN_BLOCK* ClientOpen;
  /* 0x0010 */ void* ClientContext;
  /* 0x0014 */ struct _NDIS_CO_VC_PTR_BLOCK* pProxyVcPtr;
  /* 0x0018 */ struct _NDIS_CO_VC_PTR_BLOCK* pClientVcPtr;
  /* 0x001c */ void* CoSendCompleteHandler /* function */;
  /* 0x0020 */ void* CoReceivePacketHandler /* function */;
  /* 0x0024 */ void* CoSendNetBufferListsCompleteHandler /* function */;
  /* 0x0028 */ void* CoReceiveNetBufferListsHandler /* function */;
  /* 0x002c */ struct _NDIS_OPEN_BLOCK* CallMgrOpen;
  /* 0x0030 */ void* CallMgrContext;
  /* 0x0034 */ void* CmActivateVcCompleteHandler /* function */;
  /* 0x0038 */ void* CmDeactivateVcCompleteHandler /* function */;
  /* 0x003c */ void* CmModifyCallQoSHandler /* function */;
  /* 0x0040 */ struct _NDIS_MINIPORT_BLOCK* Miniport;
  /* 0x0044 */ void* MiniportContext;
  /* 0x0048 */ unsigned __int64 VcId;
} NDIS_CO_VC_BLOCK, *PNDIS_CO_VC_BLOCK; /* size: 0x0050 */

typedef struct _NDIS_CO_VC_PTR_BLOCK
{
  /* 0x0000 */ long References;
  /* 0x0004 */ unsigned long CallFlags;
  /* 0x0008 */ unsigned long* pVcFlags;
  /* 0x000c */ unsigned long Lock;
  /* 0x0010 */ void* ClientContext;
  /* 0x0014 */ struct _LIST_ENTRY ClientLink;
  /* 0x001c */ struct _LIST_ENTRY VcLink;
  /* 0x0024 */ struct _NDIS_CO_AF_BLOCK* AfBlock;
  /* 0x0028 */ struct _NDIS_CO_VC_BLOCK* VcBlock;
  /* 0x002c */ struct _NDIS_OPEN_BLOCK* ClientOpen;
  /* 0x0030 */ long OwnsVcBlock;
  /* 0x0034 */ void* CoDeleteVcHandler /* function */;
  /* 0x0038 */ void* DeleteVcContext;
  /* 0x003c */ void* ClModifyCallQoSCompleteHandler /* function */;
  /* 0x0040 */ void* ClIncomingCallQoSChangeHandler /* function */;
  /* 0x0044 */ void* ClCallConnectedHandler /* function */;
  /* 0x0048 */ struct _NDIS_OPEN_BLOCK* CallMgrOpen;
  /* 0x004c */ void* CallMgrContext;
  /* 0x0050 */ struct _LIST_ENTRY CallMgrLink;
  /* 0x0058 */ void* CmActivateVcCompleteHandler /* function */;
  /* 0x005c */ void* CmDeactivateVcCompleteHandler /* function */;
  /* 0x0060 */ void* CmModifyCallQoSHandler /* function */;
  /* 0x0064 */ struct _NDIS_MINIPORT_BLOCK* Miniport;
  /* 0x0068 */ void* MiniportContext;
  /* 0x006c */ void* WCoSendPacketsHandler /* function */;
  /* 0x0070 */ void* WCoDeleteVcHandler /* function */;
  /* 0x0074 */ void* WCoActivateVcHandler /* function */;
  /* 0x0078 */ void* WCoDeactivateVcHandler /* function */;
  /* 0x007c */ void* WCoSendNetBufferListsHandler /* function */;
  /* 0x0080 */ void* CoSendNetBufferListsHandler /* function */;
  /* 0x0084 */ void* CoSendNetBufferListsCompleteHandler /* function */;
  /* 0x0088 */ void* CoSendPacketHandler /* function */;
  /* 0x008c */ void* CoSendPacketCompleteHandler /* function */;
  /* 0x0090 */ void* CoIndicateReceivePacketHandler /* function */;
  /* 0x0094 */ void* CoIndicateReceiveNetBufferListsHandler /* function */;
  /* 0x0098 */ struct _UNICODE_STRING VcInstanceName;
  /* 0x00a0 */ union _LARGE_INTEGER VcIndex;
  /* 0x00a8 */ struct _LIST_ENTRY WmiLink;
  /* 0x00b0 */ unsigned char CallMiniportDeleteVc;
  /* 0x00b1 */ char __PADDING__[7];
} NDIS_CO_VC_PTR_BLOCK, *PNDIS_CO_VC_PTR_BLOCK; /* size: 0x00b8 */

typedef enum _NDIS_CS_TRAFFIC_STATS
{
  NdisCSTrafficLatest = 0,
  NdisCSTrafficTotalD0 = 1,
  NdisCSTrafficTotalDX = 2,
  NdisCSTrafficMaximum = 3,
} NDIS_CS_TRAFFIC_STATS, *PNDIS_CS_TRAFFIC_STATS;

typedef struct _NDIS_D0_SIGNAL_WORK_ITEM
{
  /* 0x0000 */ struct _NDIS_WORK_ITEM WorkItem;
  /* 0x0028 */ long CompletionStatus;
  /* 0x002c */ unsigned char Scheduled;
  /* 0x002d */ char __PADDING__[3];
} NDIS_D0_SIGNAL_WORK_ITEM, *PNDIS_D0_SIGNAL_WORK_ITEM; /* size: 0x0030 */

typedef enum _NDIS_DATA_PATH_TYPE
{
  NdisSendPath = 0,
  NdisSendCompletePath = 1,
  NdisReceivePath = 2,
  NdisReceiveCompletePath = 3,
  NdisDataPathCount = 4,
} NDIS_DATA_PATH_TYPE, *PNDIS_DATA_PATH_TYPE;

typedef struct _NDIS_DEBUG_BLOCK<1147946562>
{
} NDIS_DEBUG_BLOCK<1147946562>, *PNDIS_DEBUG_BLOCK<1147946562>; /* size: 0x0001 */

typedef struct _NDIS_DEBUG_BLOCK<1148473410>
{
} NDIS_DEBUG_BLOCK<1148473410>, *PNDIS_DEBUG_BLOCK<1148473410>; /* size: 0x0001 */

typedef struct _NDIS_DEBUG_BLOCK<1282164290>
{
} NDIS_DEBUG_BLOCK<1282164290>, *PNDIS_DEBUG_BLOCK<1282164290>; /* size: 0x0001 */

typedef struct _NDIS_DEBUG_BLOCK<1282691138>
{
} NDIS_DEBUG_BLOCK<1282691138>, *PNDIS_DEBUG_BLOCK<1282691138>; /* size: 0x0001 */

typedef struct _NDIS_DEBUG_BLOCK<1396859982>
{
} NDIS_DEBUG_BLOCK<1396859982>, *PNDIS_DEBUG_BLOCK<1396859982>; /* size: 0x0001 */

typedef struct _NDIS_DEBUG_BLOCK<1920090443>
{
} NDIS_DEBUG_BLOCK<1920090443>, *PNDIS_DEBUG_BLOCK<1920090443>; /* size: 0x0001 */

typedef struct _NDIS_DEBUG_BLOCK<1920226123>
{
} NDIS_DEBUG_BLOCK<1920226123>, *PNDIS_DEBUG_BLOCK<1920226123>; /* size: 0x0001 */

typedef struct _NDIS_DEBUG_BLOCK<1935819854>
{
} NDIS_DEBUG_BLOCK<1935819854>, *PNDIS_DEBUG_BLOCK<1935819854>; /* size: 0x0001 */

typedef struct _NDIS_DEVICE_OBJECT_ATTRIBUTES
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ struct _UNICODE_STRING* DeviceName;
  /* 0x0008 */ struct _UNICODE_STRING* SymbolicName;
  /* 0x000c */ void** MajorFunctions /* function */;
  /* 0x0010 */ unsigned long ExtensionSize;
  /* 0x0014 */ const struct _UNICODE_STRING* DefaultSDDLString;
  /* 0x0018 */ const struct _GUID* DeviceClassGuid;
} NDIS_DEVICE_OBJECT_ATTRIBUTES, *PNDIS_DEVICE_OBJECT_ATTRIBUTES; /* size: 0x001c */

typedef enum _NDIS_DEVICE_PNP_EVENT
{
  NdisDevicePnPEventQueryRemoved = 0,
  NdisDevicePnPEventRemoved = 1,
  NdisDevicePnPEventSurpriseRemoved = 2,
  NdisDevicePnPEventQueryStopped = 3,
  NdisDevicePnPEventStopped = 4,
  NdisDevicePnPEventPowerProfileChanged = 5,
  NdisDevicePnPEventFilterListChanged = 6,
  NdisDevicePnPEventMaximum = 7,
} NDIS_DEVICE_PNP_EVENT, *PNDIS_DEVICE_PNP_EVENT;

typedef enum _NDIS_DEVICE_POWER_STATE
{
  NdisDeviceStateUnspecified = 0,
  NdisDeviceStateD0 = 1,
  NdisDeviceStateD1 = 2,
  NdisDeviceStateD2 = 3,
  NdisDeviceStateD3 = 4,
  NdisDeviceStateMaximum = 5,
} NDIS_DEVICE_POWER_STATE, *PNDIS_DEVICE_POWER_STATE;

typedef struct _NDIS_DMA_BLOCK
{
  /* 0x0000 */ void* MapRegisterBase;
  /* 0x0004 */ struct _KEVENT AllocationEvent;
  /* 0x0014 */ void* SystemAdapterObject;
  /* 0x0018 */ void* Miniport;
  /* 0x001c */ unsigned char InProgress;
  /* 0x001d */ char __PADDING__[3];
} NDIS_DMA_BLOCK, *PNDIS_DMA_BLOCK; /* size: 0x0020 */

typedef struct _NDIS_DMA_DESCRIPTION
{
  /* 0x0000 */ unsigned char DemandMode;
  /* 0x0001 */ unsigned char AutoInitialize;
  /* 0x0002 */ unsigned char DmaChannelSpecified;
  /* 0x0004 */ enum _DMA_WIDTH DmaWidth;
  /* 0x0008 */ enum _DMA_SPEED DmaSpeed;
  /* 0x000c */ unsigned long DmaPort;
  /* 0x0010 */ unsigned long DmaChannel;
} NDIS_DMA_DESCRIPTION, *PNDIS_DMA_DESCRIPTION; /* size: 0x0014 */

typedef struct _NDIS_DPC_WORK_ITEM
{
  /* 0x0000 */ struct _WORK_QUEUE_ITEM WorkItem;
  /* 0x0010 */ struct _KDPC* Dpc;
  /* 0x0014 */ void* InterruptContext;
  /* 0x0018 */ void* SystemArgument1;
  /* 0x001c */ void* SystemArgument2;
  /* 0x0020 */ unsigned long TargetCpu;
  /* 0x0024 */ unsigned long Flags;
  /* 0x0028 */ unsigned long Lock;
} NDIS_DPC_WORK_ITEM, *PNDIS_DPC_WORK_ITEM; /* size: 0x002c */

typedef struct _NDIS_DRIVER_OPTIONAL_HANDLERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
} NDIS_DRIVER_OPTIONAL_HANDLERS, *PNDIS_DRIVER_OPTIONAL_HANDLERS; /* size: 0x0004 */

typedef struct _NDIS_DRIVER_WRAPPER_HANDLE
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ void* NdisWrapperHandle;
} NDIS_DRIVER_WRAPPER_HANDLE, *PNDIS_DRIVER_WRAPPER_HANDLE; /* size: 0x0008 */

typedef struct _NDIS_ENCAPSULATED_PACKET_TASK_OFFLOAD
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned long TransmitChecksumOffloadSupported : 4; /* bit position: 0 */
    /* 0x0000 */ unsigned long ReceiveChecksumOffloadSupported : 4; /* bit position: 4 */
    /* 0x0000 */ unsigned long LsoV2Supported : 4; /* bit position: 8 */
    /* 0x0000 */ unsigned long RssSupported : 4; /* bit position: 12 */
    /* 0x0000 */ unsigned long VmqSupported : 4; /* bit position: 16 */
  }; /* bitfield */
  /* 0x0004 */ unsigned long MaxHeaderSizeSupported;
} NDIS_ENCAPSULATED_PACKET_TASK_OFFLOAD, *PNDIS_ENCAPSULATED_PACKET_TASK_OFFLOAD; /* size: 0x0008 */

typedef struct _NDIS_ENCAPSULATED_PACKET_TASK_OFFLOAD_V2
{
  struct /* bitfield */
  {
    /* 0x0000 */ unsigned long TransmitChecksumOffloadSupported : 4; /* bit position: 0 */
    /* 0x0000 */ unsigned long ReceiveChecksumOffloadSupported : 4; /* bit position: 4 */
    /* 0x0000 */ unsigned long LsoV2Supported : 4; /* bit position: 8 */
    /* 0x0000 */ unsigned long RssSupported : 4; /* bit position: 12 */
    /* 0x0000 */ unsigned long VmqSupported : 4; /* bit position: 16 */
    /* 0x0000 */ unsigned long Reserved : 12; /* bit position: 20 */
  }; /* bitfield */
  /* 0x0004 */ unsigned long MaxHeaderSizeSupported;
  /* 0x0008 */ union _NDIS_ENCAPSULATED_PACKET_TASK_OFFLOAD_V2::_ENCAPSULATION_PROTOCOL_INFO EncapsulationProtocolInfo;
  /* 0x000c */ unsigned long Reserved1;
  /* 0x0010 */ unsigned long Reserved2;
} NDIS_ENCAPSULATED_PACKET_TASK_OFFLOAD_V2, *PNDIS_ENCAPSULATED_PACKET_TASK_OFFLOAD_V2; /* size: 0x0014 */

typedef union _NDIS_ENCAPSULATED_PACKET_TASK_OFFLOAD_V2::_ENCAPSULATION_PROTOCOL_INFO
{
  union
  {
    /* 0x0000 */ struct _NDIS_ENCAPSULATED_PACKET_TASK_OFFLOAD_V2::_ENCAPSULATION_PROTOCOL_INFO::_VXLAN_INFO VxlanInfo;
    /* 0x0000 */ unsigned long Value;
  }; /* size: 0x0004 */
} NDIS_ENCAPSULATED_PACKET_TASK_OFFLOAD_V2::_ENCAPSULATION_PROTOCOL_INFO, *PNDIS_ENCAPSULATED_PACKET_TASK_OFFLOAD_V2::_ENCAPSULATION_PROTOCOL_INFO; /* size: 0x0004 */

typedef struct _NDIS_ENCAPSULATED_PACKET_TASK_OFFLOAD_V2::_ENCAPSULATION_PROTOCOL_INFO::_VXLAN_INFO
{
  /* 0x0000 */ unsigned short VxlanUDPPortNumber;
  /* 0x0002 */ unsigned short VxlanUDPPortNumberConfigurable : 1; /* bit position: 0 */
} NDIS_ENCAPSULATED_PACKET_TASK_OFFLOAD_V2::_ENCAPSULATION_PROTOCOL_INFO::_VXLAN_INFO, *PNDIS_ENCAPSULATED_PACKET_TASK_OFFLOAD_V2::_ENCAPSULATION_PROTOCOL_INFO::_VXLAN_INFO; /* size: 0x0004 */

typedef enum _NDIS_ENCAPSULATION
{
  UNSPECIFIED_Encapsulation = 0,
  NULL_Encapsulation = 1,
  IEEE_802_3_Encapsulation = 2,
  IEEE_802_5_Encapsulation = 3,
  LLC_SNAP_ROUTED_Encapsulation = 4,
  LLC_SNAP_BRIDGED_Encapsulation = 5,
} NDIS_ENCAPSULATION, *PNDIS_ENCAPSULATION;

typedef struct _NDIS_ENCAPSULATION_FORMAT
{
  /* 0x0000 */ enum _NDIS_ENCAPSULATION Encapsulation;
  struct
  {
    struct /* bitfield */
    {
      /* 0x0004 */ unsigned long FixedHeaderSize : 1; /* bit position: 0 */
      /* 0x0004 */ unsigned long Reserved : 31; /* bit position: 1 */
    }; /* bitfield */
  } /* size: 0x0004 */ Flags;
  /* 0x0008 */ unsigned long EncapsulationHeaderSize;
} NDIS_ENCAPSULATION_FORMAT, *PNDIS_ENCAPSULATION_FORMAT; /* size: 0x000c */

typedef struct _NDIS_ENTRY_HEADER
{
  /* 0x0000 */ struct _NDIS_POOL_HEADER* PoolHeader;
  /* 0x0004 */ struct _LIST_ENTRY Linkage;
  /* 0x000c */ unsigned long LookasideProcIndex;
} NDIS_ENTRY_HEADER, *PNDIS_ENTRY_HEADER; /* size: 0x0010 */

typedef struct _NDIS_ENUM_FILTERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ unsigned long NumberOfFilters;
  /* 0x000c */ unsigned long OffsetFirstFilter;
  /* 0x0010 */ struct _NDIS_FILTER_INTERFACE Filter[1];
} NDIS_ENUM_FILTERS, *PNDIS_ENUM_FILTERS; /* size: 0x0040 */

typedef enum _NDIS_ENVIRONMENT_TYPE
{
  NdisEnvironmentWindows = 0,
  NdisEnvironmentWindowsNt = 1,
} NDIS_ENVIRONMENT_TYPE, *PNDIS_ENVIRONMENT_TYPE;

typedef struct _NDIS_EVENT
{
  /* 0x0000 */ struct _KEVENT Event;
} NDIS_EVENT, *PNDIS_EVENT; /* size: 0x0010 */

typedef struct _NDIS_EVENT_LOG
{
  /* 0x0000 */ unsigned __int64 LastEventTime;
  /* 0x0008 */ unsigned long LastUsedEntry;
  /* 0x000c */ unsigned long NumEntries;
  /* 0x0010 */ unsigned long Lock;
  /* 0x0014 */ unsigned short Flags;
  /* 0x0016 */ unsigned short EntrySize;
} NDIS_EVENT_LOG, *PNDIS_EVENT_LOG; /* size: 0x0018 */

typedef struct _NDIS_EVENT_LOG_ENTRY
{
  /* 0x0000 */ unsigned short EventId;
  union
  {
    struct /* bitfield */
    {
      /* 0x0002 */ unsigned short Timestamp : 15; /* bit position: 0 */
      /* 0x0002 */ unsigned short TimestampScale : 1; /* bit position: 15 */
    }; /* bitfield */
    /* 0x0002 */ unsigned short TimestampValue;
  }; /* size: 0x0002 */
  /* 0x0004 */ unsigned long StackTrace;
  /* 0x0008 */ void* Context;
} NDIS_EVENT_LOG_ENTRY, *PNDIS_EVENT_LOG_ENTRY; /* size: 0x000c */

typedef struct _NDIS_FILTERLIST_ITEM
{
  /* 0x0000 */ struct _GUID FilterUniqueName;
  /* 0x0010 */ unsigned short FilterIndex;
} NDIS_FILTERLIST_ITEM, *PNDIS_FILTERLIST_ITEM; /* size: 0x0012 */

typedef struct _NDIS_FILTER_ATTACH_PARAMETERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long IfIndex;
  /* 0x0008 */ union _NET_LUID_LH NetLuid;
  /* 0x0010 */ struct _UNICODE_STRING* FilterModuleGuidName;
  /* 0x0014 */ unsigned long BaseMiniportIfIndex;
  /* 0x0018 */ struct _UNICODE_STRING* BaseMiniportInstanceName;
  /* 0x001c */ struct _UNICODE_STRING* BaseMiniportName;
  /* 0x0020 */ enum _NET_IF_MEDIA_CONNECT_STATE MediaConnectState;
  /* 0x0024 */ enum _NET_IF_MEDIA_DUPLEX_STATE MediaDuplexState;
  /* 0x0028 */ unsigned __int64 XmitLinkSpeed;
  /* 0x0030 */ unsigned __int64 RcvLinkSpeed;
  /* 0x0038 */ enum _NDIS_MEDIUM MiniportMediaType;
  /* 0x003c */ enum _NDIS_PHYSICAL_MEDIUM MiniportPhysicalMediaType;
  /* 0x0040 */ void* MiniportMediaSpecificAttributes;
  /* 0x0044 */ struct _NDIS_OFFLOAD* DefaultOffloadConfiguration;
  /* 0x0048 */ unsigned short MacAddressLength;
  /* 0x004a */ unsigned char CurrentMacAddress[32];
  /* 0x0070 */ union _NET_LUID_LH BaseMiniportNetLuid;
  /* 0x0078 */ unsigned long LowerIfIndex;
  /* 0x0080 */ union _NET_LUID_LH LowerIfNetLuid;
  /* 0x0088 */ unsigned long Flags;
  /* 0x008c */ struct _NDIS_HD_SPLIT_CURRENT_CONFIG* HDSplitCurrentConfig;
  /* 0x0090 */ struct _NDIS_RECEIVE_FILTER_CAPABILITIES* ReceiveFilterCapabilities;
  /* 0x0094 */ struct _DEVICE_OBJECT* MiniportPhysicalDeviceObject;
  /* 0x0098 */ struct _NDIS_NIC_SWITCH_CAPABILITIES* NicSwitchCapabilities;
  /* 0x009c */ unsigned char BaseMiniportIfConnectorPresent;
  /* 0x00a0 */ struct _NDIS_SRIOV_CAPABILITIES* SriovCapabilities;
  /* 0x00a4 */ struct _NDIS_NIC_SWITCH_INFO_ARRAY* NicSwitchArray;
} NDIS_FILTER_ATTACH_PARAMETERS, *PNDIS_FILTER_ATTACH_PARAMETERS; /* size: 0x00a8 */

typedef struct _NDIS_FILTER_ATTRIBUTES
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Flags;
} NDIS_FILTER_ATTRIBUTES, *PNDIS_FILTER_ATTRIBUTES; /* size: 0x0008 */

typedef struct _NDIS_FILTER_BLOCK
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ struct _NDIS_FILTER_BLOCK* NextFilter;
  /* 0x0008 */ struct _NDIS_FILTER_DRIVER_BLOCK* FilterDriver;
  /* 0x000c */ void* FilterModuleContext;
  /* 0x0010 */ struct _NDIS_MINIPORT_BLOCK* Miniport;
  /* 0x0014 */ class KPtr<Rtl::KString,KDeletePtr<Rtl::KString> > FilterInstanceName;
  /* 0x0018 */ struct _UNICODE_STRING* FilterFriendlyName;
  /* 0x001c */ unsigned long Flags;
  /* 0x0020 */ unsigned long StackFlags;
  /* 0x0024 */ enum _NDIS_FILTER_STATE State;
  /* 0x0028 */ struct _REFERENCE_EX Ref;
  /* 0x0034 */ int FakeStatus;
  /* 0x0038 */ struct _NDIS_FILTER_BLOCK* NextGlobalFilter;
  /* 0x003c */ struct _NDIS_FILTER_BLOCK* LowerFilter;
  /* 0x0040 */ struct _NDIS_FILTER_BLOCK* HigherFilter;
  /* 0x0044 */ struct _FILTER_PAUSE_RESTART_CONTEXT* AsyncOpContext;
  /* 0x0048 */ long NumOfPauseRestartRequests;
  /* 0x004c */ unsigned long Lock;
  /* 0x0050 */ void* LockThread;
  /* 0x0054 */ unsigned long LockDbg;
  /* 0x0058 */ struct _LIST_ENTRY OidRequestList;
  /* 0x0060 */ struct _NDIS_OID_REQUEST* PendingOidRequest;
  struct
  {
    /* 0x0064 */ struct _WORK_QUEUE_ITEM WorkItem;
    /* 0x0074 */ unsigned char WorkItemQueued;
    /* 0x0078 */ struct _PENDING_STACK_EXPANSION_FALLBACK_WORK PendingWork;
  } /* size: 0x0030 */ StackExpansionFallback;
  /* 0x0094 */ volatile unsigned char StatusIndicationsQueued;
  /* 0x0098 */ volatile long DroppedReceiveNbls;
  /* 0x009c */ volatile long DroppedSendNbls;
  /* 0x00a0 */ unsigned long DroppedStatusIndications;
  /* 0x00a4 */ unsigned long DroppedUncloneableStatusIndications;
  /* 0x00a8 */ struct _REFERENCE_EX PnPRef;
  /* 0x00b4 */ enum _NDIS_MEDIUM MediaType;
  /* 0x00b8 */ enum _NDIS_PHYSICAL_MEDIUM PhysicalMediaType;
  /* 0x00bc */ enum _NET_IF_MEDIA_CONNECT_STATE MediaConnectState;
  /* 0x00c0 */ enum _NET_IF_MEDIA_DUPLEX_STATE MediaDuplexState;
  /* 0x00c8 */ unsigned __int64 XmitLinkSpeed;
  /* 0x00d0 */ unsigned __int64 RcvLinkSpeed;
  /* 0x00d8 */ enum _NDIS_SUPPORTED_PAUSE_FUNCTIONS PauseFunctions;
  /* 0x00dc */ unsigned long AutoNegotiationFlags;
  /* 0x00e0 */ unsigned char XState;
  /* 0x00e1 */ unsigned char Reserved1;
  /* 0x00e2 */ unsigned char Reserved2;
  /* 0x00e3 */ unsigned char Reserved3;
  /* 0x00e4 */ enum _NET_IF_MEDIA_CONNECT_STATE MediaConnectStateIndicateUp;
  /* 0x00e8 */ enum _NET_IF_MEDIA_DUPLEX_STATE MediaDuplexStateIndicateUp;
  /* 0x00f0 */ unsigned __int64 XmitLinkSpeedIndicateUp;
  /* 0x00f8 */ unsigned __int64 RcvLinkSpeedIndicateUp;
  /* 0x0100 */ enum _NDIS_SUPPORTED_PAUSE_FUNCTIONS PauseFunctionsIndicateUp;
  /* 0x0104 */ unsigned long AutoNegotiationFlagsIndicateUp;
  /* 0x0108 */ void* NextRequestHandle;
  /* 0x010c */ struct _NDIS_ITERATIVE_DATA_PATH_TRACKER_ENTRY* IterativeDataPathTracker[4];
  /* 0x0110 */ void* NextSendNetBufferListsHandler /* function */;
  /* 0x0114 */ void* NextSendNetBufferListsContext;
  /* 0x0118 */ struct NDIS_NBL_TRACKER_HANDLE__* NextSendNetBufferListsTracker;
  /* 0x011c */ struct _NDIS_OBJECT_HEADER* NextSendNetBufferListsObject;
  /* 0x0120 */ void* NextSendNetBufferListsCompleteHandler /* function */;
  /* 0x0124 */ void* NextSendNetBufferListsCompleteContext;
  /* 0x0128 */ struct NDIS_NBL_TRACKER_HANDLE__* NextSendNetBufferListsCompleteTracker;
  /* 0x012c */ struct _NDIS_OBJECT_HEADER* NextSendNetBufferListsCompleteObject;
  /* 0x0130 */ void* NextIndicateReceiveNetBufferListsHandler /* function */;
  /* 0x0134 */ void* NextIndicateReceiveNetBufferListsContext;
  /* 0x0138 */ struct NDIS_NBL_TRACKER_HANDLE__* NextIndicateReceiveNetBufferListsTracker;
  /* 0x013c */ struct _NDIS_OBJECT_HEADER* NextIndicateReceiveNetBufferListsObject;
  /* 0x0140 */ void* NextReturnNetBufferListsHandler /* function */;
  /* 0x0144 */ void* NextReturnNetBufferListsContext;
  /* 0x0148 */ struct NDIS_NBL_TRACKER_HANDLE__* NextReturnNetBufferListsTracker;
  /* 0x014c */ struct _NDIS_OBJECT_HEADER* NextReturnNetBufferListsObject;
  /* 0x0150 */ void* NextCancelSendNetBufferListsHandler /* function */;
  /* 0x0154 */ void* NextCancelSendNetBufferListsContext;
  /* 0x0158 */ struct _NDIS_FILTER_PARTIAL_CHARACTERISTICS Characteristics;
  /* 0x0174 */ void* FilterSendNetBufferListsHandler /* function */;
  /* 0x0178 */ void* FilterIndicateReceiveNetBufferListsHandler /* function */;
  /* 0x017c */ void* FilterCancelSendNetBufferListsHandler /* function */;
  /* 0x0180 */ void* InitiateOffloadCompleteHandler /* function */;
  /* 0x0184 */ void* TerminateOffloadCompleteHandler /* function */;
  /* 0x0188 */ void* UpdateOffloadCompleteHandler /* function */;
  /* 0x018c */ void* InvalidateOffloadCompleteHandler /* function */;
  /* 0x0190 */ void* QueryOffloadCompleteHandler /* function */;
  /* 0x0194 */ void* IndicateOffloadEventHandler /* function */;
  /* 0x0198 */ void* TcpOffloadSendCompleteHandler /* function */;
  /* 0x019c */ void* TcpOffloadReceiveCompleteHandler /* function */;
  /* 0x01a0 */ void* TcpOffloadDisconnectCompleteHandler /* function */;
  /* 0x01a4 */ void* TcpOffloadForwardCompleteHandler /* function */;
  /* 0x01a8 */ void* TcpOffloadEventHandler /* function */;
  /* 0x01ac */ void* TcpOffloadReceiveIndicateHandler /* function */;
  /* 0x01b0 */ void* InitiateOffloadHandler /* function */;
  /* 0x01b4 */ void* TerminateOffloadHandler /* function */;
  /* 0x01b8 */ void* UpdateOffloadHandler /* function */;
  /* 0x01bc */ void* InvalidateOffloadHandler /* function */;
  /* 0x01c0 */ void* QueryOffloadHandler /* function */;
  /* 0x01c4 */ void* TcpOffloadReceiveReturnHandler /* function */;
  /* 0x01c8 */ struct NDIS_NBL_TRACKER_HANDLE__* NblTracker;
  /* 0x01cc */ struct _NDIS_FILTER_TASK_OFFLOAD* Offload;
  /* 0x01d0 */ struct _GUID InterfaceGuid;
  /* 0x01e0 */ unsigned long IfIndex;
  /* 0x01e4 */ struct _NDIS_IF_BLOCK* IfBlock;
  /* 0x01e8 */ void* NextDirectRequestHandle;
  /* 0x01ec */ unsigned long DirectOidRequestCount;
  /* 0x01f0 */ struct _SINGLE_LIST_ENTRY WOLPatternList;
  /* 0x01f4 */ struct _SINGLE_LIST_ENTRY PMProtocolOffloadList;
  /* 0x01f8 */ struct _NDIS_PM_PARAMETERS PMCurrentParameters;
  /* 0x020c */ struct NDIS_BIND_FILTER_LINK* Bind;
  /* 0x0210 */ void* VerifierContext;
  /* 0x0214 */ long __PADDING__[1];
} NDIS_FILTER_BLOCK, *PNDIS_FILTER_BLOCK; /* size: 0x0218 */

typedef struct _NDIS_FILTER_DRIVER_BLOCK
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ struct _NDIS_FILTER_DRIVER_BLOCK* NextFilterDriver;
  /* 0x0008 */ struct _DRIVER_OBJECT* DriverObject;
  /* 0x000c */ struct _NDIS_FILTER_BLOCK* FilterQueue;
  /* 0x0010 */ void* FilterDriverContext;
  /* 0x0014 */ unsigned long Lock;
  /* 0x0018 */ unsigned long Flags;
  /* 0x001c */ struct _LIST_ENTRY DeviceList;
  /* 0x0024 */ struct _REFERENCE_EX Ref;
  /* 0x0030 */ struct _NDIS_FILTER_DRIVER_CHARACTERISTICS DefaultFilterCharacteristics;
  /* 0x00a4 */ void* InitiateOffloadCompleteHandler /* function */;
  /* 0x00a8 */ void* TerminateOffloadCompleteHandler /* function */;
  /* 0x00ac */ void* UpdateOffloadCompleteHandler /* function */;
  /* 0x00b0 */ void* InvalidateOffloadCompleteHandler /* function */;
  /* 0x00b4 */ void* QueryOffloadCompleteHandler /* function */;
  /* 0x00b8 */ void* IndicateOffloadEventHandler /* function */;
  /* 0x00bc */ void* TcpOffloadSendCompleteHandler /* function */;
  /* 0x00c0 */ void* TcpOffloadReceiveCompleteHandler /* function */;
  /* 0x00c4 */ void* TcpOffloadDisconnectCompleteHandler /* function */;
  /* 0x00c8 */ void* TcpOffloadForwardCompleteHandler /* function */;
  /* 0x00cc */ void* TcpOffloadEventHandler /* function */;
  /* 0x00d0 */ void* TcpOffloadReceiveIndicateHandler /* function */;
  /* 0x00d4 */ void* InitiateOffloadHandler /* function */;
  /* 0x00d8 */ void* TerminateOffloadHandler /* function */;
  /* 0x00dc */ void* UpdateOffloadHandler /* function */;
  /* 0x00e0 */ void* InvalidateOffloadHandler /* function */;
  /* 0x00e4 */ void* QueryOffloadHandler /* function */;
  /* 0x00e8 */ void* TcpOffloadReceiveReturnHandler /* function */;
  /* 0x00ec */ class KRef<NDIS_BIND_FILTER_DRIVER> Bind;
  /* 0x00f0 */ struct _UNICODE_STRING ImageName;
} NDIS_FILTER_DRIVER_BLOCK, *PNDIS_FILTER_DRIVER_BLOCK; /* size: 0x00f8 */

typedef struct _NDIS_FILTER_DRIVER_CHARACTERISTICS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned char MajorNdisVersion;
  /* 0x0005 */ unsigned char MinorNdisVersion;
  /* 0x0006 */ unsigned char MajorDriverVersion;
  /* 0x0007 */ unsigned char MinorDriverVersion;
  /* 0x0008 */ unsigned long Flags;
  /* 0x000c */ struct _UNICODE_STRING FriendlyName;
  /* 0x0014 */ struct _UNICODE_STRING UniqueName;
  /* 0x001c */ struct _UNICODE_STRING ServiceName;
  /* 0x0024 */ void* SetOptionsHandler /* function */;
  /* 0x0028 */ void* SetFilterModuleOptionsHandler /* function */;
  /* 0x002c */ void* AttachHandler /* function */;
  /* 0x0030 */ void* DetachHandler /* function */;
  /* 0x0034 */ void* RestartHandler /* function */;
  /* 0x0038 */ void* PauseHandler /* function */;
  /* 0x003c */ void* SendNetBufferListsHandler /* function */;
  /* 0x0040 */ void* SendNetBufferListsCompleteHandler /* function */;
  /* 0x0044 */ void* CancelSendNetBufferListsHandler /* function */;
  /* 0x0048 */ void* ReceiveNetBufferListsHandler /* function */;
  /* 0x004c */ void* ReturnNetBufferListsHandler /* function */;
  /* 0x0050 */ void* OidRequestHandler /* function */;
  /* 0x0054 */ void* OidRequestCompleteHandler /* function */;
  /* 0x0058 */ void* CancelOidRequestHandler /* function */;
  /* 0x005c */ void* DevicePnPEventNotifyHandler /* function */;
  /* 0x0060 */ void* NetPnPEventHandler /* function */;
  /* 0x0064 */ void* StatusHandler /* function */;
  /* 0x0068 */ void* DirectOidRequestHandler /* function */;
  /* 0x006c */ void* DirectOidRequestCompleteHandler /* function */;
  /* 0x0070 */ void* CancelDirectOidRequestHandler /* function */;
} NDIS_FILTER_DRIVER_CHARACTERISTICS, *PNDIS_FILTER_DRIVER_CHARACTERISTICS; /* size: 0x0074 */

typedef struct _NDIS_FILTER_INTERFACE
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ unsigned long FilterType;
  /* 0x000c */ unsigned long FilterRunType;
  /* 0x0010 */ unsigned long IfIndex;
  /* 0x0018 */ union _NET_LUID_LH NetLuid;
  /* 0x0020 */ struct _UNICODE_STRING FilterClass;
  /* 0x0028 */ struct _UNICODE_STRING FilterInstanceName;
} NDIS_FILTER_INTERFACE, *PNDIS_FILTER_INTERFACE; /* size: 0x0030 */

typedef struct _NDIS_FILTER_PARTIAL_CHARACTERISTICS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ void* SendNetBufferListsHandler /* function */;
  /* 0x000c */ void* SendNetBufferListsCompleteHandler /* function */;
  /* 0x0010 */ void* CancelSendNetBufferListsHandler /* function */;
  /* 0x0014 */ void* ReceiveNetBufferListsHandler /* function */;
  /* 0x0018 */ void* ReturnNetBufferListsHandler /* function */;
} NDIS_FILTER_PARTIAL_CHARACTERISTICS, *PNDIS_FILTER_PARTIAL_CHARACTERISTICS; /* size: 0x001c */

typedef struct _NDIS_FILTER_PAUSE_PARAMETERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ unsigned long PauseReason;
} NDIS_FILTER_PAUSE_PARAMETERS, *PNDIS_FILTER_PAUSE_PARAMETERS; /* size: 0x000c */

typedef struct _NDIS_FILTER_RESTART_PARAMETERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ enum _NDIS_MEDIUM MiniportMediaType;
  /* 0x0008 */ enum _NDIS_PHYSICAL_MEDIUM MiniportPhysicalMediaType;
  /* 0x000c */ struct _NDIS_RESTART_ATTRIBUTES* RestartAttributes;
  /* 0x0010 */ unsigned long LowerIfIndex;
  /* 0x0018 */ union _NET_LUID_LH LowerIfNetLuid;
  /* 0x0020 */ unsigned long Flags;
  /* 0x0024 */ long __PADDING__[1];
} NDIS_FILTER_RESTART_PARAMETERS, *PNDIS_FILTER_RESTART_PARAMETERS; /* size: 0x0028 */

typedef enum _NDIS_FILTER_STATE
{
  NdisFilterDetached = 0,
  NdisFilterAttaching = 1,
  NdisFilterPaused = 2,
  NdisFilterRestarting = 3,
  NdisFilterRunning = 4,
  NdisFilterPausing = 5,
  NdisFilterDetaching = 6,
} NDIS_FILTER_STATE, *PNDIS_FILTER_STATE;

typedef struct _NDIS_FILTER_TASK_OFFLOAD
{
  /* 0x0000 */ struct _NDIS_OFFLOAD OffloadCaps;
} NDIS_FILTER_TASK_OFFLOAD, *PNDIS_FILTER_TASK_OFFLOAD; /* size: 0x00b4 */

typedef enum _NDIS_FPNP_REFTAG
{
  FPNPREF_FCANCELOID = 0,
  FPNPREF_PCANCELOID = 1,
  FPNPREF_PCANCELDOID = 2,
  FPNPREF_FCANCELDOID = 3,
  FPNPREF_DOCANCELDOID = 4,
  FPNPREF_DPNPNOTIFYF = 5,
  FPNPREF_DPNPNOTIFYM = 6,
  FPNPREF_DPNPNOTIFYT = 7,
  FPNPREF_FSTATUS = 8,
  FPNPREF_MSTATS = 9,
  FPNPREF_NPNPEVENT = 10,
  FPNPREF_IFTOP = 11,
  FPNPREF_OIDQUEUED = 12,
  FPNPREF_FSYNCOID = 13,
  FPNPREF_PSYNCOID = 14,
  FPNPREF_OIDPENDING = 15,
  FPNPREF_DOIDPENDING = 16,
  FPNPREF_OIDSEARCH = 17,
  FPNPREF_DOIDSEARCH = 18,
  FPNPREF_COMPLETEOID = 19,
  FPNPREF_DOIDCOMPLETE = 20,
  FPNPREF_PREDETACH = 21,
  FPNPREF_APIRESTART = 22,
  FPNPREF_NUMBER_OF_TAGS = 23,
} NDIS_FPNP_REFTAG, *PNDIS_FPNP_REFTAG;

typedef enum _NDIS_FRAME_HEADER
{
  NdisFrameHeaderUndefined = 0,
  NdisFrameHeaderMac = 1,
  NdisFrameHeaderArp = 2,
  NdisFrameHeaderIPv4 = 3,
  NdisFrameHeaderIPv6 = 4,
  NdisFrameHeaderUdp = 5,
  NdisFrameHeaderMaximum = 6,
} NDIS_FRAME_HEADER, *PNDIS_FRAME_HEADER;

typedef struct _NDIS_FRAME_TYPE_AND_OPEN
{
  /* 0x0000 */ unsigned short Type;
  /* 0x0004 */ struct _NDIS_OPEN_BLOCK* Open;
} NDIS_FRAME_TYPE_AND_OPEN, *PNDIS_FRAME_TYPE_AND_OPEN; /* size: 0x0008 */

typedef struct _NDIS_FRAME_TYPE_RECORD
{
  /* 0x0000 */ unsigned int NumEntries;
  /* 0x0004 */ struct _NDIS_FRAME_TYPE_AND_OPEN Entry[16];
} NDIS_FRAME_TYPE_RECORD, *PNDIS_FRAME_TYPE_RECORD; /* size: 0x0084 */

typedef struct _NDIS_GENERIC_OBJECT
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ void* Caller;
  /* 0x0008 */ void* CallersCaller;
  /* 0x000c */ struct _DRIVER_OBJECT* DriverObject;
} NDIS_GENERIC_OBJECT, *PNDIS_GENERIC_OBJECT; /* size: 0x0010 */

typedef struct _NDIS_GFT_OFFLOAD_CAPABILITIES
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ unsigned long CounterCapabilities;
  /* 0x000c */ unsigned long SupportedTableTypes;
  /* 0x0010 */ unsigned long SupportedEncapsulationTypes;
  /* 0x0014 */ unsigned long SupportedIngressExactMatchTableActions;
  /* 0x0018 */ unsigned long SupportedEgressExactMatchTableActions;
  /* 0x001c */ unsigned long SoftwareSupportedIngressExactMatchTableActions;
  /* 0x0020 */ unsigned long SoftwareSupportedEgressExactMatchTableActions;
  /* 0x0024 */ unsigned long SupportedIngressWildcardMatchTableActions;
  /* 0x0028 */ unsigned long SupportedEgressWildcardMatchTableActions;
  /* 0x002c */ unsigned long SoftwareSupportedIngressWildcardMatchTableActions;
  /* 0x0030 */ unsigned long SoftwareSupportedEgressWildcardMatchTableActions;
  /* 0x0034 */ unsigned long NumPacketCounterObjects;
  /* 0x0038 */ unsigned long NumByteCounterObjects;
  /* 0x003c */ unsigned long NumPacketAndByteCounterObjects;
  /* 0x0040 */ unsigned long NumCounterObjectsPerIngressExactMatchFlowEntry;
  /* 0x0044 */ unsigned long NumCounterObjectsPerEgressExactMatchFlowEntry;
  /* 0x0048 */ unsigned long NumCounterObjectsPerIngressWildcardMatchFlowEntry;
  /* 0x004c */ unsigned long NumCounterObjectsPerEgressWildcardMatchFlowEntry;
} NDIS_GFT_OFFLOAD_CAPABILITIES, *PNDIS_GFT_OFFLOAD_CAPABILITIES; /* size: 0x0050 */

typedef struct _NDIS_GLOBAL_TRIAGE_BLOCK
{
  /* 0x0000 */ unsigned long Signature;
  /* 0x0004 */ unsigned short Revision;
  /* 0x0006 */ unsigned short Size;
  /* 0x0008 */ unsigned short MiniportBlockSize;
  /* 0x000a */ unsigned short MiniportAdapterContextOffset;
  /* 0x000c */ unsigned short AdapterInstanceNameOffset;
  /* 0x000e */ unsigned short MiniportLowestFilterOffset;
  /* 0x0010 */ unsigned short MiniportOpenQueueOffset;
  /* 0x0012 */ unsigned short MiniportDriverHandleOffset;
  /* 0x0014 */ unsigned short MiniportPendingOidOffset;
  /* 0x0016 */ unsigned short MiniportSymbolicLinkOffset;
  /* 0x0018 */ unsigned short MDriverBlockSize;
  /* 0x001a */ unsigned short MiniportServiceNameOffset;
  /* 0x001c */ unsigned short MiniportImageNameOffset;
  /* 0x001e */ unsigned short FilterBlockSize;
  /* 0x0020 */ unsigned short FilterDriverOffset;
  /* 0x0022 */ unsigned short FilterModuleContextOffset;
  /* 0x0024 */ unsigned short FilterHigherFilterOffset;
  /* 0x0026 */ unsigned short FilterFriendlyNameOffset;
  /* 0x0028 */ unsigned short FilterPendingOidOffset;
  /* 0x002a */ unsigned short FilterMiniportOffset;
  /* 0x002c */ unsigned short FilterDriverBlockSize;
  /* 0x002e */ unsigned short FilterDriverFriendlyNameOffset;
  /* 0x0030 */ unsigned short FilterServiceNameOffset;
  /* 0x0032 */ unsigned short FilterImageNameOffset;
  /* 0x0034 */ unsigned short OpenBlockSize;
  /* 0x0036 */ unsigned short ProtocolHandleOffset;
  /* 0x0038 */ unsigned short ProtocolBindingContextOffset;
  /* 0x003a */ unsigned short MiniportNextOpenOffset;
  /* 0x003c */ unsigned short OpenMiniportOffset;
  /* 0x003e */ unsigned short ProtocolBlockSize;
  /* 0x0040 */ unsigned short ProtocolNameOffset;
  /* 0x0042 */ unsigned short ProtocolImageNameOffset;
  /* 0x0044 */ unsigned short NBLPoolListOffset;
  /* 0x0046 */ unsigned short AllocatedListOffset;
  /* 0x0048 */ unsigned short OwnerHandleOffset;
  /* 0x004a */ unsigned short LookasideListOffset;
  /* 0x004c */ unsigned short EntryLinkageOffset;
  /* 0x004e */ unsigned short EntryHeaderSize;
  /* 0x0050 */ unsigned short LookasideListSize;
  /* 0x0052 */ unsigned short SListHeadOffset;
  /* 0x0054 */ unsigned short BackupSListHeadOffset;
  /* 0x0056 */ unsigned short NblSize;
  /* 0x0058 */ unsigned short NblCurrentOwnerOffset;
  /* 0x005a */ unsigned short SourceHandleOffset;
  /* 0x005c */ unsigned short NdisOidRequestSize;
  /* 0x005e */ unsigned short NdisTrackNblOwner;
  /* 0x0060 */ unsigned short MaxNumberOfProcessors;
  /* 0x0068 */ unsigned __int64 GlobalNetBufferListPoolList;
  /* 0x0070 */ unsigned __int64 BugcheckMiniport;
  /* 0x0078 */ unsigned __int64 PendingNBL[32];
  /* 0x0178 */ unsigned short PendingNBLCount[32];
  /* 0x01b8 */ unsigned short NblTrackerContextOffset;
  /* 0x01ba */ unsigned short MiniportPnPEventLogOffset;
  /* 0x01bc */ unsigned short MiniportSelectiveSuspendOffset;
  /* 0x01be */ unsigned short MiniportSelectiveSuspendSize;
  /* 0x01c0 */ unsigned short MiniportAoAcOffset;
  /* 0x01c2 */ unsigned short MiniportAoAcSize;
  struct
  {
    /* 0x01c4 */ unsigned short NumProtocolsOffset;
    /* 0x01c6 */ unsigned short ProtocolListOffset;
    /* 0x01c8 */ unsigned short NumFiltersOffset;
    /* 0x01ca */ unsigned short FilterListOffset;
  } /* size: 0x0008 */ MiniportBlockBindings;
  struct
  {
    /* 0x01cc */ unsigned short Size;
    /* 0x01ce */ unsigned short BindStateOffset;
    /* 0x01d0 */ unsigned short BindDriverOffset;
    /* 0x01d2 */ unsigned short BindDriverSize;
  } /* size: 0x0008 */ BindProtocolLink;
  struct
  {
    /* 0x01d4 */ unsigned short Size;
    /* 0x01d6 */ unsigned short BindStateOffset;
    /* 0x01d8 */ unsigned short BindDriverOffset;
    /* 0x01da */ unsigned short BindDriverSize;
  } /* size: 0x0008 */ BindFilterLink;
  struct
  {
    /* 0x01dc */ unsigned short NumContextsOffset;
    /* 0x01de */ unsigned short ContextListOffset;
  } /* size: 0x0004 */ BindState;
  struct
  {
    /* 0x01e0 */ unsigned short Size;
    /* 0x01e2 */ unsigned short NumEntriesOffset;
    /* 0x01e4 */ unsigned short EntrySizeOffset;
  } /* size: 0x0006 */ NdisEventLog;
  /* 0x01e6 */ char __PADDING__[2];
} NDIS_GLOBAL_TRIAGE_BLOCK, *PNDIS_GLOBAL_TRIAGE_BLOCK; /* size: 0x01e8 */

typedef struct _NDIS_GUID
{
  /* 0x0000 */ struct _GUID Guid;
  union
  {
    /* 0x0010 */ unsigned long Oid;
    /* 0x0010 */ int Status;
  }; /* size: 0x0004 */
  /* 0x0014 */ unsigned long Size;
  /* 0x0018 */ unsigned long Flags;
} NDIS_GUID, *PNDIS_GUID; /* size: 0x001c */

typedef enum _NDIS_HALT_ACTION
{
  NdisHaltDeviceDisabled = 0,
  NdisHaltDeviceInstanceDeInitialized = 1,
  NdisHaltDevicePoweredDown = 2,
  NdisHaltDeviceSurpriseRemoved = 3,
  NdisHaltDeviceFailed = 4,
  NdisHaltDeviceInitializationFailed = 5,
  NdisHaltDeviceStopped = 6,
} NDIS_HALT_ACTION, *PNDIS_HALT_ACTION;

typedef struct _NDIS_HD_SPLIT_ATTRIBUTES
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long HardwareCapabilities;
  /* 0x0008 */ unsigned long CurrentCapabilities;
  /* 0x000c */ unsigned long HDSplitFlags;
  /* 0x0010 */ unsigned long BackfillSize;
  /* 0x0014 */ unsigned long MaxHeaderSize;
} NDIS_HD_SPLIT_ATTRIBUTES, *PNDIS_HD_SPLIT_ATTRIBUTES; /* size: 0x0018 */

typedef struct _NDIS_HD_SPLIT_CURRENT_CONFIG
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long HardwareCapabilities;
  /* 0x0008 */ unsigned long CurrentCapabilities;
  /* 0x000c */ unsigned long HDSplitFlags;
  /* 0x0010 */ unsigned long HDSplitCombineFlags;
  /* 0x0014 */ unsigned long BackfillSize;
  /* 0x0018 */ unsigned long MaxHeaderSize;
} NDIS_HD_SPLIT_CURRENT_CONFIG, *PNDIS_HD_SPLIT_CURRENT_CONFIG; /* size: 0x001c */

typedef struct _NDIS_IF_BLOCK
{
  /* 0x04d0 */ struct _LIST_ENTRY Link;
  /* 0x04d8 */ struct _LIST_ENTRY ProviderLink;
  /* 0x04e0 */ struct _LIST_ENTRY NetworkLink;
  /* 0x04e8 */ struct _NDIS_IF_RCV_ADDRESS* ifRcvAddressTable;
  /* 0x04ec */ unsigned long ifRcvAddressCount;
  /* 0x04f0 */ unsigned long ifMaxRcvAddressCount;
  /* 0x04f4 */ unsigned long LowerLayerIfCount;
  /* 0x04f8 */ unsigned long HigherLayerIfCount;
  /* 0x04fc */ long Ref;
  /* 0x0500 */ union _NET_LUID_LH NetLuid;
  /* 0x0508 */ void* ProviderIfContext;
  /* 0x050c */ struct _NDIS_IF_PROVIDER_BLOCK* ProviderHandle;
  /* 0x0510 */ unsigned long Flags;
  /* 0x0514 */ struct _NET_PHYSICAL_LOCATION_LH PhysicalLocation;
  /* 0x0520 */ unsigned long WanTunnelType;
  /* 0x0524 */ unsigned long PortNumber;
  /* 0x0528 */ unsigned __int64 ifLastChange;
  /* 0x0530 */ unsigned __int64 ifCounterDiscontinuityTime;
  /* 0x0538 */ struct _NDIS_IF_NETWORK_BLOCK* Network;
  /* 0x053c */ struct _NDIS_IF_COMPARTMENT_BLOCK* Compartment;
  /* 0x0540 */ struct _KEVENT* AsyncEvent;
  /* 0x0544 */ unsigned char AlreadyDeregistered;
  /* 0x0545 */ unsigned char bNdisIsProvider;
  /* 0x0546 */ unsigned char IsNdisFilter;
  /* 0x0547 */ unsigned char MiniportAvailable;
  /* 0x0548 */ unsigned long MiniportLinkReference;
  /* 0x054c */ enum NdisIfBlockSource Source;
  union
  {
    /* 0x0550 */ struct _NDIS_MINIPORT_BLOCK* Miniport;
    /* 0x0550 */ struct _NDIS_FILTER_BLOCK* Filter;
  }; /* size: 0x0004 */
  /* 0x0554 */ unsigned long SupportedStatistics;
  /* 0x0558 */ struct _IF_COUNTED_STRING_LH* ifL2NetworkInfo;
  /* 0x055c */ struct NDIS_REFCOUNT_HANDLE__* RefCountTracker;
  /* 0x0560 */ struct NDIS_REFCOUNT_HANDLE__* MpRefCountTracker;
  /* 0x0564 */ unsigned long InterlockedFlags;
  /* 0x0568 */ enum _NDIS_MINIPORT_EVENT LastMiniportFatalErrorReason;
  /* 0x0570 */ unsigned __int64 MiniportFatalErrorTimestamp[3];
  /* 0x0588 */ unsigned char MiniportFatalErrorTimestampIndex;
  /* 0x058c */ struct _NDIS_PCW_DATA_BLOCK* PcwDataBlock;
} NDIS_IF_BLOCK, *PNDIS_IF_BLOCK; /* size: 0x0590 */

typedef struct _NDIS_IF_COMPARTMENT_BLOCK
{
  /* 0x0000 */ struct _LIST_ENTRY Link;
  /* 0x0008 */ unsigned int CompartmentId;
  /* 0x000c */ struct _LIST_ENTRY NetworkLink;
  /* 0x0014 */ unsigned long Flags;
  /* 0x0018 */ long Ref;
  /* 0x001c */ long UserRef;
  /* 0x0020 */ struct _NDIS_IF_NETWORK_BLOCK* LoopbackNetwork;
  /* 0x0028 */ struct _NDIS_NSI_COMPARTMENT_RW LoopbackInfo;
  /* 0x0680 */ struct _NDIS_IF_BLOCK* LoopbackIf;
  /* 0x0684 */ struct _KEVENT* AsyncEvent;
} NDIS_IF_COMPARTMENT_BLOCK, *PNDIS_IF_COMPARTMENT_BLOCK; /* size: 0x0688 */

typedef struct _NDIS_IF_NETWORK_BLOCK
{
  /* 0x0000 */ struct _LIST_ENTRY Link;
  /* 0x0008 */ struct _LIST_ENTRY CompartmentLink;
  /* 0x0010 */ struct _GUID NetworkGuid;
  /* 0x0020 */ struct _NDIS_IF_COMPARTMENT_BLOCK* Compartment;
  /* 0x0024 */ struct _LIST_ENTRY InterfaceLink;
  /* 0x002c */ unsigned long Flags;
  /* 0x0030 */ long Ref;
  /* 0x0034 */ struct _NDIS_NSI_NETWORK_RW NetworkInfo;
  /* 0x0244 */ struct _KEVENT* AsyncEvent;
} NDIS_IF_NETWORK_BLOCK, *PNDIS_IF_NETWORK_BLOCK; /* size: 0x0248 */

typedef struct _NDIS_IF_PROVIDER_BLOCK
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ struct _LIST_ENTRY Link;
  /* 0x000c */ struct _LIST_ENTRY IfList;
  /* 0x0014 */ void* IfProviderContext;
  /* 0x0018 */ struct _NDIS_IF_PROVIDER_CHARACTERISTICS ProviderCharacteristics;
} NDIS_IF_PROVIDER_BLOCK, *PNDIS_IF_PROVIDER_BLOCK; /* size: 0x002c */

typedef struct _NDIS_IF_PROVIDER_CHARACTERISTICS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ void* QueryObjectHandler /* function */;
  /* 0x0008 */ void* SetObjectHandler /* function */;
  /* 0x000c */ void* Reserved1;
  /* 0x0010 */ void* Reserved2;
} NDIS_IF_PROVIDER_CHARACTERISTICS, *PNDIS_IF_PROVIDER_CHARACTERISTICS; /* size: 0x0014 */

typedef struct _NDIS_IF_RCV_ADDRESS
{
  /* 0x0008 */ unsigned char ifRcvAddress[32];
} NDIS_IF_RCV_ADDRESS, *PNDIS_IF_RCV_ADDRESS; /* size: 0x0028 */

typedef enum _NDIS_IF_REFTAG
{
  IFREF_REGISTER = 0,
  IFREF_GETII = 1,
  IFREF_TOPGETII = 2,
  IFREF_GETALL = 3,
  IFREF_TOPGETALL = 4,
  IFREF_SET = 5,
  IFREF_ENUMALL = 6,
  IFREF_TOPENUMALL = 7,
  IFREF_GETRCVADDR = 8,
  IFREF_GETALLRCVADDR = 9,
  IFREF_ASYNCCHANGE = 10,
  IFREF_CHALIAS = 11,
  IFREF_MINIPORT = 12,
  IFREF_SETDESCR = 13,
  IFREF_UPDATE = 14,
  IFREF_NUMBER_OF_TAGS = 15,
} NDIS_IF_REFTAG, *PNDIS_IF_REFTAG;

typedef struct _NDIS_IF_STACK_ENTRY
{
  /* 0x0000 */ struct _LIST_ENTRY Link;
  /* 0x0008 */ unsigned long HigherLayerIfIndex;
  /* 0x000c */ unsigned long LowerLayerIfIndex;
  /* 0x0010 */ struct _NDIS_IF_BLOCK* HigherLayerIf;
  /* 0x0014 */ struct _NDIS_IF_BLOCK* LowerLayerIf;
} NDIS_IF_STACK_ENTRY, *PNDIS_IF_STACK_ENTRY; /* size: 0x0018 */

typedef enum _NDIS_INTERFACE_TYPE
{
  NdisInterfaceInternal = 0,
  NdisInterfaceIsa = 1,
  NdisInterfaceEisa = 2,
  NdisInterfaceMca = 3,
  NdisInterfaceTurboChannel = 4,
  NdisInterfacePci = 5,
  NdisInterfacePcMcia = 8,
  NdisInterfaceCBus = 9,
  NdisInterfaceMPIBus = 10,
  NdisInterfaceMPSABus = 11,
  NdisInterfaceProcessorInternal = 12,
  NdisInterfaceInternalPowerBus = 13,
  NdisInterfacePNPISABus = 14,
  NdisInterfacePNPBus = 15,
  NdisInterfaceUSB = 16,
  NdisInterfaceIrda = 17,
  NdisInterface1394 = 18,
  NdisMaximumInterfaceType = 19,
} NDIS_INTERFACE_TYPE, *PNDIS_INTERFACE_TYPE;

typedef struct _NDIS_INTERRUPT_BLOCK
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ volatile unsigned char IsDeregistered;
  /* 0x0008 */ void* MiniportInterruptContext;
  /* 0x000c */ void* MiniportIsr /* function */;
  /* 0x0010 */ void* MiniportDpc /* function */;
  /* 0x0014 */ struct _KDPC InterruptDpc;
  /* 0x0034 */ struct _NDIS_MINIPORT_BLOCK* Miniport;
  /* 0x0038 */ volatile long DpcCount;
  /* 0x003c */ struct _KDPC* Dpc;
  union
  {
    /* 0x0040 */ void* Generic;
    /* 0x0040 */ struct _KINTERRUPT* InterruptObject;
    /* 0x0040 */ struct _IO_INTERRUPT_MESSAGE_INFO* MessageInfoTable;
  }; /* size: 0x0004 */
  /* 0x0044 */ struct _KEVENT DpcsCompletedEvent;
  /* 0x0054 */ unsigned char SharedInterrupt;
  /* 0x0055 */ unsigned char IsrRequested;
  /* 0x0058 */ struct _NDIS_INTERRUPT_BLOCK* NextInterrupt;
  /* 0x005c */ enum _KINTERRUPT_MODE InterruptMode;
  /* 0x0060 */ void* MiniportMessageIsr /* function */;
  /* 0x0064 */ void* MiniportMessageInterruptDpc /* function */;
  /* 0x0068 */ unsigned char MsiSupported;
  /* 0x0069 */ unsigned char MessageUsed;
  /* 0x006c */ unsigned long MessagesSyncLock;
  /* 0x0070 */ struct _IO_INTERRUPT_MESSAGE_INFO* NdisMessageInfoTable;
  /* 0x0074 */ struct _NDIS_DPC_WORK_ITEM* DpcWorkItems;
  /* 0x0078 */ struct _KDPC* MsgDpc;
} NDIS_INTERRUPT_BLOCK, *PNDIS_INTERRUPT_BLOCK; /* size: 0x007c */

typedef enum _NDIS_INTERRUPT_MODERATION
{
  NdisInterruptModerationUnknown = 0,
  NdisInterruptModerationNotSupported = 1,
  NdisInterruptModerationEnabled = 2,
  NdisInterruptModerationDisabled = 3,
} NDIS_INTERRUPT_MODERATION, *PNDIS_INTERRUPT_MODERATION;

typedef struct _NDIS_INTERRUPT_MODERATION_PARAMETERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ enum _NDIS_INTERRUPT_MODERATION InterruptModeration;
} NDIS_INTERRUPT_MODERATION_PARAMETERS, *PNDIS_INTERRUPT_MODERATION_PARAMETERS; /* size: 0x000c */

typedef enum _NDIS_INTERRUPT_TYPE
{
  NDIS_CONNECT_LINE_BASED = 1,
  NDIS_CONNECT_MESSAGE_BASED = 2,
} NDIS_INTERRUPT_TYPE, *PNDIS_INTERRUPT_TYPE;

typedef struct _NDIS_IPSEC_OFFLOAD_V1
{
  struct
  {
    /* 0x0000 */ unsigned long Encapsulation;
    /* 0x0004 */ unsigned long AhEspCombined;
    /* 0x0008 */ unsigned long TransportTunnelCombined;
    /* 0x000c */ unsigned long IPv4Options;
    /* 0x0010 */ unsigned long Flags;
  } /* size: 0x0014 */ Supported;
  struct
  {
    struct /* bitfield */
    {
      /* 0x0014 */ unsigned long Md5 : 2; /* bit position: 0 */
      /* 0x0014 */ unsigned long Sha_1 : 2; /* bit position: 2 */
      /* 0x0014 */ unsigned long Transport : 2; /* bit position: 4 */
      /* 0x0014 */ unsigned long Tunnel : 2; /* bit position: 6 */
      /* 0x0014 */ unsigned long Send : 2; /* bit position: 8 */
      /* 0x0014 */ unsigned long Receive : 2; /* bit position: 10 */
    }; /* bitfield */
  } /* size: 0x0004 */ IPv4AH;
  struct
  {
    struct /* bitfield */
    {
      /* 0x0018 */ unsigned long Des : 2; /* bit position: 0 */
      /* 0x0018 */ unsigned long Reserved : 2; /* bit position: 2 */
      /* 0x0018 */ unsigned long TripleDes : 2; /* bit position: 4 */
      /* 0x0018 */ unsigned long NullEsp : 2; /* bit position: 6 */
      /* 0x0018 */ unsigned long Transport : 2; /* bit position: 8 */
      /* 0x0018 */ unsigned long Tunnel : 2; /* bit position: 10 */
      /* 0x0018 */ unsigned long Send : 2; /* bit position: 12 */
      /* 0x0018 */ unsigned long Receive : 2; /* bit position: 14 */
    }; /* bitfield */
  } /* size: 0x0004 */ IPv4ESP;
} NDIS_IPSEC_OFFLOAD_V1, *PNDIS_IPSEC_OFFLOAD_V1; /* size: 0x001c */

typedef struct _NDIS_IPSEC_OFFLOAD_V1_NET_BUFFER_LIST_INFO
{
  union
  {
    struct
    {
      /* 0x0000 */ void* OffloadHandle;
    } /* size: 0x0004 */ Transmit;
    struct
    {
      struct /* bitfield */
      {
        /* 0x0000 */ unsigned short SaDeleteReq : 1; /* bit position: 0 */
        /* 0x0000 */ unsigned short CryptoDone : 1; /* bit position: 1 */
        /* 0x0000 */ unsigned short NextCryptoDone : 1; /* bit position: 2 */
        /* 0x0000 */ unsigned short Pad : 13; /* bit position: 3 */
      }; /* bitfield */
      /* 0x0002 */ unsigned short CryptoStatus;
    } /* size: 0x0004 */ Receive;
  }; /* size: 0x0004 */
} NDIS_IPSEC_OFFLOAD_V1_NET_BUFFER_LIST_INFO, *PNDIS_IPSEC_OFFLOAD_V1_NET_BUFFER_LIST_INFO; /* size: 0x0004 */

typedef struct _NDIS_IPSEC_OFFLOAD_V2
{
  /* 0x0000 */ unsigned long Encapsulation;
  /* 0x0004 */ unsigned char IPv6Supported;
  /* 0x0005 */ unsigned char IPv4Options;
  /* 0x0006 */ unsigned char IPv6NonIPsecExtensionHeaders;
  /* 0x0007 */ unsigned char Ah;
  /* 0x0008 */ unsigned char Esp;
  /* 0x0009 */ unsigned char AhEspCombined;
  /* 0x000a */ unsigned char Transport;
  /* 0x000b */ unsigned char Tunnel;
  /* 0x000c */ unsigned char TransportTunnelCombined;
  /* 0x000d */ unsigned char LsoSupported;
  /* 0x000e */ unsigned char ExtendedSequenceNumbers;
  /* 0x0010 */ unsigned long UdpEsp;
  /* 0x0014 */ unsigned long AuthenticationAlgorithms;
  /* 0x0018 */ unsigned long EncryptionAlgorithms;
  /* 0x001c */ unsigned long SaOffloadCapacity;
} NDIS_IPSEC_OFFLOAD_V2, *PNDIS_IPSEC_OFFLOAD_V2; /* size: 0x0020 */

typedef struct _NDIS_IPSEC_OFFLOAD_V2_HEADER_NET_BUFFER_LIST_INFO
{
  union
  {
    struct
    {
      struct /* bitfield */
      {
        /* 0x0000 */ unsigned long NextHeader : 8; /* bit position: 0 */
        /* 0x0000 */ unsigned long PadLength : 8; /* bit position: 8 */
        /* 0x0000 */ unsigned long AhHeaderOffset : 8; /* bit position: 16 */
        /* 0x0000 */ unsigned long EspHeaderOffset : 8; /* bit position: 24 */
      }; /* bitfield */
    } /* size: 0x0004 */ Transmit;
    struct
    {
      struct /* bitfield */
      {
        /* 0x0000 */ unsigned long NextHeader : 8; /* bit position: 0 */
        /* 0x0000 */ unsigned long PadLength : 8; /* bit position: 8 */
        /* 0x0000 */ unsigned long HeaderInfoSet : 1; /* bit position: 16 */
      }; /* bitfield */
    } /* size: 0x0004 */ Receive;
  }; /* size: 0x0004 */
} NDIS_IPSEC_OFFLOAD_V2_HEADER_NET_BUFFER_LIST_INFO, *PNDIS_IPSEC_OFFLOAD_V2_HEADER_NET_BUFFER_LIST_INFO; /* size: 0x0004 */

typedef struct _NDIS_IPSEC_OFFLOAD_V2_NET_BUFFER_LIST_INFO
{
  union
  {
    struct
    {
      /* 0x0000 */ void* OffloadHandle;
    } /* size: 0x0004 */ Transmit;
    struct
    {
      struct /* bitfield */
      {
        /* 0x0000 */ unsigned long SaDeleteReq : 1; /* bit position: 0 */
        /* 0x0000 */ unsigned long CryptoDone : 1; /* bit position: 1 */
        /* 0x0000 */ unsigned long NextCryptoDone : 1; /* bit position: 2 */
        /* 0x0000 */ unsigned long Reserved : 13; /* bit position: 3 */
        /* 0x0000 */ unsigned long CryptoStatus : 16; /* bit position: 16 */
      }; /* bitfield */
    } /* size: 0x0004 */ Receive;
  }; /* size: 0x0004 */
} NDIS_IPSEC_OFFLOAD_V2_NET_BUFFER_LIST_INFO, *PNDIS_IPSEC_OFFLOAD_V2_NET_BUFFER_LIST_INFO; /* size: 0x0004 */

typedef struct _NDIS_IPSEC_OFFLOAD_V2_TUNNEL_NET_BUFFER_LIST_INFO
{
  struct
  {
    /* 0x0000 */ void* TunnelHandle;
  } /* size: 0x0004 */ Transmit;
} NDIS_IPSEC_OFFLOAD_V2_TUNNEL_NET_BUFFER_LIST_INFO, *PNDIS_IPSEC_OFFLOAD_V2_TUNNEL_NET_BUFFER_LIST_INFO; /* size: 0x0004 */

typedef struct _NDIS_IPSEC_PACKET_INFO
{
  union
  {
    struct
    {
      /* 0x0000 */ void* OffloadHandle;
      /* 0x0004 */ void* NextOffloadHandle;
    } /* size: 0x0008 */ Transmit;
    struct
    {
      struct /* bitfield */
      {
        /* 0x0000 */ unsigned long SA_DELETE_REQ : 1; /* bit position: 0 */
        /* 0x0000 */ unsigned long CRYPTO_DONE : 1; /* bit position: 1 */
        /* 0x0000 */ unsigned long NEXT_CRYPTO_DONE : 1; /* bit position: 2 */
      }; /* bitfield */
      /* 0x0004 */ unsigned long CryptoStatus;
    } /* size: 0x0008 */ Receive;
  }; /* size: 0x0008 */
} NDIS_IPSEC_PACKET_INFO, *PNDIS_IPSEC_PACKET_INFO; /* size: 0x0008 */

typedef enum _NDIS_IPV4_HEADER_FIELD
{
  NdisIPv4HeaderFieldUndefined = 0,
  NdisIPv4HeaderFieldProtocol = 1,
  NdisIPv4HeaderFieldMaximum = 2,
} NDIS_IPV4_HEADER_FIELD, *PNDIS_IPV4_HEADER_FIELD;

typedef enum _NDIS_IPV6_HEADER_FIELD
{
  NdisIPv6HeaderFieldUndefined = 0,
  NdisIPv6HeaderFieldProtocol = 1,
  NdisIPv6HeaderFieldMaximum = 2,
} NDIS_IPV6_HEADER_FIELD, *PNDIS_IPV6_HEADER_FIELD;

typedef struct _NDIS_IRP_WORK_ITEM
{
  /* 0x0000 */ struct _WORK_QUEUE_ITEM Item;
  /* 0x0010 */ struct _NDIS_MINIPORT_BLOCK* Miniport;
  /* 0x0014 */ struct _IRP* Irp;
} NDIS_IRP_WORK_ITEM, *PNDIS_IRP_WORK_ITEM; /* size: 0x0018 */

typedef struct _NDIS_ITERATIVE_DATA_PATH_TRACKER_ENTRY
{
  /* 0x0000 */ struct _NET_BUFFER_LIST* FirstNbl;
  /* 0x0004 */ struct _NET_BUFFER_LIST* LastNbl;
  /* 0x0008 */ unsigned char IterationInProgress;
  /* 0x0009 */ char __PADDING__[3];
} NDIS_ITERATIVE_DATA_PATH_TRACKER_ENTRY, *PNDIS_ITERATIVE_DATA_PATH_TRACKER_ENTRY; /* size: 0x000c */

typedef struct _NDIS_LINK_PARAMETERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ enum _NET_IF_MEDIA_DUPLEX_STATE MediaDuplexState;
  /* 0x0008 */ unsigned __int64 XmitLinkSpeed;
  /* 0x0010 */ unsigned __int64 RcvLinkSpeed;
  /* 0x0018 */ enum _NDIS_SUPPORTED_PAUSE_FUNCTIONS PauseFunctions;
  /* 0x001c */ unsigned long AutoNegotiationFlags;
} NDIS_LINK_PARAMETERS, *PNDIS_LINK_PARAMETERS; /* size: 0x0020 */

typedef struct _NDIS_LINK_STATE
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ enum _NET_IF_MEDIA_CONNECT_STATE MediaConnectState;
  /* 0x0008 */ enum _NET_IF_MEDIA_DUPLEX_STATE MediaDuplexState;
  /* 0x0010 */ unsigned __int64 XmitLinkSpeed;
  /* 0x0018 */ unsigned __int64 RcvLinkSpeed;
  /* 0x0020 */ enum _NDIS_SUPPORTED_PAUSE_FUNCTIONS PauseFunctions;
  /* 0x0024 */ unsigned long AutoNegotiationFlags;
} NDIS_LINK_STATE, *PNDIS_LINK_STATE; /* size: 0x0028 */

typedef struct _NDIS_LOG
{
  /* 0x0000 */ struct _NDIS_MINIPORT_BLOCK* Miniport;
  /* 0x0004 */ unsigned long LogLock;
  /* 0x0008 */ struct _IRP* Irp;
  /* 0x000c */ unsigned int TotalSize;
  /* 0x0010 */ unsigned int CurrentSize;
  /* 0x0014 */ unsigned int InPtr;
  /* 0x0018 */ unsigned int OutPtr;
  /* 0x001c */ unsigned char LogBuf[1];
  /* 0x001d */ char __PADDING__[3];
} NDIS_LOG, *PNDIS_LOG; /* size: 0x0020 */

typedef enum _NDIS_LWFDRV_REFTAG
{
  LWFDRV_ATTACHING = 0,
  LWFDRV_IOWORKITEM = 1,
  LWFDRV_IOWORKITEMC = 2,
  LWFDRV_FILTERMODULE = 3,
  LWFDRV_PD_CLIENT = 4,
  LWFDRV_NUMBER_OF_TAGS = 5,
} NDIS_LWFDRV_REFTAG, *PNDIS_LWFDRV_REFTAG;

typedef enum _NDIS_LWF_REFTAG
{
  LWFREF_DETACHING = 0,
  LWFREF_WORKITEM = 1,
  LWFREF_NUMBER_OF_TAGS = 2,
} NDIS_LWF_REFTAG, *PNDIS_LWF_REFTAG;

typedef enum _NDIS_MAC_HEADER_FIELD
{
  NdisMacHeaderFieldUndefined = 0,
  NdisMacHeaderFieldDestinationAddress = 1,
  NdisMacHeaderFieldSourceAddress = 2,
  NdisMacHeaderFieldProtocol = 3,
  NdisMacHeaderFieldVlanId = 4,
  NdisMacHeaderFieldPriority = 5,
  NdisMacHeaderFieldPacketType = 6,
  NdisMacHeaderFieldMaximum = 7,
} NDIS_MAC_HEADER_FIELD, *PNDIS_MAC_HEADER_FIELD;

typedef enum _NDIS_MDRV_REFTAG
{
  MDRVREF_IMDEINIT = 0,
  MDRVREF_REMOVINGMP = 1,
  MDRVREF_MINIPORT = 2,
  MDRVREF_IOWORKITEM = 3,
  MDRVREF_IOWORKITEMC = 4,
  MDRVREF_NOTIFYMINI = 5,
  MDRVREF_MPREFH = 6,
  MDRVREF_MPREFN = 7,
  MDRVREF_MPREFT = 8,
  MDRVREF_CHECKPT = 9,
  MDRVREF_TIMEROBJDPC = 10,
  MDRVREF_TIMERDPCX = 11,
  MDRVREF_NUMBER_OF_TAGS = 12,
} NDIS_MDRV_REFTAG, *PNDIS_MDRV_REFTAG;

typedef enum _NDIS_MEDIUM
{
  NdisMedium802_3 = 0,
  NdisMedium802_5 = 1,
  NdisMediumFddi = 2,
  NdisMediumWan = 3,
  NdisMediumLocalTalk = 4,
  NdisMediumDix = 5,
  NdisMediumArcnetRaw = 6,
  NdisMediumArcnet878_2 = 7,
  NdisMediumAtm = 8,
  NdisMediumWirelessWan = 9,
  NdisMediumIrda = 10,
  NdisMediumBpc = 11,
  NdisMediumCoWan = 12,
  NdisMedium1394 = 13,
  NdisMediumInfiniBand = 14,
  NdisMediumTunnel = 15,
  NdisMediumNative802_11 = 16,
  NdisMediumLoopback = 17,
  NdisMediumWiMAX = 18,
  NdisMediumIP = 19,
  NdisMediumMax = 20,
} NDIS_MEDIUM, *PNDIS_MEDIUM;

typedef union _NDIS_MINIPORT_ADAPTER_ATTRIBUTES
{
  union
  {
    /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
    /* 0x0000 */ struct _NDIS_MINIPORT_ADD_DEVICE_REGISTRATION_ATTRIBUTES AddDeviceRegistrationAttributes;
    /* 0x0000 */ struct _NDIS_MINIPORT_ADAPTER_REGISTRATION_ATTRIBUTES RegistrationAttributes;
    /* 0x0000 */ struct _NDIS_MINIPORT_ADAPTER_GENERAL_ATTRIBUTES GeneralAttributes;
    /* 0x0000 */ struct _NDIS_MINIPORT_ADAPTER_OFFLOAD_ATTRIBUTES OffloadAttributes;
    /* 0x0000 */ struct _NDIS_MINIPORT_ADAPTER_NATIVE_802_11_ATTRIBUTES Native_802_11_Attributes;
    /* 0x0000 */ struct _NDIS_MINIPORT_ADAPTER_HARDWARE_ASSIST_ATTRIBUTES HardwareAssistAttributes;
    /* 0x0000 */ struct _NDIS_MINIPORT_ADAPTER_NDK_ATTRIBUTES NDKAttributes;
    /* 0x0000 */ struct _NDIS_MINIPORT_ADAPTER_PACKET_DIRECT_ATTRIBUTES PacketDirectAttributes;
  }; /* size: 0x00d0 */
} NDIS_MINIPORT_ADAPTER_ATTRIBUTES, *PNDIS_MINIPORT_ADAPTER_ATTRIBUTES; /* size: 0x00d0 */

typedef struct _NDIS_MINIPORT_ADAPTER_GENERAL_ATTRIBUTES
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ enum _NDIS_MEDIUM MediaType;
  /* 0x000c */ enum _NDIS_PHYSICAL_MEDIUM PhysicalMediumType;
  /* 0x0010 */ unsigned long MtuSize;
  /* 0x0018 */ unsigned __int64 MaxXmitLinkSpeed;
  /* 0x0020 */ unsigned __int64 XmitLinkSpeed;
  /* 0x0028 */ unsigned __int64 MaxRcvLinkSpeed;
  /* 0x0030 */ unsigned __int64 RcvLinkSpeed;
  /* 0x0038 */ enum _NET_IF_MEDIA_CONNECT_STATE MediaConnectState;
  /* 0x003c */ enum _NET_IF_MEDIA_DUPLEX_STATE MediaDuplexState;
  /* 0x0040 */ unsigned long LookaheadSize;
  /* 0x0044 */ struct _NDIS_PNP_CAPABILITIES* PowerManagementCapabilities;
  /* 0x0048 */ unsigned long MacOptions;
  /* 0x004c */ unsigned long SupportedPacketFilters;
  /* 0x0050 */ unsigned long MaxMulticastListSize;
  /* 0x0054 */ unsigned short MacAddressLength;
  /* 0x0056 */ unsigned char PermanentMacAddress[32];
  /* 0x0076 */ unsigned char CurrentMacAddress[32];
  /* 0x0098 */ struct _NDIS_RECEIVE_SCALE_CAPABILITIES* RecvScaleCapabilities;
  /* 0x009c */ enum _NET_IF_ACCESS_TYPE AccessType;
  /* 0x00a0 */ enum _NET_IF_DIRECTION_TYPE DirectionType;
  /* 0x00a4 */ enum _NET_IF_CONNECTION_TYPE ConnectionType;
  /* 0x00a8 */ unsigned short IfType;
  /* 0x00aa */ unsigned char IfConnectorPresent;
  /* 0x00ac */ unsigned long SupportedStatistics;
  /* 0x00b0 */ unsigned long SupportedPauseFunctions;
  /* 0x00b4 */ unsigned long DataBackFillSize;
  /* 0x00b8 */ unsigned long ContextBackFillSize;
  /* 0x00bc */ unsigned long* SupportedOidList;
  /* 0x00c0 */ unsigned long SupportedOidListLength;
  /* 0x00c4 */ unsigned long AutoNegotiationFlags;
  /* 0x00c8 */ struct _NDIS_PM_CAPABILITIES* PowerManagementCapabilitiesEx;
  /* 0x00cc */ long __PADDING__[1];
} NDIS_MINIPORT_ADAPTER_GENERAL_ATTRIBUTES, *PNDIS_MINIPORT_ADAPTER_GENERAL_ATTRIBUTES; /* size: 0x00d0 */

typedef struct _NDIS_MINIPORT_ADAPTER_HARDWARE_ASSIST_ATTRIBUTES
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ struct _NDIS_HD_SPLIT_ATTRIBUTES* HDSplitAttributes;
  /* 0x0008 */ struct _NDIS_RECEIVE_FILTER_CAPABILITIES* HardwareReceiveFilterCapabilities;
  /* 0x000c */ struct _NDIS_RECEIVE_FILTER_CAPABILITIES* CurrentReceiveFilterCapabilities;
  /* 0x0010 */ struct _NDIS_NIC_SWITCH_CAPABILITIES* HardwareNicSwitchCapabilities;
  /* 0x0014 */ struct _NDIS_NIC_SWITCH_CAPABILITIES* CurrentNicSwitchCapabilities;
  /* 0x0018 */ struct _NDIS_SRIOV_CAPABILITIES* HardwareSriovCapabilities;
  /* 0x001c */ struct _NDIS_SRIOV_CAPABILITIES* CurrentSriovCapabilities;
  /* 0x0020 */ struct _NDIS_QOS_CAPABILITIES* HardwareQosCapabilities;
  /* 0x0024 */ struct _NDIS_QOS_CAPABILITIES* CurrentQosCapabilities;
  /* 0x0028 */ struct _NDIS_GFT_OFFLOAD_CAPABILITIES* HardwareGftOffloadCapabilities;
  /* 0x002c */ struct _NDIS_GFT_OFFLOAD_CAPABILITIES* CurrentGftOffloadCapabilities;
} NDIS_MINIPORT_ADAPTER_HARDWARE_ASSIST_ATTRIBUTES, *PNDIS_MINIPORT_ADAPTER_HARDWARE_ASSIST_ATTRIBUTES; /* size: 0x0030 */

typedef struct _NDIS_MINIPORT_ADAPTER_NATIVE_802_11_ATTRIBUTES
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long OpModeCapability;
  /* 0x0008 */ unsigned long NumOfTXBuffers;
  /* 0x000c */ unsigned long NumOfRXBuffers;
  /* 0x0010 */ unsigned char MultiDomainCapabilityImplemented;
  /* 0x0014 */ unsigned long NumSupportedPhys;
  /* 0x0018 */ struct DOT11_PHY_ATTRIBUTES* SupportedPhyAttributes;
  /* 0x001c */ struct DOT11_EXTSTA_ATTRIBUTES* ExtSTAAttributes;
  /* 0x0020 */ struct DOT11_VWIFI_ATTRIBUTES* VWiFiAttributes;
  /* 0x0024 */ struct _DOT11_EXTAP_ATTRIBUTES* ExtAPAttributes;
  /* 0x0028 */ struct _DOT11_WFD_ATTRIBUTES* WFDAttributes;
} NDIS_MINIPORT_ADAPTER_NATIVE_802_11_ATTRIBUTES, *PNDIS_MINIPORT_ADAPTER_NATIVE_802_11_ATTRIBUTES; /* size: 0x002c */

typedef struct _NDIS_MINIPORT_ADAPTER_NDK_ATTRIBUTES
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned char Enabled;
  /* 0x0008 */ struct _NDIS_NDK_CAPABILITIES* NdkCapabilities;
} NDIS_MINIPORT_ADAPTER_NDK_ATTRIBUTES, *PNDIS_MINIPORT_ADAPTER_NDK_ATTRIBUTES; /* size: 0x000c */

typedef struct _NDIS_MINIPORT_ADAPTER_OFFLOAD_ATTRIBUTES
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ struct _NDIS_OFFLOAD* DefaultOffloadConfiguration;
  /* 0x0008 */ struct _NDIS_OFFLOAD* HardwareOffloadCapabilities;
  /* 0x000c */ struct _NDIS_TCP_CONNECTION_OFFLOAD* DefaultTcpConnectionOffloadConfiguration;
  /* 0x0010 */ struct _NDIS_TCP_CONNECTION_OFFLOAD* TcpConnectionOffloadHardwareCapabilities;
} NDIS_MINIPORT_ADAPTER_OFFLOAD_ATTRIBUTES, *PNDIS_MINIPORT_ADAPTER_OFFLOAD_ATTRIBUTES; /* size: 0x0014 */

typedef struct _NDIS_MINIPORT_ADAPTER_PACKET_DIRECT_ATTRIBUTES
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ unsigned char DmaAddressWidth;
  /* 0x0009 */ char __PADDING__[3];
} NDIS_MINIPORT_ADAPTER_PACKET_DIRECT_ATTRIBUTES, *PNDIS_MINIPORT_ADAPTER_PACKET_DIRECT_ATTRIBUTES; /* size: 0x000c */

typedef struct _NDIS_MINIPORT_ADAPTER_REGISTRATION_ATTRIBUTES
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ void* MiniportAdapterContext;
  /* 0x0008 */ unsigned long AttributeFlags;
  /* 0x000c */ unsigned int CheckForHangTimeInSeconds;
  /* 0x0010 */ enum _NDIS_INTERFACE_TYPE InterfaceType;
} NDIS_MINIPORT_ADAPTER_REGISTRATION_ATTRIBUTES, *PNDIS_MINIPORT_ADAPTER_REGISTRATION_ATTRIBUTES; /* size: 0x0014 */

typedef struct _NDIS_MINIPORT_ADD_DEVICE_REGISTRATION_ATTRIBUTES
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ void* MiniportAddDeviceContext;
  /* 0x0008 */ unsigned long Flags;
} NDIS_MINIPORT_ADD_DEVICE_REGISTRATION_ATTRIBUTES, *PNDIS_MINIPORT_ADD_DEVICE_REGISTRATION_ATTRIBUTES; /* size: 0x000c */

typedef struct _NDIS_MINIPORT_AOAC
{
  /* 0x0000 */ unsigned long Lock;
  /* 0x0004 */ struct _LIST_ENTRY HandleList;
  /* 0x000c */ long HandleListCount;
  /* 0x0010 */ struct _LIST_ENTRY PendingIrpList;
  /* 0x0018 */ long PendingIrpListCount;
  /* 0x001c */ long ActiveRef;
  /* 0x0020 */ enum _NDIS_TMP_REF_REASON TempRefReason;
  /* 0x0028 */ struct _NDIS_TIMER TempRefTimer;
  /* 0x0070 */ struct _NDIS_WORK_ITEM TempRefWorkItem;
  /* 0x0098 */ unsigned char TempDerefInProgress;
  /* 0x009c */ unsigned long DerefTimeoutMilliseconds;
  /* 0x00a0 */ unsigned char WakeWorkItemScheduled;
  /* 0x00a2 */ enum _NDIS_MINIPORT_EVENT WakeWorkItemWakeReason;
  /* 0x00a4 */ struct _NDIS_WORK_ITEM WakeWorkItem;
  /* 0x00cc */ enum _NDIS_NIC_ACTIVE_STATE ActiveState;
  /* 0x00d0 */ struct _NDIS_SS_STOP_FLAGS StopFlags;
  /* 0x00d4 */ unsigned char SSIdleConfirmed;
  /* 0x00d5 */ unsigned char SSIdleConfirmInProgress;
  /* 0x00d6 */ unsigned char RemoteWakeEnabled;
  /* 0x00d7 */ unsigned char DeviceGone;
  /* 0x00d8 */ struct _KEVENT PowerSuspendCompleteEvent;
  /* 0x00e8 */ struct _KEVENT NicQuietCheckCompleteEvent;
  /* 0x00f8 */ unsigned __int64 StartTime;
  /* 0x0100 */ unsigned short LastUnexpectedFailureLine[2];
  /* 0x0104 */ unsigned char TakeStartToRefTime;
  /* 0x0108 */ union _LARGE_INTEGER LastWakeTime;
  /* 0x0110 */ unsigned char TakeWakeToRefTime;
  /* 0x0114 */ long ComponentRefCounts[14];
  /* 0x0150 */ struct _NDIS_AOAC_COMPONENT_REF_TIME CsRefTimes[14];
  /* 0x0230 */ long CsPowerTransitions;
  /* 0x0238 */ unsigned __int64 TotalCsActiveTime;
  /* 0x0240 */ unsigned __int64 TotalCsResiliencyTime;
  /* 0x0248 */ unsigned __int64 CurrentActiveStartTime;
  /* 0x0250 */ unsigned long CsSurpriseWakes;
  /* 0x0254 */ unsigned long CsSpuriousWakes;
  /* 0x0258 */ struct _NDIS_MINIPORT_CS_TRAFFIC_STATS CsTrafficStats[3];
} NDIS_MINIPORT_AOAC, *PNDIS_MINIPORT_AOAC; /* size: 0x02e8 */

typedef struct _NDIS_MINIPORT_BLOCK
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ struct _NDIS_MINIPORT_BLOCK* NextMiniport;
  /* 0x0008 */ struct _NDIS_MINIPORT_BLOCK* BaseMiniport;
  /* 0x000c */ void* MiniportAdapterContext;
  union
  {
    /* 0x0010 */ struct _UNICODE_STRING Reserved4;
    struct
    {
      /* 0x0010 */ unsigned char MajorNdisVersion;
      /* 0x0011 */ unsigned char MinorNdisVersion;
      /* 0x0014 */ struct _NDIS_PCW_DATA_BLOCK* PcwDataBlock;
    }; /* size: 0x0006 */
  }; /* size: 0x0008 */
  union
  {
    /* 0x0018 */ long PcwDatapathEventMask;
    /* 0x0018 */ void* Reserved28;
  }; /* size: 0x0004 */
  /* 0x001c */ struct _NDIS_OPEN_BLOCK* OpenQueue;
  /* 0x0020 */ struct _REFERENCE ShortRef;
  union
  {
    /* 0x0028 */ long PcwDatapathCycleMask;
    /* 0x0028 */ void* Reserved29;
  }; /* size: 0x0004 */
  /* 0x002c */ unsigned char LinkStateIndicationFlags;
  /* 0x002d */ unsigned char LockAcquired;
  /* 0x002e */ unsigned char PmodeOpens;
  /* 0x002f */ unsigned char LoopbackOpens;
  /* 0x0030 */ unsigned long Lock;
  /* 0x0034 */ void* Reserved25;
  /* 0x0038 */ struct _NDIS_MINIPORT_INTERRUPT* Interrupt;
  /* 0x003c */ unsigned long Flags;
  /* 0x0040 */ unsigned long PnPFlags;
  /* 0x0044 */ struct _LIST_ENTRY PacketList;
  /* 0x004c */ struct _NDIS_PACKET* FirstPendingPacket;
  /* 0x0050 */ struct _NDIS_PACKET* ReturnPacketsQueue;
  /* 0x0054 */ unsigned long RequestBuffer;
  /* 0x0058 */ void* Reserved26;
  /* 0x005c */ struct _NDIS_MINIPORT_BLOCK* PrimaryMiniport;
  /* 0x0060 */ void* NextCancelSendNetBufferListsHandler /* function */;
  /* 0x0064 */ void* OidContext;
  /* 0x0068 */ unsigned long SupportedOidListLength;
  /* 0x006c */ struct _CM_RESOURCE_LIST* Resources;
  /* 0x0070 */ struct _NDIS_TIMER WakeUpDpcTimer;
  union
  {
    /* 0x00b8 */ struct _UNICODE_STRING Reserved20;
    struct
    {
      /* 0x00b8 */ enum _NET_IF_MEDIA_CONNECT_STATE MiniportMediaConnectState;
      /* 0x00bc */ enum _NET_IF_MEDIA_DUPLEX_STATE MiniportMediaDuplexState;
    }; /* size: 0x0008 */
  }; /* size: 0x0008 */
  /* 0x00c0 */ struct _UNICODE_STRING SymbolicLinkName;
  /* 0x00c8 */ unsigned long CheckForHangSeconds;
  /* 0x00cc */ unsigned short CFHangTicks;
  /* 0x00ce */ unsigned short CFHangCurrentTick;
  /* 0x00d0 */ int ResetStatus;
  /* 0x00d4 */ struct _NDIS_OPEN_BLOCK* ResetOpen;
  union
  {
    /* 0x00d8 */ struct _X_FILTER* EthDB;
    /* 0x00d8 */ struct _X_FILTER* NullDB;
  }; /* size: 0x0004 */
  /* 0x00dc */ void* Unused1;
  /* 0x00e0 */ void* Unused2;
  /* 0x00e4 */ void* Unused3;
  /* 0x00e8 */ void* PacketIndicateHandler /* function */;
  /* 0x00ec */ void* SendCompleteHandler /* function */;
  /* 0x00f0 */ void* SendResourcesHandler /* function */;
  /* 0x00f4 */ void* ResetCompleteHandler /* function */;
  /* 0x00f8 */ enum _NDIS_MEDIUM MediaType;
  /* 0x00fc */ unsigned long AutoNegotiationFlags;
  /* 0x0100 */ enum _NDIS_INTERFACE_TYPE Reserved5;
  /* 0x0104 */ enum _NDIS_INTERFACE_TYPE AdapterType;
  union
  {
    /* 0x0108 */ struct _DEVICE_OBJECT* Reserved6;
    /* 0x0108 */ enum _NET_IF_MEDIA_CONNECT_STATE MediaConnectState;
  }; /* size: 0x0004 */
  union
  {
    /* 0x010c */ struct _DEVICE_OBJECT* Reserved7;
    /* 0x010c */ enum _NET_IF_MEDIA_DUPLEX_STATE MediaDuplexState;
  }; /* size: 0x0004 */
  /* 0x0110 */ unsigned long* SupportedOidList;
  /* 0x0114 */ struct _NDIS_SG_DMA_BLOCK* MiniportSGDmaBlock;
  /* 0x0118 */ struct _NDIS_AF_LIST* CallMgrAfList;
  /* 0x011c */ void* MiniportThread;
  /* 0x0120 */ void* SetInfoBuf;
  /* 0x0124 */ unsigned short SetInfoBufLen;
  /* 0x0126 */ unsigned short MaxSendPackets;
  /* 0x0128 */ int FakeStatus;
  union
  {
    /* 0x012c */ void* Reserved24;
    /* 0x012c */ void* GlobalTriageBlock;
  }; /* size: 0x0004 */
  /* 0x0130 */ struct _NDIS_RECEIVE_SCALE_PARAMETERS* CombinedNdisRSSParameters;
  union
  {
    /* 0x0134 */ struct _NDIS_MINIPORT_TIMER* TimerQueue;
    /* 0x0134 */ struct _NDIS_TIMER_ENTRY* TimerObjectQueue;
  }; /* size: 0x0004 */
  /* 0x0138 */ unsigned int MacOptions;
  /* 0x013c */ struct _NDIS_REQUEST* PendingRequest;
  /* 0x0140 */ unsigned int MaximumLongAddresses;
  /* 0x0144 */ unsigned int Reserved27;
  /* 0x0148 */ unsigned int MiniportCurrentLookahead;
  /* 0x014c */ unsigned int MiniportMaximumLookahead;
  union
  {
    /* 0x0150 */ unsigned long Reserved1;
    /* 0x0150 */ struct _X_FILTER* NullMediaFilter;
  }; /* size: 0x0004 */
  /* 0x0154 */ void* DisableInterruptHandler /* function */;
  /* 0x0158 */ void* EnableInterruptHandler /* function */;
  /* 0x015c */ void* SendPacketsHandler /* function */;
  /* 0x0160 */ void* DeferredSendHandler /* function */;
  /* 0x0164 */ void* EthRxIndicateHandler /* function */;
  /* 0x0168 */ void* Reserved30;
  /* 0x016c */ void* NextSendNetBufferListsHandler /* function */;
  /* 0x0170 */ void* EthRxCompleteHandler /* function */;
  /* 0x0174 */ void* Reserved31;
  /* 0x0178 */ void* SavedNextSendNetBufferListsHandler /* function */;
  /* 0x017c */ void* StatusHandler /* function */;
  /* 0x0180 */ void* StatusCompleteHandler /* function */;
  /* 0x0184 */ void* TDCompleteHandler /* function */;
  /* 0x0188 */ void* QueryCompleteHandler /* function */;
  /* 0x018c */ void* SetCompleteHandler /* function */;
  /* 0x0190 */ void* WanSendCompleteHandler /* function */;
  /* 0x0194 */ void* WanRcvHandler /* function */;
  /* 0x0198 */ void* WanRcvCompleteHandler /* function */;
  /* 0x019c */ void* SendNetBufferListsCompleteHandler /* function */;
  /* 0x01a0 */ struct _KEVENT* PnPEventLockEvent;
  /* 0x01a4 */ struct _NDIS_OBJECT_HEADER* MediaSpecificAttributes;
  /* 0x01a8 */ struct _IRP* PendingQueryPowerIrp;
  /* 0x01ac */ struct _NDIS_INTERRUPT_BLOCK* InterruptEx;
  /* 0x01b0 */ unsigned __int64 XmitLinkSpeed;
  /* 0x01b8 */ unsigned __int64 RcvLinkSpeed;
  /* 0x01c0 */ enum _NDIS_SUPPORTED_PAUSE_FUNCTIONS PauseFunctions;
  /* 0x01c4 */ enum _NDIS_SUPPORTED_PAUSE_FUNCTIONS MiniportPauseFunctions;
  /* 0x01c8 */ unsigned long MiniportAutoNegotiationFlags;
  /* 0x01cc */ struct _SINGLE_LIST_ENTRY WorkQueue[7];
  /* 0x01e8 */ struct _SINGLE_LIST_ENTRY SingleWorkItems[6];
  /* 0x0200 */ unsigned char SendFlags;
  /* 0x0201 */ unsigned char MP6SupportPM;
  /* 0x0202 */ unsigned char XState;
  /* 0x0204 */ struct _NDIS_LOG* Log;
  /* 0x0208 */ struct _CM_RESOURCE_LIST* AllocatedResources;
  /* 0x020c */ struct _CM_RESOURCE_LIST* AllocatedResourcesTranslated;
  /* 0x0210 */ struct _SINGLE_LIST_ENTRY PatternList;
  /* 0x0214 */ struct _SINGLE_LIST_ENTRY WOLPatternList;
  /* 0x0218 */ struct _SINGLE_LIST_ENTRY PMProtocolOffloadList;
  /* 0x021c */ struct _NDIS_PNP_CAPABILITIES PMCapabilities61;
  /* 0x022c */ struct _NDIS_PM_CAPABILITIES PMHardwareCapabilities;
  /* 0x0268 */ struct _NDIS_PM_CAPABILITIES PMAdvertisedCapabilities;
  /* 0x02a4 */ struct _NDIS_PM_PARAMETERS PMCurrentParameters;
  /* 0x02b8 */ struct _NDIS_PM_PARAMETERS PMWmiParameters;
  /* 0x02cc */ struct _DEVICE_CAPABILITIES OriginalDeviceCaps;
  /* 0x030c */ struct _DEVICE_CAPABILITIES DeviceCaps;
  /* 0x034c */ unsigned char S0WakeupSupported;
  /* 0x0350 */ unsigned long WakeUpEnable;
  /* 0x0354 */ struct _IRP* WaitWakeIrp;
  /* 0x0358 */ struct _KEVENT WaitWakeIrpCompleted;
  /* 0x0368 */ BOOL WaitWakeIoCompletionRoutineRan;
  /* 0x0369 */ BOOL WaitWakeCancelInProgress;
  /* 0x036a */ BOOL WaitWakeCancelAttempted;
  /* 0x036c */ enum _SYSTEM_POWER_STATE WaitWakeSystemState;
  /* 0x0370 */ union _LARGE_INTEGER VcIndex;
  /* 0x0378 */ unsigned long VcCountLock;
  /* 0x037c */ struct _LIST_ENTRY WmiEnabledVcs;
  /* 0x0384 */ struct _NDIS_GUID* pNdisGuidMap;
  /* 0x0388 */ struct _NDIS_GUID* pCustomGuidMap;
  /* 0x038c */ unsigned short VcCount;
  /* 0x038e */ unsigned short cNdisGuidMap;
  /* 0x0390 */ unsigned short cCustomGuidMap;
  /* 0x0398 */ struct _NDIS_TIMER MediaDisconnectTimer;
  /* 0x03e0 */ enum _NDIS_PNP_DEVICE_STATE PnPDeviceState;
  /* 0x03e4 */ enum _NDIS_PNP_DEVICE_STATE OldPnPDeviceState;
  /* 0x03e8 */ struct _KDPC DeferredDpc;
  /* 0x0408 */ union _LARGE_INTEGER StartTicks;
  /* 0x0410 */ struct _NDIS_PACKET** IndicatedPacket;
  /* 0x0414 */ struct _KEVENT* RemoveReadyEvent;
  /* 0x0418 */ struct _KEVENT* AllRequestsCompletedEvent;
  /* 0x041c */ unsigned long InitTimeMs;
  /* 0x0420 */ struct _NDIS_MINIPORT_WORK_ITEM WorkItemBuffer[6];
  /* 0x0468 */ struct _OID_LIST* OidList;
  /* 0x046c */ unsigned short InternalResetCount;
  /* 0x046e */ unsigned short MiniportResetCount;
  /* 0x0470 */ unsigned short MediaSenseConnectCount;
  /* 0x0472 */ unsigned short MediaSenseDisconnectCount;
  /* 0x0474 */ struct _NDIS_PACKET** xPackets;
  /* 0x0478 */ unsigned long UserModeOpenReferences;
  /* 0x047c */ void* WSendPacketsHandler /* function */;
  /* 0x0480 */ unsigned long MiniportAttributes;
  /* 0x0484 */ unsigned short NumOpens;
  /* 0x0486 */ unsigned short CFHangXTicks;
  /* 0x0488 */ unsigned long RequestCount;
  /* 0x048c */ unsigned long IndicatedPacketsCount;
  /* 0x0490 */ enum _NDIS_PHYSICAL_MEDIUM PhysicalMediumType;
  /* 0x0494 */ enum _NDIS_MEDIUM MiniportMediaType;
  /* 0x0498 */ struct _NDIS_REQUEST* LastRequest;
  /* 0x049c */ void* FakeMac;
  /* 0x04a0 */ unsigned long LockDbg;
  /* 0x04a4 */ unsigned long LockDbgX;
  /* 0x04a8 */ void* LockThread;
  /* 0x04ac */ unsigned long InfoFlags;
  /* 0x04b0 */ unsigned long TimerQueueLock;
  /* 0x04b4 */ struct _KEVENT* ResetCompletedEvent;
  /* 0x04b8 */ void* SavedPacketIndicateHandler /* function */;
  /* 0x04bc */ long RegisteredInterrupts;
  /* 0x04c0 */ unsigned long SetOid;
  /* 0x04c4 */ struct _KEVENT CFHCompletedEvent;
  /* 0x04d4 */ struct _WORK_QUEUE_ITEM CFHWorkItem;
  /* 0x04e4 */ volatile long CFHWorkItemQueued;
  /* 0x04e8 */ void* DeviceContext;
  /* 0x04ec */ struct _NDIS_MINIPORT_RSS_PARAMETERS_CACHE* RssParametersBuffer;
  /* 0x04f0 */ unsigned char UsingMSIX;
  /* 0x04f1 */ unsigned char Miniport5InNdis6Mode;
  /* 0x04f2 */ unsigned char Miniport5HasNdis6Component;
  /* 0x04f3 */ unsigned char InitMode;
  /* 0x04f4 */ unsigned char InitModeNotNeededAnymore;
  /* 0x04f5 */ char MediaChangeFilters;
  /* 0x04f6 */ unsigned char CheckPacketFilters;
  /* 0x04f7 */ unsigned char ReceiveFilters;
  /* 0x04f8 */ unsigned long RecvLock;
  /* 0x04fc */ enum _NDIS_MINIPORT_STATE RecvState;
  /* 0x0500 */ unsigned long OutstandingReceives;
  /* 0x0504 */ void* MiniportRecvLockThread;
  /* 0x0508 */ unsigned long RecvLockDbg;
  /* 0x050c */ void* NextSendPacketsHandler /* function */;
  /* 0x0510 */ void* FinalSendPacketsHandler /* function */;
  /* 0x0514 */ struct _NDIS_FILTER_BLOCK* LowestFilter;
  /* 0x0518 */ struct _NDIS_FILTER_BLOCK* HighestFilter;
  /* 0x051c */ void* ShutdownContext;
  /* 0x0520 */ void* ShutdownHandler /* function */;
  /* 0x0524 */ struct _KBUGCHECK_CALLBACK_RECORD BugcheckCallbackRecord;
  /* 0x0544 */ void* TopIndicateNetBufferListsHandler /* function */;
  /* 0x0548 */ void* TopIndicateLoopbackNetBufferListsHandler /* function */;
  /* 0x054c */ void* Ndis5PacketIndicateHandler /* function */;
  /* 0x0550 */ void* MiniportReturnPacketHandler /* function */;
  /* 0x0554 */ void* MiniportReturnPacketContext;
  /* 0x0558 */ void* SynchronousReturnPacketHandler /* function */;
  /* 0x055c */ void* SynchronousReturnPacketContext;
  /* 0x0560 */ struct _LIST_ENTRY OidRequestList;
  /* 0x0568 */ struct _NDIS_OID_REQUEST* PendingOidRequest;
  /* 0x056c */ struct _NDIS_OID_REQUEST* ProcessedOidRequest;
  /* 0x0570 */ struct _NDIS_OID_REQUEST* HookedOidRequest;
  /* 0x0574 */ void* NextCoOidRequestHandle;
  /* 0x0578 */ unsigned long Ndis6ProtocolsBound;
  /* 0x057c */ unsigned long PmodeOpen6;
  /* 0x0580 */ enum _NDIS_MINIPORT_STATE State;
  /* 0x0584 */ struct _KEVENT* AsyncOpCompletionEvent;
  /* 0x0588 */ int AsyncOpCompletionStatus;
  /* 0x0590 */ unsigned __int64 MaxXmitLinkSpeed;
  /* 0x0598 */ unsigned __int64 MaxRcvLinkSpeed;
  /* 0x05a0 */ unsigned long SupportedPacketFilters;
  /* 0x05a4 */ struct _NDIS_MINIPORT_HANDLERS NoFilter;
  /* 0x0600 */ struct _NDIS_MINIPORT_HANDLERS Next;
  /* 0x065c */ unsigned char ReceivePathEnabled;
  /* 0x065d */ unsigned char NormalTopReceive;
  /* 0x0660 */ enum _NDIS_SEND_PATH_TYPE SendPathType;
  /* 0x0664 */ enum _NDIS_SEND_PATH_TYPE SavedSendPathType;
  /* 0x0668 */ unsigned char SavedReceivePathEnabled;
  /* 0x066c */ unsigned long FilterPnPFlags;
  /* 0x0670 */ unsigned long SupportedStatistics;
  /* 0x0674 */ unsigned long cDpcSendCompletes;
  /* 0x0678 */ unsigned long cDpcRcvIndications;
  /* 0x067c */ unsigned long cDpcRcvIndicationCalls;
  /* 0x0680 */ unsigned long cDpcNbSendCompletes;
  /* 0x0684 */ unsigned long cDpcNblSendCompletes;
  /* 0x0688 */ unsigned long cDpcNblIndications;
  /* 0x068c */ unsigned long cDpcMaxPacketsIndicated;
  /* 0x0690 */ unsigned long cDpcTotalDpcCount;
  /* 0x0694 */ struct _NDIS_RECEIVE_SCALE_CAPABILITIES RecvScaleCapabilities;
  /* 0x06a8 */ struct _NDIS_MINIPORT_ADAPTER_GENERAL_ATTRIBUTES* GeneralAttributes;
  /* 0x06ac */ struct _LIST_ENTRY PortList;
  /* 0x06b4 */ unsigned char* AllocatedPortIndices;
  /* 0x06b8 */ unsigned long AllocatedPortIndicesLength;
  /* 0x06bc */ unsigned long NumberOfPorts;
  /* 0x06c0 */ unsigned long NumberOfActivePorts;
  /* 0x06c8 */ unsigned __int64 MiniportXmitLinkSpeed;
  /* 0x06d0 */ unsigned __int64 MiniportRcvLinkSpeed;
  /* 0x06d8 */ struct _NDIS_TIMER InitModeTimeoutTimer;
  /* 0x0720 */ struct _NDIS_WORK_ITEM InitModeTimeoutWorkItem;
  /* 0x0748 */ struct _KEVENT InitModeTimeoutTimerQueuedEvent;
  /* 0x0758 */ unsigned long DataBackFillSize;
  /* 0x075c */ unsigned long ContextBackFillSize;
  /* 0x0760 */ struct _NDIS_RESTART_GENERAL_ATTRIBUTES TopFilterRestartAttributes;
  /* 0x07b0 */ struct _NDIS_RECEIVE_SCALE_CAPABILITIES TopRecvScaleCapabilities;
  /* 0x07c4 */ unsigned long NsiOpenReferences;
  /* 0x07c8 */ void* ProcessingOpen;
  /* 0x07cc */ struct _KEVENT* NsiRequestsCompletedEvent;
  /* 0x07d0 */ enum _DEVICE_POWER_STATE QueryPowerDeviceState;
  /* 0x07d4 */ unsigned char MinimumNdisMajorVersion;
  /* 0x07d5 */ unsigned char MinimumNdisMinorVersion;
  /* 0x07d8 */ struct _NDIS_MINIPORT_STATS* BottomIfStats;
  /* 0x07dc */ struct _NDIS_M_PERIODIC_RECEIVES PeriodicReceiveQueue;
  /* 0x0838 */ struct PNDIS_PER_PROCESSOR_SLOT__* PeriodicReceivesNblCountIndex;
  /* 0x083c */ enum _NDIS_PORT_CONTROL_STATE DefaultSendControlState;
  /* 0x0840 */ enum _NDIS_PORT_CONTROL_STATE DefaultRcvControlState;
  /* 0x0844 */ enum _NDIS_PORT_AUTHORIZATION_STATE DefaultSendAuthorizationState;
  /* 0x0848 */ enum _NDIS_PORT_AUTHORIZATION_STATE DefaultRcvAuthorizationState;
  /* 0x084c */ enum _NDIS_PORT_CONTROL_STATE DefaultPortSendControlState;
  /* 0x0850 */ enum _NDIS_PORT_CONTROL_STATE DefaultPortRcvControlState;
  /* 0x0854 */ enum _NDIS_PORT_AUTHORIZATION_STATE DefaultPortSendAuthorizationState;
  /* 0x0858 */ enum _NDIS_PORT_AUTHORIZATION_STATE DefaultPortRcvAuthorizationState;
  /* 0x085c */ struct _NDIS_PCI_DEVICE_CUSTOM_PROPERTIES PciDeviceCustomProperties;
  /* 0x0890 */ void* TopNdis5PacketIndicateHandler /* function */;
  /* 0x0894 */ unsigned long* ndisSupportedOidList;
  /* 0x0898 */ unsigned long ndisSupportedOidListLength;
  /* 0x089c */ unsigned long MsiIntCount;
  /* 0x08a0 */ struct _WORK_QUEUE_ITEM MiniportDpcWorkItem;
  /* 0x08b0 */ unsigned __int64 InvalidFrames;
  /* 0x08b8 */ long PagingPathCount;
  /* 0x08bc */ struct _LIST_ENTRY ReceiveQueueList;
  /* 0x08c4 */ unsigned char* AllocatedQueueIndices;
  /* 0x08c8 */ unsigned long AllocatedQueueIndicesLength;
  /* 0x08cc */ unsigned long NumReceiveQueues;
  /* 0x08d0 */ struct _LIST_ENTRY ReceiveFilterList;
  /* 0x08d8 */ unsigned char* AllocatedReceiveFilterIndices;
  /* 0x08dc */ unsigned long AllocatedReceiveFilterIndicesLength;
  /* 0x08e0 */ unsigned long NumReceiveFilters;
  /* 0x08e4 */ unsigned long EnabledReceiveFilterTypes;
  /* 0x08e8 */ unsigned long EnabledReceiveQueueTypes;
  /* 0x08ec */ struct _NDIS_RECEIVE_FILTER_CAPABILITIES* ReceiveFilterHwCapabilities;
  /* 0x08f0 */ struct _NDIS_RECEIVE_FILTER_CAPABILITIES* ReceiveFilterCurrentCapabilities;
  /* 0x08f4 */ struct _NDIS_RECEIVE_FILTER_CAPABILITIES* TopReceiveFilterCurrentCapabilities;
  /* 0x08f8 */ struct _NDIS_NIC_SWITCH_CAPABILITIES* NicSwitchHwCapabilities;
  /* 0x08fc */ struct _NDIS_NIC_SWITCH_CAPABILITIES* NicSwitchCurrentCapabilities;
  /* 0x0900 */ struct _NDIS_NIC_SWITCH_CAPABILITIES* TopNicSwitchCurrentCapabilities;
  /* 0x0904 */ struct _LIST_ENTRY SharedMemoryBlockList;
  /* 0x090c */ void* AllocateSharedMemoryHandler /* function */;
  /* 0x0910 */ void* FreeSharedMemoryHandler /* function */;
  /* 0x0914 */ void* AllocateSharedMemoryContext;
  /* 0x0918 */ struct PCI_MSI_CAPABILITY MsiCaps;
  /* 0x0930 */ struct PCI_MSIX_CAPABILITY MsiXCaps;
  /* 0x0940 */ unsigned __int64 NumberOfIndirectionTableChanges;
  /* 0x0948 */ unsigned int PciDeviceSriovSupport;
  union
  {
    /* 0x094c */ unsigned char BeginSavedFields;
    /* 0x094c */ unsigned long NumUserOpens;
  }; /* size: 0x0004 */
  /* 0x0950 */ struct _NDIS_MINIPORT_OFFLOAD_REG OffloadRegistry;
  /* 0x0954 */ unsigned short MediaDisconnectTimeOut;
  /* 0x0956 */ unsigned short SGMapRegistersNeeded;
  /* 0x0958 */ unsigned long DriverVerifyFlags;
  /* 0x095c */ void* SetBusData /* function */;
  /* 0x0960 */ void* GetBusData /* function */;
  /* 0x0964 */ void* BusDataContext;
  /* 0x0968 */ enum _INTERFACE_TYPE BusType;
  /* 0x096c */ unsigned long BusNumber;
  /* 0x0970 */ unsigned long SlotNumber;
  /* 0x0974 */ struct _NDIS_EVENT OpenReadyEvent;
  /* 0x0984 */ unsigned long NumAdminOpens;
  /* 0x0988 */ struct _NDIS_M_DRIVER_BLOCK* DriverHandle;
  /* 0x098c */ struct _NDIS_BIND_PATHS* BindPaths;
  /* 0x0990 */ enum _NDIS_PHYSICAL_MEDIUM MiniportPhysicalMediumType;
  /* 0x0994 */ void* SecurityDescriptor;
  /* 0x0998 */ struct _UNICODE_STRING BaseName;
  /* 0x09a0 */ struct _UNICODE_STRING MiniportName;
  /* 0x09a8 */ struct _DEVICE_OBJECT* DeviceObject;
  /* 0x09ac */ struct _DEVICE_OBJECT* PhysicalDeviceObject;
  /* 0x09b0 */ struct _DEVICE_OBJECT* NextDeviceObject;
  /* 0x09b4 */ struct _NDIS_MINIPORT_BLOCK* NextGlobalMiniport;
  /* 0x09b8 */ struct _UNICODE_STRING* pAdapterInstanceName;
  /* 0x09bc */ unsigned long PnPCapabilities;
  /* 0x09c0 */ enum _DEVICE_POWER_STATE CurrentDevicePowerState;
  /* 0x09c4 */ unsigned long PowerStateLock;
  /* 0x09c8 */ enum _DEVICE_POWER_STATE DriverPowerState;
  /* 0x09cc */ enum _DEVICE_POWER_STATE PrevDriverPowerState;
  /* 0x09d0 */ struct _NET_BUFFER_LIST* LowPowerRcvReturnNbls;
  /* 0x09d4 */ unsigned long PendingReturnNBLCount;
  /* 0x09d8 */ unsigned char SurpriseRemoveFlushedRcvReturnQueue;
  /* 0x09dc */ struct NDIS_NBL_TRACKER_HANDLE__* LowPowerRcvReturnNblTracker;
  /* 0x09e0 */ struct _NDIS_PM_ADMIN_CONFIG PMAdminConfig;
  /* 0x09e4 */ struct _KSEMAPHORE PMPatternSemaphore;
  /* 0x09f8 */ struct _KSEMAPHORE PMOffloadSemaphore;
  /* 0x0a0c */ void* BusInterface;
  /* 0x0a10 */ unsigned short InstanceNumber;
  /* 0x0a14 */ void* ConfigurationHandle;
  /* 0x0a18 */ struct _GUID InterfaceGuid;
  /* 0x0a28 */ union _NET_LUID_LH NetLuid;
  /* 0x0a30 */ unsigned char IfBlockAvailable;
  /* 0x0a34 */ struct _NDIS_IF_BLOCK* IfBlock;
  /* 0x0a38 */ struct _KEVENT* IfBlockPointerRefZeroEvent;
  /* 0x0a3c */ unsigned int IfIndex;
  /* 0x0a40 */ enum _NET_IF_ADMIN_STATUS AdminStatus;
  /* 0x0a44 */ enum _NET_IF_OPER_STATUS OperStatus;
  /* 0x0a48 */ unsigned long OperStatusFlags;
  union
  {
    /* 0x0a4c */ void* SendHandler /* function */;
    /* 0x0a4c */ void* WanSendHandler /* function */;
  }; /* size: 0x0004 */
  /* 0x0a50 */ struct NDIS_NBL_TRACKER_HANDLE__* NblTracker;
  /* 0x0a54 */ struct _DEVICE_RESET_INTERFACE_STANDARD* ReenumerateSelfInterface;
  /* 0x0a58 */ struct _NDIS_MINIPORT_OFFLOAD* Offload;
  /* 0x0a5c */ void* NDKBlock;
  /* 0x0a60 */ void* AddDeviceContext;
  /* 0x0a64 */ struct _IO_REMOVE_LOCK RemoveLock;
  /* 0x0a7c */ struct _UNICODE_STRING DevinterfaceNetSymbolicLinkName;
  /* 0x0a84 */ unsigned long PhysicalMediumInInf;
  /* 0x0a88 */ class KPtr<Rtl::KString,KDeletePtr<Rtl::KString> > ExportName;
  /* 0x0a8c */ class KPtr<Rtl::KString,KDeletePtr<Rtl::KString> > FilterClass;
  /* 0x0a90 */ void* StatusProcessingThread;
  /* 0x0a94 */ unsigned long StatusProcessingDbgX;
  /* 0x0a98 */ struct _UNICODE_STRING FdoName;
  /* 0x0aa0 */ struct _KEVENT PowerD0CompleteEvent;
  /* 0x0ab0 */ long LastD0CompleteStatus;
  /* 0x0ab4 */ enum _NDIS_MINIPORT_EVENT LastD0Reason;
  /* 0x0ab8 */ unsigned long DirectOidRequestCount;
  /* 0x0abc */ struct _KEVENT* AllDirectRequestsCompletedEvent;
  /* 0x0ac0 */ struct _NDIS_HD_SPLIT_CURRENT_CONFIG* HDSplitCurrentConfig;
  /* 0x0ac4 */ void* MSIXConfigContext;
  /* 0x0ac8 */ void* SetMSIXTableEntry /* function */;
  /* 0x0acc */ void* MaskMSIXTableEntry /* function */;
  /* 0x0ad0 */ void* UnmaskMSIXTableEntry /* function */;
  /* 0x0ad4 */ struct _WORK_QUEUE_ITEM DevicePowerStateWorkItem;
  /* 0x0ae4 */ struct _WORK_QUEUE_ITEM SystemPowerStateWorkItem;
  /* 0x0af4 */ struct _NDIS_RECEIVE_QUEUE_BLOCK* DefaultReceiveQueue;
  /* 0x0af8 */ unsigned long MaxNumRssProcessors;
  /* 0x0afc */ struct _PROCESSOR_NUMBER RssBaseProcessor;
  /* 0x0b00 */ struct _PROCESSOR_NUMBER RssMaxProcessor;
  /* 0x0b04 */ enum _NDIS_RSS_PROFILE RssProfile;
  /* 0x0b08 */ unsigned short NumaNodeId;
  /* 0x0b0c */ unsigned short* NumaDistances;
  /* 0x0b10 */ struct _UNICODE_STRING* pModifiedInstanceName;
  /* 0x0b14 */ unsigned long SyncFlags;
  /* 0x0b18 */ unsigned long WSyncFlags;
  /* 0x0b1c */ unsigned long InterlockedFlags;
  /* 0x0b20 */ struct _ULONG_REFERENCE Ref;
  /* 0x0b2c */ struct _NDIS_SELECTIVE_SUSPEND* SelectiveSuspend;
  /* 0x0b30 */ struct _NDIS_MINIPORT_AOAC* AoAc;
  /* 0x0b34 */ enum _NDIS_PM_WAKE_REASON_TYPE LastWakeReason;
  /* 0x0b38 */ struct NDIS_EVENT_LOG_HANDLE__* PnpEventLog;
  /* 0x0b3c */ struct _NDIS_D0_SIGNAL_WORK_ITEM D0CompleteSignalWorkItem;
  /* 0x0b6c */ struct _NDIS_PHYSICAL_PERFORMANCE_COUNTERS* PhysicalPerformanceCounters;
  /* 0x0b70 */ union _LARGE_INTEGER TimeOfInitialization;
  /* 0x0b78 */ union _LARGE_INTEGER LastSystemSleepTime;
  /* 0x0b80 */ unsigned __int64 TotalSystemSleepTimeMs;
  /* 0x0b88 */ struct _NDIS_SRIOV_CAPABILITIES* SriovHwCapabilities;
  /* 0x0b8c */ struct _NDIS_SRIOV_CAPABILITIES* SriovCurrentCapabilities;
  /* 0x0b90 */ unsigned __int64 InvalidateBlockMask;
  /* 0x0b98 */ struct _IRP* InvalidateBlockIoctlPf;
  /* 0x0b9c */ struct _IRP* InvalidateBlockIoctlVf;
  /* 0x0ba0 */ struct _VPCI_INVALIDATE_BLOCK_OUTPUT InvalidateBlockVfParams;
  /* 0x0ba8 */ struct _KEVENT InvalidateBlockEvent;
  /* 0x0bb8 */ unsigned short InvalidateVfId;
  /* 0x0bba */ unsigned char InvalidateBlockCancelling;
  /* 0x0bbc */ struct _NDIS_PF_BLOCK* PFBlock;
  /* 0x0bc0 */ unsigned long NumSwitches;
  /* 0x0bc4 */ struct _LIST_ENTRY NicSwitchList;
  /* 0x0bcc */ unsigned long NumAllocatedVFs;
  /* 0x0bd0 */ struct _LIST_ENTRY VFList;
  /* 0x0bd8 */ unsigned long NumActiveVPorts;
  /* 0x0bdc */ struct _LIST_ENTRY VPortList;
  /* 0x0be4 */ unsigned char* AllocatedVPortIndices;
  /* 0x0be8 */ unsigned long AllocatedVPortIndicesLength;
  /* 0x0bec */ void* SetVirtualFunctionData /* function */;
  /* 0x0bf0 */ void* GetVirtualFunctionData /* function */;
  /* 0x0bf4 */ void* EnableVirtualization /* function */;
  /* 0x0bf8 */ void* GetVirtualDeviceLocation /* function */;
  /* 0x0bfc */ void* GetVirtualFunctionProbedBars /* function */;
  /* 0x0c00 */ void* VirtInterfaceContext;
  /* 0x0c04 */ struct _UNICODE_STRING DevinterfaceVirtSymbolicLinkName;
  /* 0x0c0c */ void* VpciInterfaceDereference /* function */;
  /* 0x0c10 */ void* WriteVfConfigBlock /* function */;
  /* 0x0c14 */ void* ReadVfConfigBlock /* function */;
  /* 0x0c18 */ void* VpciInterfaceContext;
  /* 0x0c1c */ unsigned int VfSerialNumber;
  /* 0x0c20 */ struct _LUID SriovLuid;
  /* 0x0c28 */ struct NDIS_REFCOUNT_HANDLE__* RefCountTracker;
  /* 0x0c2c */ struct NDIS_REFCOUNT_HANDLE__* NsiRefCountTracker;
  /* 0x0c30 */ struct _NDIS_QOS_CAPABILITIES* QosHwCapabilities;
  /* 0x0c34 */ struct _NDIS_QOS_CAPABILITIES* QosCurrentCapabilities;
  /* 0x0c38 */ struct _NDIS_QOS_PARAMETERS* QosOperationalParameters;
  /* 0x0c3c */ unsigned long QosOperationalParametersBufferSize;
  /* 0x0c40 */ struct _NDIS_QOS_PARAMETERS* QosRemoteParameters;
  /* 0x0c44 */ unsigned long QosRemoteParametersBufferSize;
  /* 0x0c48 */ unsigned __int64 DeviceFlags;
  /* 0x0c50 */ void* VerifierContext;
  /* 0x0c54 */ struct _WORK_QUEUE_ITEM SurpriseRemovalWorkItem;
  /* 0x0c64 */ struct Ndis::BindStack Bindings;
  /* 0x0cc0 */ struct Ndis::BindEngine BindEngine;
  /* 0x0d0c */ class Rtl::KNeutralLock<enum NDIS_MINIPORT_POLICY_OWNER> MiniportOwner;
  /* 0x0d24 */ BOOL PmInterruptedByPnp;
  /* 0x0d25 */ BOOL DoNotBlockOnMiniportLock;
  /* 0x0d28 */ struct NDIS_MINIPORT_HOOK_ADAPTER_HANDLE__* HookAdapterHandle;
  /* 0x0d2c */ struct _WORK_QUEUE_ITEM InterfaceUpdateWorkItem;
  /* 0x0d3c */ BOOL InterfaceUpdateInProgress;
  /* 0x0d3d */ BOOL MacAddressUpdateQueued;
  /* 0x0d3e */ BOOL MtuUpdateQueued;
  /* 0x0d40 */ struct _IF_PHYSICAL_ADDRESS_LH PendingMacAddress;
  /* 0x0d64 */ unsigned long PendingMtuSize;
  /* 0x0d68 */ struct RECORDER_LOG__* BlackBoxHandle;
  /* 0x0d6c */ struct _KEVENT* PowerCompleteEvent;
  /* 0x0d70 */ long PowerCompleteStatus;
  /* 0x0d74 */ long __PADDING__[1];
} NDIS_MINIPORT_BLOCK, *PNDIS_MINIPORT_BLOCK; /* size: 0x0d78 */

typedef struct _NDIS_MINIPORT_CO_CHARACTERISTICS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ void* CoCreateVcHandler /* function */;
  /* 0x000c */ void* CoDeleteVcHandler /* function */;
  /* 0x0010 */ void* CoActivateVcHandler /* function */;
  /* 0x0014 */ void* CoDeactivateVcHandler /* function */;
  /* 0x0018 */ void* CoSendNetBufferListsHandler /* function */;
  /* 0x001c */ void* CoOidRequestHandler /* function */;
} NDIS_MINIPORT_CO_CHARACTERISTICS, *PNDIS_MINIPORT_CO_CHARACTERISTICS; /* size: 0x0020 */

typedef struct _NDIS_MINIPORT_CS_TRAFFIC_STATS
{
  /* 0x0000 */ unsigned __int64 IfInUnicastPackets;
  /* 0x0008 */ unsigned __int64 IfOutUnicastPackets;
  /* 0x0010 */ unsigned __int64 IfInMulticastPackets;
  /* 0x0018 */ unsigned __int64 IfOutMulticastPackets;
  /* 0x0020 */ unsigned __int64 IfInBroadcastPackets;
  /* 0x0028 */ unsigned __int64 IfOutBroadcastPackets;
} NDIS_MINIPORT_CS_TRAFFIC_STATS, *PNDIS_MINIPORT_CS_TRAFFIC_STATS; /* size: 0x0030 */

typedef struct _NDIS_MINIPORT_DRIVER_CHARACTERISTICS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned char MajorNdisVersion;
  /* 0x0005 */ unsigned char MinorNdisVersion;
  /* 0x0006 */ unsigned char MajorDriverVersion;
  /* 0x0007 */ unsigned char MinorDriverVersion;
  /* 0x0008 */ unsigned long Flags;
  /* 0x000c */ void* SetOptionsHandler /* function */;
  /* 0x0010 */ void* InitializeHandlerEx /* function */;
  /* 0x0014 */ void* HaltHandlerEx /* function */;
  /* 0x0018 */ void* UnloadHandler /* function */;
  /* 0x001c */ void* PauseHandler /* function */;
  /* 0x0020 */ void* RestartHandler /* function */;
  /* 0x0024 */ void* OidRequestHandler /* function */;
  /* 0x0028 */ void* SendNetBufferListsHandler /* function */;
  /* 0x002c */ void* ReturnNetBufferListsHandler /* function */;
  /* 0x0030 */ void* CancelSendHandler /* function */;
  /* 0x0034 */ void* CheckForHangHandlerEx /* function */;
  /* 0x0038 */ void* ResetHandlerEx /* function */;
  /* 0x003c */ void* DevicePnPEventNotifyHandler /* function */;
  /* 0x0040 */ void* ShutdownHandlerEx /* function */;
  /* 0x0044 */ void* CancelOidRequestHandler /* function */;
  /* 0x0048 */ void* DirectOidRequestHandler /* function */;
  /* 0x004c */ void* CancelDirectOidRequestHandler /* function */;
} NDIS_MINIPORT_DRIVER_CHARACTERISTICS, *PNDIS_MINIPORT_DRIVER_CHARACTERISTICS; /* size: 0x0050 */

typedef enum _NDIS_MINIPORT_EVENT
{
  NdisMEvent_Unknown = 0,
  NdisMEventDx_SystemSleep = 1,
  NdisMEventDx_NicQuiet = 2,
  NdisMEventDx_SSIdle = 3,
  NdisMEventDx_D3DTimeout = 4,
  NdisMEventD0_SystemResume = 5,
  NdisMEventD0_NicActive = 6,
  NdisMEventD0_AoAcWake = 7,
  NdisMEventD0_SSResume = 8,
  NdisMEventD0_D3DCancel = 9,
  NdisMEventD0_D3DWake = 10,
  NdisMEventD0_D3DResume = 11,
  NdisMEventD0_Complete = 12,
  NdisMEventD0_SSComplete = 13,
  NdisMEventDx_Complete = 14,
  NdisMEventDx_SSComplete = 15,
  NdisMEventD0_AoAcSurpriseWake = 20,
  NdisMEvent_DeviceAdded = 31,
  NdisMEvent_DeviceStart = 32,
  NdisMEvent_DeviceQueryRemove = 33,
  NdisMEvent_DeviceCancelRemove = 34,
  NdisMEvent_DeviceRemove = 35,
  NdisMEvent_DeviceSurpriseRemoval = 36,
  NdisMEvent_DeviceQueryStop = 37,
  NdisMEvent_DeviceCancelStop = 38,
  NdisMEvent_DeviceStop = 39,
  NdisMEvent_MiniportInitialized = 51,
  NdisMEvent_MiniportHalted = 52,
  NdisMEvent_MiniportPaused = 53,
  NdisMEvent_MiniportRestarted = 54,
  NdisMEvent_MiniportPmInitialized = 55,
  NdisMEventErr_Min = 70,
  NdisMEventErr_UserRequested = 70,
  NdisMEventErr_MiniportRequested = 71,
  NdisMEventErr_FailedIMInitDevice = 72,
  NdisMEventErr_FailedRestart = 73,
  NdisMEventErr_FailedPowerD0 = 74,
  NdisMEventErr_FailedPowerDx = 75,
  NdisMEventErr_UninstalledByUsermode = 76,
  NdisMEventErr_Max = 76,
} NDIS_MINIPORT_EVENT, *PNDIS_MINIPORT_EVENT;

typedef struct _NDIS_MINIPORT_HANDLERS
{
  /* 0x0000 */ void* RequestContext;
  /* 0x0004 */ void* CancelSendContext;
  /* 0x0008 */ void* IndicateNetBufferListsContext;
  /* 0x000c */ struct NDIS_NBL_TRACKER_HANDLE__* IndicateNetBufferListsTracker;
  /* 0x0010 */ struct _NDIS_OBJECT_HEADER* IndicateNetBufferListsObject;
  /* 0x0014 */ void* SaveIndicateNetBufferListsContext;
  /* 0x0018 */ void* ReturnNetBufferListsContext;
  /* 0x001c */ struct NDIS_NBL_TRACKER_HANDLE__* ReturnNetBufferListsTracker;
  /* 0x0020 */ struct _NDIS_OBJECT_HEADER* ReturnNetBufferListsObject;
  /* 0x0024 */ void* SendNetBufferListsContext;
  /* 0x0028 */ struct NDIS_NBL_TRACKER_HANDLE__* SendNetBufferListsTracker;
  /* 0x002c */ struct _NDIS_OBJECT_HEADER* SendNetBufferListsObject;
  /* 0x0030 */ void* SendNetBufferListsCompleteContext;
  /* 0x0034 */ struct NDIS_NBL_TRACKER_HANDLE__* SendNetBufferListsCompleteTracker;
  /* 0x0038 */ struct _NDIS_OBJECT_HEADER* SendNetBufferListsCompleteObject;
  /* 0x003c */ void* RequestHandle;
  union
  {
    /* 0x0040 */ void* CancelSendHandler /* function */;
    /* 0x0040 */ void* CancelSendPacketsHandler /* function */;
  }; /* size: 0x0004 */
  /* 0x0044 */ void* SendNetBufferListsCompleteHandler /* function */;
  /* 0x0048 */ void* IndicateNetBufferListsHandler /* function */;
  /* 0x004c */ void* SaveIndicateNetBufferListsHandler /* function */;
  /* 0x0050 */ void* ReturnNetBufferListsHandler /* function */;
  /* 0x0054 */ void* SendNetBufferListsHandler /* function */;
  /* 0x0058 */ void* DirectRequestHandle;
} NDIS_MINIPORT_HANDLERS, *PNDIS_MINIPORT_HANDLERS; /* size: 0x005c */

typedef enum _NDIS_MINIPORT_HOOK_DRIVER_TYPE
{
  NdisMiniportHookDriverTypeNone = 0,
  NdisMiniportHookDriverTypeWdi = 1,
  NdisMiniportHookDriverType_Maximum = 2,
} NDIS_MINIPORT_HOOK_DRIVER_TYPE, *PNDIS_MINIPORT_HOOK_DRIVER_TYPE;

typedef struct _NDIS_MINIPORT_INIT_PARAMETERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ struct _CM_PARTIAL_RESOURCE_LIST* AllocatedResources;
  /* 0x000c */ void* IMDeviceInstanceContext;
  /* 0x0010 */ void* MiniportAddDeviceContext;
  /* 0x0014 */ unsigned long IfIndex;
  /* 0x0018 */ union _NET_LUID_LH NetLuid;
  /* 0x0020 */ struct _NDIS_PORT_AUTHENTICATION_PARAMETERS* DefaultPortAuthStates;
  /* 0x0024 */ struct _NDIS_PCI_DEVICE_CUSTOM_PROPERTIES* PciDeviceCustomProperties;
} NDIS_MINIPORT_INIT_PARAMETERS, *PNDIS_MINIPORT_INIT_PARAMETERS; /* size: 0x0028 */

typedef struct _NDIS_MINIPORT_INTERRUPT
{
  /* 0x0000 */ struct _KINTERRUPT* InterruptObject;
  union
  {
    /* 0x0004 */ volatile unsigned char IsDeregistered;
    /* 0x0004 */ unsigned long DpcCountLock;
  }; /* size: 0x0004 */
  /* 0x0008 */ void* Reserved;
  /* 0x000c */ void* MiniportIsr /* function */;
  /* 0x0010 */ void* MiniportDpc /* function */;
  /* 0x0014 */ struct _KDPC InterruptDpc;
  /* 0x0034 */ struct _NDIS_MINIPORT_BLOCK* Miniport;
  /* 0x0038 */ volatile long DpcCount;
  /* 0x003c */ struct _KEVENT DpcsCompletedEvent;
  /* 0x004c */ unsigned char SharedInterrupt;
  /* 0x004d */ unsigned char IsrRequested;
  /* 0x004e */ char __PADDING__[2];
} NDIS_MINIPORT_INTERRUPT, *PNDIS_MINIPORT_INTERRUPT; /* size: 0x0050 */

typedef struct _NDIS_MINIPORT_INTERRUPT_CHARACTERISTICS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ void* InterruptHandler /* function */;
  /* 0x0008 */ void* InterruptDpcHandler /* function */;
  /* 0x000c */ void* DisableInterruptHandler /* function */;
  /* 0x0010 */ void* EnableInterruptHandler /* function */;
  /* 0x0014 */ unsigned char MsiSupported;
  /* 0x0015 */ unsigned char MsiSyncWithAllMessages;
  /* 0x0018 */ void* MessageInterruptHandler /* function */;
  /* 0x001c */ void* MessageInterruptDpcHandler /* function */;
  /* 0x0020 */ void* DisableMessageInterruptHandler /* function */;
  /* 0x0024 */ void* EnableMessageInterruptHandler /* function */;
  /* 0x0028 */ enum _NDIS_INTERRUPT_TYPE InterruptType;
  /* 0x002c */ struct _IO_INTERRUPT_MESSAGE_INFO* MessageInfoTable;
} NDIS_MINIPORT_INTERRUPT_CHARACTERISTICS, *PNDIS_MINIPORT_INTERRUPT_CHARACTERISTICS; /* size: 0x0030 */

typedef struct _NDIS_MINIPORT_OFFLOAD
{
  /* 0x0000 */ unsigned char SupportsOffload;
  /* 0x0001 */ unsigned char SupportsTopOffload;
  /* 0x0002 */ unsigned char SupportsTcpConnectionOffload;
  /* 0x0003 */ unsigned char SupportsTopTcpConnectionOffload;
  /* 0x0004 */ unsigned char TopConnectionOffloadPaused;
  /* 0x0005 */ unsigned char RSCDisallowed;
  /* 0x0008 */ struct _NDIS_OFFLOAD MiniportCurrentConfig;
  /* 0x00bc */ struct _NDIS_OFFLOAD TopCapabilities;
  /* 0x0170 */ struct _NDIS_OFFLOAD MiniportInitialConfig;
  /* 0x0224 */ struct _NDIS_OFFLOAD MiniportHardwareCapabilities;
  /* 0x02d8 */ struct _NDIS_OFFLOAD_ENCAPSULATION MiniportSetEncapsulation;
  /* 0x02f4 */ struct _NDIS_OFFLOAD_ENCAPSULATION TopSetEncapsulation;
  /* 0x0310 */ struct _NDIS_OFFLOAD_ENCAPSULATION TopMergedEncapsulation;
  /* 0x032c */ struct _NDIS_OFFLOAD_ENCAPSULATION MiniportMergedEncapsulation;
  /* 0x0348 */ struct _NDIS_TCP_CONNECTION_OFFLOAD TopTcpConnectionOffloadCapabilities;
  /* 0x035c */ struct _NDIS_TCP_CONNECTION_OFFLOAD MiniportTcpConnectionOffloadCurrentConfig;
  /* 0x0370 */ struct _NDIS_TCP_CONNECTION_OFFLOAD MiniportHwTcpConnectionOffloadCapabilities;
  /* 0x0384 */ struct _NDIS_TCP_CONNECTION_OFFLOAD_PARAMETERS TopTcpConnectionParameters;
  /* 0x03c0 */ struct _NDIS_TCP_CONNECTION_OFFLOAD_PARAMETERS MiniportTcpConnectionParameters;
  /* 0x03fc */ unsigned char MiniportTask[144];
  /* 0x048c */ unsigned long MiniportTaskSize;
  /* 0x0490 */ unsigned char Ndis5Xsum;
  /* 0x0491 */ unsigned char Ndis5LSO;
  /* 0x0492 */ unsigned char Ndis5IPsec;
  /* 0x0494 */ void* MiniportRequestBuffer;
  /* 0x0498 */ unsigned long MiniportRequestOid;
  /* 0x049c */ unsigned long MiniportRequestBufferLength;
} NDIS_MINIPORT_OFFLOAD, *PNDIS_MINIPORT_OFFLOAD; /* size: 0x04a0 */

typedef struct _NDIS_MINIPORT_OFFLOAD_BLOCK_LIST
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ struct _NDIS_MINIPORT_OFFLOAD_BLOCK_LIST* NextBlock;
  /* 0x0008 */ struct _NDIS_MINIPORT_OFFLOAD_BLOCK_LIST* DependentBlockList;
  /* 0x000c */ int Status;
  /* 0x0010 */ void* NdisReserved[2];
  /* 0x0018 */ void** MiniportOffloadContext;
  /* 0x001c */ void* NdisOffloadHandle;
  /* 0x0020 */ void* ProtocolReserved[2];
  /* 0x0028 */ void* MiniportReserved[2];
  /* 0x0030 */ void* ImReserved[2];
  /* 0x0038 */ void* Scratch[2];
  /* 0x0040 */ void* SourceHandle;
  /* 0x0044 */ unsigned long PortNumber;
  /* 0x0048 */ struct _NET_BUFFER_LIST* NetBufferListChain;
} NDIS_MINIPORT_OFFLOAD_BLOCK_LIST, *PNDIS_MINIPORT_OFFLOAD_BLOCK_LIST; /* size: 0x004c */

typedef struct _NDIS_MINIPORT_OFFLOAD_REG
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned long IPv4XSumTxDisabled : 1; /* bit position: 0 */
      /* 0x0000 */ unsigned long IPv4XSumRxDisabled : 1; /* bit position: 1 */
      /* 0x0000 */ unsigned long TCPv4XSumTxDisabled : 1; /* bit position: 2 */
      /* 0x0000 */ unsigned long TCPv4XSumRxDisabled : 1; /* bit position: 3 */
      /* 0x0000 */ unsigned long UDPv4XSumTxDisabled : 1; /* bit position: 4 */
      /* 0x0000 */ unsigned long UDPv4XSumRxDisabled : 1; /* bit position: 5 */
      /* 0x0000 */ unsigned long TCPv6XSumTxDisabled : 1; /* bit position: 6 */
      /* 0x0000 */ unsigned long TCPv6XSumRxDisabled : 1; /* bit position: 7 */
      /* 0x0000 */ unsigned long UDPv6XSumTxDisabled : 1; /* bit position: 8 */
      /* 0x0000 */ unsigned long UDPv6XSumRxDisabled : 1; /* bit position: 9 */
      /* 0x0000 */ unsigned long LsoV1IPv4Disabled : 1; /* bit position: 10 */
      /* 0x0000 */ unsigned long LsoV2IPv4Disabled : 1; /* bit position: 11 */
      /* 0x0000 */ unsigned long LsoV2IPv6Disabled : 1; /* bit position: 12 */
      /* 0x0000 */ unsigned long IPsecAHDisabled : 1; /* bit position: 13 */
      /* 0x0000 */ unsigned long IPsecESPDisabled : 1; /* bit position: 14 */
      /* 0x0000 */ unsigned long TCPv4ConnectionOffloadDisabled : 1; /* bit position: 15 */
      /* 0x0000 */ unsigned long TCPv6ConnectionOffloadDisabled : 1; /* bit position: 16 */
      /* 0x0000 */ unsigned long ReadRegistry : 1; /* bit position: 17 */
      /* 0x0000 */ unsigned long IPsecV2AHDisabled : 1; /* bit position: 18 */
      /* 0x0000 */ unsigned long IPsecV2ESPDisabled : 1; /* bit position: 19 */
      /* 0x0000 */ unsigned long IPsecV2IPv4AHDisabled : 1; /* bit position: 20 */
      /* 0x0000 */ unsigned long IPsecV2IPv4ESPDisabled : 1; /* bit position: 21 */
      /* 0x0000 */ unsigned long IPSecV2IPv6Disabled : 1; /* bit position: 22 */
      /* 0x0000 */ unsigned long RscIPv4Disabled : 1; /* bit position: 23 */
      /* 0x0000 */ unsigned long RscIPv6Disabled : 1; /* bit position: 24 */
      /* 0x0000 */ unsigned long EncapsulatedPacketTaskOffloadDisabled : 1; /* bit position: 25 */
      /* 0x0000 */ unsigned long EncapsulatedPacketTaskOffloadNvgreDisabled : 1; /* bit position: 26 */
      /* 0x0000 */ unsigned long EncapsulatedPacketTaskOffloadVxlanDisabled : 1; /* bit position: 27 */
    }; /* bitfield */
    /* 0x0000 */ unsigned long Value;
  }; /* size: 0x0004 */
} NDIS_MINIPORT_OFFLOAD_REG, *PNDIS_MINIPORT_OFFLOAD_REG; /* size: 0x0004 */

typedef struct _NDIS_MINIPORT_PAUSE_PARAMETERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ unsigned long Flags;
  /* 0x0008 */ unsigned long PauseReason;
} NDIS_MINIPORT_PAUSE_PARAMETERS, *PNDIS_MINIPORT_PAUSE_PARAMETERS; /* size: 0x000c */

typedef struct _NDIS_MINIPORT_PNP_CHARACTERISTICS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ void* MiniportAddDeviceHandler /* function */;
  /* 0x0008 */ void* MiniportRemoveDeviceHandler /* function */;
  /* 0x000c */ void* MiniportFilterResourceRequirementsHandler /* function */;
  /* 0x0010 */ void* MiniportStartDeviceHandler /* function */;
  /* 0x0014 */ unsigned long Flags;
} NDIS_MINIPORT_PNP_CHARACTERISTICS, *PNDIS_MINIPORT_PNP_CHARACTERISTICS; /* size: 0x0018 */

typedef struct _NDIS_MINIPORT_RESTART_PARAMETERS
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ struct _NDIS_RESTART_ATTRIBUTES* RestartAttributes;
  /* 0x0008 */ unsigned long Flags;
} NDIS_MINIPORT_RESTART_PARAMETERS, *PNDIS_MINIPORT_RESTART_PARAMETERS; /* size: 0x000c */

typedef struct _NDIS_MINIPORT_RSS_PARAMETERS_CACHE
{
  /* 0x0000 */ unsigned char Combined[604];
  /* 0x025c */ unsigned char Oid[604];
} NDIS_MINIPORT_RSS_PARAMETERS_CACHE, *PNDIS_MINIPORT_RSS_PARAMETERS_CACHE; /* size: 0x04b8 */

typedef enum _NDIS_MINIPORT_STATE
{
  NdisMiniportUndefinedState = 0,
  NdisMiniportHalted = 1,
  NdisMiniportInitializing = 2,
  NdisMiniportRestarting = 3,
  NdisMiniportRunning = 4,
  NdisMiniportPausing = 5,
  NdisMiniportPaused = 6,
} NDIS_MINIPORT_STATE, *PNDIS_MINIPORT_STATE;

typedef struct _NDIS_MINIPORT_STATS
{
  /* 0x0000 */ unsigned __int64 ifHCInOctets;
  /* 0x0008 */ unsigned __int64 ifHCInUcastOctets;
  /* 0x0010 */ unsigned __int64 ifHCInBroadcastOctets;
  /* 0x0018 */ unsigned __int64 ifHCInMulticastOctets;
  /* 0x0020 */ unsigned __int64 ifHCInUcastPkts;
  /* 0x0028 */ unsigned __int64 ifHCInMulticastPkts;
  /* 0x0030 */ unsigned __int64 ifHCInBroadcastPkts;
  /* 0x0038 */ unsigned __int64 ifHCOutOctets;
  /* 0x0040 */ unsigned __int64 ifHCOutUcastPkts;
  /* 0x0048 */ unsigned __int64 ifHCOutMulticastPkts;
  /* 0x0050 */ unsigned __int64 ifHCOutBroadcastPkts;
  /* 0x0058 */ unsigned __int64 ifHCOutUcastOctets;
  /* 0x0060 */ unsigned __int64 ifHCOutMulticastOctets;
  /* 0x0068 */ unsigned __int64 ifHCOutBroadcastOctets;
} NDIS_MINIPORT_STATS, *PNDIS_MINIPORT_STATS; /* size: 0x0070 */

typedef struct _NDIS_MINIPORT_SYSPOWER_NOTIFY
{
  /* 0x0000 */ struct _NDIS_OBJECT_HEADER Header;
  /* 0x0004 */ enum _SYSTEM_POWER_STATE TargetSystemState;
  /* 0x0008 */ enum _SYSTEM_POWER_STATE EffectiveSystemState;
} NDIS_MINIPORT_SYSPOWER_NOTIFY, *PNDIS_MINIPORT_SYSPOWER_NOTIFY; /* size: 0x000c */

typedef struct _NDIS_MINIPORT_TIMER
{
  /* 0x0000 */ struct _KTIMER Timer;
  /* 0x0028 */ struct _KDPC Dpc;
  /* 0x0048 */ void* MiniportTimerFunction /* function */;
  /* 0x004c */ void* MiniportTimerContext;
  /* 0x0050 */ struct _NDIS_MINIPORT_BLOCK* Miniport;
  /* 0x0054 */ struct _NDIS_MINIPORT_TIMER* NextTimer;
} NDIS_MINIPORT_TIMER, *PNDIS_MINIPORT_TIMER; /* size: 0x0058 */

typedef struct _NDIS_MINIPORT_WORK_ITEM
{
  /* 0x0000 */ struct _SINGLE_LIST_ENTRY Link;
  /* 0x0004 */ enum _NDIS_WORK_ITEM_TYPE WorkItemType;
  /* 0x0008 */ void* WorkItemContext;
} NDIS_MINIPORT_WORK_ITEM, *PNDIS_MINIPORT_WORK_ITEM; /* size: 0x000c */

typedef enum _NDIS_MPIF_REFTAG
{
  MPIFREF_IMDEINIT = 0,
  MPIFREF_AOAC = 1,
  MPIFREF_QUERYOBJ = 2,
  MPIFREF_GETTOP = 3,
  MPIFREF_GETRCVADDR = 4,
  MPIFREF_GETALLRCVADDR = 5,
  MPIFREF_CHIIB = 6,
  MPIFREF_CHIIUF = 7,
  MPIFREF_CHIIC = 8,
  MPIFREF_ENUMRCVADDR = 9,
  MPIFREF_SETISTATE = 10,
  MPIFREF_PMINIT = 11,
  MPIFREF_DEVPOWERUPFAIL = 12,
  MPIFREF_DEVPOWERUP = 13,
  MPIFREF_POWERDOWN = 14,
  MPIFREF_POWERDOWNFAIL = 15,
  MPIFREF_WMI = 16,
  MPIFREF_INITIALSTATE = 17,
  MPIFREF_REFMPGUID = 18,
  MPIFREF_FATAL_ERROR = 19,
  MPIFREF_DELIFBLOCK = 20,
  MPIFREF_NUMBER_OF_TAGS = 21,
} NDIS_MPIF_REFTAG, *PNDIS_MPIF_REFTAG;

typedef enum _NDIS_MP_REFTAG
{
  MPREF_AOAC_NA_ACQUIRE = 0,
  MPREF_AOAC_NA_RELEASE = 1,
  MPREF_AOAC_REFTIMER = 2,
  MPREF_AOAC_CLEANUP = 3,
  MPREF_AOAC_REFWAKE = 4,
  MPREF_AOAC_WAKE_ENABLE = 5,
  MPREF_AOAC_WAKE_DISABLE = 6,
  MPREF_CS_WNF_CALLBACK = 7,
  MPREF_API_RESET = 8,
  MPREF_API_REENUMERATE = 9,
  MPREF_PM_WAITWAKE = 10,
  MPREF_PM_D3D = 11,
  MPREF_PM_DEVPOWERUP = 12,
  MPREF_PM_POWERIRP = 13,
  MPREF_PM_OID = 14,
  MPREF_PM_REJECT = 15,
  MPREF_PM_UPDATECAPS = 16,
  MPREF_PM_D0COMPLETE = 17,
  MPREF_SS_IDLETIMER = 18,
  MPREF_SS_IDLEREQ = 19,
  MPREF_PNP_IMDEINIT = 20,
  MPREF_PNP_INITMODE = 21,
  MPREF_PNP_INITIALIZED = 22,
  MPREF_PNP_CHECKBIND = 23,
  MPREF_PNP_PAUSING = 24,
  MPREF_PNP_RESTARTING = 25,
  MPREF_PNP_STOPPING = 26,
  MPREF_PNP_SURPRISE_REMOVAL = 27,
  MPREF_PNP_REMOVING = 28,
  MPREF_PNP_BASEINIT = 29,
  MPREF_PNP_BINDENUM = 30,
  MPREF_PNP_PROMOTE = 31,
  MPREF_PNP_REFRESH = 32,
  MPREF_LWF_RESTART = 33,
  MPREF_LWF_CHECKBIND = 34,
  MPREF_LWF_ENUMAPI = 35,
  MPREF_LWF_PNPNOTIFY = 36,
  MPREF_LWF_ATTACHING = 37,
  MPREF_LWF_ATTACHED = 38,
  MPREF_LWF_DETACHING = 39,
  MPREF_LWF_DETACHMON = 40,
